000010*** EDIT ALLOWED                                                          
000100 01  PUNKTTAB.                                                            
000200*                         TABELL PUNKTER. ANVÄNDS VID                     
000300*                         BERÄKNING AV PÅFYLLNADSPUNKT,                   
000400*                         PÅFYLLNADSKVANT OCH ÖVERLAGERPUNKT              
000500*                         FÖR SUPPORTLAGER.                               
000600*                         PRIS- OCH FREKVENSKLASS HÄMTAS FRÅN             
000700*                         RESPEKTIVE COPYTEXT (PRISTAB & FREKVTAB)        
000800*                                                                         
000900     03 S1-PRIS-FREKVENSTABELL.                                           
001000        05 FILLER PIC X(72) VALUE                                         
001100                             '20020060S30020080S40040120S50100250S        
001200-                           '30100300F30100300F20100300F20100300F'        
001300        .                                                                 
001400        05 FILLER PIC X(72) VALUE                                         
001500                             '15015040S20015050S25030080S30075150S        
001600-                           '25080200F20070150F15054125F10050100F'        
001700        .                                                                 
001800        05 FILLER PIC X(72) VALUE                                         
001900                             '05008020S10010030S15020050S20040100S        
002000-                           '20040125F15035100F10030080F08028060F'        
002100        .                                                                 
002200        05 FILLER PIC X(72) VALUE                                         
002300                             '03005015S05007025S10012040S15030080S        
002400-                           '12031100F08022080F06017060F04016050F'        
002500        .                                                                 
002600        05 FILLER PIC X(72) VALUE                                         
002700                             '02002008S03004015S06007025S08013050S        
002800-                           '04014060F03009050F03007040F02007030F'        
002900        .                                                                 
003000        05 FILLER PIC X(72) VALUE                                         
003100                             '01002005S02003010S03004015S04007030S        
003200-                           '02008040F01005030F01004020F01004015F'        
003300        .                                                                 
003400        05 FILLER PIC X(72) VALUE                                         
003500                             '01001004S01002008S02004012S02004020S        
003600-                           '02004030F01003020F01002015F01002012F'        
003700        .                                                                 
003800        05 FILLER PIC X(72) VALUE                                         
003900                             '00001003S00001005S01001008S01002015S        
004000-                           '01002020F01002015F01001010F01001008F'        
004100        .                                                                 
004200        05 FILLER PIC X(72) VALUE                                         
004300                             '00001002S00001003S01001006S01002010S        
004400-                           '01002015F01002010F01001008F01001006F'        
004500        .                                                                 
004510                                                                          
004600     03 S2-PRIS-FREKVENSTABELL.                                           
004700        05 FILLER PIC X(72) VALUE                                         
004800                             '20020060S30020080S40040120S50100250S        
004900-                           '30100300F30100300F20100300F20100300F'        
005000        .                                                                 
005100        05 FILLER PIC X(72) VALUE                                         
005200                             '15015040S20015050S25030080S30075150S        
005300-                           '25080200F20070150F15054125F10050100F'        
005400        .                                                                 
005500        05 FILLER PIC X(72) VALUE                                         
005600                             '05008020S10010030S15020050S20040100S        
005700-                           '20040125F15035100F10030080F08028060F'        
005800        .                                                                 
005900        05 FILLER PIC X(72) VALUE                                         
006000                             '03005015S05007025S10012040S15030080S        
006100-                           '12031100F08022080F06017060F04016050F'        
006200        .                                                                 
006300        05 FILLER PIC X(72) VALUE                                         
006400                             '02002008S03004015S06007025S08013050S        
006500-                           '04014060F03009050F03007040F02007030F'        
006600        .                                                                 
006700        05 FILLER PIC X(72) VALUE                                         
006800                             '01002005S02003010S03004015S04007030S        
006900-                           '02008040F01005030F01004020F01004015F'        
007000        .                                                                 
007100        05 FILLER PIC X(72) VALUE                                         
007200                             '01001004S01002008S02004012S02004020S        
007300-                           '02004030F01003020F01002015F01002012F'        
007400        .                                                                 
007500        05 FILLER PIC X(72) VALUE                                         
007600                             '00001003S00001005S01001008S01002015S        
007700-                           '01002020F01002015F01001010F01001008F'        
007800        .                                                                 
007900        05 FILLER PIC X(72) VALUE                                         
008000                             '00001002S00001003S01001006S01002010S        
008100-                           '01002015F01002010F01001008F01001006F'        
008200        .                                                                 
008300                                                                          
008400                                                                          
008500                                                                          
008600 01  FILLER REDEFINES PUNKTTAB.                                           
008700     03 S-PRISTAB       OCCURS 2.                                         
008800        05 S-PRIS-RAD       OCCURS 9.                                     
008900           07 S-FREKV-KOL       OCCURS 8.                                 
009000              09 S-PF-PKT        PIC 9(2).                                
009100*                                    PÅFYLLNADSPUNKT                      
009200              09 S-PF-KVT        PIC 9(3).                                
009300*                                    PÅFYLLNADSKVANTITET                  
009400              09 S-OL-PKT        PIC 9(3).                                
009500*                                    ÖVERLAGERPUNKT                       
009600              09 S-ST-F          PIC X(1).                                
009700*                                    STYCK ELLER ANTAL VECKOBEHOV         
009800*                                                                         
009900*** END COPY PUNKTTAB    LENGTH=1224                                      
