000010*** EDIT ALLOWED                                                          
000100 01  W221W011.                                                            
000200*    *** SÄKERHETSLAGEWFAKTOR PER PRODUKTSLAG/CLAGER/VOLYMVÄRDE           
000300     03  MAXINDEX-1          PIC S9(3)   COMP-3  VALUE +39.               
000400     03  MAXINDEX-2          PIC S9(3)   COMP-3  VALUE +2.                
000500     03  MAXINDEX-3          PIC S9(3)   COMP-3  VALUE +5.                
000600*                                                                         
000700     03  VARDEN-TABW011.                                                  
000800*      VVKL  C1: 1 * 2 * 3 * 4 * 5                                        
000900*            C2:                   / 1 * 2 * 3 * 4 * 5 *                  
001000*****************************************************************         
001100       05  TABKDPRODSL-EJ-01                           PIC X(40)          
001200         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
001300       05  TABKDPRODSL-EJ-02                           PIC X(40)          
001400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
001500       05  TABKDPRODSL-EJ-03                           PIC X(40)          
001600         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
001700       05  TABKDPRODSL-EJ-04                           PIC X(40)          
001800         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
001900       05  TABKDPRODSL-EJ-05                           PIC X(40)          
002000         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
002100       05  TABKDPRODSL-EJ-06                           PIC X(40)          
002200         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
002300       05  TABKDPRODSL-EJ-07                           PIC X(40)          
002400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
002500       05  TABKDPRODSL-EJ-08                           PIC X(40)          
002600         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
002700       05  TABKDPRODSL-EJ-09                           PIC X(40)          
002800         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
002900       05  TABKDPRODSL-EJ-10                           PIC X(40)          
003000         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
003100       05  TABKDPRODSL-01-11                           PIC X(40)          
003200         VALUE '140*096*084*077*077/064*064*069*070*077*'.                
003300       05  TABKDPRODSL-EJ-12                           PIC X(40)          
003400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
003500       05  TABKDPRODSL-EJ-13                           PIC X(40)          
003600         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
003700       05  TABKDPRODSL-08-14                           PIC X(40)          
003800         VALUE '000*017*076*077*096/000*011*062*070*129*'.                
003900       05  TABKDPRODSL-07-15                           PIC X(40)          
004000         VALUE '034*045*073*083*075/015*030*060*075*075*'.                
004100       05  TABKDPRODSL-06-16                           PIC X(40)          
004200         VALUE '000*090*054*041*022/000*100*070*050*023*'.                
004300       05  TABKDPRODSL-06-17                           PIC X(40)          
004400         VALUE '000*033*049*031*031/000*017*024*038*031*'.                
004500       05  TABKDPRODSL-04-18                           PIC X(40)          
004600         VALUE '004*036*039*036*044/002*024*032*156*074*'.                
004700       05  TABKDPRODSL-05-19                           PIC X(40)          
004800         VALUE '044*090*111*153*167/045*060*107*116*116*'.                
004900       05  TABKDPRODSL-EJ-20                            PIC X(40)         
005000         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
005210       05  TABKDPRODSL-EJ-21                           PIC X(40)          
005220         VALUE '140*096*084*077*077/064*064*069*070*077*'.                
005300       05  TABKDPRODSL-EJ-22                            PIC X(40)         
005400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
005500       05  TABKDPRODSL-EJ-23                            PIC X(40)         
005600         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
005810       05  TABKDPRODSL-EJ-24                           PIC X(40)          
005820         VALUE '000*017*076*077*096/000*011*062*070*129*'.                
006010       05  TABKDPRODSL-EJ-25                           PIC X(40)          
006020         VALUE '034*045*073*083*075/015*030*060*075*075*'.                
006210       05  TABKDPRODSL-EJ-26                           PIC X(40)          
006220         VALUE '000*090*054*041*022/000*100*070*050*023*'.                
006410       05  TABKDPRODSL-EJ-27                           PIC X(40)          
006420         VALUE '000*033*049*031*031/000*017*024*038*031*'.                
006610       05  TABKDPRODSL-EJ-28                           PIC X(40)          
006620         VALUE '004*036*039*036*044/002*024*032*156*074*'.                
006810       05  TABKDPRODSL-EJ-29                           PIC X(40)          
006820         VALUE '044*090*111*153*167/045*060*107*116*116*'.                
006900       05  TABKDPRODSL-EJ-30                            PIC X(40)         
007000         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
007100       05  TABKDPRODSL-09-31                            PIC X(40)         
007200         VALUE '000*003*079*140*140/000*003*079*140*140*'.                
007300       05  TABKDPRODSL-EJ-32                            PIC X(40)         
007400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
007500       05  TABKDPRODSL-EJ-33                            PIC X(40)         
007600         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
007700       05  TABKDPRODSL-08-34                            PIC X(40)         
007800         VALUE '000*030*090*145*145/000*045*118*172*178*'.                
007900       05  TABKDPRODSL-07-35                            PIC X(40)         
008000         VALUE '015*060*100*135*135/000*040*095*147*152*'.                
008100       05  TABKDPRODSL-EJ-36                            PIC X(40)         
008200         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
008300       05  TABKDPRODSL-EJ-37                            PIC X(40)         
008400         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
008500       05  TABKDPRODSL-04-38                            PIC X(40)         
008600         VALUE '020*090*115*145*150/020*090*115*145*150*'.                
008700       05  TABKDPRODSL-EJ-39                            PIC X(40)         
008800         VALUE '000*000*000*000*000/000*000*000*000*000*'.                
013100******************************************************************        
013200     03  TABW011   REDEFINES VARDEN-TABW011.                              
013300      04  INDEX-1  OCCURS 39.                                             
013400*                   ***     INDEX=PRODUKTSLAG (TABKDPRODSL 01-39)         
013500       05  INDEX-2  OCCURS 2.                                             
013600*                   ***     INDEX=CLAGER (KDCLAGER 1-2)          *        
013700        06  INDEX-3  OCCURS 5.                                            
013800*                   ***     INDEX=VOLYMVÄRDESKLASS (KDVVKL 1-5)  *        
013900*                                                                         
014000           08  TABRESLFAKT          DISPLAY PIC 9V99.                     
014100*                            ***  SÄKERHETSLAGEWFAKTOR ***                
014200           08  FILLER            PIC X.                                   
014300*** END COPY W221W011C0  LENGTH=2406  OLD LENGTH=2006                     
