000010*** EDIT ALLOWED                                                          
000100 01  W221W012.                                                            
000200*             *** RUNDNINGSTABELL - HEMTAGNINGSKVANTITET *****            
000300     03  MAXINDEX-1          PIC S9(3)  COMP-3  VALUE +12.                
000400*                                                                         
000500     03  VARDEN-TABW012.                                                  
000600*****************************************************************         
000700       05  GRP-1  PIC X(25)  VALUE '0000000-0000012-->0000001'.           
000800       05  GRP-2  PIC X(25)  VALUE '0000013-0000097-->0000005'.           
000900       05  GRP-3  PIC X(25)  VALUE '0000098-0000262-->0000010'.           
001000       05  GRP-4  PIC X(25)  VALUE '0000263-0000474-->0000025'.           
001100       05  GRP-5  PIC X(25)  VALUE '0000475-0000974-->0000050'.           
001200       05  GRP-6  PIC X(25)  VALUE '0000975-0002374-->0000100'.           
001300       05  GRP-7  PIC X(25)  VALUE '0002375-0004874-->0000250'.           
001400       05  GRP-8  PIC X(25)  VALUE '0004875-0009749-->0000500'.           
001500       05  GRP-9  PIC X(25)  VALUE '0009750-0023749-->0001000'.           
001600       05  GRP-10 PIC X(25)  VALUE '0023750-0048749-->0002500'.           
001700       05  GRP-11 PIC X(25)  VALUE '0048750-0097499-->0005000'.           
001800       05  GRP-12 PIC X(25)  VALUE '0097500-9999999-->0010000'.           
001900******************************************************************        
002000     03  TABW012   REDEFINES VARDEN-TABW012.                              
002100      05  INDEX-1  OCCURS 12.                                             
002200*                   ***                                                   
002300          07  KVQ-BER-FROM       DISPLAY PIC 9(7).                        
002400*                            ***                                          
002500          07      FILLER         PIC X.                                   
002600          07  KVQ-BER-TOM        DISPLAY PIC 9(7).                        
002700*                            ***                                          
002800          07      FILLER         PIC X(3).                                
002900          07  KVANTAL-MULTIPEL   DISPLAY PIC 9(7).                        
003000*                            ***                                          
003100*** END COPY W221W012C0  LENGTH=302   OLD LENGTH=302                      
