000010*** EDIT ALLOWED                                                          
000100************************************************************              
000200*                                                                         
000300*    TABELL FÖR FRAMTAGNING AV EN KONSTANT BEROENDE AV                    
000400*           PRODUKTSLAG OCH                                               
000410*           PRISKLASS   OCH                                               
000500*           FREKVENSKLASS                                                 
000510*    SOM ANVÄNDS FÖR BERÄKNING AV SÄKERHETSLAGER                          
000600*    (INGÅR I PGM W221PUNK)                                               
000700*                                                                         
000800************************************************************              
000900                                                                          
000901 01  T-K-IX                  PIC S9(3) COMP-3 VALUE ZERO.                 
000902 01  T-K-IX-MAX              PIC S9(3) COMP-3 VALUE 11.                   
000903                                                                          
000905*     TABELL KONSTANTER FÖR SÄKERHETSLAGER-BERÄKNING                      
000920                                                                          
001000 01  TABELL-TOTALT.                                                       
001100     03 TAB-PRODUKTSLAG-11.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-11-1  PIC X(28) VALUE '140 160 160 160 130 120 120 '.        
001400        05 T-11-2  PIC X(28) VALUE '140 140 130 120 120 120 105 '.        
001500        05 T-11-3  PIC X(28) VALUE '096 110 110 110 110 110 090 '.        
001600        05 T-11-4  PIC X(28) VALUE '096 105 105 105 105 105 084 '.        
001700        05 T-11-5  PIC X(28) VALUE '084 084 084 105 105 105 084 '.        
001800        05 T-11-6  PIC X(28) VALUE '084 084 084 096 096 096 084 '.        
001810        05 T-11-7  PIC X(28) VALUE '077 077 077 077 077 077 077 '.        
001820        05 T-11-8  PIC X(28) VALUE '077 077 077 077 077 077 077 '.        
001830        05 T-11-9  PIC X(28) VALUE '077 077 077 077 077 077 077 '.        
001900                                                                          
001901     03 TAB-PRODUKTSLAG-14.                                               
001902*       PRISKLASS                    FREKVENSKLASS                        
001903*                                    A   B   C   D   E   F   G            
001904        05 T-14-1  PIC X(28) VALUE '000 000 017 017 076 076 077 '.        
001905        05 T-14-2  PIC X(28) VALUE '000 017 017 076 076 077 077 '.        
001906        05 T-14-3  PIC X(28) VALUE '017 017 076 076 077 077 096 '.        
001907        05 T-14-4  PIC X(28) VALUE '017 076 076 077 077 096 096 '.        
001908        05 T-14-5  PIC X(28) VALUE '076 076 077 077 096 096 096 '.        
001909        05 T-14-6  PIC X(28) VALUE '076 077 077 096 096 096 096 '.        
001910        05 T-14-7  PIC X(28) VALUE '077 077 096 096 096 096 096 '.        
001911        05 T-14-8  PIC X(28) VALUE '077 096 096 096 096 096 096 '.        
001912        05 T-14-9  PIC X(28) VALUE '096 096 096 096 096 096 096 '.        
001913                                                                          
001914     03 TAB-PRODUKTSLAG-15.                                               
001915*       PRISKLASS                    FREKVENSKLASS                        
001916*                                    A   B   C   D   E   F   G            
001917        05 T-15-1  PIC X(28) VALUE '034 034 045 045 073 073 083 '.        
001918        05 T-15-2  PIC X(28) VALUE '034 045 045 073 073 083 083 '.        
001919        05 T-15-3  PIC X(28) VALUE '045 045 073 073 083 083 075 '.        
001920        05 T-15-4  PIC X(28) VALUE '045 073 073 083 083 075 075 '.        
001921        05 T-15-5  PIC X(28) VALUE '073 073 083 083 075 075 075 '.        
001922        05 T-15-6  PIC X(28) VALUE '073 083 083 075 075 075 075 '.        
001923        05 T-15-7  PIC X(28) VALUE '083 083 075 075 075 075 075 '.        
001924        05 T-15-8  PIC X(28) VALUE '083 075 075 075 075 075 075 '.        
001925        05 T-15-9  PIC X(28) VALUE '075 075 075 075 075 075 075 '.        
001926                                                                          
001927     03 TAB-PRODUKTSLAG-16.                                               
001928*       PRISKLASS                    FREKVENSKLASS                        
001929*                                    A   B   C   D   E   F   G            
001930        05 T-16-1  PIC X(28) VALUE '000 000 090 090 054 054 041 '.        
001931        05 T-16-2  PIC X(28) VALUE '000 090 090 054 054 041 041 '.        
001932        05 T-16-3  PIC X(28) VALUE '090 090 054 054 041 041 022 '.        
001933        05 T-16-4  PIC X(28) VALUE '090 054 054 041 041 022 022 '.        
001934        05 T-16-5  PIC X(28) VALUE '054 054 041 041 022 022 022 '.        
001935        05 T-16-6  PIC X(28) VALUE '054 041 041 022 022 022 022 '.        
001936        05 T-16-7  PIC X(28) VALUE '041 041 022 022 022 022 022 '.        
001937        05 T-16-8  PIC X(28) VALUE '041 022 022 022 022 022 022 '.        
001938        05 T-16-9  PIC X(28) VALUE '022 022 022 022 022 022 022 '.        
001939                                                                          
001940     03 TAB-PRODUKTSLAG-17.                                               
001941*       PRISKLASS                    FREKVENSKLASS                        
001942*                                    A   B   C   D   E   F   G            
001943        05 T-17-1  PIC X(28) VALUE '000 000 033 033 049 049 031 '.        
001944        05 T-17-2  PIC X(28) VALUE '000 033 033 049 049 031 031 '.        
001945        05 T-17-3  PIC X(28) VALUE '033 033 049 049 031 031 031 '.        
001946        05 T-17-4  PIC X(28) VALUE '033 049 049 031 031 031 031 '.        
001947        05 T-17-5  PIC X(28) VALUE '049 049 031 031 031 031 031 '.        
001948        05 T-17-6  PIC X(28) VALUE '049 031 031 031 031 031 031 '.        
001949        05 T-17-7  PIC X(28) VALUE '031 031 031 031 031 031 031 '.        
001950        05 T-17-8  PIC X(28) VALUE '031 031 031 031 031 031 031 '.        
001951        05 T-17-9  PIC X(28) VALUE '031 031 031 031 031 031 031 '.        
001952                                                                          
001953     03 TAB-PRODUKTSLAG-18.                                               
001954*       PRISKLASS                    FREKVENSKLASS                        
001955*                                    A   B   C   D   E   F   G            
001956        05 T-18-1  PIC X(28) VALUE '004 004 036 036 039 039 036 '.        
001957        05 T-18-2  PIC X(28) VALUE '004 036 036 039 039 036 036 '.        
001958        05 T-18-3  PIC X(28) VALUE '036 036 039 039 036 036 044 '.        
001959        05 T-18-4  PIC X(28) VALUE '036 039 039 036 036 044 044 '.        
001960        05 T-18-5  PIC X(28) VALUE '039 039 036 036 044 044 044 '.        
001961        05 T-18-6  PIC X(28) VALUE '039 036 036 044 044 044 044 '.        
001962        05 T-18-7  PIC X(28) VALUE '036 036 044 044 044 044 044 '.        
001963        05 T-18-8  PIC X(28) VALUE '036 044 044 044 044 044 044 '.        
001964        05 T-18-9  PIC X(28) VALUE '044 044 044 044 044 044 044 '.        
001965                                                                          
001966     03 TAB-PRODUKTSLAG-19.                                               
001967*       PRISKLASS                    FREKVENSKLASS                        
001968*                                    A   B   C   D   E   F   G            
001969        05 T-19-1  PIC X(28) VALUE '044 044 090 090 111 111 153 '.        
001970        05 T-19-2  PIC X(28) VALUE '044 090 090 111 111 153 153 '.        
001971        05 T-19-3  PIC X(28) VALUE '090 090 111 111 153 153 167 '.        
001972        05 T-19-4  PIC X(28) VALUE '090 111 111 153 153 167 167 '.        
001973        05 T-19-5  PIC X(28) VALUE '111 111 153 153 167 167 167 '.        
001974        05 T-19-6  PIC X(28) VALUE '111 153 153 167 167 167 167 '.        
001975        05 T-19-7  PIC X(28) VALUE '153 153 167 167 167 167 167 '.        
001976        05 T-19-8  PIC X(28) VALUE '153 167 167 167 167 167 167 '.        
001977        05 T-19-9  PIC X(28) VALUE '167 167 167 167 167 167 167 '.        
001978                                                                          
001979     03 TAB-PRODUKTSLAG-31.                                               
001980*       PRISKLASS                    FREKVENSKLASS                        
001981*                                    A   B   C   D   E   F   G            
001982        05 T-31-1  PIC X(28) VALUE '000 000 003 003 079 079 140 '.        
001983        05 T-31-2  PIC X(28) VALUE '000 003 003 079 079 140 140 '.        
001984        05 T-31-3  PIC X(28) VALUE '003 003 079 079 140 140 140 '.        
001985        05 T-31-4  PIC X(28) VALUE '003 079 079 140 140 140 140 '.        
001986        05 T-31-5  PIC X(28) VALUE '079 079 140 140 140 140 140 '.        
001987        05 T-31-6  PIC X(28) VALUE '079 140 140 140 140 140 140 '.        
001988        05 T-31-7  PIC X(28) VALUE '140 140 140 140 140 140 140 '.        
001989        05 T-31-8  PIC X(28) VALUE '140 140 140 140 140 140 140 '.        
001990        05 T-31-9  PIC X(28) VALUE '140 140 140 140 140 140 140 '.        
001991                                                                          
001992     03 TAB-PRODUKTSLAG-34.                                               
001993*       PRISKLASS                    FREKVENSKLASS                        
001994*                                    A   B   C   D   E   F   G            
001995        05 T-34-1  PIC X(28) VALUE '000 000 030 030 090 090 145 '.        
001996        05 T-34-2  PIC X(28) VALUE '000 030 030 090 090 145 145 '.        
001997        05 T-34-3  PIC X(28) VALUE '030 030 090 090 145 145 145 '.        
001998        05 T-34-4  PIC X(28) VALUE '030 090 090 145 145 145 145 '.        
001999        05 T-34-5  PIC X(28) VALUE '090 090 145 145 145 145 145 '.        
002000        05 T-34-6  PIC X(28) VALUE '090 145 145 145 145 145 145 '.        
002001        05 T-34-7  PIC X(28) VALUE '145 145 145 145 145 145 145 '.        
002002        05 T-34-8  PIC X(28) VALUE '145 145 145 145 145 145 145 '.        
002003        05 T-34-9  PIC X(28) VALUE '145 145 145 145 145 145 145 '.        
002004                                                                          
002005     03 TAB-PRODUKTSLAG-35.                                               
002006*       PRISKLASS                    FREKVENSKLASS                        
002007*                                    A   B   C   D   E   F   G            
002008        05 T-35-1  PIC X(28) VALUE '015 015 060 060 100 100 135 '.        
002009        05 T-35-2  PIC X(28) VALUE '015 060 060 100 100 135 135 '.        
002010        05 T-35-3  PIC X(28) VALUE '060 060 100 100 135 135 135 '.        
002011        05 T-35-4  PIC X(28) VALUE '060 100 100 135 135 135 135 '.        
002012        05 T-35-5  PIC X(28) VALUE '100 100 135 135 135 135 135 '.        
002013        05 T-35-6  PIC X(28) VALUE '100 135 135 135 135 135 135 '.        
002014        05 T-35-7  PIC X(28) VALUE '135 135 135 135 135 135 135 '.        
002015        05 T-35-8  PIC X(28) VALUE '135 135 135 135 135 135 135 '.        
002016        05 T-35-9  PIC X(28) VALUE '135 135 135 135 135 135 135 '.        
002017                                                                          
002018     03 TAB-PRODUKTSLAG-38.                                               
002019*       PRISKLASS                    FREKVENSKLASS                        
002020*                                    A   B   C   D   E   F   G            
002021        05 T-38-1  PIC X(28) VALUE '020 020 090 090 115 115 145 '.        
002022        05 T-38-2  PIC X(28) VALUE '020 090 090 115 115 145 145 '.        
002023        05 T-38-3  PIC X(28) VALUE '090 090 115 115 145 145 150 '.        
002024        05 T-38-4  PIC X(28) VALUE '090 115 115 145 145 150 150 '.        
002025        05 T-38-5  PIC X(28) VALUE '115 115 145 145 150 150 150 '.        
002026        05 T-38-6  PIC X(28) VALUE '115 145 145 150 150 150 150 '.        
002027        05 T-38-7  PIC X(28) VALUE '145 145 150 150 150 150 150 '.        
002028        05 T-38-8  PIC X(28) VALUE '145 150 150 150 150 150 150 '.        
002029        05 T-38-9  PIC X(28) VALUE '150 150 150 150 150 150 150 '.        
002030                                                                          
002031******************************************************************        
002032                                                                          
002040 01  FILLER  REDEFINES TABELL-TOTALT.                                     
002100     03  TAB-PRODUKTSLAG             OCCURS 11.                           
002110         05  TAB-PRISKLASS           OCCURS 9.                            
002120             07  TAB-FREKVENSKLASS   OCCURS 7.                            
002130                 09  TAB-KONSTANT    PIC 9V99.                            
002140                 09  FILLER          PIC X.                               
