000010*** EDIT ALLOWED                                                          
000100************************************************************              
000200*                                                                         
000300*    TABELL FÖR FRAMTAGNING AV EN MINGRÄNS FÖR SÄKERHETSLAGRET            
000300*    BEROENDE AV                                                          
000400*           PRODUKTSLAG OCH                                               
000410*           PRISKLASS   OCH                                               
000500*           FREKVENSKLASS                                                 
000510*    SOM ANVÄNDS FÖR BERÄKNING AV SÄKERHETSLAGER                          
000600*    (INGÅR I PGM W221PUNK)                                               
000700*                                                                         
000800************************************************************              
000900                                                                          
000901 01  T31-K-IX                  PIC S9(3) COMP-3 VALUE ZERO.               
000902 01  T31-K-IX-MAX              PIC S9(3) COMP-3 VALUE 11.                 
000903                                                                          
000905*     TABELL MINGRÄNS FÖR SÄKERHETSLAGER-BERÄKNING                        
000920                                                                          
001000 01  TABELL31-TOTALT.                                                     
001100     03 TAB-PRODUKTSLAG-11.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-11-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-11-2  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001500        05 T-11-3  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001600        05 T-11-4  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001700        05 T-11-5  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001800        05 T-11-6  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001810        05 T-11-7  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001820        05 T-11-8  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001830        05 T-11-9  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-14.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-14-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-14-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-14-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-14-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-14-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-14-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-14-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-14-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-14-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-15.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-15-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-15-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-15-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-15-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-15-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-15-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-15-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-15-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-15-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-16.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-16-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-16-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-16-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-16-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-16-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-16-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-16-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-16-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-16-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-17.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-17-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-17-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-17-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-17-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-17-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-17-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-17-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-17-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-17-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-18.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-18-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-18-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-18-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-18-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-18-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-18-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-18-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-18-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-18-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-19.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-19-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-19-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-19-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-19-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-19-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-19-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-19-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-19-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-19-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-31.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-31-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-31-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-31-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-31-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-31-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-31-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-31-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-31-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-31-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-34.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-34-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-34-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-34-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-34-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-34-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-34-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-34-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-34-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-34-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-35.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-35-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-35-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-35-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-35-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-35-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-35-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-35-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-35-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-35-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
001100     03 TAB-PRODUKTSLAG-38.                                               
001110*       PRISKLASS                    FREKVENSKLASS                        
001200*                                    A   B   C   D   E   F   G            
001300        05 T-38-1  PIC X(28) VALUE '018 018 018 018 018 018 018 '.        
001400        05 T-38-2  PIC X(28) VALUE '016 016 016 016 016 016 016 '.        
001500        05 T-38-3  PIC X(28) VALUE '014 014 014 014 014 014 014 '.        
001600        05 T-38-4  PIC X(28) VALUE '012 012 012 012 012 012 012 '.        
001700        05 T-38-5  PIC X(28) VALUE '010 010 010 010 010 010 010 '.        
001800        05 T-38-6  PIC X(28) VALUE '008 008 008 008 008 008 008 '.        
001810        05 T-38-7  PIC X(28) VALUE '006 006 006 006 006 006 006 '.        
001820        05 T-38-8  PIC X(28) VALUE '004 004 004 004 004 004 004 '.        
001830        05 T-38-9  PIC X(28) VALUE '002 002 002 002 002 002 002 '.        
001900                                                                          
002031******************************************************************        
002032                                                                          
002040 01  FILLER  REDEFINES TABELL31-TOTALT.                                   
002100     03  TAB31-PRODUKTSLAG                 OCCURS 11.                     
002110         05  TAB31-PRISKLASS               OCCURS 9.                      
002120             07  TAB31-FREKVENSKLASS       OCCURS 7.                      
002130                 09  TAB31-KVVECKOR-MINSL  PIC 99V9.                      
002140                 09  FILLER                PIC X.                         
