000010*** EDIT ALLOWED                                                          
000100******************************************************************        
000200*****        TABELL MED HANTERINGSKOD DATA                   *****        
000300******************************************************************        
000400   01  W413HANT.                                                          
000500                                                                          
000600     03  VARDEN.                                                          
000700                                                                          
000800        05  FILLER      PIC X(38)     VALUE                               
000900            '00000047305247011401021200200004427212'.                     
001000        05  FILLER      PIC X(38)     VALUE                               
001100            '00001042812744609000221200021404427212'.                     
001200        05  FILLER      PIC X(38)     VALUE                               
001300            '00001142813044609500221200021404427212'.                     
001400        05  FILLER      PIC X(38)     VALUE                               
001500            '00001242813244609900221200021404427212'.                     
001600        05  FILLER      PIC X(38)     VALUE                               
001700            '00001342813444610400221200021404427212'.                     
001800        05  FILLER      PIC X(38)     VALUE                               
001900            '00001442813644610800221200021404427212'.                     
002000        05  FILLER      PIC X(38)     VALUE                               
002100            '00001542813844611200221200021404427212'.                     
002200        05  FILLER      PIC X(38)     VALUE                               
002300            '00001642814044611700221200021404427212'.                     
002400        05  FILLER      PIC X(38)     VALUE                               
002500            '00001742814244612100221200021404427212'.                     
002600        05  FILLER      PIC X(38)     VALUE                               
002700            '00001842814444612500221200021404427212'.                     
002800        05  FILLER      PIC X(38)     VALUE                               
002900            '00001942815644613700221200021404427212'.                     
003000        05  FILLER      PIC X(38)     VALUE                               
003100            '00002042805944609500521200052304427212'.                     
003200        05  FILLER      PIC X(38)     VALUE                               
003300            '00002142806244610000521200052304427212'.                     
003400        05  FILLER      PIC X(38)     VALUE                               
003500            '00002242806444610300521200052304427212'.                     
003600        05  FILLER      PIC X(38)     VALUE                               
003700            '00002342806744610700521200052304427212'.                     
003800        05  FILLER      PIC X(38)     VALUE                               
003900            '00003042804744606801021200198004427212'.                     
004000        05  FILLER      PIC X(38)     VALUE                               
004100            '00003142805244607201021200198004427212'.                     
004200        05  FILLER      PIC X(38)     VALUE                               
004300            '00003242805744607501021200198004427212'.                     
004400        05  FILLER      PIC X(38)     VALUE                               
004500            '00004049602866802709921200505004427212'.                     
004600        05  FILLER      PIC X(38)     VALUE                               
004700            '00005049602166802009921201095004427212'.                     
004800        05  FILLER      PIC X(38)     VALUE                               
004900            '00006049605763605501021200218004427212'.                     
005000        05  FILLER      PIC X(38)     VALUE                               
005100            '00006149606163605700221200218004427212'.                     
005200        05  FILLER      PIC X(38)     VALUE                               
005300            '00007042812744620600121200003804427212'.                     
005400        05  FILLER      PIC X(38)     VALUE                               
005500            '00007142818044620700121200003904427212'.                     
005600        05  FILLER      PIC X(38)     VALUE                               
005700            '00007242813244621600121200003904427212'.                     
005800        05  FILLER      PIC X(38)     VALUE                               
005900            '00007342813444622400121200003904427212'.                     
006000        05  FILLER      PIC X(38)     VALUE                               
006100            '00007442813644622400121200003904427212'.                     
006200        05  FILLER      PIC X(38)     VALUE                               
006300            '00007542813844623500121200003904427212'.                     
006400        05  FILLER      PIC X(38)     VALUE                               
006500            '00007642814044634100121200003904427000'.                     
006600        05  FILLER      PIC X(38)     VALUE                               
006700            '00007742814244635600121200003904427212'.                     
006800        05  FILLER      PIC X(38)     VALUE                               
006900            '00007842814444638700121200003904427212'.                     
007000        05  FILLER      PIC X(38)     VALUE                               
007100            '00007942815644658900121200003904427212'.                     
007200        05  FILLER      PIC X(38)     VALUE                               
007300            '00008037706044206205021200654004427212'.                     
007400        05  FILLER      PIC X(38)     VALUE                               
007500            '00009047206944613400621200052304427212'.                     
007600        05  FILLER      PIC X(38)     VALUE                               
007700            '00009147207244613800621200052304427212'.                     
007800        05  FILLER      PIC X(38)     VALUE                               
007900            '00009247207444614200621200052304427212'.                     
008000        05  FILLER      PIC X(38)     VALUE                               
008100            '00009347207644614800621200052304427212'.                     
008200        05  FILLER      PIC X(38)     VALUE                               
008300            '00009447207844615200621200052304427212'.                     
008400        05  FILLER      PIC X(38)     VALUE                               
008500            '00010038610444210700321200052304427212'.                     
008600        05  FILLER      PIC X(38)     VALUE                               
008700            '00011046107047011401021200200004427212'.                     
008800        05  FILLER      PIC X(38)     VALUE                               
008900            '00012037711044211000621200131004427212'.                     
009000        05  FILLER      PIC X(38)     VALUE                               
009100            '00012137711844212100621200131004427000'.                     
009200        05  FILLER      PIC X(38)     VALUE                               
009300            '00012237711944212900621200131004427212'.                     
009400        05  FILLER      PIC X(38)     VALUE                               
009500            '00012337712444214000621200131004427212'.                     
009600        05  FILLER      PIC X(38)     VALUE                               
009700            '00013055430983229501021200150004427212'.                     
009800        05  FILLER      PIC X(38)     VALUE                               
009900            '00014070502300000000000000000000000000'.                     
010000        05  FILLER      PIC X(38)     VALUE                               
010100            '00015000000000000000000000000000000000'.                     
010200        05  FILLER      PIC X(38)     VALUE                               
010300            '00015100000099326800200000001500000000'.                     
010400        05  FILLER      PIC X(38)     VALUE                               
010500            '00015200000099326800200000001500000000'.                     
010600        05  FILLER      PIC X(38)     VALUE                               
010700            '00016000000044223900121200030004427000'.                     
010800        05  FILLER      PIC X(38)     VALUE                               
010900            '00019000000099337400113800001204427000'.                     
011000        05  FILLER      PIC X(38)     VALUE                               
011100            '00020000000099328000116200003004427000'.                     
011200        05  FILLER      PIC X(38)     VALUE                               
011300            '00020100000099330500116200003004427000'.                     
011400        05  FILLER      PIC X(38)     VALUE                               
011500            '00020200000099332700116200003004427000'.                     
011600        05  FILLER      PIC X(38)     VALUE                               
011700            '00020300000099334600116200003004427000'.                     
011800        05  FILLER      PIC X(38)     VALUE                               
011900            '00020400000099336500116200003004427000'.                     
012000        05  FILLER      PIC X(38)     VALUE                               
012100            '00020500000099338400116200003004427000'.                     
012200        05  FILLER      PIC X(38)     VALUE                               
012300            '00021000000099322900109000003004427000'.                     
012400        05  FILLER      PIC X(38)     VALUE                               
012500            '00021100000099325400109000003004427000'.                     
012600        05  FILLER      PIC X(38)     VALUE                               
012700            '00021200000099327600109000003004427000'.                     
012800        05  FILLER      PIC X(38)     VALUE                               
012900            '00021300000099329500109000003004427000'.                     
013000        05  FILLER      PIC X(38)     VALUE                               
013100            '00021400000099331400109000003004427000'.                     
013200        05  FILLER      PIC X(38)     VALUE                               
013300            '00021500000099333300109000003004427000'.                     
013400        05  FILLER      PIC X(38)     VALUE                               
013500            '00021600000099335200109000003004427000'.                     
013600        05  FILLER      PIC X(38)     VALUE                               
013700            '00021700000099337100109000003004427000'.                     
013800        05  FILLER      PIC X(38)     VALUE                               
013900            '00022000000099326800516200003004427000'.                     
014000        05  FILLER      PIC X(38)     VALUE                               
014100            '00023000000099316500509000003004427000'.                     
014200        05  FILLER      PIC X(38)     VALUE                               
014300            '00025000000099319200116200003004427000'.                     
014400        05  FILLER      PIC X(38)     VALUE                               
014500            '00025100000099321600116200003004427000'.                     
014600        05  FILLER      PIC X(38)     VALUE                               
014700            '00025200000099323700116200003004427000'.                     
014800        05  FILLER      PIC X(38)     VALUE                               
014900            '00025300000099325500116200003004427000'.                     
015000        05  FILLER      PIC X(38)     VALUE                               
015100            '00025400000099327300116200003004427000'.                     
015200        05  FILLER      PIC X(38)     VALUE                               
015300            '00025500000099329100116200003004427000'.                     
015400        05  FILLER      PIC X(38)     VALUE                               
015500            '00026100000099312900216200003004427000'.                     
015600        05  FILLER      PIC X(38)     VALUE                               
015700            '00026200000099314400116200003004427000'.                     
015800        05  FILLER      PIC X(38)     VALUE                               
015900            '00026300000099315700116200003004427000'.                     
016000        05  FILLER      PIC X(38)     VALUE                               
016100            '00027400000099334800116200000504427000'.                     
016200        05  FILLER      PIC X(38)     VALUE                               
016300            '00027500000099336900116200000504427000'.                     
016400        05  FILLER      PIC X(38)     VALUE                               
016500            '00027600000099339600116200000504427000'.                     
016600        05  FILLER      PIC X(38)     VALUE                               
016700            '00027700000099338600116200000504427000'.                     
016800        05  FILLER      PIC X(38)     VALUE                               
016900            '00027800000099343800116200000504427000'.                     
017000        05  FILLER      PIC X(38)     VALUE                               
017100            '00027900000099358900116200000504427000'.                     
017200        05  FILLER      PIC X(38)     VALUE                               
017300            '00028200000099327500116200000304427000'.                     
017400        05  FILLER      PIC X(38)     VALUE                               
017500            '00028300000099329400116200000304427000'.                     
017600        05  FILLER      PIC X(38)     VALUE                               
017700            '00028400000099331300116200000304427000'.                     
017800        05  FILLER      PIC X(38)     VALUE                               
017900            '00028500000099336900116200000304427000'.                     
018000        05  FILLER      PIC X(38)     VALUE                               
018100            '00028600000099339600116200000304427000'.                     
018200        05  FILLER      PIC X(38)     VALUE                               
018300            '00028700000099341700116200000304427000'.                     
018400        05  FILLER      PIC X(38)     VALUE                               
018500            '00028800000099343800116200000304427000'.                     
018600        05  FILLER      PIC X(38)     VALUE                               
018700            '00028900000099358900116200000304427000'.                     
018800        05  FILLER      PIC X(38)     VALUE                               
018900            '00030300000099339700109000000304427000'.                     
019000        05  FILLER      PIC X(38)     VALUE                               
019100            '00030400000099341600109000000304427000'.                     
019200        05  FILLER      PIC X(38)     VALUE                               
019300            '00030500000099343500109000000304427000'.                     
019400        05  FILLER      PIC X(38)     VALUE                               
019500            '00030600000099345400109000000304427000'.                     
019600        05  FILLER      PIC X(38)     VALUE                               
019700            '00030700000099347300109000000304427000'.                     
019800        05  FILLER      PIC X(38)     VALUE                               
019900            '00030800000099350000109000000304427000'.                     
020000        05  FILLER      PIC X(38)     VALUE                               
020100            '00030900000099358900109000003004427000'.                     
020200        05  FILLER      PIC X(38)     VALUE                               
020300            '00031100000099326000209000003004427000'.                     
020400        05  FILLER      PIC X(38)     VALUE                               
020500            '00031200000099328400109000003004427000'.                     
020600        05  FILLER      PIC X(38)     VALUE                               
020700            '00031300000099330500109000003004427000'.                     
020800        05  FILLER      PIC X(38)     VALUE                               
020900            '00031400000099332600109000003004427000'.                     
021000        05  FILLER      PIC X(38)     VALUE                               
021100            '00031500000099334700109000003004427000'.                     
021200        05  FILLER      PIC X(38)     VALUE                               
021300            '00031600000099336800109000003004427000'.                     
021400        05  FILLER      PIC X(38)     VALUE                               
021500            '00031700000099338900109000003004427000'.                     
021600        05  FILLER      PIC X(38)     VALUE                               
021700            '00032300000099330100109000000504427000'.                     
021800        05  FILLER      PIC X(38)     VALUE                               
021900            '00032400000099332000109000000504427000'.                     
022000        05  FILLER      PIC X(38)     VALUE                               
022100            '00032500000099333900109000000504427000'.                     
022200        05  FILLER      PIC X(38)     VALUE                               
022300            '00032600000099335800109000000504427000'.                     
022400        05  FILLER      PIC X(38)     VALUE                               
022500            '00032700000099337700109000000504427000'.                     
022600        05  FILLER      PIC X(38)     VALUE                               
022700            '00032800000099339600109000000504427000'.                     
022800        05  FILLER      PIC X(38)     VALUE                               
022900            '00032900000099358900109000000504427000'.                     
023000        05  FILLER      PIC X(38)     VALUE                               
023100            '00035100000099328200116200000304427000'.                     
023200        05  FILLER      PIC X(38)     VALUE                               
023300            '00035200000099329700116200000304427000'.                     
023400        05  FILLER      PIC X(38)     VALUE                               
023500            '00035300000099331000116200000304427000'.                     
023600        05  FILLER      PIC X(38)     VALUE                               
023700            '00035400000099332300116200000304427000'.                     
023800        05  FILLER      PIC X(38)     VALUE                               
023900            '00036500000099362600116200000204427000'.                     
024000        05  FILLER      PIC X(38)     VALUE                               
024100            '00036600000099364400116200000204427000'.                     
024200        05  FILLER      PIC X(38)     VALUE                               
024300            '00036700000099368000116200000204427000'.                     
024400        05  FILLER      PIC X(38)     VALUE                               
024500            '00036800000099369800116200000204427000'.                     
024600        05  FILLER      PIC X(38)     VALUE                               
024700            '00036900000099374000116200000204427000'.                     
024800        05  FILLER      PIC X(38)     VALUE                               
024900            '00040000000099322600116200000504427000'.                     
025000        05  FILLER      PIC X(38)     VALUE                               
025100            '00040100000099324800116200000504427000'.                     
025200        05  FILLER      PIC X(38)     VALUE                               
025300            '00040200000099326400116200000504427000'.                     
025400        05  FILLER      PIC X(38)     VALUE                               
025500            '00040300000099327800116200000504427000'.                     
025600        05  FILLER      PIC X(38)     VALUE                               
025700            '00040400000099358900116200000404427000'.                     
025800        05  FILLER      PIC X(38)     VALUE                               
025900            '00040500000099358900116200000404427000'.                     
026000        05  FILLER      PIC X(38)     VALUE                               
026100            '00040600000099358900116200000404427000'.                     
026200        05  FILLER      PIC X(38)     VALUE                               
026300            '00041000000099321900116200000504427000'.                     
026400        05  FILLER      PIC X(38)     VALUE                               
026500            '00041100000099324100116200000504427000'.                     
026600        05  FILLER      PIC X(38)     VALUE                               
026700            '00041200000099325700116200000504427000'.                     
026800        05  FILLER      PIC X(38)     VALUE                               
026900            '00041300000099327100116200000504427000'.                     
027000        05  FILLER      PIC X(38)     VALUE                               
027100            '00041400000099328500116200000404427000'.                     
027200        05  FILLER      PIC X(38)     VALUE                               
027300            '00041500000099331700116200000404427000'.                     
027400        05  FILLER      PIC X(38)     VALUE                               
027500            '00041600000099333100116200000204427000'.                     
027600        05  FILLER      PIC X(38)     VALUE                               
027700            '00041700000099336000116200000204427000'.                     
027800        05  FILLER      PIC X(38)     VALUE                               
027900            '00041800000099337700116200000204427000'.                     
028000        05  FILLER      PIC X(38)     VALUE                               
028100            '00050200000099344500116200000204427000'.                     
028200        05  FILLER      PIC X(38)     VALUE                               
028300            '00050300000099346400116200000204427000'.                     
028400        05  FILLER      PIC X(38)     VALUE                               
028500            '00050400000099348300116200000204427000'.                     
028600        05  FILLER      PIC X(38)     VALUE                               
028700            '00050500000099350200116200000204427000'.                     
028800        05  FILLER      PIC X(38)     VALUE                               
028900            '00050600000099352100116200000104427000'.                     
029000        05  FILLER      PIC X(38)     VALUE                               
029100            '00050700000099354000116200000104427000'.                     
029200        05  FILLER      PIC X(38)     VALUE                               
029300            '00050800000099355900116200000104427000'.                     
029400        05  FILLER      PIC X(38)     VALUE                               
029500            '00050900000099358900116200000104427000'.                     
029600        05  FILLER      PIC X(38)     VALUE                               
029700            '00060000000000000000000000000014097000'.                     
029800        05  FILLER      PIC X(38)     VALUE                               
029900            '00061000000000000000000000000015977000'.                     
030000        05  FILLER      PIC X(38)     VALUE                               
030100            '00062000000000000000000000000003880000'.                     
030200        05  FILLER      PIC X(38)     VALUE                               
030300            '00063000000000000000000000000003280000'.                     
030400        05  FILLER      PIC X(38)     VALUE                               
030500            '00064000000000000000000000000003280000'.                     
030600        05  FILLER      PIC X(38)     VALUE                               
030700            '00070100000099321500116200001200000000'.                     
030800        05  FILLER      PIC X(38)     VALUE                               
030900            '00070200000099322600116200001200000000'.                     
031000        05  FILLER      PIC X(38)     VALUE                               
031100            '00070300000099323000116200001200000000'.                     
031200        05  FILLER      PIC X(38)     VALUE                               
031300            '00071100000099321500116200000800000000'.                     
031400        05  FILLER      PIC X(38)     VALUE                               
031500            '00071200000099322600116200000800000000'.                     
031600        05  FILLER      PIC X(38)     VALUE                               
031700            '00071300000099323000116200000800000000'.                     
031800        05  FILLER      PIC X(38)     VALUE                               
031900            '00071400000099324700116200000800000000'.                     
032000        05  FILLER      PIC X(38)     VALUE                               
032100            '00071500000099326800116200000800000000'.                     
032200        05  FILLER      PIC X(38)     VALUE                               
032300            '00072400000099324700116200000400000000'.                     
032400        05  FILLER      PIC X(38)     VALUE                               
032500            '00072500000099326800116200000400000000'.                     
032600        05  FILLER      PIC X(38)     VALUE                               
032700            '00072600000099328900116200000400000000'.                     
032800                                                                          
032900     03  FILLER REDEFINES VARDEN.                                         
033000                                                                          
033100        05  HANT-TABELLRAD OCCURS 160 INDEXED BY HANT-INDX.               
033200                                                                          
033300           07  HANT-KDARTHNT     PIC 9(6).                                
033400           07  HANT-DATA         PIC X(32).                               
