000010*** EDIT ALLOWED                                                          
000100******************************************************************        
000200*****         TABELL MED FÖRRÅDSDATAKRAV PER LO              *****        
000300******************************************************************        
000400                                                                          
000500   01  W413KRAV.                                                          
000600                                                                          
000700    03  VARDEN.                                                           
000800                                                                          
000900       05  FILLER       PIC X(50)      VALUE                              
001000          '00013372012719194095310011594132001001223123292940'.           
001100       05  FILLER       PIC X(50)      VALUE                              
001200          '00129150013933267055610015818245260812342522862412'.           
001300       05  FILLER       PIC X(50)      VALUE                              
001400          '00221150014627885053307616895163320821627217472101'.           
001500       05  FILLER       PIC X(50)      VALUE                              
001600          '00323150189327885387350021150199700842364436983017'.           
001700       05  FILLER       PIC X(50)      VALUE                              
001800          '00421150014627885053308515241163320841559617872448'.           
001900       05  FILLER       PIC X(50)      VALUE                              
002000          '00523150019327885110810015241189700841559626983017'.           
002100       05  FILLER       PIC X(50)      VALUE                              
002200          '00623150019327885110810015867189700841997026983017'.           
002300       05  FILLER       PIC X(50)      VALUE                              
002400          '00723150019327885110810017904189700842057026983017'.           
002500       05  FILLER       PIC X(50)      VALUE                              
002600          '00823150019327885110810018395189700842119626983017'.           
002700       05  FILLER       PIC X(50)      VALUE                              
002800          '00923150044227885112914217830189701262522429302266'.           
002900       05  FILLER       PIC X(50)      VALUE                              
003000          '01023150044227885112914215456189701262525029302266'.           
003100       05 FILLER        PIC X(50)      VALUE                              
003200          '01123150044227885112914215241189701261559626983017'.           
003300       05  FILLER       PIC X(50)      VALUE                              
003400          '01223150019327885110810015241189700841559626983017'.           
003500       05  FILLER       PIC X(50)      VALUE                              
003600          '01323150019327885107310013850189700842364426983017'.           
003700       05  FILLER       PIC X(50)      VALUE                              
003800          '01423150019327885110810017904189700842057026983017'.           
003900       05  FILLER       PIC X(50)      VALUE                              
004000          '01523150027927885143609818256189701381627022404132'.           
004100       05  FILLER       PIC X(50)      VALUE                              
004200          '01623150027927885143609813689189701381627022404132'.           
004300       05  FILLER       PIC X(50)      VALUE                              
004400          '01729150013933267055610011491245260811142922862412'.           
004500       05  FILLER       PIC X(50)      VALUE                              
004600          '01823150019327885110810017904189700842057026983017'.           
004700                                                                          
004800    03  FILLER REDEFINES VARDEN.                                          
004900                                                                          
005000       05  KRAV-TABELLRAD OCCURS 19 INDEXED BY KRAV-INDX.                 
005100                                                                          
005200          07  KRAV-KDFDKRAV    PIC 9(3).                                  
005300          07  KRAV-DATA        PIC X(47).                                 
