000010*** EDIT ALLOWED                                                          
000100******************************************************************        
000200*****            TABELL MED TRANSPORTTIDER FÖR               *****        
000300*****                  GROVLAGRET                            *****        
000400******************************************************************        
000500    01  W413TRPG.                                                         
000600                                                                          
000700       03  VARDEN.                                                        
000800                                                                          
000900          05  FILLER       PIC X(17)     VALUE                            
001000                           '00005020532014880'.                           
001100          05  FILLER       PIC X(17)     VALUE                            
001200                           '00010025416018420'.                           
001300          05  FILLER       PIC X(17)     VALUE                            
001400                           '00015011400008260'.                           
001500          05  FILLER       PIC X(17)     VALUE                            
001600                           '00020015348011120'.                           
001700          05  FILLER       PIC X(17)     VALUE                            
001800                           '00025020976015200'.                           
001900          05  FILLER       PIC X(17)     VALUE                            
002000                           '00030023928017340'.                           
002100          05  FILLER       PIC X(17)     VALUE                            
002200                           '00040032376023460'.                           
002300          05  FILLER       PIC X(17)     VALUE                            
002400                           '00050041520030090'.                           
002500          05  FILLER       PIC X(17)     VALUE                            
002600                           '00075063348045900'.                           
002700          05  FILLER       PIC X(17)     VALUE                            
002800                           '00100084456061200'.                           
002900          05  FILLER       PIC X(17)     VALUE                            
003000                           '00150122400088700'.                           
003100          05  FILLER       PIC X(17)     VALUE                            
003200                           '00200171120124000'.                           
003300          05  FILLER       PIC X(17)     VALUE                            
003400                           '00250220800160000'.                           
003500          05  FILLER       PIC X(17)     VALUE                            
003600                           '00300268800195000'.                           
003700          05  FILLER       PIC X(17)     VALUE                            
003800                           '00400342000248000'.                           
003900          05  FILLER       PIC X(17)     VALUE                            
004000                           '99999441600320000'.                           
004100                                                                          
004200       03  FILLER REDEFINES VARDEN.                                       
004300                                                                          
004400          05  TRPG-TABELLRAD  OCCURS  16  INDEXED BY TRPG-INDX.           
004500                                                                          
004600             07  TRPG-KVRADER         PIC 9(5).                           
004700             07  TRPG-DATA            PIC X(12).                          
