000010*** EDIT ALLOWED                                                          
000100 01  W475WCOP.                                                            
000200**                                                                        
000300*  TABELL FÖR ANTAL FAKTURAKOPIOR                                         
000300*  TABELLEN ANVÄNDS I W47555                                              
000400*                                                                         
000500   03  FAKTKOP-TAB.                                                       
000600      05  FILLER    PIC X(14)  VALUE '0800 7573 88 1'.                    
000600      05  FILLER    PIC X(14)  VALUE '7675 9999 88 1'.                    
000700      05  FILLER    PIC X(14)  VALUE '2560 2560 17 4'.                    
000700      05  FILLER    PIC X(14)  VALUE '2560 2560 31 6'.                    
000700      05  FILLER    PIC X(14)  VALUE '2560 2560 00 5'.                    
000700      05  FILLER    PIC X(14)  VALUE '2561 2561 00 7'.                    
000800      05  FILLER    PIC X(14)  VALUE '2603 2603 17 1'.                    
000800      05  FILLER    PIC X(14)  VALUE '2603 2603 31 4'.                    
000900      05  FILLER    PIC X(14)  VALUE '2605 2605 17 1'.                    
000900      05  FILLER    PIC X(14)  VALUE '2605 2605 31 4'.                    
000900      05  FILLER    PIC X(14)  VALUE '2605 2605 00 6'.                    
000900      05  FILLER    PIC X(14)  VALUE '2606 2606 00 6'.                    
000900      05  FILLER    PIC X(14)  VALUE '2607 2607 17 1'.                    
000900      05  FILLER    PIC X(14)  VALUE '2607 2607 31 4'.                    
000900      05  FILLER    PIC X(14)  VALUE '2607 2607 00 6'.                    
000900      05  FILLER    PIC X(14)  VALUE '2608 2608 00 6'.                    
000900      05  FILLER    PIC X(14)  VALUE '2610 2610 00 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2613 2613 17 1'.                    
001000      05  FILLER    PIC X(14)  VALUE '2613 2613 31 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2614 2614 00 6'.                    
001000      05  FILLER    PIC X(14)  VALUE '2615 2615 17 5'.                    
001000      05  FILLER    PIC X(14)  VALUE '2615 2615 31 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2615 2615 50 5'.                    
001000      05  FILLER    PIC X(14)  VALUE '2615 2615 00 6'.                    
001000      05  FILLER    PIC X(14)  VALUE '2616 2617 00 3'.                    
001000      05  FILLER    PIC X(14)  VALUE '2621 2621 17 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2621 2621 31 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2621 2621 00 6'.                    
001000      05  FILLER    PIC X(14)  VALUE '2623 2623 17 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2624 2624 00 7'.                    
001000      05  FILLER    PIC X(14)  VALUE '2626 2626 17 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2626 2626 00 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2627 2627 31 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2627 2627 40 4'.                    
001000      05  FILLER    PIC X(14)  VALUE '2627 2627 00 5'.                    
001110      05  FILLER    PIC X(14)  VALUE '2628 2628 31 1'.                    
001110      05  FILLER    PIC X(14)  VALUE '2628 2628 00 4'.                    
001110      05  FILLER    PIC X(14)  VALUE '2630 2630 17 1'.                    
001110      05  FILLER    PIC X(14)  VALUE '2630 2630 31 1'.                    
001110      05  FILLER    PIC X(14)  VALUE '2630 2630 00 4'.                    
001200      05  FILLER    PIC X(14)  VALUE '2636 2636 00 6'.                    
001210      05  FILLER    PIC X(14)  VALUE '2643 2643 17 1'.                    
001210      05  FILLER    PIC X(14)  VALUE '2643 2643 31 4'.                    
 01210      05  FILLER    PIC X(14)  VALUE '2643 2643 00 6'.                    
001210      05  FILLER    PIC X(14)  VALUE '2644 2644 17 4'.                    
001210      05  FILLER    PIC X(14)  VALUE '2644 2644 50 3'.                    
001210      05  FILLER    PIC X(14)  VALUE '2644 2644 88 1'.                    
001210      05  FILLER    PIC X(14)  VALUE '2644 2644 00 6'.                    
001220      05  FILLER    PIC X(14)  VALUE '2645 2645 17 1'.                    
001220      05  FILLER    PIC X(14)  VALUE '2645 2645 31 1'.                    
001220      05  FILLER    PIC X(14)  VALUE '2645 2645 00 4'.                    
001220      05  FILLER    PIC X(14)  VALUE '2646 2647 00 6'.                    
001230      05  FILLER    PIC X(14)  VALUE '2648 2648 00 6'.                    
001230      05  FILLER    PIC X(14)  VALUE '2649 2649 17 4'.                    
001240      05  FILLER    PIC X(14)  VALUE '2650 2656 17 1'.                    
001240      05  FILLER    PIC X(14)  VALUE '2650 2656 31 1'.                    
001240      05  FILLER    PIC X(14)  VALUE '2650 2656 00 4'.                    
001250      05  FILLER    PIC X(14)  VALUE '2657 2657 00 6'.                    
001250      05  FILLER    PIC X(14)  VALUE '2660 2660 17 1'.                    
001250      05  FILLER    PIC X(14)  VALUE '2660 2660 31 4'.                    
001250      05  FILLER    PIC X(14)  VALUE '2660 2660 00 6'.                    
001250      05  FILLER    PIC X(14)  VALUE '2661 2663 00 5'.                    
001250      05  FILLER    PIC X(14)  VALUE '2664 2664 17 1'.                    
001250      05  FILLER    PIC X(14)  VALUE '2664 2664 31 4'.                    
001250      05  FILLER    PIC X(14)  VALUE '2665 2665 17 1'.                    
001250      05  FILLER    PIC X(14)  VALUE '2665 2665 00 4'.                    
001300      05  FILLER    PIC X(14)  VALUE '2666 2667 17 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2667 2667 31 4'.                    
001300      05  FILLER    PIC X(14)  VALUE '2666 2667 00 6'.                    
001250      05  FILLER    PIC X(14)  VALUE '2668 2668 17 1'.                    
001250      05  FILLER    PIC X(14)  VALUE '2668 2668 31 5'.                    
001250      05  FILLER    PIC X(14)  VALUE '2668 2668 00 5'.                    
001300      05  FILLER    PIC X(14)  VALUE '2669 2671 17 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2669 2671 00 6'.                    
001250      05  FILLER    PIC X(14)  VALUE '2672 2672 31 5'.                    
001250      05  FILLER    PIC X(14)  VALUE '2672 2672 00 5'.                    
001300      05  FILLER    PIC X(14)  VALUE '2673 2674 17 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2673 2674 00 6'.                    
001250      05  FILLER    PIC X(14)  VALUE '2675 2675 17 1'.                    
001250      05  FILLER    PIC X(14)  VALUE '2675 2675 31 4'.                    
001250      05  FILLER    PIC X(14)  VALUE '2675 2675 00 5'.                    
001300      05  FILLER    PIC X(14)  VALUE '2676 2676 17 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2676 2676 00 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2677 2677 17 4'.                    
001300      05  FILLER    PIC X(14)  VALUE '2677 2677 00 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2678 2697 17 4'.                    
001300      05  FILLER    PIC X(14)  VALUE '2678 2697 00 6'.                    
001300      05  FILLER    PIC X(14)  VALUE '2698 2698 17 1'.                    
001300      05  FILLER    PIC X(14)  VALUE '2698 2698 31 4'.                    
001230      05  FILLER    PIC X(14)  VALUE '2698 2649 00 1'.                    
001400      05  FILLER    PIC X(14)  VALUE '2867 2867 17 4'.                    
001500      05  FILLER    PIC X(14)  VALUE '2867 2867 31 9'.                    
001600      05  FILLER    PIC X(14)  VALUE '2867 2867 50 4'.                    
001400      05  FILLER    PIC X(14)  VALUE '3130 3130 17 1'.                    
001500      05  FILLER    PIC X(14)  VALUE '3130 3130 41 2'.                    
001600      05  FILLER    PIC X(14)  VALUE '3130 3130 43 2'.                    
001700      05  FILLER    PIC X(14)  VALUE '3130 3130 50 3'.                    
001800      05  FILLER    PIC X(14)  VALUE '3166 3166 17 1'.                    
001800      05  FILLER    PIC X(14)  VALUE '3166 3166 34 4'.                    
001800      05  FILLER    PIC X(14)  VALUE '3166 3166 43 1'.                    
001800      05  FILLER    PIC X(14)  VALUE '3166 3166 50 4'.                    
001800      05  FILLER    PIC X(14)  VALUE '3166 3166 00 5'.                    
001800      05  FILLER    PIC X(14)  VALUE '3235 3235 17 1'.                    
001800      05  FILLER    PIC X(14)  VALUE '3235 3235 41 1'.                    
001800      05  FILLER    PIC X(14)  VALUE '3235 3235 43 1'.                    
001800      05  FILLER    PIC X(14)  VALUE '3235 3235 50 4'.                    
001900      05  FILLER    PIC X(14)  VALUE '3670 3670 00 5'.                    
001900      05  FILLER    PIC X(14)  VALUE '4400 4400 00 1'.                    
001900      05  FILLER    PIC X(14)  VALUE '4841 4843 17 1'.                    
001900      05  FILLER    PIC X(14)  VALUE '4841 4843 41 1'.                    
001900      05  FILLER    PIC X(14)  VALUE '4841 4843 43 1'.                    
001900      05  FILLER    PIC X(14)  VALUE '4841 4843 50 4'.                    
002000      05  FILLER    PIC X(14)  VALUE '5120 5120 17 1'.                    
002000      05  FILLER    PIC X(14)  VALUE '5120 5120 00 4'.                    
002100      05  FILLER    PIC X(14)  VALUE '5211 5212 00 3'.                    
002200      05  FILLER    PIC X(14)  VALUE '5222 5222 00 1'.                    
002300      05  FILLER    PIC X(14)  VALUE '5310 5310 17 5'.                    
002300      05  FILLER    PIC X(14)  VALUE '5310 5310 00 5'.                    
002400      05  FILLER    PIC X(14)  VALUE '5410 5410 17 1'.                    
002400      05  FILLER    PIC X(14)  VALUE '5410 5410 43 1'.                    
002400      05  FILLER    PIC X(14)  VALUE '5410 5410 50 4'.                    
002400      05  FILLER    PIC X(14)  VALUE '5415 5415 00 4'.                    
002500      05  FILLER    PIC X(14)  VALUE '5510 5510 00 4'.                    
002600      05  FILLER    PIC X(14)  VALUE '5616 5616 17 1'.                    
002700      05  FILLER    PIC X(14)  VALUE '5616 5616 43 1'.                    
002800      05  FILLER    PIC X(14)  VALUE '5616 5616 50 5'.                    
002800      05  FILLER    PIC X(14)  VALUE '5619 5619 17 1'.                    
002800      05  FILLER    PIC X(14)  VALUE '5619 5619 43 1'.                    
002800      05  FILLER    PIC X(14)  VALUE '5619 5619 50 3'.                    
002900      05  FILLER    PIC X(14)  VALUE '5625 5625 00 3'.                    
003000      05  FILLER    PIC X(14)  VALUE '5725 5725 00 1'.                    
003000      05  FILLER    PIC X(14)  VALUE '5735 5735 17 1'.                    
003000      05  FILLER    PIC X(14)  VALUE '5735 5735 43 1'.                    
003000      05  FILLER    PIC X(14)  VALUE '5735 5735 50 4'.                    
003000      05  FILLER    PIC X(14)  VALUE '5739 5739 00 5'.                    
003100      05  FILLER    PIC X(14)  VALUE '5810 5811 00 3'.                    
003200      05  FILLER    PIC X(14)  VALUE '5840 5840 17 1'.                    
003200      05  FILLER    PIC X(14)  VALUE '5840 5840 43 1'.                    
003200      05  FILLER    PIC X(14)  VALUE '5840 5840 50 3'.                    
003300      05  FILLER    PIC X(14)  VALUE '5916 5916 17 1'.                    
003300      05  FILLER    PIC X(14)  VALUE '5916 5916 43 1'.                    
003300      05  FILLER    PIC X(14)  VALUE '5916 5916 50 2'.                    
003300      05  FILLER    PIC X(14)  VALUE '5916 5916 00 3'.                    
003300      05  FILLER    PIC X(14)  VALUE '5922 5922 50 2'.                    
003300      05  FILLER    PIC X(14)  VALUE '5922 5922 00 4'.                    
003400      05  FILLER    PIC X(14)  VALUE '6017 6017 17 2'.                    
003400      05  FILLER    PIC X(14)  VALUE '6017 6017 41 2'.                    
003400      05  FILLER    PIC X(14)  VALUE '6017 6017 50 2'.                    
003400      05  FILLER    PIC X(14)  VALUE '6017 6017 00 4'.                    
003500      05  FILLER    PIC X(14)  VALUE '6020 6031 00 4'.                    
003500      05  FILLER    PIC X(14)  VALUE '6032 6033 00 5'.                    
003600      05  FILLER    PIC X(14)  VALUE '6035 6035 17 4'.                    
003700      05  FILLER    PIC X(14)  VALUE '6035 6035 43 6'.                    
003800      05  FILLER    PIC X(14)  VALUE '6035 6035 50 4'.                    
003900      05  FILLER    PIC X(14)  VALUE '6053 6053 00 5'.                    
004000      05  FILLER    PIC X(14)  VALUE '6121 6121 17 1'.                    
004000      05  FILLER    PIC X(14)  VALUE '6121 6121 00 3'.                    
004100      05  FILLER    PIC X(14)  VALUE '6204 6204 17 2'.                    
004200      05  FILLER    PIC X(14)  VALUE '6204 6204 50 4'.                    
004100      05  FILLER    PIC X(14)  VALUE '6212 6212 17 1'.                    
004100      05  FILLER    PIC X(14)  VALUE '6214 6214 17 1'.                    
004200      05  FILLER    PIC X(14)  VALUE '6214 6214 50 4'.                    
004300      05  FILLER    PIC X(14)  VALUE '6216 6216 17 1'.                    
004400      05  FILLER    PIC X(14)  VALUE '6216 6216 43 2'.                    
004500      05  FILLER    PIC X(14)  VALUE '6216 6216 50 4'.                    
004600      05  FILLER    PIC X(14)  VALUE '6217 6217 17 2'.                    
004700      05  FILLER    PIC X(14)  VALUE '6217 6217 50 4'.                    
004800      05  FILLER    PIC X(14)  VALUE '6218 6218 17 1'.                    
004800      05  FILLER    PIC X(14)  VALUE '6218 6218 00 3'.                    
004900      05  FILLER    PIC X(14)  VALUE '6221 6221 17 3'.                    
004900      05  FILLER    PIC X(14)  VALUE '6222 6222 17 1'.                    
005000      05  FILLER    PIC X(14)  VALUE '6221 6221 43 3'.                    
005000      05  FILLER    PIC X(14)  VALUE '6222 6222 43 1'.                    
005100      05  FILLER    PIC X(14)  VALUE '6221 6221 50 4'.                    
005100      05  FILLER    PIC X(14)  VALUE '6222 6222 50 3'.                    
005210      05  FILLER    PIC X(14)  VALUE '6223 6226 00 2'.                    
005300      05  FILLER    PIC X(14)  VALUE '6228 6231 17 4'.                    
005400      05  FILLER    PIC X(14)  VALUE '6228 6231 43 3'.                    
005500      05  FILLER    PIC X(14)  VALUE '6228 6231 50 5'.                    
005500      05  FILLER    PIC X(14)  VALUE '6233 6233 00 4'.                    
005800      05  FILLER    PIC X(14)  VALUE '6236 6236 00 2'.                    
005810      05  FILLER    PIC X(14)  VALUE '6247 6247 17 1'.                    
005810      05  FILLER    PIC X(14)  VALUE '6247 6247 43 4'.                    
005810      05  FILLER    PIC X(14)  VALUE '6247 6247 50 4'.                    
005810      05  FILLER    PIC X(14)  VALUE '6251 6251 17 1'.                    
005810      05  FILLER    PIC X(14)  VALUE '6251 6251 43 1'.                    
005810      05  FILLER    PIC X(14)  VALUE '6251 6251 50 3'.                    
005900      05  FILLER    PIC X(14)  VALUE '6311 6311 50 2'.                    
005900      05  FILLER    PIC X(14)  VALUE '6310 6311 00 3'.                    
006000      05  FILLER    PIC X(14)  VALUE '6480 6480 50 2'.                    
006000      05  FILLER    PIC X(14)  VALUE '6480 6480 00 3'.                    
006100      05  FILLER    PIC X(14)  VALUE '6580 6580 00 1'.                    
006100      05  FILLER    PIC X(14)  VALUE '6581 6585 00 5'.                    
006100      05  FILLER    PIC X(14)  VALUE '6587 6587 17 1'.                    
006100      05  FILLER    PIC X(14)  VALUE '6587 6587 43 1'.                    
006100      05  FILLER    PIC X(14)  VALUE '6587 6587 50 2'.                    
006100      05  FILLER    PIC X(14)  VALUE '6587 6587 00 4'.                    
006200      05  FILLER    PIC X(14)  VALUE '6680 6680 00 1'.                    
006300      05  FILLER    PIC X(14)  VALUE '6785 6785 50 2'.                    
006300      05  FILLER    PIC X(14)  VALUE '6785 6785 00 3'.                    
006400      05  FILLER    PIC X(14)  VALUE '6895 6895 17 1'.                    
006400      05  FILLER    PIC X(14)  VALUE '6895 6895 50 2'.                    
006400      05  FILLER    PIC X(14)  VALUE '6895 6895 00 4'.                    
006500      05  FILLER    PIC X(14)  VALUE '6990 6990 00 4'.                    
006600      05  FILLER    PIC X(14)  VALUE '7010 7010 00 4'.                    
006600      05  FILLER    PIC X(14)  VALUE '7030 7030 43 4'.                    
006600      05  FILLER    PIC X(14)  VALUE '7030 7030 50 2'.                    
006600      05  FILLER    PIC X(14)  VALUE '7030 7030 00 3'.                    
006600      05  FILLER    PIC X(14)  VALUE '7040 7040 50 2'.                    
006600      05  FILLER    PIC X(14)  VALUE '7040 7040 00 4'.                    
006700      05  FILLER    PIC X(14)  VALUE '7180 7180 00 4'.                    
006800      05  FILLER    PIC X(14)  VALUE '7399 7399 00 5'.                    
006900      05  FILLER    PIC X(14)  VALUE '7412 7412 50 2'.                    
006900      05  FILLER    PIC X(14)  VALUE '7412 7412 00 3'.                    
007000      05  FILLER    PIC X(14)  VALUE '7416 7416 50 2'.                    
007000      05  FILLER    PIC X(14)  VALUE '7416 7416 00 4'.                    
007100      05  FILLER    PIC X(14)  VALUE '7425 7425 00 5'.                    
007100      05  FILLER    PIC X(14)  VALUE '7426 7426 50 2'.                    
007200      05  FILLER    PIC X(14)  VALUE '7434 7435 00 5'.                    
007200      05  FILLER    PIC X(14)  VALUE '7436 7436 17 1'.                    
007200      05  FILLER    PIC X(14)  VALUE '7436 7436 50 2'.                    
007200      05  FILLER    PIC X(14)  VALUE '7436 7469 00 5'.                    
007200      05  FILLER    PIC X(14)  VALUE '7470 7470 17 3'.                    
007200      05  FILLER    PIC X(14)  VALUE '7470 7470 50 2'.                    
007200      05  FILLER    PIC X(14)  VALUE '7470 7470 00 5'.                    
007300      05  FILLER    PIC X(14)  VALUE '7482 7482 00 1'.                    
007400      05  FILLER    PIC X(14)  VALUE '7485 7485 00 4'.                    
007500      05  FILLER    PIC X(14)  VALUE '7490 7490 50 2'.                    
007500      05  FILLER    PIC X(14)  VALUE '7490 7495 00 3'.                    
007500      05  FILLER    PIC X(14)  VALUE '7496 7496 00 1'.                    
007700      05  FILLER    PIC X(14)  VALUE '7538 7538 17 1'.                    
007700      05  FILLER    PIC X(14)  VALUE '7538 7538 50 2'.                    
007700      05  FILLER    PIC X(14)  VALUE '7538 7538 00 4'.                    
007800      05  FILLER    PIC X(14)  VALUE '7574 7574 00 3'.                    
007900      05  FILLER    PIC X(14)  VALUE '7674 7674 00 3'.                    
008000      05  FILLER    PIC X(14)  VALUE '7836 7836 17 3'.                    
008010      05  FILLER    PIC X(14)  VALUE '7836 7836 19 3'.                    
008100      05  FILLER    PIC X(14)  VALUE '7836 7836 43 4'.                    
008300      05  FILLER    PIC X(14)  VALUE '7910 7910 00 4'.                    
008410      05  FILLER    PIC X(14)  VALUE '8141 8141 17 2'.                    
008410      05  FILLER    PIC X(14)  VALUE '8141 8141 43 1'.                    
008410      05  FILLER    PIC X(14)  VALUE '8141 8141 00 3'.                    
008410      05  FILLER    PIC X(14)  VALUE '8142 8142 17 2'.                    
008410      05  FILLER    PIC X(14)  VALUE '8142 8142 43 1'.                    
008410      05  FILLER    PIC X(14)  VALUE '8143 8143 17 2'.                    
008410      05  FILLER    PIC X(14)  VALUE '8143 8143 43 1'.                    
008410      05  FILLER    PIC X(14)  VALUE '8151 8151 43 1'.                    
008410      05  FILLER    PIC X(14)  VALUE '8142 8151 00 3'.                    
008411      05  FILLER    PIC X(14)  VALUE '8161 8161 17 1'.                    
008420      05  FILLER    PIC X(14)  VALUE '8161 8161 43 4'.                    
008430      05  FILLER    PIC X(14)  VALUE '8161 8161 50 4'.                    
008440      05  FILLER    PIC X(14)  VALUE '8162 8162 17 1'.                    
008450      05  FILLER    PIC X(14)  VALUE '8162 8162 43 3'.                    
008460      05  FILLER    PIC X(14)  VALUE '8162 8162 50 3'.                    
008500   03  REFAKTKOP  REDEFINES FAKTKOP-TAB.                                  
008600      05  FAKTKOP-TABELL OCCURS 254                                       
008700          ASCENDING KEY KOP-IDDISTR-MIN                                   
008800          INDEXED BY KOP-IX.                                              
008900          07  KOP-IDDISTR-MIN       PIC 9(4).                             
009000          07  FILLER                PIC X.                                
009100          07  KOP-IDDISTR-MAX       PIC 9(4).                             
009200          07  FILLER                PIC X.                                
009300          07  KOP-KDFRAKT           PIC 9(2).                             
009400          07  FILLER                PIC X.                                
009500          07  KOP-ANT-KOPIOR        PIC 9(1).                             
009600*** END COPY W475WCOP                                                     
