000100*** EDIT ALLOWED                                                          
000201*****************************************************************         
000301* TABELL FÖR ATT HITTA RÄTT TRANS-TYP ( /X) FÖR ETT DISTRIKT    *         
000401*                                                               *         
000501*   PIC A(12) VALUE '11/1000-1099'.                             *         
000601*                     I     I                                   *         
000701*   DC          ------I     I                                   *         
000801*   DISTRIKTSINTERVALL  ----I                                   *         
000901*                                                               *         
001001* TABELLEN TALAR OM ATT 'DE HÄR DISTRIKTEN SKALL HA             *         
001101* EN BAKGRUNDS-TRANS (X) FRÅN: 4664/4698 & L187                 *         
001201*                                                               *         
001301* OBS!!OBS!! VID TILLÄGG/BORTTAG ANPASSA OCCURS I BOTTEN!!!     *         
001401*                                                               *         
001501*****************************************************************         
001601                                                                          
001701 01  TRANS-TABELL-DATA.                                                   
001801                                                                          
001901   03   PIC X(12) VALUE '1A/0001-9999'.                                   
002001   03   PIC X(12) VALUE '1B/0001-9999'.                                   
002101   03   PIC X(12) VALUE '1C/0001-9999'.                                   
002201   03   PIC X(12) VALUE '1D/0001-9999'.                                   
002301   03   PIC X(12) VALUE '1E/0001-9999'.                                   
002401                                                                          
002501   03   PIC X(12) VALUE '2C/0001-9999'.                                   
002601   03   PIC X(12) VALUE '2H/0001-9999'.                                   
002701   03   PIC X(12) VALUE '2I/0001-9999'.                                   
002801   03   PIC X(12) VALUE '2J/0001-9999'.                                   
002901   03   PIC X(12) VALUE '2L/0001-9999'.                                   
003001   03   PIC X(12) VALUE '2M/0001-9999'.                                   
003101                                                                          
003201   03   PIC X(12) VALUE '3A/0001-9999'.                                   
003301   03   PIC X(12) VALUE '3B/0001-9999'.                                   
003401   03   PIC X(12) VALUE '3C/0001-9999'.                                   
003501   03   PIC X(12) VALUE '3D/0001-9999'.                                   
003601   03   PIC X(12) VALUE '3E/0001-9999'.                                   
003701   03   PIC X(12) VALUE '3F/0001-9999'.                                   
003801   03   PIC X(12) VALUE '3G/0001-9999'.                                   
003901   03   PIC X(12) VALUE '3H/0001-9999'.                                   
004001   03   PIC X(12) VALUE '3J/0001-9999'.                                   
004101   03   PIC X(12) VALUE '3K/0001-9999'.                                   
004201   03   PIC X(12) VALUE '3L/0001-9999'.                                   
004301   03   PIC X(12) VALUE '3M/0001-9999'.                                   
004401   03   PIC X(12) VALUE '3N/0001-9999'.                                   
004501   03   PIC X(12) VALUE '3O/0001-2634'.                                   
004601   03   PIC X(12) VALUE '3O/2636-2637'.                                   
004701   03   PIC X(12) VALUE '3O/2639-9999'.                                   
004800   03   PIC X(12) VALUE '3P/0001-9999'.                                   
004900   03   PIC X(12) VALUE '3R/0001-9999'.                                   
005000   03   PIC X(12) VALUE '3S/0001-9999'.                                   
005100   03   PIC X(12) VALUE '3T/0001-9999'.                                   
005200   03   PIC X(12) VALUE '4A/0001-9999'.                                   
005300   03   PIC X(12) VALUE '4B/0001-9999'.                                   
005400   03   PIC X(12) VALUE '4C/0001-9999'.                                   
005500   03   PIC X(12) VALUE '4D/0001-9999'.                                   
005600                                                                          
005700   03   PIC X(12) VALUE '11/0001-0100'.                                   
005800   03   PIC X(12) VALUE '11/0738-0738'.                                   
006000   03   PIC X(12) VALUE '11/0970-0999'.                                   
006100   03   PIC X(12) VALUE '11/1238-1238'.                                   
006200   03   PIC X(12) VALUE '11/1241-1292'.                                   
006300   03   PIC X(12) VALUE '11/1338-1338'.                                   
006400   03   PIC X(12) VALUE '11/1378-1382'.                                   
006500   03   PIC X(12) VALUE '11/1420-1479'.                                   
006600   03   PIC X(12) VALUE '11/1558-1558'.                                   
006700   03   PIC X(12) VALUE '11/1578-1578'.                                   
006800   03   PIC X(12) VALUE '11/1619-1678'.                                   
006900   03   PIC X(12) VALUE '11/1778-1778'.                                   
007000   03   PIC X(12) VALUE '11/1822-1879'.                                   
007100   03   PIC X(12) VALUE '11/1958-1958'.                                   
007200   03   PIC X(12) VALUE '11/1979-1979'.                                   
007300   03   PIC X(12) VALUE '11/2059-2078'.                                   
007400   03   PIC X(12) VALUE '11/2120-2120'.                                   
007500   03   PIC X(12) VALUE '11/2138-2138'.                                   
007600   03   PIC X(12) VALUE '11/2178-2179'.                                   
007700   03   PIC X(12) VALUE '11/2270-2278'.                                   
007800   03   PIC X(12) VALUE '11/2282-2282'.                                   
007900   03   PIC X(12) VALUE '11/2359-2378'.                                   
008000   03   PIC X(12) VALUE '11/2459-2459'.                                   
008100   03   PIC X(12) VALUE '11/2878-2879'.                                   
008200   03   PIC X(12) VALUE '11/7575-7580'.                                   
008300   03   PIC X(12) VALUE '11/7680-7680'.                                   
008400   03   PIC X(12) VALUE '11/8032-8032'.                                   
008500   03   PIC X(12) VALUE '11/8052-8052'.                                   
008600   03   PIC X(12) VALUE '11/8062-8062'.                                   
008700   03   PIC X(12) VALUE '11/8072-8072'.                                   
008800   03   PIC X(12) VALUE '11/8082-8082'.                                   
008900   03   PIC X(12) VALUE '11/8092-8092'.                                   
009000   03   PIC X(12) VALUE '11/8111-8140'.                                   
009100   03   PIC X(12) VALUE '11/8154-8160'.                                   
009200   03   PIC X(12) VALUE '11/8168-8170'.                                   
009301   03   PIC X(12) VALUE '11/8175-8184'.                                   
009400   03   PIC X(12) VALUE '11/8188-8192'.                                   
009500   03   PIC X(12) VALUE '11/8194-8540'.                                   
009600   03   PIC X(12) VALUE '11/8544-8613'.                                   
009700   03   PIC X(12) VALUE '11/8615-8616'.                                   
009800   03   PIC X(12) VALUE '11/8618-8678'.                                   
009900   03   PIC X(12) VALUE '11/8680-8699'.                                   
010000   03   PIC X(12) VALUE '11/8700-8700'.                                   
010100   03   PIC X(12) VALUE '11/8741-8751'.                                   
010200   03   PIC X(12) VALUE '11/8851-8866'.                                   
010210   03   PIC X(12) VALUE '11/8868-8868'.                                   
010300   03   PIC X(12) VALUE '11/8960-8977'.                                   
010400                                                                          
010500   03   PIC X(12) VALUE '21/0001-0100'.                                   
010600   03   PIC X(12) VALUE '21/0778-0778'.                                   
010700   03   PIC X(12) VALUE '21/0878-0878'.                                   
010800   03   PIC X(12) VALUE '21/0978-0978'.                                   
010900   03   PIC X(12) VALUE '21/1090-1090'.                                   
011000   03   PIC X(12) VALUE '21/1257-1292'.                                   
011100   03   PIC X(12) VALUE '21/1378-1378'.                                   
011200   03   PIC X(12) VALUE '21/1420-1478'.                                   
011300   03   PIC X(12) VALUE '21/1619-1679'.                                   
011400   03   PIC X(12) VALUE '21/1778-1778'.                                   
011500   03   PIC X(12) VALUE '21/1822-1822'.                                   
011600   03   PIC X(12) VALUE '21/1958-1958'.                                   
011700   03   PIC X(12) VALUE '21/2059-2078'.                                   
011800   03   PIC X(12) VALUE '21/2178-2178'.                                   
011900   03   PIC X(12) VALUE '21/2259-2278'.                                   
012000   03   PIC X(12) VALUE '21/2370-2378'.                                   
012100   03   PIC X(12) VALUE '21/8033-8034'.                                   
012200                                                                          
012300   03   PIC X(12) VALUE '23/0001-0100'.                                   
012400   03   PIC X(12) VALUE '23/1378-1378'.                                   
012500   03   PIC X(12) VALUE '23/1778-1778'.                                   
012600   03   PIC X(12) VALUE '23/8053-8054'.                                   
012700                                                                          
012800   03   PIC X(12) VALUE '24/0001-3129'.                                   
012900   03   PIC X(12) VALUE '24/3131-3679'.                                   
013000   03   PIC X(12) VALUE '24/3681-4399'.                                   
013100   03   PIC X(12) VALUE '24/4401-4409'.                                   
013200   03   PIC X(12) VALUE '24/4411-9999'.                                   
013300                                                                          
013400   03   PIC X(12) VALUE '25/0001-9999'.                                   
013500                                                                          
013600   03   PIC X(12) VALUE '26/0001-0100'.                                   
013700   03   PIC X(12) VALUE '26/2370-2378'.                                   
013800   03   PIC X(12) VALUE '26/8083-8084'.                                   
013900                                                                          
014000   03   PIC X(12) VALUE '41/7510-7510'.                                   
014100   03   PIC X(12) VALUE '41/7575-8751'.                                   
014200                                                                          
014300   03   PIC X(12) VALUE '43/7510-7510'.                                   
014400   03   PIC X(12) VALUE '43/7575-8751'.                                   
014500   03   PIC X(12) VALUE '44/7510-7510'.                                   
014600   03   PIC X(12) VALUE '44/7575-7673'.                                   
014700   03   PIC X(12) VALUE '44/7675-8751'.                                   
014800                                                                          
014900   03   PIC X(12) VALUE '51/0001-7673'.                                   
015000   03   PIC X(12) VALUE '51/7675-9999'.                                   
015100   03   PIC X(12) VALUE '52/0001-9999'.                                   
015200   03   PIC X(12) VALUE '53/0001-9999'.                                   
015300                                                                          
015400   03   PIC X(12) VALUE '61/0001-0100'.                                   
015500   03   PIC X(12) VALUE '61/5222-5222'.                                   
015600   03   PIC X(12) VALUE '61/8263-8263'.                                   
015700   03   PIC X(12) VALUE '61/8311-8312'.                                   
015800   03   PIC X(12) VALUE '61/8362-8362'.                                   
015900                                                                          
016000   03   PIC X(12) VALUE '6A/5222-5222'.                                   
016100   03   PIC X(12) VALUE '6A/8311-8312'.                                   
016200   03   PIC X(12) VALUE '6A/8363-8364'.                                   
016300                                                                          
016400   03   PIC X(12) VALUE '62/0001-9999'.                                   
016500                                                                          
016600   03   PIC X(12) VALUE '63/0001-8563'.                                   
016700   03   PIC X(12) VALUE '63/8565-8565'.                                   
016800   03   PIC X(12) VALUE '63/8567-9999'.                                   
016900                                                                          
017000   03   PIC X(12) VALUE '64/0001-8562'.                                   
017100   03   PIC X(12) VALUE '64/8564-8565'.                                   
017200   03   PIC X(12) VALUE '64/8567-8567'.                                   
017300   03   PIC X(12) VALUE '64/8568-9999'.                                   
017400                                                                          
017500   03   PIC X(12) VALUE '65/0001-9366'.                                   
017600   03   PIC X(12) VALUE '65/9368-9999'.                                   
017701                                                                          
017801   03   PIC X(12) VALUE '66/0001-8562'.                                   
017901   03   PIC X(12) VALUE '66/8565-9999'.                                   
018001                                                                          
018101   03   PIC X(12) VALUE '67/0001-9999'.                                   
018201                                                                          
018301   03   PIC X(12) VALUE '71/0001-9140'.                                   
018401   03   PIC X(12) VALUE '71/9147-9160'.                                   
018501   03   PIC X(12) VALUE '71/9168-9180'.                                   
018601   03   PIC X(12) VALUE '71/9188-9999'.                                   
018701                                                                          
018801   03   PIC X(12) VALUE '72/0001-9999'.                                   
018901   03   PIC X(12) VALUE '73/0001-9999'.                                   
019001   03   PIC X(12) VALUE '74/0001-9999'.                                   
019101                                                                          
019201   03   PIC X(12) VALUE '81/0001-9999'.                                   
019301   03   PIC X(12) VALUE '82/0001-9999'.                                   
019401   03   PIC X(12) VALUE '85/0001-9999'.                                   
019501   03   PIC X(12) VALUE '86/0001-9999'.                                   
019601   03   PIC X(12) VALUE '87/0071-0071'.                                   
019701   03   PIC X(12) VALUE '87/8224-8225'.                                   
019801   03   PIC X(12) VALUE '87/8480-8480'.                                   
019901   03   PIC X(12) VALUE '87/8490-8490'.                                   
020001                                                                          
020101 01  FILLER REDEFINES TRANS-TABELL-DATA.                                  
020201   03  TRANS-TABELL OCCURS 159 INDEXED BY IDDC-IX.                        
020301     05  TRA-IDDC            PIC X(2).                                    
020401     05  FILLER              PIC X(1).                                    
020501     05  TRA-IDDISTR-FOM     PIC X(4).                                    
020601     05  FILLER              PIC X(1).                                    
020701     05  TRA-IDDISTR-TOM     PIC X(4).                                    
020801                                                                          
020901     EJECT                                                                
021001*** END COPY W476DIST    LENGTH=                                          
