000100*** EDIT ALLOWED                                                          
000200 01  XLS-R2-WB1103.                                                       
000300*                             2:a RUBRIKRAD I XLS-FIL                     
000310     03 XLS-R2-ID01          PIC X(3)   VALUE 'KDP'.                      
000500     03 XLS-R2-TAB01         PIC X      VALUE X'05'.                      
000600     03 XLS-R2-ID02          PIC X(3)   VALUE 'KDP'.                      
000700     03 XLS-R2-TAB02         PIC X      VALUE X'05'.                      
000800     03 XLS-R2-ID03          PIC X(3)   VALUE 'KDP'.                      
000900     03 XLS-R2-TAB03         PIC X      VALUE X'05'.                      
001000     03 XLS-R2-ID04          PIC X(3)   VALUE 'KDP'.                      
001100     03 XLS-R2-TAB04         PIC X      VALUE X'05'.                      
001200     03 XLS-R2-ID05          PIC X(3)   VALUE 'KDP'.                      
001300     03 XLS-R2-TAB05         PIC X      VALUE X'05'.                      
001400     03 XLS-R2-ID06          PIC X(3)   VALUE 'KDP'.                      
001500     03 XLS-R2-TAB06         PIC X      VALUE X'05'.                      
001600     03 XLS-R2-ID07          PIC X(3)   VALUE 'KDP'.                      
001700     03 XLS-R2-TAB07         PIC X      VALUE X'05'.                      
001800     03 XLS-R2-ID08          PIC X(3)   VALUE 'KDP'.                      
001900     03 XLS-R2-TAB08         PIC X      VALUE X'05'.                      
002000     03 XLS-R2-ID09          PIC X(3)   VALUE 'KDP'.                      
002100     03 XLS-R2-TAB09         PIC X      VALUE X'05'.                      
002200     03 XLS-R2-ID10          PIC X(3)   VALUE 'KDP'.                      
002300     03 XLS-R2-TAB10         PIC X      VALUE X'05'.                      
002400     03 XLS-R2-ID11          PIC X(3)   VALUE 'KDP'.                      
002500     03 XLS-R2-TAB11         PIC X      VALUE X'05'.                      
002600     03 XLS-R2-ID12          PIC X(3)   VALUE 'KDP'.                      
002700     03 XLS-R2-TAB12         PIC X      VALUE X'05'.                      
002800     03 XLS-R2-ID13          PIC X(3)   VALUE 'KDP'.                      
002900     03 XLS-R2-TAB13         PIC X      VALUE X'05'.                      
003000     03 XLS-R2-ID14          PIC X(3)   VALUE 'KDP'.                      
003100     03 XLS-R2-TAB14         PIC X      VALUE X'05'.                      
003200     03 XLS-R2-ID15          PIC X(3)   VALUE 'KDP'.                      
003300     03 XLS-R2-TAB15         PIC X      VALUE X'05'.                      
003400     03 XLS-R2-ID16          PIC X(3)   VALUE 'KDP'.                      
003500     03 XLS-R2-TAB16         PIC X      VALUE X'05'.                      
003510     03 XLS-R2-ID17          PIC X(3)   VALUE 'KDP'.                      
003520     03 XLS-R2-TAB17         PIC X      VALUE X'05'.                      
003600     03 XLS-R2-ID18          PIC X(3)   VALUE 'KDP'.                      
003700     03 XLS-R2-TAB18         PIC X      VALUE X'05'.                      
003800     03 XLS-R2-ID19          PIC X(3)   VALUE 'Man'.                      
003900     03 XLS-R2-TAB19         PIC X      VALUE X'05'.                      
004000     03 XLS-R2-ID20          PIC X(3)   VALUE 'KDP'.                      
004100     03 XLS-R2-TAB20         PIC X      VALUE X'05'.                      
004200     03 XLS-R2-ID21          PIC X(3)   VALUE 'KDP'.                      
004300     03 XLS-R2-TAB21         PIC X      VALUE X'05'.                      
004310     03 XLS-R2-ID22          PIC X(3)   VALUE 'KDP'.                      
004320     03 XLS-R2-TAB22         PIC X      VALUE X'05'.                      
004400     03 XLS-R2-ID23          PIC X(3)   VALUE 'KDP'.                      
004500     03 XLS-R2-TAB23         PIC X      VALUE X'05'.                      
004600     03 XLS-R2-ID24          PIC X(3)   VALUE 'KDP'.                      
004700     03 XLS-R2-TAB24         PIC X      VALUE X'05'.                      
004800     03 XLS-R2-ID25          PIC X(4)   VALUE 'FLIT'.                     
004900     03 XLS-R2-TAB25         PIC X      VALUE X'05'.                      
005000     03 XLS-R2-ID26          PIC X(4)   VALUE 'PULS'.                     
005100     03 XLS-R2-TAB26         PIC X      VALUE X'05'.                      
005200     03 XLS-R2-ID27          PIC X(8)   VALUE 'Man/PULS'.                 
005300     03 XLS-R2-TAB27         PIC X      VALUE X'05'.                      
005400     03 XLS-R2-ID28          PIC X(4)   VALUE 'PULS'.                     
005500     03 XLS-R2-TAB28         PIC X      VALUE X'05'.                      
006000     03 XLS-R2-ID29          PIC X(4)   VALUE 'PULS'.                     
006010     03 XLS-R2-TAB29         PIC X      VALUE X'05'.                      
006200     03 XLS-R2-ID30          PIC X(8)   VALUE 'SI+/PULS'.                 
006210     03 XLS-R2-TAB30         PIC X      VALUE X'05'.                      
006211     03 XLS-R2-ID31          PIC X(4)   VALUE 'PULS'.                     
006220     03 XLS-R2-TAB31         PIC X      VALUE X'05'.                      
006230     03 XLS-R2-ID32          PIC X(4)   VALUE 'PULS'.                     
006300     03 XLS-R2-TAB32         PIC X      VALUE X'05'.                      
006400     03 XLS-R2-ID33          PIC X(3)   VALUE 'KDP'.                      
006500     03 XLS-R2-TAB33         PIC X      VALUE X'05'.                      
006600     03 XLS-R2-ID34          PIC X(3)   VALUE 'KDP'.                      
006700     03 XLS-R2-TAB34         PIC X      VALUE X'05'.                      
006800     03 XLS-R2-ID35          PIC X(4)   VALUE 'FLIT'.                     
006900     03 XLS-R2-TAB35         PIC X      VALUE X'05'.                      
007000     03 XLS-R2-ID36          PIC X(4)   VALUE 'FLIT'.                     
007100     03 XLS-R2-TAB36         PIC X      VALUE X'05'.                      
007200     03 XLS-R2-ID37          PIC X(3)   VALUE 'KDP'.                      
007300     03 XLS-R2-TAB37         PIC X      VALUE X'05'.                      
007400     03 XLS-R2-ID38          PIC X(3)   VALUE 'KDP'.                      
007500     03 XLS-R2-TAB38         PIC X      VALUE X'05'.                      
007600     03 XLS-R2-ID39          PIC X(3)   VALUE 'KDP'.                      
007700     03 XLS-R2-TAB39         PIC X      VALUE X'05'.                      
007800     03 XLS-R2-ID40          PIC X(3)   VALUE 'KDP'.                      
007900     03 XLS-R2-TAB40         PIC X      VALUE X'05'.                      
008000     03 XLS-R2-ID41          PIC X(3)   VALUE 'KDP'.                      
008100     03 XLS-R2-TAB41         PIC X      VALUE X'05'.                      
008200     03 XLS-R2-ID42          PIC X(3)   VALUE 'KDP'.                      
008300     03 XLS-R2-TAB42         PIC X      VALUE X'05'.                      
008400     03 XLS-R2-ID43          PIC X(4)   VALUE 'FLIT'.                     
008500     03 XLS-R2-TAB43         PIC X      VALUE X'05'.                      
008600     03 XLS-R2-ID44          PIC X(4)   VALUE 'FLIT'.                     
008700     03 XLS-R2-TAB44         PIC X      VALUE X'05'.                      
008800     03 XLS-R2-ID45          PIC X(4)   VALUE 'FLIT'.                     
008900     03 XLS-R2-TAB45         PIC X      VALUE X'05'.                      
009000     03 XLS-R2-ID46          PIC X(4)   VALUE 'FLIT'.                     
009100     03 XLS-R2-TAB46         PIC X      VALUE X'05'.                      
009200     03 XLS-R2-ID47          PIC X(4)   VALUE 'FLIT'.                     
009300     03 XLS-R2-TAB47         PIC X      VALUE X'05'.                      
009400     03 XLS-R2-ID48          PIC X(4)   VALUE 'FLIT'.                     
009500     03 XLS-R2-TAB48         PIC X      VALUE X'05'.                      
009600     03 XLS-R2-ID49          PIC X(4)   VALUE 'PULS'.                     
009700     03 XLS-R2-TAB49         PIC X      VALUE X'05'.                      
009710     03 XLS-R2-ID50          PIC X(4)   VALUE 'PULS'.                     
009720     03 XLS-R2-TAB50         PIC X      VALUE X'05'.                      
009730     03 XLS-R2-ID51          PIC X(4)   VALUE 'PULS'.                     
009740     03 XLS-R2-TAB51         PIC X      VALUE X'05'.                      
009750     03 XLS-R2-ID52          PIC X(4)   VALUE 'PULS'.                     
009760     03 XLS-R2-TAB52         PIC X      VALUE X'05'.                      
009770     03 XLS-R2-ID53          PIC X(4)   VALUE 'PULS'.                     
009780     03 XLS-R2-TAB53         PIC X      VALUE X'05'.                      
009790     03 XLS-R2-ID54          PIC X(4)   VALUE 'PULS'.                     
009791     03 XLS-R2-TAB54         PIC X      VALUE X'05'.                      
009792     03 XLS-R2-ID55          PIC X(4)   VALUE 'FLIT'.                     
009793     03 XLS-R2-TAB55         PIC X      VALUE X'05'.                      
009794     03 XLS-R2-ID56          PIC X(8)   VALUE 'KDP/PULS'.                 
009795     03 XLS-R2-TAB56         PIC X      VALUE X'05'.                      
009796     03 XLS-R2-ID57          PIC X(3)   VALUE 'Man'.                      
009797     03 XLS-R2-TAB57         PIC X      VALUE X'05'.                      
009798     03 XLS-R2-ID58          PIC X(3)   VALUE 'Man'.                      
009799     03 XLS-R2-TAB58         PIC X      VALUE X'05'.                      
009800     03 XLS-R2-ID59          PIC X(3)   VALUE 'Man'.                      
009810     03 XLS-R2-TAB59         PIC X      VALUE X'05'.                      
009820     03 XLS-R2-ID60          PIC X(3)   VALUE 'Man'.                      
009830     03 XLS-R2-TAB60         PIC X      VALUE X'05'.                      
009840     03 XLS-R2-ID61          PIC X(3)   VALUE 'Man'.                      
009850     03 XLS-R2-TAB61         PIC X      VALUE X'05'.                      
009860     03 XLS-R2-ID62          PIC X(3)   VALUE 'Man'.                      
009870     03 XLS-R2-TAB62         PIC X      VALUE X'05'.                      
009880     03 XLS-R2-ID63          PIC X(3)   VALUE 'Man'.                      
009890     03 XLS-R2-TAB63         PIC X      VALUE X'05'.                      
009891     03 XLS-R2-ID64          PIC X(3)   VALUE 'Man'.                      
009892     03 XLS-R2-TAB64         PIC X      VALUE X'05'.                      
009893     03 XLS-R2-ID65          PIC X(3)   VALUE 'Man'.                      
009894     03 XLS-R2-TAB65         PIC X      VALUE X'05'.                      
009895     03 XLS-R2-ID66          PIC X(3)   VALUE 'Man'.                      
009896     03 XLS-R2-TAB66         PIC X      VALUE X'05'.                      
009897     03 XLS-R2-ID67          PIC X(3)   VALUE 'Man'.                      
009898     03 XLS-R2-TAB67         PIC X      VALUE X'05'.                      
009899     03 XLS-R2-ID68          PIC X(3)   VALUE 'Man'.                      
009900     03 XLS-R2-TAB68         PIC X      VALUE X'05'.                      
009910     03 XLS-R2-ID69          PIC X(3)   VALUE 'Man'.                      
009920     03 XLS-R2-TAB69         PIC X      VALUE X'05'.                      
009930     03 XLS-R2-ID70          PIC X(3)   VALUE 'Man'.                      
009940     03 XLS-R2-TAB70         PIC X      VALUE X'05'.                      
009950     03 XLS-R2-ID71          PIC X(3)   VALUE 'Man'.                      
009960     03 XLS-R2-TAB71         PIC X      VALUE X'05'.                      
010000                                                                          
