000100     EJECT                                                                
000200*    ------ TRADITIONAL CHINESE (TAIWAN) SINGLE BYTE CODE  -------        
000201*    ------ (SUBSET STANDARD US EBCDIC CP 37)              -------        
000210*    -- CREATED BY REXX EBCTAB.                                           
000300*    -- CONV FROM UNICODE UCS-2 TO CCS-ID 28709 (HEX 7025)                
000400*    -- DATA FROM D:/MBTABS/UCSTAB/34B07025.U1D                           
000500*    -- DBCS -> SBCS TABLE. FIRST SOURCE BYTE IS USED AS                  
000600*    -- INDEX INTO FIRST TABLE WHICH GIVES ROW NUMBER OF                  
000700*    -- SECOND TABLE. SECOND SOURCE BYTE IS USED AS INDEX                 
000800*    -- INTO THAT ROW WHICH CONTAINS THE SBCS VALUE (HEX)                 
000900*    -- FOR THE TWO SOURCE BYTES.                                         
001000*    -- INVALID SOURCE VALUES -> HEX 3F (SBCS SUB)                        
001100 01  TAB1-UCS-TO-CP37.                                                    
001200     03  PIC X(16) VALUE X'00020001000100010001000100010001'.             
001300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004300     03  PIC X(16) VALUE X'00010001000100010001000100010003'.             
004400 01  FILLER  REDEFINES TAB1-UCS-TO-CP37.                                  
004500     03  TAB2-IND-U37     PIC S9(4) COMP  OCCURS 256.                     
004600                                                                          
004700 01  TAB2-UCS-TO-CP37.                                                    
004800*    -- TAB2-IND = 1 (X'1')                                               
004900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006500*    -- TAB2-IND = 2 (X'2')                                               
006600     03  PIC X(16) VALUE X'00010203372D2E2F1605250B0C0D0E0F'.             
006700     03  PIC X(16) VALUE X'101112133C3D322618193F271C1D1E1F'.             
006800     03  PIC X(16) VALUE X'405A7F7B5B6C507D4D5D5C4E6B604B61'.             
006900     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
007000     03  PIC X(16) VALUE X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
007100     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E9BAE0BBB06D'.             
007200     03  PIC X(16) VALUE X'79818283848586878889919293949596'.             
007300     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A9C04FD0A107'.             
007400     03  PIC X(16) VALUE X'202122232415061728292A2B2C090A1B'.             
007500     03  PIC X(16) VALUE X'30311A333435360838393A3B04143EFF'.             
007600     03  PIC X(16) VALUE X'3F3F4A3F3F3F6A3F3F3F3F3F5F3F3F3F'.             
007700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
007800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
007900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008200*    -- TAB2-IND = 3 (X'3')                                               
008300     03  PIC X(16) VALUE X'3F5A7F7B5B6C507D4D5D5C4E6B604B61'.             
008400     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
008500     03  PIC X(16) VALUE X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
008600     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E9BAE0BBB06D'.             
008700     03  PIC X(16) VALUE X'79818283848586878889919293949596'.             
008800     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A9C04FD0A13F'.             
008900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009900 01  FILLER  REDEFINES TAB2-UCS-TO-CP37.                                  
010000     03  FILLER                   OCCURS 3.                               
010100       05  UCS-TO-CP37     PIC X  OCCURS 256.                             
