000400     EJECT                                                                
000500*    -------------- SWEDISH/FINISH EBCDIC -----------------               
000510*    -- CREATED BY REXX EBCTAB.                                           
000600*    -- CONV FROM UNICODE UCS-2 TO CCS-ID 278 (HEX 0116)                  
000700*    -- DATA FROM D:/MBTABS/UCSTAB/34B00116.U1D                           
000800*    -- DBCS -> SBCS TABLE. FIRST SOURCE BYTE IS USED AS                  
000900*    -- INDEX INTO FIRST TABLE WHICH GIVES ROW NUMBER OF                  
001000*    -- SECOND TABLE. SECOND SOURCE BYTE IS USED AS INDEX                 
001100*    -- INTO THAT ROW WHICH CONTAINS THE SBCS VALUE (HEX)                 
001200*    -- FOR THE TWO SOURCE BYTES.                                         
001300*    -- INVALID SOURCE VALUES -> HEX 3F (SBCS SUB)                        
001400 01  TAB1-UCS-TO-CP278.                                                   
001500     03  PIC X(16) VALUE X'00020001000100010001000100010001'.             
001600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001900     03  PIC X(16) VALUE X'00030001000100010001000100010001'.             
002000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004600     03  PIC X(16) VALUE X'00010001000100010001000100010004'.             
004700 01  FILLER  REDEFINES TAB1-UCS-TO-CP278.                                 
004800     03  TAB2-IND-U278  PIC S9(4) COMP  OCCURS 256.                       
004900                                                                          
005000 01  TAB2-UCS-TO-CP278.                                                   
005100*    -- TAB2-IND = 1 (X'1')                                               
005200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006800*    -- TAB2-IND = 2 (X'2')                                               
006900     03  PIC X(16) VALUE X'00010203372D2E2F1605250B0C0D0E0F'.             
007000     03  PIC X(16) VALUE X'101112133C3D322618193F271C1D1E1F'.             
007100     03  PIC X(16) VALUE X'404F7F63676C507D4D5D5C4E6B604B61'.             
007200     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
007300     03  PIC X(16) VALUE X'ECC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
007400     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E9B5719F5F6D'.             
007500     03  PIC X(16) VALUE X'51818283848586878889919293949596'.             
007600     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A943BB47DC07'.             
007700     03  PIC X(16) VALUE X'202122232415061728292A2B2C090A1B'.             
007800     03  PIC X(16) VALUE X'30311A333435360838393A3B04143EFF'.             
007900     03  PIC X(16) VALUE X'41AAB0B15AB2CC4ABDB49A8ABACAAFBC'.             
008000     03  PIC X(16) VALUE X'908FEAFABEA0B6B39DDA9B8BB7B8B9AB'.             
008100     03  PIC X(16) VALUE X'646562667B5B9E6874E0727378757677'.             
008200     03  PIC X(16) VALUE X'AC69EDEEEBEF7CBF80FDFEFBFCADAE59'.             
008300     03  PIC X(16) VALUE X'44454246C0D09C485479525358555657'.             
008400     03  PIC X(16) VALUE X'8C49CDCECBCF6AE170DDDEDBA18D8EDF'.             
008500*    -- TAB2-IND = 3 (X'3')                                               
008600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3FBC3F'.             
009000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010200*    -- TAB2-IND = 4 (X'4')                                               
010300     03  PIC X(16) VALUE X'3F4F7F63676C507D4D5D5C4E6B604B61'.             
010400     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
010500     03  PIC X(16) VALUE X'ECC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
010600     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E9B5719F5F6D'.             
010700     03  PIC X(16) VALUE X'51818283848586878889919293949596'.             
010800     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A943BB47DC3F'.             
010900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011900 01  FILLER  REDEFINES TAB2-UCS-TO-CP278.                                 
012000     03  FILLER                 OCCURS 4.                                 
012100       05  UCS-TO-CP278  PIC X  OCCURS 256.                               
