000010*    -------- EASTERN EUROPE MULTILIGUAL EBCDIC -------------             
000020*    -------- (POLISH, CZECH, SLOVAKIAN, HUNGARIAN, ALBANIAN,             
000030*    -------- ROMANIAN, CROATIAN AND OTHERS)                              
000100*    -- CREATED BY REXX UNITAB.                                           
000200*    -- CONV FROM CCS-ID 870 (HEX 0366) TO UNICODE UCS-2                  
000300*    -- DATA FROM D:/MBTABS/UCSTAB/036634B0.U1D                           
000400*    -- SBCS -> DBCS TABLE. ELEMENT N POINTS TO UCS VALUE                 
000500*    -- (HEXADECIMAL) FOR BYTE VALUE N-1.                                 
000600*    -- INVALID VALUES -> 001A (SUB)                                      
000700 01  TAB-CP870-TO-UCS.                                                    
000800     03  PIC X(16) VALUE X'00000001000200030004000500060007'.             
000900     03  PIC X(16) VALUE X'00080009000A000B000C000D0E000F00'.             
001000     03  PIC X(16) VALUE X'10001100120013001400250016001700'.             
001100     03  PIC X(16) VALUE X'180019001A001B001C001D001E001F00'.             
001200     03  PIC X(16) VALUE X'20002100220023002400150026002700'.             
001300     03  PIC X(16) VALUE X'280029002A002B002C002D002E002F00'.             
001400     03  PIC X(16) VALUE X'30003100320033003400350036003700'.             
001500     03  PIC X(16) VALUE X'380039003A003B003C003D003E003F00'.             
001600     03  PIC X(16) VALUE X'40004100420043018300450103010D48'.             
001700     03  PIC X(16) VALUE X'012F00AD004B004C004D004E005A0050'.             
001800     03  PIC X(16) VALUE X'005101190053019600550056016E017A'.             
001900     03  PIC X(16) VALUE X'005900BD005B005C005D005E005F0060'.             
002000     03  PIC X(16) VALUE X'00610062006302BA00650102010C0068'.             
002100     03  PIC X(16) VALUE X'012E004F006B006C006D006E006F0268'.             
002200     03  PIC X(16) VALUE X'007101180073019500750076017E01F9'.             
002300     03  PIC X(16) VALUE X'0079007A007B007C007D007E007F0280'.             
002400     03  PIC X(16) VALUE X'00810082008300840085008600870088'.             
002500     03  PIC X(16) VALUE X'008901AD01C80111008D01E8016D0090'.             
002600     03  PIC X(16) VALUE X'00910092009300940095009600970098'.             
002700     03  PIC X(16) VALUE X'009901C201C40181009D02FB009F012D'.             
002800     03  PIC X(16) VALUE X'00A100A200A300A400A500A600A700A8'.             
002900     03  PIC X(16) VALUE X'00A901E901C7011000BA01E7015F02FD'.             
003000     03  PIC X(16) VALUE X'0137014F018201C000B501A101A901D0'.             
003100     03  PIC X(16) VALUE X'01A801C101C3017900BB00BE00BF00C0'.             
003200     03  PIC X(16) VALUE X'00C100C200C300C400C500C600C700C8'.             
003300     03  PIC X(16) VALUE X'00C900CA00CB00CC01E400CE01D800D0'.             
003400     03  PIC X(16) VALUE X'00D100D200D300D400D500D600D700D8'.             
003500     03  PIC X(16) VALUE X'00D9013F019800DC018500DE012700E0'.             
003600     03  PIC X(16) VALUE X'00E100E200E300E400E500E600E700E8'.             
003700     03  PIC X(16) VALUE X'00E9010F00EB00EC01E300EE01D700F0'.             
003800     03  PIC X(16) VALUE X'00F100F200F300F400F500F600F700F8'.             
003900     03  PIC X(16) VALUE X'00F9010E019700FC018400FE00FF4040'.             
004000 01  FILLER  REDEFINES TAB-CP870-TO-UCS.                                  
004100     03  CP870-TO-UCS-X   OCCURS 256.                                     
004200       05  CP870-TO-UCS     PIC S9(4) COMP.                               
