000100     EJECT                                                                
000200*    ---- TRADITIONAL CHINESE (BIGFIVE) DOUBLE BYTE CODE ------           
000300*    -- CREATED BY REXX UNITAB2.                                          
000400*    -- CONV FROM CCS-ID 837 (HEX 0345) TO UNICODE UCS-2                  
000500*    -- DATA FROM D:/MBTABS/UCSTAB/034534B0.U1D                           
000600*    -- DBCS -> DBCS TABLE. FIRST SOURCE BYTE IS USED AS                  
000700*    -- INDEX INTO FIRST TABLE WHICH GIVES ROW NUMBER OF                  
000800*    -- SECOND TABLE. SECOND SOURCE BYTE IS USED AS INDEX                 
000900*    -- INTO THAT ROW WHICH CONTAINS THE UCS VALUE (HEX)                  
001000*    -- FOR THE TWO SOURCE BYTES.                                         
001100*    -- INVALID SOURCE VALUES -> FFFD (REPLACEMENT CHAR)                  
001200 01  TAB1-CP837-TO-UCS.                                                   
001300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002100     03  PIC X(16) VALUE X'00020003000400050006000700080001'.             
002200     03  PIC X(16) VALUE X'0009000A000B000C000D000E000F0010'.             
002300     03  PIC X(16) VALUE X'00110012001300140015001600170018'.             
002400     03  PIC X(16) VALUE X'0019001A001B001C001D001E001F0020'.             
002500     03  PIC X(16) VALUE X'00210022002300240025002600270028'.             
002600     03  PIC X(16) VALUE X'0029002A002B002C002D000100010001'.             
002700     03  PIC X(16) VALUE X'000100010001000100010001002E002F'.             
002800     03  PIC X(16) VALUE X'00300031003200330034003500360037'.             
002900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004500 01  FILLER  REDEFINES TAB1-CP837-TO-UCS.                                 
004600     03  TAB2-IND-837U  PIC S9(4) COMP  OCCURS 256.                       
004700                                                                          
004800 01  TAB2-CP837-TO-UCS.                                                   
004900*    -- TAB2-IND = 1 (X'1')                                               
005000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
005900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
006900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
007900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008200*    -- TAB2-IND = 2 (X'2')                                               
008300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
008900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009100     03  PIC X(16) VALUE X'3000FFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
009900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
010900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011500*    -- TAB2-IND = 3 (X'3')                                               
011600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
011900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012400     03  PIC X(16) VALUE X'FFFD03B103B203B303B403B503B603B7'.             
012500     03  PIC X(16) VALUE X'03B803B903BA03BB03BC03BD03BE03BF'.             
012600     03  PIC X(16) VALUE X'03C003C103C303C403C503C603C703C8'.             
012700     03  PIC X(16) VALUE X'03C9FFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
012800     03  PIC X(16) VALUE X'FFFD0391039203930394039503960397'.             
012900     03  PIC X(16) VALUE X'03980399039A039B039C039D039E039F'.             
013000     03  PIC X(16) VALUE X'03A003A103A303A403A503A603A703A8'.             
013100     03  PIC X(16) VALUE X'03A9FFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
013200     03  PIC X(16) VALUE X'04300431043204330434043504510436'.             
013300     03  PIC X(16) VALUE X'043704380439043A043B043C043D043E'.             
013400     03  PIC X(16) VALUE X'043F0440044104420443044404450446'.             
013500     03  PIC X(16) VALUE X'044704480449044A044B044C044D044E'.             
013600     03  PIC X(16) VALUE X'044FFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
013700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
013800     03  PIC X(16) VALUE X'FFFD2170217121722173217421752176'.             
013900     03  PIC X(16) VALUE X'217721782179FFFDFFFDFFFDFFFDFFFD'.             
014000     03  PIC X(16) VALUE X'04100411041204130414041504010416'.             
014100     03  PIC X(16) VALUE X'041704180419041A041B041C041D041E'.             
014200     03  PIC X(16) VALUE X'041F0420042104220423042404250426'.             
014300     03  PIC X(16) VALUE X'042704280429042A042B042C042D042E'.             
014400     03  PIC X(16) VALUE X'042FFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
014500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
014600     03  PIC X(16) VALUE X'FFFD2160216121622163216421652166'.             
014700     03  PIC X(16) VALUE X'216721682169216A216BFFFDFFFDFFFD'.             
014800*    -- TAB2-IND = 4 (X'4')                                               
014900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
015800     03  PIC X(16) VALUE X'FFFDFFFDFFE1FF0EFF1CFF08FF0BFF5C'.             
015900     03  PIC X(16) VALUE X'FF06FFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
016000     03  PIC X(16) VALUE X'FFFDFFFDFF01FFE5FF0AFF09FF1BFFE2'.             
016100     03  PIC X(16) VALUE X'FF0DFF0FFFFDFFFDFFFDFFFDFFFDFFFD'.             
016200     03  PIC X(16) VALUE X'FFFDFFFDFFE4FF0CFF05FF3FFF1EFF1F'.             
016300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
016400     03  PIC X(16) VALUE X'FFFDFF40FF1AFF03FF20FF07FF1DFF02'.             
016500     03  PIC X(16) VALUE X'FFFDFF41FF42FF43FF44FF45FF46FF47'.             
016600     03  PIC X(16) VALUE X'FF48FF49FFFDFFFDFFFDFFFDFFFDFFFD'.             
016700     03  PIC X(16) VALUE X'FFFDFF4AFF4BFF4CFF4DFF4EFF4FFF50'.             
016800     03  PIC X(16) VALUE X'FF51FF52FFFDFFFDFFFDFFFDFFFDFFFD'.             
016900     03  PIC X(16) VALUE X'FFFDFFE3FF53FF54FF55FF56FF57FF58'.             
017000     03  PIC X(16) VALUE X'FF59FF5AFFFDFFFDFFFDFFFDFFFDFFFD'.             
017100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
017200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
017300     03  PIC X(16) VALUE X'FF5BFF21FF22FF23FF24FF25FF26FF27'.             
017400     03  PIC X(16) VALUE X'FF28FF29FFFDFFFDFFFDFFFDFFFDFFFD'.             
017500     03  PIC X(16) VALUE X'FF5DFF2AFF2BFF2CFF2DFF2EFF2FFF30'.             
017600     03  PIC X(16) VALUE X'FF31FF32FFFDFFFDFFFDFFFDFFFDFFFD'.             
017700     03  PIC X(16) VALUE X'FF04FFFDFF33FF34FF35FF36FF37FF38'.             
017800     03  PIC X(16) VALUE X'FF39FF3AFFFDFFFDFFFDFFFDFFFDFFFD'.             
017900     03  PIC X(16) VALUE X'FF10FF11FF12FF13FF14FF15FF16FF17'.             
018000     03  PIC X(16) VALUE X'FF18FF19FFFDFFFDFFFDFFFDFFFDFFFD'.             
018100*    -- TAB2-IND = 5 (X'5')                                               
018200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
018900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
019000     03  PIC X(16) VALUE X'FFFD3002300C300D300130FB30F230A1'.             
019100     03  PIC X(16) VALUE X'30A330A5FFE0FFFDFFFDFFFDFFFDFFFD'.             
019200     03  PIC X(16) VALUE X'FFFD30A730A930E330E530E730C330EE'.             
019300     03  PIC X(16) VALUE X'30FC30F530F6F83DFFFDFFFDFFFDFFFD'.             
019400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
019500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
019600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
019700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
019800     03  PIC X(16) VALUE X'FFFD30A230A430A630A830AA30AB30AD'.             
019900     03  PIC X(16) VALUE X'30AF30B130B3FFFD30B530B730B930BB'.             
020000     03  PIC X(16) VALUE X'30BD30BF30C130C430C630C830CA30CB'.             
020100     03  PIC X(16) VALUE X'30CC30CD30CEFFFDFFFD30CF30D230D5'.             
020200     03  PIC X(16) VALUE X'FFFDFF5E30D830DB30DE30DF30E030E1'.             
020300     03  PIC X(16) VALUE X'30E230E430E6FFFD30E830E930EA30EB'.             
020400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
020500     03  PIC X(16) VALUE X'FFFDFFFD30EC30ED30EF30F3309B309C'.             
020600     03  PIC X(16) VALUE X'30AC30AE30B030B230B430B630B830BA'.             
020700     03  PIC X(16) VALUE X'30BC30BE30C030C230C530C730C930D0'.             
020800     03  PIC X(16) VALUE X'30D330D630D930DC30F430D130D430D7'.             
020900     03  PIC X(16) VALUE X'30DA30DD30F030F130FD30FEFFFDFFFD'.             
021000     03  PIC X(16) VALUE X'FF3CFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021400*    -- TAB2-IND = 6 (X'6')                                               
021500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
021900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
022000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
022100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
022200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
022300     03  PIC X(16) VALUE X'FFFDFFFD300E300FFF3BFF3D30923041'.             
022400     03  PIC X(16) VALUE X'30433045201500B12260221E2103FFFD'.             
022500     03  PIC X(16) VALUE X'00B4304730493083308530873063308E'.             
022600     03  PIC X(16) VALUE X'FFFDFFFD20103003F83E300530063007'.             
022700     03  PIC X(16) VALUE X'00A82018201C30143008300A30102264'.             
022800     03  PIC X(16) VALUE X'2234264200A7203B3012323121162121'.             
022900     03  PIC X(16) VALUE X'FF3E2019201D30153009300B30112265'.             
023000     03  PIC X(16) VALUE X'2235264000D700F72016301320252026'.             
023100     03  PIC X(16) VALUE X'FFFD3042304430463048304A304B304D'.             
023200     03  PIC X(16) VALUE X'304F30513053FFFD305530573059305B'.             
023300     03  PIC X(16) VALUE X'305D305F3061306430663068306A306B'.             
023400     03  PIC X(16) VALUE X'306C306D306EFFFDFFFD306F30723075'.             
023500     03  PIC X(16) VALUE X'FFFDFFFD3078307B307E307F30803081'.             
023600     03  PIC X(16) VALUE X'308230843086FFFD30883089308A308B'.             
023700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
023800     03  PIC X(16) VALUE X'FFFDFFFD308C308D308F3093FFFDFFFD'.             
023900     03  PIC X(16) VALUE X'304C304E30503052305430563058305A'.             
024000     03  PIC X(16) VALUE X'305C305E306030623065306730693070'.             
024100     03  PIC X(16) VALUE X'307330763079307CFFFD307130743077'.             
024200     03  PIC X(16) VALUE X'307A307D30903091309D309EFFFDFFFD'.             
024300     03  PIC X(16) VALUE X'25CB25CF25B325B225CE2606260525C7'.             
024400     03  PIC X(16) VALUE X'25C625A125A025BD25BC00B020322033'.             
024500     03  PIC X(16) VALUE X'2192219021912193FFFDFFFDFFFDFFFD'.             
024600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
024700*    -- TAB2-IND = 7 (X'7')                                               
024800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
024900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFD02C902C7FFFD'.             
025700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
025900     03  PIC X(16) VALUE X'FFFDFFFDFFFD30163017FFFDFFFDFFFD'.             
026000     03  PIC X(16) VALUE X'FFFDFFFD2236222722282211220F222A'.             
026100     03  PIC X(16) VALUE X'222922082237221A22A5222522202312'.             
026200     03  PIC X(16) VALUE X'2299222B222E2261224C2248223D221D'.             
026300     03  PIC X(16) VALUE X'FFFD226E226FFFFDFFFDFFFDFFFDFFFD'.             
026400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
026500     03  PIC X(16) VALUE X'00A4FFFDFFFD2030FFFDFFFDFFFDFFFD'.             
026600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
026700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
026800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
026900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
027000     03  PIC X(16) VALUE X'FFFD24882489248A248B248C248D248E'.             
027100     03  PIC X(16) VALUE X'248F2490249124922493249424952496'.             
027200     03  PIC X(16) VALUE X'249724982499249A249B247424752476'.             
027300     03  PIC X(16) VALUE X'247724782479247A247B247C247D247E'.             
027400     03  PIC X(16) VALUE X'247F2480248124822483248424852486'.             
027500     03  PIC X(16) VALUE X'2487FFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
027600     03  PIC X(16) VALUE X'FFFD2460246124622463246424652466'.             
027700     03  PIC X(16) VALUE X'246724682469FFFDFFFDFFFDFFFDFFFD'.             
027800     03  PIC X(16) VALUE X'FFFD3220322132223223322432253226'.             
027900     03  PIC X(16) VALUE X'322732283229FFFDFFFDFFFDFFFDFFFD'.             
028000*    -- TAB2-IND = 8 (X'8')                                               
028100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
028900     03  PIC X(16) VALUE X'FFFD010100E101CE00E0011300E9011B'.             
029000     03  PIC X(16) VALUE X'00E8012B00ED01D000EC014D00F301D2'.             
029100     03  PIC X(16) VALUE X'00F2016B00FA01D400F901D601D801DA'.             
029200     03  PIC X(16) VALUE X'01DC00FC00EAFFFDFFFDFFFDFFFDFFFD'.             
029300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFD310531063107'.             
029400     03  PIC X(16) VALUE X'31083109310A310B310C310D310E310F'.             
029500     03  PIC X(16) VALUE X'31103111311231133114311531163117'.             
029600     03  PIC X(16) VALUE X'31183119311A311B311C311D311E311F'.             
029700     03  PIC X(16) VALUE X'31203121312231233124312531263127'.             
029800     03  PIC X(16) VALUE X'31283129FFFDFFFDFFFDFFFDFFFDFFFD'.             
029900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
030000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
030100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFD2500250125022503'.             
030200     03  PIC X(16) VALUE X'250425052506250725082509250A250B'.             
030300     03  PIC X(16) VALUE X'250C250D250E250F2510251125122513'.             
030400     03  PIC X(16) VALUE X'251425152516251725182519251A251B'.             
030500     03  PIC X(16) VALUE X'251C251D251E251F2520252125222523'.             
030600     03  PIC X(16) VALUE X'252425252526252725282529252A252B'.             
030700     03  PIC X(16) VALUE X'252C252D252E252F2530253125322533'.             
030800     03  PIC X(16) VALUE X'253425352536253725382539253A253B'.             
030900     03  PIC X(16) VALUE X'253C253D253E253F2540254125422543'.             
031000     03  PIC X(16) VALUE X'254425452546254725482549254A254B'.             
031100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031300*    -- TAB2-IND = 9 (X'9')                                               
031400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
031900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
032900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
033000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
033100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
033200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
033300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
033400     03  PIC X(16) VALUE X'554A963F57C3632854CE550954C07691'.             
033500     03  PIC X(16) VALUE X'764C853C77EE827E788D72319698978D'.             
033600     03  PIC X(16) VALUE X'6C285B894FFA630966975CB880FA6848'.             
033700     03  PIC X(16) VALUE X'80AE660276CE51F9655671AC7FF18884'.             
033800     03  PIC X(16) VALUE X'50B2596561CA6FB382AD634C625253ED'.             
033900     03  PIC X(16) VALUE X'54277B06516B75A45DF462D48DCB9776'.             
034000     03  PIC X(16) VALUE X'628A8019575D97387F627238767D67CF'.             
034100     03  PIC X(16) VALUE X'767E64464F708D2562DC7A17659173ED'.             
034200     03  PIC X(16) VALUE X'642C6273822C9881677F7248626E62CC'.             
034300     03  PIC X(16) VALUE X'4F3474E3534A529E7ECA90A65E2E6886'.             
034400     03  PIC X(16) VALUE X'699C81807ED168D278C5868C9551508D'.             
034500     03  PIC X(16) VALUE X'8C2482DE80DE530589125265FFFDFFFD'.             
034600*    -- TAB2-IND = 10 (X'A')                                              
034700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
034800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
034900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
035500     03  PIC X(16) VALUE X'FFFD858496F94FDD582199715B9D62B1'.             
035600     03  PIC X(16) VALUE X'62A566B48C799C8D7206676F789160B2'.             
035700     03  PIC X(16) VALUE X'535153178F8880CC8D1D94A1500D72C8'.             
035800     03  PIC X(16) VALUE X'590760EB711988AB595482EF672C7B28'.             
035900     03  PIC X(16) VALUE X'5D297EF7752D6CF58E668FF8903C9F3B'.             
036000     03  PIC X(16) VALUE X'6BD491197B145F7C78A784D6853D6BD5'.             
036100     03  PIC X(16) VALUE X'6BD96BD65E015E8775F995ED655D5F0A'.             
036200     03  PIC X(16) VALUE X'5FC58F9F58C181C2907F965B97AD8FB9'.             
036300     03  PIC X(16) VALUE X'FFFD7F168D2C62414FBF53D8535E8FA8'.             
036400     03  PIC X(16) VALUE X'8FA98FAB904D68075F6A819888689CD6'.             
036500     03  PIC X(16) VALUE X'618B522B762A5F6C658C6FD26EE85BBE'.             
036600     03  PIC X(16) VALUE X'6448517551B067C44E1979C9997C70B3'.             
036700     03  PIC X(16) VALUE X'75C55E7673BB83E064AD62E894B56CE2'.             
036800     03  PIC X(16) VALUE X'535A52C3640F94C27B944F2F5E1B8236'.             
036900     03  PIC X(16) VALUE X'8116818A6E246CCA9A736355535C54FA'.             
037000     03  PIC X(16) VALUE X'886557E04E0D5E036B657C3F90E86016'.             
037100     03  PIC X(16) VALUE X'64E6731C88C16750624D8D22776C8E29'.             
037200     03  PIC X(16) VALUE X'91C75F6983DC8521991053C286956B8B'.             
037300     03  PIC X(16) VALUE X'60ED60E8707F82CD82314ED36CA785CF'.             
037400     03  PIC X(16) VALUE X'64CD7CD969FD66F9834953957B564FA7'.             
037500     03  PIC X(16) VALUE X'518C6D4B5C428E6D63D253C9832C8336'.             
037600     03  PIC X(16) VALUE X'67E578B4643D5BDF5C945DEE8BE762C6'.             
037700     03  PIC X(16) VALUE X'67F48C7A640063BA8749998B8C177F20'.             
037800     03  PIC X(16) VALUE X'94F24EA7961098A4660C7316FFFDFFFD'.             
037900*    -- TAB2-IND = 11 (X'B')                                              
038000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
038800     03  PIC X(16) VALUE X'FFFD573A5C1D5E38957F507F80A05382'.             
038900     03  PIC X(16) VALUE X'655E7545553150218D856284949E671D'.             
039000     03  PIC X(16) VALUE X'56326F6E5DE2543570928F66626F64A4'.             
039100     03  PIC X(16) VALUE X'63A35F7B6F8890F481E38FB05C186668'.             
039200     03  PIC X(16) VALUE X'5FF16C8996488D81886C649179F057CE'.             
039300     03  PIC X(16) VALUE X'6A59621054484E587A0B60E96F848BDA'.             
039400     03  PIC X(16) VALUE X'627F901E9A8B79E4540375F463015319'.             
039500     03  PIC X(16) VALUE X'6C608FDF5F1B9A70803B9F7F4F885C3A'.             
039600     03  PIC X(16) VALUE X'FFFD8D647FC565A570BD514551B2866B'.             
039700     03  PIC X(16) VALUE X'5D075BA062BD916C75748E0C7A206101'.             
039800     03  PIC X(16) VALUE X'7B794EC77EF877854E1181ED521D51FA'.             
039900     03  PIC X(16) VALUE X'6A7153A88E87950496CF6EC19664695A'.             
040000     03  PIC X(16) VALUE X'784050A877D7641089E6590463E35DDD'.             
040100     03  PIC X(16) VALUE X'7A7F693D4F20823955984E3275AE7A97'.             
040200     03  PIC X(16) VALUE X'5E625E8A95EF521B5439708A63769524'.             
040300     03  PIC X(16) VALUE X'57826625693F918755076DF37EAF8822'.             
040400     03  PIC X(16) VALUE X'62337EF075B5832878C196CC8F9E6148'.             
040500     03  PIC X(16) VALUE X'74F78BCD6B64523A8D506B21806A8471'.             
040600     03  PIC X(16) VALUE X'56F153064ECE4E1B51D17C97918B7C07'.             
040700     03  PIC X(16) VALUE X'4FC38E7F7BE17A9C64675D1450AC8106'.             
040800     03  PIC X(16) VALUE X'76017CB96DEC7FE067515B585BF878CB'.             
040900     03  PIC X(16) VALUE X'64AE641363AA632B9519642D8FBE7B54'.             
041000     03  PIC X(16) VALUE X'76296253592754466B7950A362345E26'.             
041100     03  PIC X(16) VALUE X'6B864EE38D37888B5F85902EFFFDFFFD'.             
041200*    -- TAB2-IND = 12 (X'C')                                              
041300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
041900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
042000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
042100     03  PIC X(16) VALUE X'FFFD6020803D62C54E39535590F863B8'.             
042200     03  PIC X(16) VALUE X'80C665E66C2E4F4660EE6DE18BDE5F39'.             
042300     03  PIC X(16) VALUE X'86CB5F536321515A8361686352006363'.             
042400     03  PIC X(16) VALUE X'8E4850125C9B79775BFC52307A3B60BC'.             
042500     03  PIC X(16) VALUE X'905376D75FB75F9776848E6C706F767B'.             
042600     03  PIC X(16) VALUE X'7B4977AA51F3909358244F4E6EF48FEA'.             
042700     03  PIC X(16) VALUE X'654C7B1B72C46DA47FDF5AE162B55E95'.             
042800     03  PIC X(16) VALUE X'573084827B2C5E1D5F1F90127F1498A0'.             
042900     03  PIC X(16) VALUE X'FFFD63826EC7789870B95178975B57AB'.             
043000     03  PIC X(16) VALUE X'75354F4375385E9760E659606DC06BBF'.             
043100     03  PIC X(16) VALUE X'788953FC96D551CB52016389540A9493'.             
043200     03  PIC X(16) VALUE X'8C038DCC7239789F87768FED8C0D53E0'.             
043300     03  PIC X(16) VALUE X'4E0176EF53EE948998769F0E952D5B9A'.             
043400     03  PIC X(16) VALUE X'8BA24E224E1C51AC846361C252A8680B'.             
043500     03  PIC X(16) VALUE X'4F97606B51BB6D1E515C629665979661'.             
043600     03  PIC X(16) VALUE X'8C46901775D890FD77636BD2728A72EC'.             
043700     03  PIC X(16) VALUE X'8BFB583577798D4C675C9540809A5EA6'.             
043800     03  PIC X(16) VALUE X'6E2159927AEF77ED953B6BB565AD7F0E'.             
043900     03  PIC X(16) VALUE X'58065151961F5BF958A954288E726566'.             
044000     03  PIC X(16) VALUE X'987F56E4949D76FE9041638754C6591A'.             
044100     03  PIC X(16) VALUE X'593A579B8EB267358DFA8235524160F0'.             
044200     03  PIC X(16) VALUE X'581586FE5CE89E454FC4989D8BB95A25'.             
044300     03  PIC X(16) VALUE X'60765384627C904F9102997F6069800C'.             
044400     03  PIC X(16) VALUE X'513F80335C1499756D314E8CFFFDFFFD'.             
044500*    -- TAB2-IND = 13 (X'D')                                              
044600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
044700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
044800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
044900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
045000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
045100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
045200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
045300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
045400     03  PIC X(16) VALUE X'FFFD8D3053D17F5A7B4F4F104E4F9600'.             
045500     03  PIC X(16) VALUE X'6CD573D085E95E06756A7FFB6A0A77FE'.             
045600     03  PIC X(16) VALUE X'94927E4151E170E653CD8FD483038D29'.             
045700     03  PIC X(16) VALUE X'72AF996D6CDB574A82B365B980AA623F'.             
045800     03  PIC X(16) VALUE X'963259A84EFF8BBF7EBA653E83F2975E'.             
045900     03  PIC X(16) VALUE X'556198DE80A5532A8BFD542080BA5E9F'.             
046000     03  PIC X(16) VALUE X'6CB88D3982AC915A54296C1B52067EB7'.             
046100     03  PIC X(16) VALUE X'575F711A6C7E7C89594B4EFD5FFF6124'.             
046200     03  PIC X(16) VALUE X'FFFD7CAA4E305C0167AB87025CF0950B'.             
046300     03  PIC X(16) VALUE X'98CE75AF70FD902251AF7F1D8BBD5949'.             
046400     03  PIC X(16) VALUE X'51E44F5B5426592B657780A45B756276'.             
046500     03  PIC X(16) VALUE X'62C28F905E456C1F7B264F0F4FD8670D'.             
046600     03  PIC X(16) VALUE X'6D6E6DAA798F88B15F17752B629A8F85'.             
046700     03  PIC X(16) VALUE X'4FEF91DC65A7812F81515E9C81508D74'.             
046800     03  PIC X(16) VALUE X'526F89868D4B590D50854ED8961C7236'.             
046900     03  PIC X(16) VALUE X'81798D1F5BCC8BA3964459877F1A5490'.             
047000     03  PIC X(16) VALUE X'5676560E8BE565396982949976D66E89'.             
047100     03  PIC X(16) VALUE X'5E727518674667D17AFF809D8D76611F'.             
047200     03  PIC X(16) VALUE X'79C665628D635188521A94A27F38809B'.             
047300     03  PIC X(16) VALUE X'7EB25C976E2F67607BD9768B9AD8818F'.             
047400     03  PIC X(16) VALUE X'7F947CD5641E95507A3F544A54E56B4C'.             
047500     03  PIC X(16) VALUE X'640162089E3D80F3759952729769845B'.             
047600     03  PIC X(16) VALUE X'683C86E49601969494EC4E2A54047ED9'.             
047700     03  PIC X(16) VALUE X'68398DDF801566F45E9A7FB9FFFDFFFD'.             
047800*    -- TAB2-IND = 14 (X'E')                                              
047900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
048700     03  PIC X(16) VALUE X'FFFD57C2803F68975DE5653B529F606D'.             
048800     03  PIC X(16) VALUE X'9F9A4F9B8EAC516C5BAB5F135DE96C5E'.             
048900     03  PIC X(16) VALUE X'62F18D21517194A952FE6C9F82DF72D7'.             
049000     03  PIC X(16) VALUE X'57A267848D2D591F8F9C83C754957B8D'.             
049100     03  PIC X(16) VALUE X'4F306CBD5B6459D19F1353E486CA9AA8'.             
049200     03  PIC X(16) VALUE X'8C3780A16545987E56FA96C7522E74DC'.             
049300     03  PIC X(16) VALUE X'52505BE1630289024E5662D0602A68FA'.             
049400     03  PIC X(16) VALUE X'51735B9851A089C27BA199867F5060EF'.             
049500     03  PIC X(16) VALUE X'FFFD704C8D2F51495E7F901B747089C4'.             
049600     03  PIC X(16) VALUE X'572D78455F529F9F95FA8F689B3C8BE1'.             
049700     03  PIC X(16) VALUE X'7678684267DC8DEA8D35523D8F8A6EDA'.             
049800     03  PIC X(16) VALUE X'68CD950590ED56FD679C88F98FC754C8'.             
049900     03  PIC X(16) VALUE X'9AB85B696D776C264EA55BB39A879163'.             
050000     03  PIC X(16) VALUE X'61A890AF97E9542B6DB55BD251FD558A'.             
050100     03  PIC X(16) VALUE X'7F557FF064BC634D65F161BE608D710A'.             
050200     03  PIC X(16) VALUE X'6C576C49592F676D822A58D5568E8C6A'.             
050300     03  PIC X(16) VALUE X'6BEB90DD597D801753F76D695475559D'.             
050400     03  PIC X(16) VALUE X'837783CF683879BE548C4F55540876D2'.             
050500     03  PIC X(16) VALUE X'8C8996026CB36DB88D6B89109E648D3A'.             
050600     03  PIC X(16) VALUE X'563F9ED175D55F8872E0606854FC4EA8'.             
050700     03  PIC X(16) VALUE X'6A2A886160528F7054C470D886799E3F'.             
050800     03  PIC X(16) VALUE X'6D2A5B8F5F187EA255894FAF7334543C'.             
050900     03  PIC X(16) VALUE X'539A5019540E547C4E4E5FFD745A58F6'.             
051000     03  PIC X(16) VALUE X'846B80E1877472D07CCA6E56FFFDFFFD'.             
051100*    -- TAB2-IND = 15 (X'F')                                              
051200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
051900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
052000     03  PIC X(16) VALUE X'FFFD5F27864E552C62A44E926CAA6237'.             
052100     03  PIC X(16) VALUE X'82B154D7534E733E6ED1753B52125316'.             
052200     03  PIC X(16) VALUE X'8BDD69D05F8A60006DEE574F6B2273AF'.             
052300     03  PIC X(16) VALUE X'68538FD87F13636260A3552475EA8C62'.             
052400     03  PIC X(16) VALUE X'71156DA35BA65E7B8352614C9EC478FA'.             
052500     03  PIC X(16) VALUE X'87577C27768751F060F6714C66435E4C'.             
052600     03  PIC X(16) VALUE X'604D8C0E707063258F895FBD606286D4'.             
052700     03  PIC X(16) VALUE X'56DE6BC160946167534960E066668D3F'.             
052800     03  PIC X(16) VALUE X'FFFD79FD4F1A70E96C478BB38BF27ED8'.             
052900     03  PIC X(16) VALUE X'8364660F5A5A9B426D516DF78C416D3B'.             
053000     03  PIC X(16) VALUE X'4F19706B83B7621660D1970D8D277978'.             
053100     03  PIC X(16) VALUE X'51FB573E57FA673A75787A3D79EF7B95'.             
053200     03  PIC X(16) VALUE X'808C99658FF96FC08BA59E2159EC7EE9'.             
053300     03  PIC X(16) VALUE X'7F095409678168D88F917C4D96C653CA'.             
053400     03  PIC X(16) VALUE X'602575BE6C7253735AC97EA7632451E0'.             
053500     03  PIC X(16) VALUE X'810A5DF184DF628051805B634F0E796D'.             
053600     03  PIC X(16) VALUE X'524260B86D4E5BC45BC28BA18BB065E2'.             
053700     03  PIC X(16) VALUE X'5FCC964559937EE77EAA560967B75939'.             
053800     03  PIC X(16) VALUE X'4F735BB652A0835A988A8D3E753294BE'.             
053900     03  PIC X(16) VALUE X'50477A3C4EF767B69A7E5AC16B7C76D1'.             
054000     03  PIC X(16) VALUE X'575A5C167B3A95F4714E517C80A98270'.             
054100     03  PIC X(16) VALUE X'59787F04832768C067EC78B1787762E3'.             
054200     03  PIC X(16) VALUE X'63617B804FED526A51CF835069DB9274'.             
054300     03  PIC X(16) VALUE X'8DF58D3189C1952E7BAD4EF6FFFDFFFD'.             
054400*    -- TAB2-IND = 16 (X'10')                                             
054500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
054600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
054700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
054800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
054900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
055000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
055100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
055200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
055300     03  PIC X(16) VALUE X'FFFD506582305251996F6E106E856DA7'.             
055400     03  PIC X(16) VALUE X'5EFA50F559DC5C066D466C5F7586848B'.             
055500     03  PIC X(16) VALUE X'686859568BB253209171964D85496912'.             
055600     03  PIC X(16) VALUE X'7901712680F64EA490CA6D479A845A07'.             
055700     03  PIC X(16) VALUE X'56BC640594F077EB4FA5811A72E189D2'.             
055800     03  PIC X(16) VALUE X'997A7F347EDE527F655991758F7F8F83'.             
055900     03  PIC X(16) VALUE X'53EB7A9663ED63A5768679F888579636'.             
056000     03  PIC X(16) VALUE X'622A52AB8282685467706377776B7AED'.             
056100     03  PIC X(16) VALUE X'FFFD6D017ED389E359D0621285C982A5'.             
056200     03  PIC X(16) VALUE X'754C501F4ECB75A58BEB5C4A5DFE7B4B'.             
056300     03  PIC X(16) VALUE X'65A491D14ECA6D25895F7D2795264EC5'.             
056400     03  PIC X(16) VALUE X'8C288FDB9773664B79818FD170EC6D78'.             
056500     03  PIC X(16) VALUE X'5C3D52B283465162830E775B66769CB8'.             
056600     03  PIC X(16) VALUE X'4EAC60CA7CBE7CB37ECF4E958B66666F'.             
056700     03  PIC X(16) VALUE X'988897595883656C955C5F8475C99756'.             
056800     03  PIC X(16) VALUE X'7ADF7ADE51C070AF7A9863EA7A767EA0'.             
056900     03  PIC X(16) VALUE X'739697ED4E4570784E5D915253A96551'.             
057000     03  PIC X(16) VALUE X'65E781FC8205548E5C31759A97A062D8'.             
057100     03  PIC X(16) VALUE X'72D975BD5C459A7983CA5C40548077E9'.             
057200     03  PIC X(16) VALUE X'4E3E6CAE805A62D2636E5DE851778DDD'.             
057300     03  PIC X(16) VALUE X'8E1E952F4FF153E560E770AC52676350'.             
057400     03  PIC X(16) VALUE X'9E435A1F5026773753777EE26485652B'.             
057500     03  PIC X(16) VALUE X'628963985014723589C951B38BC07EDD'.             
057600     03  PIC X(16) VALUE X'574783CC94A7519B541B5CFBFFFDFFFD'.             
057700*    -- TAB2-IND = 17 (X'11')                                             
057800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
057900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
058600     03  PIC X(16) VALUE X'FFFD4FCA7AE36D5A90E19A8F55805496'.             
058700     03  PIC X(16) VALUE X'536154AF5F0063E9697751EF6168520A'.             
058800     03  PIC X(16) VALUE X'582A52D8574E780D770B5EB761777CE0'.             
058900     03  PIC X(16) VALUE X'625B62974EA27095800362F770E49760'.             
059000     03  PIC X(16) VALUE X'577782DB67EF68F578D5989779D158F3'.             
059100     03  PIC X(16) VALUE X'54B353EF6E34514B523B5BA28BFE80AF'.             
059200     03  PIC X(16) VALUE X'554357A660735751542D7A7A60505B54'.             
059300     03  PIC X(16) VALUE X'63A762A053E362635BC767AF54ED7A9F'.             
059400     03  PIC X(16) VALUE X'FFFD82E691775E9388E4593857AE630E'.             
059500     03  PIC X(16) VALUE X'8DE880EF57577B774FA95FEB5BBD6B3E'.             
059600     03  PIC X(16) VALUE X'53217B5072C2684677FF773665F751B5'.             
059700     03  PIC X(16) VALUE X'4E8F76D45CBF7AA58475594E9B415080'.             
059800     03  PIC X(16) VALUE X'998861276E8357646606634656F062EC'.             
059900     03  PIC X(16) VALUE X'62695ED39614578362C955878721814A'.             
060000     03  PIC X(16) VALUE X'8FA3556683B167658D5684DD5A6A680F'.             
060100     03  PIC X(16) VALUE X'62E67BEE961151706F9C8C3063FD89C8'.             
060200     03  PIC X(16) VALUE X'61D27F0670C26EE57405699472FC5ECA'.             
060300     03  PIC X(16) VALUE X'90CE67176D6A635E52B3726280014F6C'.             
060400     03  PIC X(16) VALUE X'59E5916A70D96D9D52D24E5096F7956D'.             
060500     03  PIC X(16) VALUE X'857E78CA7D2F5121579264C2808B7C7B'.             
060600     03  PIC X(16) VALUE X'6CEA68F1695E51B7539868A872819ECE'.             
060700     03  PIC X(16) VALUE X'7BF172F879BB6F137406674E91CC9CA4'.             
060800     03  PIC X(16) VALUE X'793C83898354540F68174E3D538952B1'.             
060900     03  PIC X(16) VALUE X'783E5386522950884F8B4FD0FFFDFFFD'.             
061000*    -- TAB2-IND = 18 (X'12')                                             
061100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
061900     03  PIC X(16) VALUE X'FFFD75E27ACB7C926CA596B6529B7483'.             
062000     03  PIC X(16) VALUE X'54E94FE9805483B28FDE95705EC9601C'.             
062100     03  PIC X(16) VALUE X'6D9F5E18655B813894FE604B70BC7EC3'.             
062200     03  PIC X(16) VALUE X'7CAE51C968817CB1826F4E248F8691CF'.             
062300     03  PIC X(16) VALUE X'667E4EAE8C0564A9804A50DA759771CE'.             
062400     03  PIC X(16) VALUE X'5BE58FBD6F664E86648295635ED66599'.             
062500     03  PIC X(16) VALUE X'521788C270C852A3730E7433679778F7'.             
062600     03  PIC X(16) VALUE X'97164E3490BB9CDE6DCB51DB8D41541D'.             
062700     03  PIC X(16) VALUE X'FFFD62CE73B283F196F69F8494C34F36'.             
062800     03  PIC X(16) VALUE X'7F9A51CC707596755CAD988653E64EE4'.             
062900     03  PIC X(16) VALUE X'6E9C740969B4786B998F755952187624'.             
063000     03  PIC X(16) VALUE X'6D4167F3516D9F99804B54997B3C7ABF'.             
063100     03  PIC X(16) VALUE X'9686578462E29647697C5A0464027BD3'.             
063200     03  PIC X(16) VALUE X'6F0F964B82A6536298855E90708963B3'.             
063300     03  PIC X(16) VALUE X'5364864F9C819E93788C97328DEF8D42'.             
063400     03  PIC X(16) VALUE X'9E7F6F5E79845F559646622E9A745415'.             
063500     03  PIC X(16) VALUE X'94DD4FA365C55C655C617F1586516C2F'.             
063600     03  PIC X(16) VALUE X'5F8B73876EE47EFF5CE6631B5B6A6EE6'.             
063700     03  PIC X(16) VALUE X'53754E7163A0756562A18F6E4F264ED1'.             
063800     03  PIC X(16) VALUE X'6CA67EB68BBA841D87BA7F57903B9523'.             
063900     03  PIC X(16) VALUE X'7BA99AA188F8843D6D1B9A867EDC5988'.             
064000     03  PIC X(16) VALUE X'9EBB739B780186829A6C9A82561B5417'.             
064100     03  PIC X(16) VALUE X'57CB4E709EA653568FC8810977929992'.             
064200     03  PIC X(16) VALUE X'86EE6EE1851366FC61626F2BFFFDFFFD'.             
064300*    -- TAB2-IND = 19 (X'13')                                             
064400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
064500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
064600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
064700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
064800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
064900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
065000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
065100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
065200     03  PIC X(16) VALUE X'FFFD8C298292832B76F26C135FD983BD'.             
065300     03  PIC X(16) VALUE X'732B8305951A6BDB77DB94C6536F8302'.             
065400     03  PIC X(16) VALUE X'51925E3D8C8C8D384E4873AB679A6885'.             
065500     03  PIC X(16) VALUE X'9176970971646CA177095A9295416BCF'.             
065600     03  PIC X(16) VALUE X'7F8E66275BD059B95A9A95E895F74EEC'.             
065700     03  PIC X(16) VALUE X'840C84996AAC76DF9530731B68A65B5F'.             
065800     03  PIC X(16) VALUE X'772F919A97617CDC8FF78C1C5F257C73'.             
065900     03  PIC X(16) VALUE X'79D889C56CCC871C5BC65E4268C97720'.             
066000     03  PIC X(16) VALUE X'FFFD7EF55195514D52C95A297F059762'.             
066100     03  PIC X(16) VALUE X'82D763CF778485D079D26E3A5E995999'.             
066200     03  PIC X(16) VALUE X'8511706D6C1162BF76BF654F60AF95FD'.             
066300     03  PIC X(16) VALUE X'660E879F9E2394ED540D547D8C2C6478'.             
066400     03  PIC X(16) VALUE X'647986116A21819C78E864699B5462B9'.             
066500     03  PIC X(16) VALUE X'672B83AB58A89ED86CAB6F205BDE964C'.             
066600     03  PIC X(16) VALUE X'8C0B725F67D062C772614EA959C66BCD'.             
066700     03  PIC X(16) VALUE X'589366AE5E5552DF6155672876EE7766'.             
066800     03  PIC X(16) VALUE X'72677A4662FF54EA545094A090A35A1C'.             
066900     03  PIC X(16) VALUE X'7EB36C164E4359768010594853577537'.             
067000     03  PIC X(16) VALUE X'96BE56CA63208111607C95F96DD65462'.             
067100     03  PIC X(16) VALUE X'998151855AE980FD59AE9713502A6CE5'.             
067200     03  PIC X(16) VALUE X'5C3C62DF4F60533F817B90066EBA852B'.             
067300     03  PIC X(16) VALUE X'62C85E7478BE64B5637B5FF55A18917F'.             
067400     03  PIC X(16) VALUE X'9E1F5C3F634F80425B7D556E954A954D'.             
067500     03  PIC X(16) VALUE X'6D8560A867E072DE51DD5B81FFFDFFFD'.             
067600*    -- TAB2-IND = 20 (X'14')                                             
067700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
067800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
067900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
068500     03  PIC X(16) VALUE X'FFFD62E76CDE725B626D94AE7EBD8113'.             
068600     03  PIC X(16) VALUE X'6D53519C5F04597452AA601259736696'.             
068700     03  PIC X(16) VALUE X'8650759F632A61E67CEF8BFA54E66B27'.             
068800     03  PIC X(16) VALUE X'9E256BB485D5545550766CA4556A8DB4'.             
068900     03  PIC X(16) VALUE X'722C5E156015743662CD6392724C5F98'.             
069000     03  PIC X(16) VALUE X'6E436D3E65006F5876D878D076FC7554'.             
069100     03  PIC X(16) VALUE X'522453DB4E535E9E65C1802A80D6629B'.             
069200     03  PIC X(16) VALUE X'5486522870AE888D8DD16CE1547880DA'.             
069300     03  PIC X(16) VALUE X'FFFD57F988F48D54966A914D4F696C9B'.             
069400     03  PIC X(16) VALUE X'55B776C6783062A870F96F8E5F6D84EC'.             
069500     03  PIC X(16) VALUE X'68DA787C7BF781A8670B9E4F636778B0'.             
069600     03  PIC X(16) VALUE X'576F78129739627962AB528874356BD7'.             
069700     03  PIC X(16) VALUE X'5564813E75B276AE533975DE50FB5C41'.             
069800     03  PIC X(16) VALUE X'8B6C7BC7504F72479A9798D86F0274E2'.             
069900     03  PIC X(16) VALUE X'7968648777A562FC98918D2B54C18058'.             
070000     03  PIC X(16) VALUE X'4E52576A82F9840D5E7351ED74F68BC4'.             
070100     03  PIC X(16) VALUE X'5C4F57616CFC98875A4678349B448FEB'.             
070200     03  PIC X(16) VALUE X'7C955256625194FA4EC68386846183E9'.             
070300     03  PIC X(16) VALUE X'84B257D467345703666E6D668C3166DD'.             
070400     03  PIC X(16) VALUE X'7011671F6B3A6816621A59BB4E0351C4'.             
070500     03  PIC X(16) VALUE X'6F0667D26C8F517668CB59476B677566'.             
070600     03  PIC X(16) VALUE X'5D0E81109F5065D7794879419A918D77'.             
070700     03  PIC X(16) VALUE X'5C824E5E4F01542F5951780C56686C14'.             
070800     03  PIC X(16) VALUE X'8FC45F036C7D6CE38BAB6390FFFDFFFD'.             
070900*    -- TAB2-IND = 21 (X'15')                                             
071000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
071800     03  PIC X(16) VALUE X'FFFD60706D3D72756266948E94C55343'.             
071900     03  PIC X(16) VALUE X'8FC17B7E4EDF8C264E7E9ED494B194B3'.             
072000     03  PIC X(16) VALUE X'524D6F5C90636D458C3458115D4C6B20'.             
072100     03  PIC X(16) VALUE X'6B4967AA545B81547F8C589985375F3A'.             
072200     03  PIC X(16) VALUE X'62A26A47953965726084686577A74E54'.             
072300     03  PIC X(16) VALUE X'4FA85DE7979864AC7FD85CED4FCF7A8D'.             
072400     03  PIC X(16) VALUE X'520783044E14602F7A8394A64FB54EB2'.             
072500     03  PIC X(16) VALUE X'79E6743452E482B964D279BD5BDD6C81'.             
072600     03  PIC X(16) VALUE X'FFFD97528F7B6C22503E537F6E0564CE'.             
072700     03  PIC X(16) VALUE X'66746C3060C598778BF75E86743C7A77'.             
072800     03  PIC X(16) VALUE X'79CB4E1890B174036C4256DA914B6CC5'.             
072900     03  PIC X(16) VALUE X'8D8B533A86C666F28EAF5C489A716E20'.             
073000     03  PIC X(16) VALUE X'53D65A369F8B8DA353BB570898A76743'.             
073100     03  PIC X(16) VALUE X'919B6CC9516875CA62F372AC5238529D'.             
073200     03  PIC X(16) VALUE X'7F3A7094763853749E4A69B7786E96C0'.             
073300     03  PIC X(16) VALUE X'88D97FA4713671C3518967D374E458E4'.             
073400     03  PIC X(16) VALUE X'651856B78BA9997662707ED560F970ED'.             
073500     03  PIC X(16) VALUE X'58EC4EC14EBA5FCD97E74EFB8BA45203'.             
073600     03  PIC X(16) VALUE X'598A7EAB62544ECD65E5620E833884C9'.             
073700     03  PIC X(16) VALUE X'8363878D71946EB65BB97ED2519763C9'.             
073800     03  PIC X(16) VALUE X'67D480898339881551125B7A59828FB1'.             
073900     03  PIC X(16) VALUE X'4E736C5D516589258F6F962E854A745E'.             
074000     03  PIC X(16) VALUE X'951095F06DA682E55F3164926D128428'.             
074100     03  PIC X(16) VALUE X'816E9CC3585E8D5B4E0953C1FFFDFFFD'.             
074200*    -- TAB2-IND = 22 (X'16')                                             
074300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
074900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
075000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
075100     03  PIC X(16) VALUE X'FFFD4F1E6563685155D34E2764149A9A'.             
075200     03  PIC X(16) VALUE X'626B5AC2745F82726DA968EE50E7838E'.             
075300     03  PIC X(16) VALUE X'7802674052396C997EB150BB5565715E'.             
075400     03  PIC X(16) VALUE X'7B5B665273CA82EB67495C715220717D'.             
075500     03  PIC X(16) VALUE X'886B95EA965564C58D6181B355846C55'.             
075600     03  PIC X(16) VALUE X'62477F2E58924F2455468D4F664C4E0A'.             
075700     03  PIC X(16) VALUE X'5C1A88F368A2634E7A0D70E7828D52FA'.             
075800     03  PIC X(16) VALUE X'97F65C1154E890B57ECD59628D4A86C7'.             
075900     03  PIC X(16) VALUE X'FFFD820C820D8D6664445C0461516D89'.             
076000     03  PIC X(16) VALUE X'793E8BBE78377533547B4F388EAB6DF1'.             
076100     03  PIC X(16) VALUE X'5A207EC5795E6C885BA15A76751A80BE'.             
076200     03  PIC X(16) VALUE X'614E6E1758F0751F7525727253477EF3'.             
076300     03  PIC X(16) VALUE X'770176DB526980DC57235E08593172EE'.             
076400     03  PIC X(16) VALUE X'65BD6E7F8BD75C388671534177F362FE'.             
076500     03  PIC X(16) VALUE X'65F64EC098DF86805B9E8BC653F277E2'.             
076600     03  PIC X(16) VALUE X'4F7F5C4E9A7659CB5F0F793A58EB4E16'.             
076700     03  PIC X(16) VALUE X'67FF4E8B62ED8A93901D52BF662F55DC'.             
076800     03  PIC X(16) VALUE X'566C90024ED54F8D91CA99706C0F5E02'.             
076900     03  PIC X(16) VALUE X'60435BA489C68BD56536624B99965B88'.             
077000     03  PIC X(16) VALUE X'5BFF6388552E53D77626517D852C67A2'.             
077100     03  PIC X(16) VALUE X'68B36B8A62928F9353D482126DD1758F'.             
077200     03  PIC X(16) VALUE X'4E668D4E5B70719F85AF669166D97F72'.             
077300     03  PIC X(16) VALUE X'87009ECD9F205C5E672F8FF06811675F'.             
077400     03  PIC X(16) VALUE X'620D7AD658855EB665706F31FFFDFFFD'.             
077500*    -- TAB2-IND = 23 (X'17')                                             
077600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
077700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
077800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
077900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
078000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
078100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
078200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
078300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
078400     03  PIC X(16) VALUE X'FFFD60555237800D6454887075295E05'.             
078500     03  PIC X(16) VALUE X'681362F4971C53CC723D8C016C347761'.             
078600     03  PIC X(16) VALUE X'7A0E542E77AC987A821C8BF478556714'.             
078700     03  PIC X(16) VALUE X'70C165AF64955636601D79C153F84E1D'.             
078800     03  PIC X(16) VALUE X'6B7B80865BFA55E356DB4F3A4F3C9972'.             
078900     03  PIC X(16) VALUE X'5DF3677E80386002988290015B8B8BBC'.             
079000     03  PIC X(16) VALUE X'8BF5641C825864DE55FD82CF91654FD7'.             
079100     03  PIC X(16) VALUE X'7D20901F7C9F50F358516EAF5BBF8BC9'.             
079200     03  PIC X(16) VALUE X'FFFD80839178849C7B97867D968B968F'.             
079300     03  PIC X(16) VALUE X'7EE59AD3788E5C817A57904296A7795F'.             
079400     03  PIC X(16) VALUE X'5B59635F7B0B84D168AD55067F297410'.             
079500     03  PIC X(16) VALUE X'7D2295016240584C4ED65B8359795854'.             
079600     03  PIC X(16) VALUE X'736D631E8E4B8E0F80CE82D462AC53F0'.             
079700     03  PIC X(16) VALUE X'6CF0915E592A60016C70574D644A8D2A'.             
079800     03  PIC X(16) VALUE X'762B6EE9575B6A8075F06F6D8C2D8C08'.             
079900     03  PIC X(16) VALUE X'57666BEF889278B363A253F970AD6C64'.             
080000     03  PIC X(16) VALUE X'5858642A580268E0819B55107CD65018'.             
080100     03  PIC X(16) VALUE X'8EBA6DCC8D9F70EB638F6D9B6ED47EE6'.             
080200     03  PIC X(16) VALUE X'8404684390036DD896768BA859577279'.             
080300     03  PIC X(16) VALUE X'85E4817E75BC8A8A68AF52548E229511'.             
080400     03  PIC X(16) VALUE X'63D098988E44557C4F5366FF568F60D5'.             
080500     03  PIC X(16) VALUE X'6D9552435C4959296DFB586B7530751C'.             
080600     03  PIC X(16) VALUE X'606C82148146631167618FE2773A8DF3'.             
080700     03  PIC X(16) VALUE X'8D3494C15E165385542C70C3FFFDFFFD'.             
080800*    -- TAB2-IND = 24 (X'18')                                             
080900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
081700     03  PIC X(16) VALUE X'FFFD6C405EF7505C4EAD5EAD633A8247'.             
081800     03  PIC X(16) VALUE X'901A6850916E77B3540C94DC5F647AE5'.             
081900     03  PIC X(16) VALUE X'687663457B527EDF75DB507762955934'.             
082000     03  PIC X(16) VALUE X'900F51F879C37A8156FE5F9290146D82'.             
082100     03  PIC X(16) VALUE X'5C60571F541051546E4D56E263A89893'.             
082200     03  PIC X(16) VALUE X'817F8715892A9000541E5C6F81C062D6'.             
082300     03  PIC X(16) VALUE X'625881319E3596409A6E9A7C692D59A5'.             
082400     03  PIC X(16) VALUE X'62D3553E631654C786D96D3C5A0374E6'.             
082500     03  PIC X(16) VALUE X'FFFD889C6B6A59168C4C5F2F6E7E73A9'.             
082600     03  PIC X(16) VALUE X'987D4E3870F75B8C7897633D665A7696'.             
082700     03  PIC X(16) VALUE X'60CB5B9B5A494E0781556C6A738B4EA1'.             
082800     03  PIC X(16) VALUE X'67897F515F8065FA671B5FD859845A01'.             
082900     03  PIC X(16) VALUE X'5DCD5FAE537197E68FDD684556F4552F'.             
083000     03  PIC X(16) VALUE X'60DF4E3A6F4D7EF482C7840E59D44F1F'.             
083100     03  PIC X(16) VALUE X'4F2A5C3E7EAC672A851A5473754F80C3'.             
083200     03  PIC X(16) VALUE X'55829B4F4F4D6E2D8C135C096170536B'.             
083300     03  PIC X(16) VALUE X'761F6E29868A658795FB7EB9543B7A33'.             
083400     03  PIC X(16) VALUE X'7D0A95EE55E17FC174EE631D87176DA1'.             
083500     03  PIC X(16) VALUE X'7A9D621165A1536763E16C835DEB545C'.             
083600     03  PIC X(16) VALUE X'94A84E4C6C618BEC5C4B65E0829C68A7'.             
083700     03  PIC X(16) VALUE X'543E54346BCB6B664E9463425348821E'.             
083800     03  PIC X(16) VALUE X'4F0D4FAE575E620A96FE6664726952FF'.             
083900     03  PIC X(16) VALUE X'52A1609F8BEF661471996790897F7852'.             
084000     03  PIC X(16) VALUE X'77FD6670563B54389521727AFFFDFFFD'.             
084100*    -- TAB2-IND = 25 (X'19')                                             
084200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
084900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
085000     03  PIC X(16) VALUE X'FFFD7A00606F5E0C6089819D591560DC'.             
085100     03  PIC X(16) VALUE X'718470EF6EAA6C5072806A8488AD5E2D'.             
085200     03  PIC X(16) VALUE X'4E605AB3559C94E36D177CFB9699620F'.             
085300     03  PIC X(16) VALUE X'7EC6778E867E5323971E8F9666875CE1'.             
085400     03  PIC X(16) VALUE X'4FA072ED4E0B53A6590F541363809528'.             
085500     03  PIC X(16) VALUE X'51484ED99C9C7EA454B88D2488548237'.             
085600     03  PIC X(16) VALUE X'95F26D8E5F265ACC663E966973B0732E'.             
085700     03  PIC X(16) VALUE X'53BF817A99857FA15BAA967796507EBF'.             
085800     03  PIC X(16) VALUE X'FFFD76F853A2957699997BB189446E58'.             
085900     03  PIC X(16) VALUE X'4E617FD479658BE660F354CD4EAB9879'.             
086000     03  PIC X(16) VALUE X'5DF76A6150CF54118C618427785D9704'.             
086100     03  PIC X(16) VALUE X'524A54EE56A395006D885BB56DC66653'.             
086200     03  PIC X(16) VALUE X'5C0F5B5D6821809655787B1165486954'.             
086300     03  PIC X(16) VALUE X'4E9B6B47874E978B534F631F643A90AA'.             
086400     03  PIC X(16) VALUE X'659C80C18C10519968B0537887F961C8'.             
086500     03  PIC X(16) VALUE X'6CC46CFB8C225C5185AA82AF950C6B23'.             
086600     03  PIC X(16) VALUE X'8F9B65B05FFB5FC34FE18845661F8165'.             
086700     03  PIC X(16) VALUE X'732960FA51745211578B5F6290A2884C'.             
086800     03  PIC X(16) VALUE X'91925E78674F602759D3514451F680F8'.             
086900     03  PIC X(16) VALUE X'53086C7996C4718A4F114FEE7F9E673D'.             
087000     03  PIC X(16) VALUE X'55C5950879C088967EE3589F620C9700'.             
087100     03  PIC X(16) VALUE X'865A5618987B5F908BB884C4915753D9'.             
087200     03  PIC X(16) VALUE X'65ED5E8F755C60647D6E5A7F7EEA7EED'.             
087300     03  PIC X(16) VALUE X'8F6955A75BA360AC65CB7384FFFDFFFD'.             
087400*    -- TAB2-IND = 26 (X'1A')                                             
087500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
087600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
087700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
087800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
087900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
088000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
088100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
088200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
088300     03  PIC X(16) VALUE X'FFFD9009766377297EDA9774859B5B66'.             
088400     03  PIC X(16) VALUE X'7A7496EA884052CB718F5FAA65EC8BE2'.             
088500     03  PIC X(16) VALUE X'5BFB9A6F5DE16B896C5B8BAD8BAF900A'.             
088600     03  PIC X(16) VALUE X'8FC5538B62BC9E269E2D54404E2B82BD'.             
088700     03  PIC X(16) VALUE X'7259869C5D1688596DAF96C554D14E9A'.             
088800     03  PIC X(16) VALUE X'8BB6710954BD960970DF6DF976D04E25'.             
088900     03  PIC X(16) VALUE X'781487125CA95EF68A00989C960E708E'.             
089000     03  PIC X(16) VALUE X'6CBF594463A9773C884D6F1482735830'.             
089100     03  PIC X(16) VALUE X'FFFD71D5538C781A96C155015F667130'.             
089200     03  PIC X(16) VALUE X'5BB48C1A9A8C6B83592E9E2F79E76768'.             
089300     03  PIC X(16) VALUE X'626C4F6F75A17F8A6D0B96336C274EF0'.             
089400     03  PIC X(16) VALUE X'75D2517B68376F3E9080817059967476'.             
089500     03  PIC X(16) VALUE X'64475C2790657A918C2359DA54AC8200'.             
089600     03  PIC X(16) VALUE X'836F898180006930564E8036723791CE'.             
089700     03  PIC X(16) VALUE X'51B64E5F987563964E1A53F666F3814B'.             
089800     03  PIC X(16) VALUE X'591C6DB24E0058F9533B63D694F14F9D'.             
089900     03  PIC X(16) VALUE X'4F0A886398905937905779FB4EEA80F0'.             
090000     03  PIC X(16) VALUE X'75916C825B9C59E85F5D69058681501A'.             
090100     03  PIC X(16) VALUE X'5DF24E5977E34EE5827A629166139091'.             
090200     03  PIC X(16) VALUE X'5C794EBF5F7981C69038808475AB4EA6'.             
090300     03  PIC X(16) VALUE X'88D4610F6BC55FC64E4976CA6EA28BE3'.             
090400     03  PIC X(16) VALUE X'8BAE8C0A8BD15F027FFC7FCC7ECE8335'.             
090500     03  PIC X(16) VALUE X'836B56E06BB797F3963459FB541F94F6'.             
090600     03  PIC X(16) VALUE X'6DEB5BC5996E5C395F159690FFFDFFFD'.             
090700*    -- TAB2-IND = 27 (X'1B')                                             
090800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
090900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
091600     03  PIC X(16) VALUE X'FFFD537082F16A315A749E705E947F28'.             
091700     03  PIC X(16) VALUE X'83B984248425836787478FCE8D6276C8'.             
091800     03  PIC X(16) VALUE X'5F719896786C662054DF62E54F6381C3'.             
091900     03  PIC X(16) VALUE X'75C85EB896CD8E0A86F9548F6CF36D8C'.             
092000     03  PIC X(16) VALUE X'6C38607F52C775285E7D4F1860A05FE7'.             
092100     03  PIC X(16) VALUE X'5C24753190AE94C072B96CB96E389149'.             
092200     03  PIC X(16) VALUE X'670953CB53F34F5191C98BF153C85E7C'.             
092300     03  PIC X(16) VALUE X'8FC26DE44E8E76C26986865E611A8206'.             
092400     03  PIC X(16) VALUE X'FFFD4F594FDE903E9C7C61096E1D6E14'.             
092500     03  PIC X(16) VALUE X'96854E885A3196E84E0E5C7F79B95B87'.             
092600     03  PIC X(16) VALUE X'8BED7FBD738957DF828B90C154019047'.             
092700     03  PIC X(16) VALUE X'55BB5CEA5FA161086B3272F180B28A89'.             
092800     03  PIC X(16) VALUE X'6D745BD388D598848C6B9A6D9E336E0A'.             
092900     03  PIC X(16) VALUE X'51A4514357A38881539F63F48F9556ED'.             
093000     03  PIC X(16) VALUE X'54585706733F6E907F188FDC82D1613F'.             
093100     03  PIC X(16) VALUE X'6028966266F07EA68D8A8DC394A55CB3'.             
093200     03  PIC X(16) VALUE X'7CA4670860A6960580184E9190E75300'.             
093300     03  PIC X(16) VALUE X'966851418FD08574915D665597F55B55'.             
093400     03  PIC X(16) VALUE X'531D78386742683D54C9707E5BB08F7D'.             
093500     03  PIC X(16) VALUE X'518D572854B1651266828D5E8D43810F'.             
093600     03  PIC X(16) VALUE X'846C906D7CDF51FF85FB67A365E96FA1'.             
093700     03  PIC X(16) VALUE X'86A48E81566A90207682707671E58D23'.             
093800     03  PIC X(16) VALUE X'62E952196CFD8D3C600E589E618E66FE'.             
093900     03  PIC X(16) VALUE X'8D60624E55B36E23672D8F67FFFDFFFD'.             
094000*    -- TAB2-IND = 28 (X'1C')                                             
094100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
094900     03  PIC X(16) VALUE X'FFFD94E195F87728680569A8548B4E4D'.             
095000     03  PIC X(16) VALUE X'70B88BC86458658B5B857A84503A5BE8'.             
095100     03  PIC X(16) VALUE X'77BB6BE18A797C986CBE76CF65A98F97'.             
095200     03  PIC X(16) VALUE X'5D2D5C5586386808536062187AD96E5B'.             
095300     03  PIC X(16) VALUE X'7EFD6A1F7AE05F706F335F20638C6DA8'.             
095400     03  PIC X(16) VALUE X'67564E085E108D264ED780C07634969C'.             
095500     03  PIC X(16) VALUE X'62DB662D627E6CBC8D7571677F695146'.             
095600     03  PIC X(16) VALUE X'808753EC906E629854F286F08F998005'.             
095700     03  PIC X(16) VALUE X'FFFD951785178FD96D5973CD659F771F'.             
095800     03  PIC X(16) VALUE X'7504782781FB8D1E94884FA6679575B9'.             
095900     03  PIC X(16) VALUE X'8BCA9707632F9547963584B863237741'.             
096000     03  PIC X(16) VALUE X'5F8172F04E896014657462EF6B63653F'.             
096100     03  PIC X(16) VALUE X'5E2775C790D18BC1829D679D652F5431'.             
096200     03  PIC X(16) VALUE X'871877E580A281026C414E4B7EC7804C'.             
096300     03  PIC X(16) VALUE X'76F4690D6B966267503C4F8457406307'.             
096400     03  PIC X(16) VALUE X'6B628DBE53EA65E87EB85FD7631A63B7'.             
096500     03  PIC X(16) VALUE X'81F381F47F6E5E1C5CD95236667A79E9'.             
096600     03  PIC X(16) VALUE X'7A1A8D28709975D46EDE6CBB7A924E2D'.             
096700     03  PIC X(16) VALUE X'76C55FE0949F88777EC879CD80BF91CD'.             
096800     03  PIC X(16) VALUE X'4EF24F17821F54685DDE6D328BCC7CA5'.             
096900     03  PIC X(16) VALUE X'8F7480985E1A549276B15B99663C9AA4'.             
097000     03  PIC X(16) VALUE X'73E0682A86DB6731732A8BF88BDB9010'.             
097100     03  PIC X(16) VALUE X'7AF970DB716E62C477A956314E3B8457'.             
097200     03  PIC X(16) VALUE X'67F152A986C08D2E94F87B51FFFDFFFD'.             
097300*    -- TAB2-IND = 29 (X'1D')                                             
097400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
097500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
097600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
097700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
097800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
097900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
098000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
098100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
098200     03  PIC X(16) VALUE X'FFFD4F4F6CE8795D9A7B6293722A62FD'.             
098300     03  PIC X(16) VALUE X'4E1378168F6C64B08D5A7BC668695E84'.             
098400     03  PIC X(16) VALUE X'88C55986649E58EE72B6690E95258FFD'.             
098500     03  PIC X(16) VALUE X'8D5857607F008C0651C6634962D95353'.             
098600     03  PIC X(16) VALUE X'684C74228301914C55447740707C6D4A'.             
098700     03  PIC X(16) VALUE X'517954A88D4459FF6ECB6DC45B5C7D2B'.             
098800     03  PIC X(16) VALUE X'4ED47C7D6ED35B5081EA6E0D5B579B03'.             
098900     03  PIC X(16) VALUE X'68D58E2A5B977EFC603B7EB590B98D70'.             
099000     03  PIC X(16) VALUE X'FFFD594F63CD79DF8DB3535265CF7956'.             
099100     03  PIC X(16) VALUE X'8BC5963B7EC494BB7E82563491896700'.             
099200     03  PIC X(16) VALUE X'7F6A5C0A907566285DE64F5067DE505A'.             
099300     03  PIC X(16) VALUE X'4F5C57505EA7FFFDFFFDFFFDFFFDFFFD'.             
099400     03  PIC X(16) VALUE X'4E8D4E0C51404E105EFF53454E154E98'.             
099500     03  PIC X(16) VALUE X'4E1E9B325B6C56694E2879BA4E3F5315'.             
099600     03  PIC X(16) VALUE X'4E47592D723B536E6C1056DF80E49997'.             
099700     03  PIC X(16) VALUE X'6BD3777E9F174E364E9F9F104E5C4E69'.             
099800     03  PIC X(16) VALUE X'4E9382885B5B556C560F4EC4538D539D'.             
099900     03  PIC X(16) VALUE X'53A353A553AE97658D5D531A53F55326'.             
100000     03  PIC X(16) VALUE X'532E533E8D5C5366536352025208520E'.             
100100     03  PIC X(16) VALUE X'522D5233523F5240524C525E5261525C'.             
100200     03  PIC X(16) VALUE X'84AF527D528252815290529351827F54'.             
100300     03  PIC X(16) VALUE X'4EBB4EC34EC94EC24EE84EE14EEB4EDE'.             
100400     03  PIC X(16) VALUE X'4F1B4EF34F224F644EF54F254F274F09'.             
100500     03  PIC X(16) VALUE X'4F2B4F5E4F6765384F5A4F5DFFFDFFFD'.             
100600*    -- TAB2-IND = 30 (X'1E')                                             
100700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
100800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
100900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
101500     03  PIC X(16) VALUE X'FFFD4F5F4F574F324F3D4F764F744F91'.             
101600     03  PIC X(16) VALUE X'4F894F834F8F4F7E4F7B4FAA4F7C4FAC'.             
101700     03  PIC X(16) VALUE X'4F944FE64FE84FEA4FC54FDA4FE34FDC'.             
101800     03  PIC X(16) VALUE X'4FD14FDF4FF85029504C4FF3502C500F'.             
101900     03  PIC X(16) VALUE X'502E502D4FFE501C500C50255028507E'.             
102000     03  PIC X(16) VALUE X'504350555048504E506C507B50A550A7'.             
102100     03  PIC X(16) VALUE X'50A950BA50D6510650ED50EC50E650EE'.             
102200     03  PIC X(16) VALUE X'5107510B4EDD6C3D4F584F654FCE9FA0'.             
102300     03  PIC X(16) VALUE X'FFFD6C467C74516E5DFD9EC999985181'.             
102400     03  PIC X(16) VALUE X'591452F9530D8A07531051EB59195155'.             
102500     03  PIC X(16) VALUE X'4EA051564EB3886E88A44EB5811488D2'.             
102600     03  PIC X(16) VALUE X'79805B3488037FB851AB51B151BD51BC'.             
102700     03  PIC X(16) VALUE X'51C7519651A251A58BA08BA68BA78BAA'.             
102800     03  PIC X(16) VALUE X'8BB48BB58BB78BC28BC38BCB8BCF8BCE'.             
102900     03  PIC X(16) VALUE X'8BD28BD38BD48BD68BD88BD98BDC8BDF'.             
103000     03  PIC X(16) VALUE X'8BE08BE48BE88BE98BEE8BF08BF38BF6'.             
103100     03  PIC X(16) VALUE X'8BF98BFC8BFF8C008C028C048C078C0C'.             
103200     03  PIC X(16) VALUE X'8C0F8C118C128C148C158C168C198C1B'.             
103300     03  PIC X(16) VALUE X'8C188C1D8C1F8C208C218C258C278C2A'.             
103400     03  PIC X(16) VALUE X'8C2B8C2E8C2F8C328C338C358C365369'.             
103500     03  PIC X(16) VALUE X'537A961D962296219631962A963D963C'.             
103600     03  PIC X(16) VALUE X'964296499654965F9667966C96729674'.             
103700     03  PIC X(16) VALUE X'9688968D969796B09097909B909D9099'.             
103800     03  PIC X(16) VALUE X'90AC90A190B490B390B690BAFFFDFFFD'.             
103900*    -- TAB2-IND = 31 (X'1F')                                             
104000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
104800     03  PIC X(16) VALUE X'FFFD90B890B090CF90C590BE90D090C4'.             
104900     03  PIC X(16) VALUE X'90C790D390E690E290DC90D790DB90EB'.             
105000     03  PIC X(16) VALUE X'90EF90FE91049122911E91239131912F'.             
105100     03  PIC X(16) VALUE X'913991439146520D594252A252AC52AD'.             
105200     03  PIC X(16) VALUE X'52BE54FF52D052D652F053DF71EE77CD'.             
105300     03  PIC X(16) VALUE X'5EF451F551FC9B2F53B65F01755A5DEF'.             
105400     03  PIC X(16) VALUE X'574C57A957A1587E58BC58C558D15729'.             
105500     03  PIC X(16) VALUE X'572C572A57335739572E572F575C573B'.             
105600     03  PIC X(16) VALUE X'FFFD574257695785576B5786577C577B'.             
105700     03  PIC X(16) VALUE X'5768576D5776577357AD57A4578C57B2'.             
105800     03  PIC X(16) VALUE X'57CF57A757B4579357A057D557D857DA'.             
105900     03  PIC X(16) VALUE X'57D957D257B857F457EF57F857E457DD'.             
106000     03  PIC X(16) VALUE X'580B580D57FD57ED5800581E58195844'.             
106100     03  PIC X(16) VALUE X'58205865586C58815889589A588099A8'.             
106200     03  PIC X(16) VALUE X'9F1961FF8279827D827F828F828A82A8'.             
106300     03  PIC X(16) VALUE X'8284828E82918297829982AB82B882BE'.             
106400     03  PIC X(16) VALUE X'82B082C882CA82E3829882B782AE82CB'.             
106500     03  PIC X(16) VALUE X'82CC82C182A982B482A182AA829F82C4'.             
106600     03  PIC X(16) VALUE X'82CE82A482E1830982F782E4830F8307'.             
106700     03  PIC X(16) VALUE X'82DC82F482D282D8830C82FB82D38311'.             
106800     03  PIC X(16) VALUE X'831A83068314831582E082D5831C8351'.             
106900     03  PIC X(16) VALUE X'835B835C83088392833C83348331839B'.             
107000     03  PIC X(16) VALUE X'835E832F834F83478343835F83408317'.             
107100     03  PIC X(16) VALUE X'8360832D833A833383668365FFFDFFFD'.             
107200*    -- TAB2-IND = 32 (X'20')                                             
107300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
107900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
108000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
108100     03  PIC X(16) VALUE X'FFFD8368831B8369836C836A836D836E'.             
108200     03  PIC X(16) VALUE X'83B0837883B383B483A083AA8393839C'.             
108300     03  PIC X(16) VALUE X'8385837C83B683A9837D83B8837B8398'.             
108400     03  PIC X(16) VALUE X'839E83A883BA83BC83C1840183E583D8'.             
108500     03  PIC X(16) VALUE X'58078418840B83DD83FD83D6841C8438'.             
108600     03  PIC X(16) VALUE X'8411840683D483DF840F840383F883F9'.             
108700     03  PIC X(16) VALUE X'83EA83C583C0842683F083E1845C8451'.             
108800     03  PIC X(16) VALUE X'845A8459847384878488847A84898478'.             
108900     03  PIC X(16) VALUE X'FFFD843C844684698476848C848E8431'.             
109000     03  PIC X(16) VALUE X'846D84C184CD84D084E684BD84D384CA'.             
109100     03  PIC X(16) VALUE X'84BF84BA84E084A184B984B4849784E5'.             
109200     03  PIC X(16) VALUE X'84E3850C750D853884F08539851F853A'.             
109300     03  PIC X(16) VALUE X'8556853B84FF84FC8559854885688564'.             
109400     03  PIC X(16) VALUE X'855E857A77A285438572857B85A485A8'.             
109500     03  PIC X(16) VALUE X'8587858F857985AE859C858585B985B7'.             
109600     03  PIC X(16) VALUE X'85B085D385C185DC85FF862786058629'.             
109700     03  PIC X(16) VALUE X'8616863C5EFE5F08593C594180375955'.             
109800     03  PIC X(16) VALUE X'595A5958530F5C225C255C2C5C34624C'.             
109900     03  PIC X(16) VALUE X'626A629F62BB62CA62DA62D762EE6322'.             
110000     03  PIC X(16) VALUE X'62F66339634B634363AD63F66371637A'.             
110100     03  PIC X(16) VALUE X'638E63B4636D63AC638A636963AE63BC'.             
110200     03  PIC X(16) VALUE X'63F263F863E063FF63C463DE63CE6452'.             
110300     03  PIC X(16) VALUE X'63C663BE64456441640B641B6420640C'.             
110400     03  PIC X(16) VALUE X'64266421645E6484646D6496FFFDFFFD'.             
110500*    -- TAB2-IND = 33 (X'21')                                             
110600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
110700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
110800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
110900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
111000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
111100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
111200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
111300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
111400     03  PIC X(16) VALUE X'FFFD647A64B764B8649964BA64C064D0'.             
111500     03  PIC X(16) VALUE X'64D764E464E265096525652E5F0B5FD2'.             
111600     03  PIC X(16) VALUE X'75195F11535F53F153FD53E953E853FB'.             
111700     03  PIC X(16) VALUE X'541254165406544B5452545354545456'.             
111800     03  PIC X(16) VALUE X'54435421545754595423543254825494'.             
111900     03  PIC X(16) VALUE X'547754715464549A549B548454765466'.             
112000     03  PIC X(16) VALUE X'549D54D054AD54C254B454D254A754A6'.             
112100     03  PIC X(16) VALUE X'54D354D4547254A354D554BB54BF54CC'.             
112200     03  PIC X(16) VALUE X'FFFD54D954DA54DC54A954AA54A454DD'.             
112300     03  PIC X(16) VALUE X'54CF54DE551B54E7552054FD551454F3'.             
112400     03  PIC X(16) VALUE X'55225523550F55115527552A5567558F'.             
112500     03  PIC X(16) VALUE X'55B55549556D55415555553F5550553C'.             
112600     03  PIC X(16) VALUE X'5537555655755576557755335530555C'.             
112700     03  PIC X(16) VALUE X'558B55D2558355B155B955885581559F'.             
112800     03  PIC X(16) VALUE X'557E55D65591557B55DF55BD55BE5594'.             
112900     03  PIC X(16) VALUE X'559955EA55F755C9561F55D155EB55EC'.             
113000     03  PIC X(16) VALUE X'55D455E655DD55C455EF55E555F255F3'.             
113100     03  PIC X(16) VALUE X'55CC55CD55E855F555E48F94561E5608'.             
113200     03  PIC X(16) VALUE X'560C56015624562355FE56005627562D'.             
113300     03  PIC X(16) VALUE X'565856395657562C564D56625659565C'.             
113400     03  PIC X(16) VALUE X'564C5654568656645671566B567B567C'.             
113500     03  PIC X(16) VALUE X'5685569356AF56D456D756DD56E156F5'.             
113600     03  PIC X(16) VALUE X'56EB56F956FF5704570A5709571C5E0F'.             
113700     03  PIC X(16) VALUE X'5E195E145E115E315E3B5E3CFFFDFFFD'.             
113800*    -- TAB2-IND = 34 (X'22')                                             
113900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
114700     03  PIC X(16) VALUE X'FFFD5E375E445E545E5B5E5E5E615C8C'.             
114800     03  PIC X(16) VALUE X'5C7A5C8D5C905C965C885C985C995C91'.             
114900     03  PIC X(16) VALUE X'5C9A5C9C5CB55CA25CBD5CAC5CAB5CB1'.             
115000     03  PIC X(16) VALUE X'5CA35CC15CB75CC45CD25CE45CCB5CE5'.             
115100     03  PIC X(16) VALUE X'5D025D035D275D265D2E5D245D1E5D06'.             
115200     03  PIC X(16) VALUE X'5D1B5D585D3E5D345D3D5D6C5D5B5D6F'.             
115300     03  PIC X(16) VALUE X'5D5D5D6B5D4B5D4A5D695D745D825D99'.             
115400     03  PIC X(16) VALUE X'5D9D8C735DB75DC55F735F775F825F87'.             
115500     03  PIC X(16) VALUE X'FFFD5F895F8C5F955F995F9C5FA85FAD'.             
115600     03  PIC X(16) VALUE X'5FB55FBC88625F6172AD72B072B472B7'.             
115700     03  PIC X(16) VALUE X'72B872C372C172CE72CD72D272E872EF'.             
115800     03  PIC X(16) VALUE X'72E972F272F472F7730172F3730372FA'.             
115900     03  PIC X(16) VALUE X'72FB731773137321730A731E731D7315'.             
116000     03  PIC X(16) VALUE X'732273397325732C733873317350734D'.             
116100     03  PIC X(16) VALUE X'73577360736C736F737E821B592598E7'.             
116200     03  PIC X(16) VALUE X'592459029963996799689969996A996B'.             
116300     03  PIC X(16) VALUE X'996C99749977997D998099849987998A'.             
116400     03  PIC X(16) VALUE X'998D999099919993999499955E805E91'.             
116500     03  PIC X(16) VALUE X'5E8B5E965EA55EA05EB95EB55EBE5EB3'.             
116600     03  PIC X(16) VALUE X'8D535ED25ED15EDB5EE85EEA81BA5FC4'.             
116700     03  PIC X(16) VALUE X'5FC95FD65FCF60035FEE60045FE15FE4'.             
116800     03  PIC X(16) VALUE X'5FFE600560065FEA5FED5FF860196035'.             
116900     03  PIC X(16) VALUE X'6026601B600F600D6029602B600A603F'.             
117000     03  PIC X(16) VALUE X'602160786079607B607A6042FFFDFFFD'.             
117100*    -- TAB2-IND = 35 (X'23')                                             
117200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
117900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
118000     03  PIC X(16) VALUE X'FFFD606A607D6096609A60AD609D6083'.             
118100     03  PIC X(16) VALUE X'6092608C609B60EC60BB60B160DD60D8'.             
118200     03  PIC X(16) VALUE X'60C660DA60B4612061266115612360F4'.             
118300     03  PIC X(16) VALUE X'6100610E612B614A617561AC619461A7'.             
118400     03  PIC X(16) VALUE X'61B761D461F55FDD96B395E995EB95F1'.             
118500     03  PIC X(16) VALUE X'95F395F595F695FC95FE960396049606'.             
118600     03  PIC X(16) VALUE X'9608960A960B960C960D960F96129615'.             
118700     03  PIC X(16) VALUE X'961696179619961A4E2C723F62156C35'.             
118800     03  PIC X(16) VALUE X'FFFD6C546C5C6C4A6CA36C856C906C94'.             
118900     03  PIC X(16) VALUE X'6C8C6C686C696C746C766C866CA96CD0'.             
119000     03  PIC X(16) VALUE X'6CD46CAD6CF76CF86CF16CD76CB26CE0'.             
119100     03  PIC X(16) VALUE X'6CD66CFA6CEB6CEE6CB16CD36CEF6CFE'.             
119200     03  PIC X(16) VALUE X'6D396D276D0C6D436D486D076D046D19'.             
119300     03  PIC X(16) VALUE X'6D0E6D2B6D4D6D2E6D356D1A6D4F6D52'.             
119400     03  PIC X(16) VALUE X'6D546D336D916D6F6D9E6DA06D5E6D93'.             
119500     03  PIC X(16) VALUE X'6D946D5C6D606D7C6D636E1A6DC76DC5'.             
119600     03  PIC X(16) VALUE X'6DDE6E0E6DBF6DE06E116DE66DDD6DD9'.             
119700     03  PIC X(16) VALUE X'6E166DAB6E0C6DAE6E2B6E6E6E4E6E6B'.             
119800     03  PIC X(16) VALUE X'6EB26E5F6E866E536E546E326E256E44'.             
119900     03  PIC X(16) VALUE X'6EDF6EB16E986EE06F2D6EE26EA56EA7'.             
120000     03  PIC X(16) VALUE X'6EBD6EBB6EB76ED76EB46ECF6E8F6EC2'.             
120100     03  PIC X(16) VALUE X'6E9F6F626F466F476F246F156EF96F2F'.             
120200     03  PIC X(16) VALUE X'6F366F4B6F746F2A6F096F296F896F8D'.             
120300     03  PIC X(16) VALUE X'6F8C6F786F726F7C6F7A6FD1FFFDFFFD'.             
120400*    -- TAB2-IND = 36 (X'24')                                             
120500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
120600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
120700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
120800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
120900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
121000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
121100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
121200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
121300     03  PIC X(16) VALUE X'FFFD6FC96FA76FB96FB66FC26FE16FEE'.             
121400     03  PIC X(16) VALUE X'6FDE6FE06FEF701A7023701B70397035'.             
121500     03  PIC X(16) VALUE X'704F705E5B805B845B955B935BA55BB8'.             
121600     03  PIC X(16) VALUE X'752F9A9E64345BE45BEE89305BF08E47'.             
121700     03  PIC X(16) VALUE X'8B078FB68FD38FD58FE58FEE8FE48FE9'.             
121800     03  PIC X(16) VALUE X'8FE68FF38FE890059004900B90269011'.             
121900     03  PIC X(16) VALUE X'900D9016902190359036902D902F9044'.             
122000     03  PIC X(16) VALUE X'905190529050906890589062905B66B9'.             
122100     03  PIC X(16) VALUE X'FFFD9074907D908290889083908B5F50'.             
122200     03  PIC X(16) VALUE X'5F575F565F585C3B54AB5C505C595B71'.             
122300     03  PIC X(16) VALUE X'5C635C667FBC5F2A5F295F2D82745F3C'.             
122400     03  PIC X(16) VALUE X'9B3B5C6E59815983598D59A959AA59A3'.             
122500     03  PIC X(16) VALUE X'599759CA59AB599E59A459D259B259AF'.             
122600     03  PIC X(16) VALUE X'59D759BE5A055A0659DD5A0859E359D8'.             
122700     03  PIC X(16) VALUE X'59F95A0C5A095A325A345A115A235A13'.             
122800     03  PIC X(16) VALUE X'5A405A675A4A5A555A3C5A625A7580EC'.             
122900     03  PIC X(16) VALUE X'5AAA5A9B5A775A7A5ABE5AEB5AB25AD2'.             
123000     03  PIC X(16) VALUE X'5AD45AB85AE05AE35AF15AD65AE65AD8'.             
123100     03  PIC X(16) VALUE X'5ADC5B095B175B165B325B375B405C15'.             
123200     03  PIC X(16) VALUE X'5C1C5B5A5B655B735B515B535B629A75'.             
123300     03  PIC X(16) VALUE X'9A779A789A7A9A7F9A7D9A809A819A85'.             
123400     03  PIC X(16) VALUE X'9A889A8A9A909A929A939A969A989A9B'.             
123500     03  PIC X(16) VALUE X'9A9C9A9D9A9F9AA09AA29AA39AA59AA7'.             
123600     03  PIC X(16) VALUE X'7E9F7EA17EA37EA57EA87EA9FFFDFFFD'.             
123700*    -- TAB2-IND = 37 (X'25')                                             
123800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
123900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
124600     03  PIC X(16) VALUE X'FFFD7EAD7EB07EBE7EC07EC17EC27EC9'.             
124700     03  PIC X(16) VALUE X'7ECB7ECC7ED07ED47ED77EDB7EE07EE1'.             
124800     03  PIC X(16) VALUE X'7EE87EEB7EEE7EEF7EF17EF27F0D7EF6'.             
124900     03  PIC X(16) VALUE X'7EFA7EFB7EFE7F017F027F037F077F08'.             
125000     03  PIC X(16) VALUE X'7F0B7F0C7F0F7F117F127F177F197F1C'.             
125100     03  PIC X(16) VALUE X'7F1B7F1F7F217F227F237F247F257F26'.             
125200     03  PIC X(16) VALUE X'7F277F2A7F2B7F2C7F2D7F2F7F307F31'.             
125300     03  PIC X(16) VALUE X'7F327F337F355E7A757F5DDB753E9095'.             
125400     03  PIC X(16) VALUE X'FFFD738E739173AE73A2739F73CF73C2'.             
125500     03  PIC X(16) VALUE X'73D173B773B373C073C973C873E573D9'.             
125600     03  PIC X(16) VALUE X'987C740A73E973E773DE73BA73F2740F'.             
125700     03  PIC X(16) VALUE X'742A745B7426742574287430742E742C'.             
125800     03  PIC X(16) VALUE X'741B741A7441745C7457745574597477'.             
125900     03  PIC X(16) VALUE X'746D747E749C748E748074817487748B'.             
126000     03  PIC X(16) VALUE X'749E74A874A9749074A774D274BA97EA'.             
126100     03  PIC X(16) VALUE X'97EB97EC674C6753675E6748676967A5'.             
126200     03  PIC X(16) VALUE X'6787676A6773679867A7677567A8679E'.             
126300     03  PIC X(16) VALUE X'67AD678B6777677C67F0680967D8680A'.             
126400     03  PIC X(16) VALUE X'67E967B0680C67D967B567DA67B367DD'.             
126500     03  PIC X(16) VALUE X'680067C367B867E2680E67C167FD6832'.             
126600     03  PIC X(16) VALUE X'683368606861684E6862684468646883'.             
126700     03  PIC X(16) VALUE X'681D68556866684168676840683E684A'.             
126800     03  PIC X(16) VALUE X'6849682968B5688F687468776893686B'.             
126900     03  PIC X(16) VALUE X'68C2696E68FC691F692068F9FFFDFFFD'.             
127000*    -- TAB2-IND = 38 (X'26')                                             
127100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
127900     03  PIC X(16) VALUE X'FFFD692468F0690B6901695768E36910'.             
128000     03  PIC X(16) VALUE X'6971693969606942695D6984696B6980'.             
128100     03  PIC X(16) VALUE X'69986978693469CC6987698869CE6989'.             
128200     03  PIC X(16) VALUE X'696669636979699B69A769BB69AB69AD'.             
128300     03  PIC X(16) VALUE X'69D469B169C169CA69DF699569E0698D'.             
128400     03  PIC X(16) VALUE X'69FF6A2F69ED6A176A186A6569F26A44'.             
128500     03  PIC X(16) VALUE X'6A3E6AA06A506A5B6A356A8E6A796A3D'.             
128600     03  PIC X(16) VALUE X'6A286A586A7C6A916A906AA96A976AAB'.             
128700     03  PIC X(16) VALUE X'FFFD733773526B816B826B876B846B92'.             
128800     03  PIC X(16) VALUE X'6B936B8D6B9A6B9B6BA16BAA8F6B8F6D'.             
128900     03  PIC X(16) VALUE X'8F718F728F738F758F768F788F778F79'.             
129000     03  PIC X(16) VALUE X'8F7A8F7C8F7E8F818F828F848F878F8B'.             
129100     03  PIC X(16) VALUE X'8F8D8F8E8F8F8F988F9A8ECE620B6217'.             
129200     03  PIC X(16) VALUE X'621B621F6222622162256224622C81E7'.             
129300     03  PIC X(16) VALUE X'74EF74F474FF750F75117513653465EE'.             
129400     03  PIC X(16) VALUE X'65EF65F0660A66196772660366156600'.             
129500     03  PIC X(16) VALUE X'708566F7661D66346631663666358006'.             
129600     03  PIC X(16) VALUE X'665F66546641664F6656666166576677'.             
129700     03  PIC X(16) VALUE X'6684668C66A7669D66BE66DB66DC66E6'.             
129800     03  PIC X(16) VALUE X'66E98D328D338D368D3B8D3D8D408D45'.             
129900     03  PIC X(16) VALUE X'8D468D488D498D478D4D8D558D5989C7'.             
130000     03  PIC X(16) VALUE X'89CA89CB89CC89CE89CF89D089D1726E'.             
130100     03  PIC X(16) VALUE X'729F725D7266726F727E727F7284728B'.             
130200     03  PIC X(16) VALUE X'728D728F72926308633263B0FFFDFFFD'.             
130300*    -- TAB2-IND = 39 (X'27')                                             
130400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
130500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
130600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
130700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
130800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
130900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
131000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
131100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
131200     03  PIC X(16) VALUE X'FFFD643F64D880046BEA6BF36BFD6BF5'.             
131300     03  PIC X(16) VALUE X'6BF96C056C076C066C0D6C156C186C19'.             
131400     03  PIC X(16) VALUE X'6C1A6C216C296C246C2A6C3265356555'.             
131500     03  PIC X(16) VALUE X'656B724D72527256723086625216809F'.             
131600     03  PIC X(16) VALUE X'809C809380BC670A80BD80B180AB80AD'.             
131700     03  PIC X(16) VALUE X'80B480B780E780E880E980EA80DB80C2'.             
131800     03  PIC X(16) VALUE X'80C480D980CD80D7671080DD80EB80F1'.             
131900     03  PIC X(16) VALUE X'80F480ED810D810E80F280FC67158112'.             
132000     03  PIC X(16) VALUE X'FFFD8C5A8136811E812C811881328148'.             
132100     03  PIC X(16) VALUE X'814C815381748159815A817181608169'.             
132200     03  PIC X(16) VALUE X'817C817D816D8167584D5AB581888182'.             
132300     03  PIC X(16) VALUE X'81916ED581A381AA81CC672681CA81BB'.             
132400     03  PIC X(16) VALUE X'81C181A66B246B376B396B436B466B59'.             
132500     03  PIC X(16) VALUE X'98D198D298D398D598D998DA6BB35F40'.             
132600     03  PIC X(16) VALUE X'6BC289F365909F51659365BC65C665C4'.             
132700     03  PIC X(16) VALUE X'65C365CC65CE65D265D67080709C7096'.             
132800     03  PIC X(16) VALUE X'709D70BB70C070B770AB70B170E870CA'.             
132900     03  PIC X(16) VALUE X'711071137116712F71317173715C7168'.             
133000     03  PIC X(16) VALUE X'71457172714A7178717A719871B371B5'.             
133100     03  PIC X(16) VALUE X'71A871A071E071D471E771F9721D7228'.             
133200     03  PIC X(16) VALUE X'706C7118716671B9623E623D62436248'.             
133300     03  PIC X(16) VALUE X'6249793B794079467949795B795C7953'.             
133400     03  PIC X(16) VALUE X'795A796279577960796F7967797A7985'.             
133500     03  PIC X(16) VALUE X'798A799A79A779B35FD15FD0FFFDFFFD'.             
133600*    -- TAB2-IND = 40 (X'28')                                             
133700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
133800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
133900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
134500     03  PIC X(16) VALUE X'FFFD603C605D605A6067604160596063'.             
134600     03  PIC X(16) VALUE X'60AB6106610D615D61A9619D61CB61D1'.             
134700     03  PIC X(16) VALUE X'62068080807F6C936CF66DFC77F677F8'.             
134800     03  PIC X(16) VALUE X'7800780978177818781165AB782D781C'.             
134900     03  PIC X(16) VALUE X'781D7839783A783B781F783C7825782C'.             
135000     03  PIC X(16) VALUE X'78237829784E786D7856785778267850'.             
135100     03  PIC X(16) VALUE X'7847784C786A789B7893789A7887789C'.             
135200     03  PIC X(16) VALUE X'78A178A378B278B978A578D478D978C9'.             
135300     03  PIC X(16) VALUE X'FFFD78EC78F2790578F479137924791E'.             
135400     03  PIC X(16) VALUE X'79349F9B9EF99EFB9EFC76F17704770D'.             
135500     03  PIC X(16) VALUE X'76F977077708771A77227719772D7726'.             
135600     03  PIC X(16) VALUE X'773577387750775177477743775A7768'.             
135700     03  PIC X(16) VALUE X'77627765777F778D777D7780778C7791'.             
135800     03  PIC X(16) VALUE X'779F77A077B077B577BD753A7540754E'.             
135900     03  PIC X(16) VALUE X'754B7548755B7572757975837F587F61'.             
136000     03  PIC X(16) VALUE X'7F5F8A487F687F747F717F797F817F7E'.             
136100     03  PIC X(16) VALUE X'76CD76E58832948594869487948B948A'.             
136200     03  PIC X(16) VALUE X'948C948D948F9490949494979495949A'.             
136300     03  PIC X(16) VALUE X'949B949C94A394A494AB94AA94AD94AC'.             
136400     03  PIC X(16) VALUE X'94AF94B094B294B494B694B794B894B9'.             
136500     03  PIC X(16) VALUE X'94BA94BC94BD94BF94C494C894C994CA'.             
136600     03  PIC X(16) VALUE X'94CB94CC94CD94CE94D094D194D294D5'.             
136700     03  PIC X(16) VALUE X'94D694D794D994D894DB94DE94DF94E0'.             
136800     03  PIC X(16) VALUE X'94E294E494E594E794E894EAFFFDFFFD'.             
136900*    -- TAB2-IND = 41 (X'29')                                             
137000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
137800     03  PIC X(16) VALUE X'FFFD94E994EB94EE94EF94F394F494F5'.             
137900     03  PIC X(16) VALUE X'94F794F994FC94FD94FF950395029506'.             
138000     03  PIC X(16) VALUE X'95079509950A950D950E950F95129513'.             
138100     03  PIC X(16) VALUE X'9514951595169518951B951D951E951F'.             
138200     03  PIC X(16) VALUE X'9522952A952B9529952C953195329534'.             
138300     03  PIC X(16) VALUE X'953695379538953C953E953F95429535'.             
138400     03  PIC X(16) VALUE X'9544954595469549954C954E954F9552'.             
138500     03  PIC X(16) VALUE X'955395549556955795589559955B955E'.             
138600     03  PIC X(16) VALUE X'FFFD955F955D95619562956495659566'.             
138700     03  PIC X(16) VALUE X'956795689569956A956B956C956F9571'.             
138800     03  PIC X(16) VALUE X'95729573953A77E777EC96C979D579ED'.             
138900     03  PIC X(16) VALUE X'79E379EB7A065D477A037A027A1E7A14'.             
139000     03  PIC X(16) VALUE X'7A397A377A519ECF99A57A707688768E'.             
139100     03  PIC X(16) VALUE X'7693769976A474DE74E0752C9E209E22'.             
139200     03  PIC X(16) VALUE X'9E289E299E2A9E2B9E2C9E329E319E36'.             
139300     03  PIC X(16) VALUE X'9E389E379E399E3A9E3E9E419E429E44'.             
139400     03  PIC X(16) VALUE X'9E469E479E489E499E4B9E4C9E4E9E51'.             
139500     03  PIC X(16) VALUE X'9E559E579E5A9E5B9E5C9E5E9E639E66'.             
139600     03  PIC X(16) VALUE X'9E679E689E699E6A9E6B9E6C9E719E6D'.             
139700     03  PIC X(16) VALUE X'9E7375927594759675A0759D75AC75A3'.             
139800     03  PIC X(16) VALUE X'75B375B475B875C475B175B075C375C2'.             
139900     03  PIC X(16) VALUE X'75D675CD75E375E875E675E475EB75E7'.             
140000     03  PIC X(16) VALUE X'760375F175FC75FF761076007605760C'.             
140100     03  PIC X(16) VALUE X'7617760A7625761876157619FFFDFFFD'.             
140200*    -- TAB2-IND = 42 (X'2A')                                             
140300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
140900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
141000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
141100     03  PIC X(16) VALUE X'FFFD761B763C762276207640762D7630'.             
141200     03  PIC X(16) VALUE X'763F76357643763E7633764D765E7654'.             
141300     03  PIC X(16) VALUE X'765C7656766B766F7FCA7AE67A787A79'.             
141400     03  PIC X(16) VALUE X'7A807A867A887A957AA67AA07AAC7AA8'.             
141500     03  PIC X(16) VALUE X'7AAD7AB3886488698872887D887F8882'.             
141600     03  PIC X(16) VALUE X'88A288C688B788BC88C988E288CE88E3'.             
141700     03  PIC X(16) VALUE X'88E588F1891A88FC88E888FE88F08921'.             
141800     03  PIC X(16) VALUE X'89198913891B890A8934892B89368941'.             
141900     03  PIC X(16) VALUE X'FFFD8966897B758B80E576B276B477DC'.             
142000     03  PIC X(16) VALUE X'801280148016801C8020802280258026'.             
142100     03  PIC X(16) VALUE X'8027802980288031800B803580438046'.             
142200     03  PIC X(16) VALUE X'804D8052806980718983987898809883'.             
142300     03  PIC X(16) VALUE X'9889988C988D988F9894989A989B989E'.             
142400     03  PIC X(16) VALUE X'989F98A198A298A598A6864D8654866C'.             
142500     03  PIC X(16) VALUE X'866E867F867A867C867B86A8868D868B'.             
142600     03  PIC X(16) VALUE X'86AC869D86A786A386AA869386A986B6'.             
142700     03  PIC X(16) VALUE X'86C486B586CE86B086BA86B186AF86C9'.             
142800     03  PIC X(16) VALUE X'86CF86B486E986F186F286ED86F386D0'.             
142900     03  PIC X(16) VALUE X'871386DE86F486DF86D886D187038707'.             
143000     03  PIC X(16) VALUE X'86F88708870A870D87098723873B871E'.             
143100     03  PIC X(16) VALUE X'8725872E871A873E8748873487318729'.             
143200     03  PIC X(16) VALUE X'8737873F87828722877D877E877B8760'.             
143300     03  PIC X(16) VALUE X'8770874C876E878B87538763877C8764'.             
143400     03  PIC X(16) VALUE X'87598765879387AF87A887D2FFFDFFFD'.             
143500*    -- TAB2-IND = 43 (X'2B')                                             
143600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
143700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
143800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
143900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
144000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
144100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
144200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
144300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
144400     03  PIC X(16) VALUE X'FFFD87C68788878587AD8797878387AB'.             
144500     03  PIC X(16) VALUE X'87E587AC87B587B387CB87D387BD87D1'.             
144600     03  PIC X(16) VALUE X'87C087CA87DB87EA87E087EE88168813'.             
144700     03  PIC X(16) VALUE X'87FE880A881B88218839883C7F367F42'.             
144800     03  PIC X(16) VALUE X'7F447F4582107AFA7AFD7B087B037B04'.             
144900     03  PIC X(16) VALUE X'7B157B0A7B2B7B0F7B477B387B2A7B19'.             
145000     03  PIC X(16) VALUE X'7B2E7B317B207B257B247B337B3E7B1E'.             
145100     03  PIC X(16) VALUE X'7B587B5A7B457B757B4C7B5D7B607B6E'.             
145200     03  PIC X(16) VALUE X'FFFD7B7B7B627B727B717B907BA67BA7'.             
145300     03  PIC X(16) VALUE X'7BB87BAC7B9D7BA87B857BAA7B9C7BA2'.             
145400     03  PIC X(16) VALUE X'7BAB7BB47BD17BC17BCC7BDD7BDA7BE5'.             
145500     03  PIC X(16) VALUE X'7BE67BEA7C0C7BFE7BFC7C0F7C167C0B'.             
145600     03  PIC X(16) VALUE X'7C1F7C2A7C267C387C417C4081FE8201'.             
145700     03  PIC X(16) VALUE X'8202820481EC8844822182228223822D'.             
145800     03  PIC X(16) VALUE X'822F8228822B8238823B82338234823E'.             
145900     03  PIC X(16) VALUE X'82448249824B824F825A825F8268887E'.             
146000     03  PIC X(16) VALUE X'8885888888D888DF895E7F9D7F9F7FA7'.             
146100     03  PIC X(16) VALUE X'7FAF7FB07FB27C7C65497C917C9D7C9C'.             
146200     03  PIC X(16) VALUE X'7C9E7CA27CB27CBC7CBD7CC17CC77CCC'.             
146300     03  PIC X(16) VALUE X'7CCD7CC87CC57CD77CE8826E66A87FBF'.             
146400     03  PIC X(16) VALUE X'7FCE7FD57FE57FE17FE67FE97FEE7FF3'.             
146500     03  PIC X(16) VALUE X'7CF87D777DA67DAE7E477E9B9EB89EB4'.             
146600     03  PIC X(16) VALUE X'8D738D848D948D918DB18D678D6D8C47'.             
146700     03  PIC X(16) VALUE X'8C49914A9150914E914F9164FFFDFFFD'.             
146800*    -- TAB2-IND = 44 (X'2C')                                             
146900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
147700     03  PIC X(16) VALUE X'FFFD9162916191709169916F917D917E'.             
147800     03  PIC X(16) VALUE X'917291749179918C91859190918D9191'.             
147900     03  PIC X(16) VALUE X'91A291A391AA91AD91AE91AF91B591B4'.             
148000     03  PIC X(16) VALUE X'91BA8C559E7E8DB88DEB8E058E598E69'.             
148100     03  PIC X(16) VALUE X'8DB58DBF8DBC8DBA8DC48DD68DD78DDA'.             
148200     03  PIC X(16) VALUE X'8DDE8DCE8DCF8DDB8DC68DEC8DF78DF8'.             
148300     03  PIC X(16) VALUE X'8DE38DF98DFB8DE48E098DFD8E148E1D'.             
148400     03  PIC X(16) VALUE X'8E1F8E2C8E2E8E238E2F8E3A8E408E39'.             
148500     03  PIC X(16) VALUE X'FFFD8E358E3D8E318E498E418E428E51'.             
148600     03  PIC X(16) VALUE X'8E528E4A8E708E768E7C8E6F8E748E85'.             
148700     03  PIC X(16) VALUE X'8E8F8E948E908E9C8E9E8C788C828C8A'.             
148800     03  PIC X(16) VALUE X'8C858C988C94659B89D689DE89DA89DC'.             
148900     03  PIC X(16) VALUE X'89E589EB89EF8A3E8B26975396E996F3'.             
149000     03  PIC X(16) VALUE X'96EF970697019708970F970E972A972D'.             
149100     03  PIC X(16) VALUE X'9730973E9F809F839F859F869F879F88'.             
149200     03  PIC X(16) VALUE X'9F899F8A9F8C9EFE9F0B9F0D96B996BC'.             
149300     03  PIC X(16) VALUE X'96BD96CE96D277BF96E0928E92AE92C8'.             
149400     03  PIC X(16) VALUE X'933E936A93CA938F943E946B9C7F9C82'.             
149500     03  PIC X(16) VALUE X'9C859C869C879C887A239C8B9C8E9C90'.             
149600     03  PIC X(16) VALUE X'9C919C929C949C959C9A9C9B9C9E9C9F'.             
149700     03  PIC X(16) VALUE X'9CA09CA19CA29CA39CA59CA69CA79CA8'.             
149800     03  PIC X(16) VALUE X'9CA99CAB9CAD9CAE9CB09CB19CB29CB3'.             
149900     03  PIC X(16) VALUE X'9CB49CB59CB69CB79CBA9CBB9CBC9CBD'.             
150000     03  PIC X(16) VALUE X'9CC49CC59CC69CC79CCA9CCBFFFDFFFD'.             
150100*    -- TAB2-IND = 45 (X'2D')                                             
150200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
150900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
151000     03  PIC X(16) VALUE X'FFFD9CCC9CCD9CCE9CCF9CD09CD39CD4'.             
151100     03  PIC X(16) VALUE X'9CD59CD79CD89CD99CDC9CDD9CDF9CE2'.             
151200     03  PIC X(16) VALUE X'977C978597919792979497AF97AB97A3'.             
151300     03  PIC X(16) VALUE X'97B297B49AB19AB09AB79E589AB69ABA'.             
151400     03  PIC X(16) VALUE X'9ABC9AC19AC09AC59AC29ACB9ACC9AD1'.             
151500     03  PIC X(16) VALUE X'9B459B439B479B499B489B4D9B5198E8'.             
151600     03  PIC X(16) VALUE X'990D992E995599549ADF9AE19AE69AEF'.             
151700     03  PIC X(16) VALUE X'9AEB9AFB9AED9AF99B089B0F9B139B1F'.             
151800     03  PIC X(16) VALUE X'FFFD9B239EBD9EBE7E3B9E829E879E88'.             
151900     03  PIC X(16) VALUE X'9E8B9E9293D69E9D9E9F9EDB9EDC9EDD'.             
152000     03  PIC X(16) VALUE X'9EE09EDF9EE29EE99EE79EE59EEA9EEF'.             
152100     03  PIC X(16) VALUE X'9F229F2C9F2F9F399F379F3D9F3E9F44'.             
152200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
152900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153400*    -- TAB2-IND = 46 (X'2E')                                             
153500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
153900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
154000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
154100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
154200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
154300     03  PIC X(16) VALUE X'FFFDE000E001E002E003E004E005E006'.             
154400     03  PIC X(16) VALUE X'E007E008E009E00AE00BE00CE00DE00E'.             
154500     03  PIC X(16) VALUE X'E00FE010E011E012E013E014E015E016'.             
154600     03  PIC X(16) VALUE X'E017E018E019E01AE01BE01CE01DE01E'.             
154700     03  PIC X(16) VALUE X'E01FE020E021E022E023E024E025E026'.             
154800     03  PIC X(16) VALUE X'E027E028E029E02AE02BE02CE02DE02E'.             
154900     03  PIC X(16) VALUE X'E02FE030E031E032E033E034E035E036'.             
155000     03  PIC X(16) VALUE X'E037E038E039E03AE03BE03CE03DE03E'.             
155100     03  PIC X(16) VALUE X'FFFDE03FE040E041E042E043E044E045'.             
155200     03  PIC X(16) VALUE X'E046E047E048E049E04AE04BE04CE04D'.             
155300     03  PIC X(16) VALUE X'E04EE04FE050E051E052E053E054E055'.             
155400     03  PIC X(16) VALUE X'E056E057E058E059E05AE05BE05CE05D'.             
155500     03  PIC X(16) VALUE X'E05EE05FE060E061E062E063E064E065'.             
155600     03  PIC X(16) VALUE X'E066E067E068E069E06AE06BE06CE06D'.             
155700     03  PIC X(16) VALUE X'E06EE06FE070E071E072E073E074E075'.             
155800     03  PIC X(16) VALUE X'E076E077E078E079E07AE07BE07CE07D'.             
155900     03  PIC X(16) VALUE X'E07EE07FE080E081E082E083E084E085'.             
156000     03  PIC X(16) VALUE X'E086E087E088E089E08AE08BE08CE08D'.             
156100     03  PIC X(16) VALUE X'E08EE08FE090E091E092E093E094E095'.             
156200     03  PIC X(16) VALUE X'E096E097E098E099E09AE09BE09CE09D'.             
156300     03  PIC X(16) VALUE X'E09EE09FE0A0E0A1E0A2E0A3E0A4E0A5'.             
156400     03  PIC X(16) VALUE X'E0A6E0A7E0A8E0A9E0AAE0ABE0ACE0AD'.             
156500     03  PIC X(16) VALUE X'E0AEE0AFE0B0E0B1E0B2E0B3E0B4E0B5'.             
156600     03  PIC X(16) VALUE X'E0B6E0B7E0B8E0B9E0BAE0BBFFFDFFFD'.             
156700*    -- TAB2-IND = 47 (X'2F')                                             
156800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
156900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
157600     03  PIC X(16) VALUE X'FFFDE0BCE0BDE0BEE0BFE0C0E0C1E0C2'.             
157700     03  PIC X(16) VALUE X'E0C3E0C4E0C5E0C6E0C7E0C8E0C9E0CA'.             
157800     03  PIC X(16) VALUE X'E0CBE0CCE0CDE0CEE0CFE0D0E0D1E0D2'.             
157900     03  PIC X(16) VALUE X'E0D3E0D4E0D5E0D6E0D7E0D8E0D9E0DA'.             
158000     03  PIC X(16) VALUE X'E0DBE0DCE0DDE0DEE0DFE0E0E0E1E0E2'.             
158100     03  PIC X(16) VALUE X'E0E3E0E4E0E5E0E6E0E7E0E8E0E9E0EA'.             
158200     03  PIC X(16) VALUE X'E0EBE0ECE0EDE0EEE0EFE0F0E0F1E0F2'.             
158300     03  PIC X(16) VALUE X'E0F3E0F4E0F5E0F6E0F7E0F8E0F9E0FA'.             
158400     03  PIC X(16) VALUE X'FFFDE0FBE0FCE0FDE0FEE0FFE100E101'.             
158500     03  PIC X(16) VALUE X'E102E103E104E105E106E107E108E109'.             
158600     03  PIC X(16) VALUE X'E10AE10BE10CE10DE10EE10FE110E111'.             
158700     03  PIC X(16) VALUE X'E112E113E114E115E116E117E118E119'.             
158800     03  PIC X(16) VALUE X'E11AE11BE11CE11DE11EE11FE120E121'.             
158900     03  PIC X(16) VALUE X'E122E123E124E125E126E127E128E129'.             
159000     03  PIC X(16) VALUE X'E12AE12BE12CE12DE12EE12FE130E131'.             
159100     03  PIC X(16) VALUE X'E132E133E134E135E136E137E138E139'.             
159200     03  PIC X(16) VALUE X'E13AE13BE13CE13DE13EE13FE140E141'.             
159300     03  PIC X(16) VALUE X'E142E143E144E145E146E147E148E149'.             
159400     03  PIC X(16) VALUE X'E14AE14BE14CE14DE14EE14FE150E151'.             
159500     03  PIC X(16) VALUE X'E152E153E154E155E156E157E158E159'.             
159600     03  PIC X(16) VALUE X'E15AE15BE15CE15DE15EE15FE160E161'.             
159700     03  PIC X(16) VALUE X'E162E163E164E165E166E167E168E169'.             
159800     03  PIC X(16) VALUE X'E16AE16BE16CE16DE16EE16FE170E171'.             
159900     03  PIC X(16) VALUE X'E172E173E174E175E176E177FFFDFFFD'.             
160000*    -- TAB2-IND = 48 (X'30')                                             
160100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
160900     03  PIC X(16) VALUE X'FFFDE178E179E17AE17BE17CE17DE17E'.             
161000     03  PIC X(16) VALUE X'E17FE180E181E182E183E184E185E186'.             
161100     03  PIC X(16) VALUE X'E187E188E189E18AE18BE18CE18DE18E'.             
161200     03  PIC X(16) VALUE X'E18FE190E191E192E193E194E195E196'.             
161300     03  PIC X(16) VALUE X'E197E198E199E19AE19BE19CE19DE19E'.             
161400     03  PIC X(16) VALUE X'E19FE1A0E1A1E1A2E1A3E1A4E1A5E1A6'.             
161500     03  PIC X(16) VALUE X'E1A7E1A8E1A9E1AAE1ABE1ACE1ADE1AE'.             
161600     03  PIC X(16) VALUE X'E1AFE1B0E1B1E1B2E1B3E1B4E1B5E1B6'.             
161700     03  PIC X(16) VALUE X'FFFDE1B7E1B8E1B9E1BAE1BBE1BCE1BD'.             
161800     03  PIC X(16) VALUE X'E1BEE1BFE1C0E1C1E1C2E1C3E1C4E1C5'.             
161900     03  PIC X(16) VALUE X'E1C6E1C7E1C8E1C9E1CAE1CBE1CCE1CD'.             
162000     03  PIC X(16) VALUE X'E1CEE1CFE1D0E1D1E1D2E1D3E1D4E1D5'.             
162100     03  PIC X(16) VALUE X'E1D6E1D7E1D8E1D9E1DAE1DBE1DCE1DD'.             
162200     03  PIC X(16) VALUE X'E1DEE1DFE1E0E1E1E1E2E1E3E1E4E1E5'.             
162300     03  PIC X(16) VALUE X'E1E6E1E7E1E8E1E9E1EAE1EBE1ECE1ED'.             
162400     03  PIC X(16) VALUE X'E1EEE1EFE1F0E1F1E1F2E1F3E1F4E1F5'.             
162500     03  PIC X(16) VALUE X'E1F6E1F7E1F8E1F9E1FAE1FBE1FCE1FD'.             
162600     03  PIC X(16) VALUE X'E1FEE1FFE200E201E202E203E204E205'.             
162700     03  PIC X(16) VALUE X'E206E207E208E209E20AE20BE20CE20D'.             
162800     03  PIC X(16) VALUE X'E20EE20FE210E211E212E213E214E215'.             
162900     03  PIC X(16) VALUE X'E216E217E218E219E21AE21BE21CE21D'.             
163000     03  PIC X(16) VALUE X'E21EE21FE220E221E222E223E224E225'.             
163100     03  PIC X(16) VALUE X'E226E227E228E229E22AE22BE22CE22D'.             
163200     03  PIC X(16) VALUE X'E22EE22FE230E231E232E233FFFDFFFD'.             
163300*    -- TAB2-IND = 49 (X'31')                                             
163400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
163500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
163600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
163700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
163800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
163900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
164000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
164100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
164200     03  PIC X(16) VALUE X'FFFDE234E235E236E237E238E239E23A'.             
164300     03  PIC X(16) VALUE X'E23BE23CE23DE23EE23FE240E241E242'.             
164400     03  PIC X(16) VALUE X'E243E244E245E246E247E248E249E24A'.             
164500     03  PIC X(16) VALUE X'E24BE24CE24DE24EE24FE250E251E252'.             
164600     03  PIC X(16) VALUE X'E253E254E255E256E257E258E259E25A'.             
164700     03  PIC X(16) VALUE X'E25BE25CE25DE25EE25FE260E261E262'.             
164800     03  PIC X(16) VALUE X'E263E264E265E266E267E268E269E26A'.             
164900     03  PIC X(16) VALUE X'E26BE26CE26DE26EE26FE270E271E272'.             
165000     03  PIC X(16) VALUE X'FFFDE273E274E275E276E277E278E279'.             
165100     03  PIC X(16) VALUE X'E27AE27BE27CE27DE27EE27FE280E281'.             
165200     03  PIC X(16) VALUE X'E282E283E284E285E286E287E288E289'.             
165300     03  PIC X(16) VALUE X'E28AE28BE28CE28DE28EE28FE290E291'.             
165400     03  PIC X(16) VALUE X'E292E293E294E295E296E297E298E299'.             
165500     03  PIC X(16) VALUE X'E29AE29BE29CE29DE29EE29FE2A0E2A1'.             
165600     03  PIC X(16) VALUE X'E2A2E2A3E2A4E2A5E2A6E2A7E2A8E2A9'.             
165700     03  PIC X(16) VALUE X'E2AAE2ABE2ACE2ADE2AEE2AFE2B0E2B1'.             
165800     03  PIC X(16) VALUE X'E2B2E2B3E2B4E2B5E2B6E2B7E2B8E2B9'.             
165900     03  PIC X(16) VALUE X'E2BAE2BBE2BCE2BDE2BEE2BFE2C0E2C1'.             
166000     03  PIC X(16) VALUE X'E2C2E2C3E2C4E2C5E2C6E2C7E2C8E2C9'.             
166100     03  PIC X(16) VALUE X'E2CAE2CBE2CCE2CDE2CEE2CFE2D0E2D1'.             
166200     03  PIC X(16) VALUE X'E2D2E2D3E2D4E2D5E2D6E2D7E2D8E2D9'.             
166300     03  PIC X(16) VALUE X'E2DAE2DBE2DCE2DDE2DEE2DFE2E0E2E1'.             
166400     03  PIC X(16) VALUE X'E2E2E2E3E2E4E2E5E2E6E2E7E2E8E2E9'.             
166500     03  PIC X(16) VALUE X'E2EAE2EBE2ECE2EDE2EEE2EFFFFDFFFD'.             
166600*    -- TAB2-IND = 50 (X'32')                                             
166700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
166800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
166900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
167500     03  PIC X(16) VALUE X'FFFDE2F0E2F1E2F2E2F3E2F4E2F5E2F6'.             
167600     03  PIC X(16) VALUE X'E2F7E2F8E2F9E2FAE2FBE2FCE2FDE2FE'.             
167700     03  PIC X(16) VALUE X'E2FFE300E301E302E303E304E305E306'.             
167800     03  PIC X(16) VALUE X'E307E308E309E30AE30BE30CE30DE30E'.             
167900     03  PIC X(16) VALUE X'E30FE310E311E312E313E314E315E316'.             
168000     03  PIC X(16) VALUE X'E317E318E319E31AE31BE31CE31DE31E'.             
168100     03  PIC X(16) VALUE X'E31FE320E321E322E323E324E325E326'.             
168200     03  PIC X(16) VALUE X'E327E328E329E32AE32BE32CE32DE32E'.             
168300     03  PIC X(16) VALUE X'FFFDE32FE330E331E332E333E334E335'.             
168400     03  PIC X(16) VALUE X'E336E337E338E339E33AE33BE33CE33D'.             
168500     03  PIC X(16) VALUE X'E33EE33FE340E341E342E343E344E345'.             
168600     03  PIC X(16) VALUE X'E346E347E348E349E34AE34BE34CE34D'.             
168700     03  PIC X(16) VALUE X'E34EE34FE350E351E352E353E354E355'.             
168800     03  PIC X(16) VALUE X'E356E357E358E359E35AE35BE35CE35D'.             
168900     03  PIC X(16) VALUE X'E35EE35FE360E361E362E363E364E365'.             
169000     03  PIC X(16) VALUE X'E366E367E368E369E36AE36BE36CE36D'.             
169100     03  PIC X(16) VALUE X'E36EE36FE370E371E372E373E374E375'.             
169200     03  PIC X(16) VALUE X'E376E377E378E379E37AE37BE37CE37D'.             
169300     03  PIC X(16) VALUE X'E37EE37FE380E381E382E383E384E385'.             
169400     03  PIC X(16) VALUE X'E386E387E388E389E38AE38BE38CE38D'.             
169500     03  PIC X(16) VALUE X'E38EE38FE390E391E392E393E394E395'.             
169600     03  PIC X(16) VALUE X'E396E397E398E399E39AE39BE39CE39D'.             
169700     03  PIC X(16) VALUE X'E39EE39FE3A0E3A1E3A2E3A3E3A4E3A5'.             
169800     03  PIC X(16) VALUE X'E3A6E3A7E3A8E3A9E3AAE3ABFFFDFFFD'.             
169900*    -- TAB2-IND = 51 (X'33')                                             
170000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
170800     03  PIC X(16) VALUE X'FFFDE3ACE3ADE3AEE3AFE3B0E3B1E3B2'.             
170900     03  PIC X(16) VALUE X'E3B3E3B4E3B5E3B6E3B7E3B8E3B9E3BA'.             
171000     03  PIC X(16) VALUE X'E3BBE3BCE3BDE3BEE3BFE3C0E3C1E3C2'.             
171100     03  PIC X(16) VALUE X'E3C3E3C4E3C5E3C6E3C7E3C8E3C9E3CA'.             
171200     03  PIC X(16) VALUE X'E3CBE3CCE3CDE3CEE3CFE3D0E3D1E3D2'.             
171300     03  PIC X(16) VALUE X'E3D3E3D4E3D5E3D6E3D7E3D8E3D9E3DA'.             
171400     03  PIC X(16) VALUE X'E3DBE3DCE3DDE3DEE3DFE3E0E3E1E3E2'.             
171500     03  PIC X(16) VALUE X'E3E3E3E4E3E5E3E6E3E7E3E8E3E9E3EA'.             
171600     03  PIC X(16) VALUE X'FFFDE3EBE3ECE3EDE3EEE3EFE3F0E3F1'.             
171700     03  PIC X(16) VALUE X'E3F2E3F3E3F4E3F5E3F6E3F7E3F8E3F9'.             
171800     03  PIC X(16) VALUE X'E3FAE3FBE3FCE3FDE3FEE3FFE400E401'.             
171900     03  PIC X(16) VALUE X'E402E403E404E405E406E407E408E409'.             
172000     03  PIC X(16) VALUE X'E40AE40BE40CE40DE40EE40FE410E411'.             
172100     03  PIC X(16) VALUE X'E412E413E414E415E416E417E418E419'.             
172200     03  PIC X(16) VALUE X'E41AE41BE41CE41DE41EE41FE420E421'.             
172300     03  PIC X(16) VALUE X'E422E423E424E425E426E427E428E429'.             
172400     03  PIC X(16) VALUE X'E42AE42BE42CE42DE42EE42FE430E431'.             
172500     03  PIC X(16) VALUE X'E432E433E434E435E436E437E438E439'.             
172600     03  PIC X(16) VALUE X'E43AE43BE43CE43DE43EE43FE440E441'.             
172700     03  PIC X(16) VALUE X'E442E443E444E445E446E447E448E449'.             
172800     03  PIC X(16) VALUE X'E44AE44BE44CE44DE44EE44FE450E451'.             
172900     03  PIC X(16) VALUE X'E452E453E454E455E456E457E458E459'.             
173000     03  PIC X(16) VALUE X'E45AE45BE45CE45DE45EE45FE460E461'.             
173100     03  PIC X(16) VALUE X'E462E463E464E465E466E467FFFDFFFD'.             
173200*    -- TAB2-IND = 52 (X'34')                                             
173300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
173900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
174000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
174100     03  PIC X(16) VALUE X'FFFDE468E469E46AE46BE46CE46DE46E'.             
174200     03  PIC X(16) VALUE X'E46FE470E471E472E473E474E475E476'.             
174300     03  PIC X(16) VALUE X'E477E478E479E47AE47BE47CE47DE47E'.             
174400     03  PIC X(16) VALUE X'E47FE480E481E482E483E484E485E486'.             
174500     03  PIC X(16) VALUE X'E487E488E489E48AE48BE48CE48DE48E'.             
174600     03  PIC X(16) VALUE X'E48FE490E491E492E493E494E495E496'.             
174700     03  PIC X(16) VALUE X'E497E498E499E49AE49BE49CE49DE49E'.             
174800     03  PIC X(16) VALUE X'E49FE4A0E4A1E4A2E4A3E4A4E4A5E4A6'.             
174900     03  PIC X(16) VALUE X'FFFDE4A7E4A8E4A9E4AAE4ABE4ACE4AD'.             
175000     03  PIC X(16) VALUE X'E4AEE4AFE4B0E4B1E4B2E4B3E4B4E4B5'.             
175100     03  PIC X(16) VALUE X'E4B6E4B7E4B8E4B9E4BAE4BBE4BCE4BD'.             
175200     03  PIC X(16) VALUE X'E4BEE4BFE4C0E4C1E4C2E4C3E4C4E4C5'.             
175300     03  PIC X(16) VALUE X'E4C6E4C7E4C8E4C9E4CAE4CBE4CCE4CD'.             
175400     03  PIC X(16) VALUE X'E4CEE4CFE4D0E4D1E4D2E4D3E4D4E4D5'.             
175500     03  PIC X(16) VALUE X'E4D6E4D7E4D8E4D9E4DAE4DBE4DCE4DD'.             
175600     03  PIC X(16) VALUE X'E4DEE4DFE4E0E4E1E4E2E4E3E4E4E4E5'.             
175700     03  PIC X(16) VALUE X'E4E6E4E7E4E8E4E9E4EAE4EBE4ECE4ED'.             
175800     03  PIC X(16) VALUE X'E4EEE4EFE4F0E4F1E4F2E4F3E4F4E4F5'.             
175900     03  PIC X(16) VALUE X'E4F6E4F7E4F8E4F9E4FAE4FBE4FCE4FD'.             
176000     03  PIC X(16) VALUE X'E4FEE4FFE500E501E502E503E504E505'.             
176100     03  PIC X(16) VALUE X'E506E507E508E509E50AE50BE50CE50D'.             
176200     03  PIC X(16) VALUE X'E50EE50FE510E511E512E513E514E515'.             
176300     03  PIC X(16) VALUE X'E516E517E518E519E51AE51BE51CE51D'.             
176400     03  PIC X(16) VALUE X'E51EE51FE520E521E522E523FFFDFFFD'.             
176500*    -- TAB2-IND = 53 (X'35')                                             
176600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
176700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
176800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
176900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
177000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
177100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
177200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
177300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
177400     03  PIC X(16) VALUE X'FFFDE524E525E526E527E528E529E52A'.             
177500     03  PIC X(16) VALUE X'E52BE52CE52DE52EE52FE530E531E532'.             
177600     03  PIC X(16) VALUE X'E533E534E535E536E537E538E539E53A'.             
177700     03  PIC X(16) VALUE X'E53BE53CE53DE53EE53FE540E541E542'.             
177800     03  PIC X(16) VALUE X'E543E544E545E546E547E548E549E54A'.             
177900     03  PIC X(16) VALUE X'E54BE54CE54DE54EE54FE550E551E552'.             
178000     03  PIC X(16) VALUE X'E553E554E555E556E557E558E559E55A'.             
178100     03  PIC X(16) VALUE X'E55BE55CE55DE55EE55FE560E561E562'.             
178200     03  PIC X(16) VALUE X'FFFDE563E564E565E566E567E568E569'.             
178300     03  PIC X(16) VALUE X'E56AE56BE56CE56DE56EE56FE570E571'.             
178400     03  PIC X(16) VALUE X'E572E573E574E575E576E577E578E579'.             
178500     03  PIC X(16) VALUE X'E57AE57BE57CE57DE57EE57FE580E581'.             
178600     03  PIC X(16) VALUE X'E582E583E584E585E586E587E588E589'.             
178700     03  PIC X(16) VALUE X'E58AE58BE58CE58DE58EE58FE590E591'.             
178800     03  PIC X(16) VALUE X'E592E593E594E595E596E597E598E599'.             
178900     03  PIC X(16) VALUE X'E59AE59BE59CE59DE59EE59FE5A0E5A1'.             
179000     03  PIC X(16) VALUE X'E5A2E5A3E5A4E5A5E5A6E5A7E5A8E5A9'.             
179100     03  PIC X(16) VALUE X'E5AAE5ABE5ACE5ADE5AEE5AFE5B0E5B1'.             
179200     03  PIC X(16) VALUE X'E5B2E5B3E5B4E5B5E5B6E5B7E5B8E5B9'.             
179300     03  PIC X(16) VALUE X'E5BAE5BBE5BCE5BDE5BEE5BFE5C0E5C1'.             
179400     03  PIC X(16) VALUE X'E5C2E5C3E5C4E5C5E5C6E5C7E5C8E5C9'.             
179500     03  PIC X(16) VALUE X'E5CAE5CBE5CCE5CDE5CEE5CFE5D0E5D1'.             
179600     03  PIC X(16) VALUE X'E5D2E5D3E5D4E5D5E5D6E5D7E5D8E5D9'.             
179700     03  PIC X(16) VALUE X'E5DAE5DBE5DCE5DDE5DEE5DFFFFDFFFD'.             
179800*    -- TAB2-IND = 54 (X'36')                                             
179900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180000     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180100     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
180700     03  PIC X(16) VALUE X'FFFDE5E0E5E1E5E2E5E3E5E4E5E5E5E6'.             
180800     03  PIC X(16) VALUE X'E5E7E5E8E5E9E5EAE5EBE5ECE5EDE5EE'.             
180900     03  PIC X(16) VALUE X'E5EFE5F0E5F1E5F2E5F3E5F4E5F5E5F6'.             
181000     03  PIC X(16) VALUE X'E5F7E5F8E5F9E5FAE5FBE5FCE5FDE5FE'.             
181100     03  PIC X(16) VALUE X'E5FFE600E601E602E603E604E605E606'.             
181200     03  PIC X(16) VALUE X'E607E608E609E60AE60BE60CE60DE60E'.             
181300     03  PIC X(16) VALUE X'E60FE610E611E612E613E614E615E616'.             
181400     03  PIC X(16) VALUE X'E617E618E619E61AE61BE61CE61DE61E'.             
181500     03  PIC X(16) VALUE X'FFFDE61FE620E621E622E623E624E625'.             
181600     03  PIC X(16) VALUE X'E626E627E628E629E62AE62BE62CE62D'.             
181700     03  PIC X(16) VALUE X'E62EE62FE630E631E632E633E634E635'.             
181800     03  PIC X(16) VALUE X'E636E637E638E639E63AE63BE63CE63D'.             
181900     03  PIC X(16) VALUE X'E63EE63FE640E641E642E643E644E645'.             
182000     03  PIC X(16) VALUE X'E646E647E648E649E64AE64BE64CE64D'.             
182100     03  PIC X(16) VALUE X'E64EE64FE650E651E652E653E654E655'.             
182200     03  PIC X(16) VALUE X'E656E657E658E659E65AE65BE65CE65D'.             
182300     03  PIC X(16) VALUE X'E65EE65FE660E661E662E663E664E665'.             
182400     03  PIC X(16) VALUE X'E666E667E668E669E66AE66BE66CE66D'.             
182500     03  PIC X(16) VALUE X'E66EE66FE670E671E672E673E674E675'.             
182600     03  PIC X(16) VALUE X'E676E677E678E679E67AE67BE67CE67D'.             
182700     03  PIC X(16) VALUE X'E67EE67FE680E681E682E683E684E685'.             
182800     03  PIC X(16) VALUE X'E686E687E688E689E68AE68BE68CE68D'.             
182900     03  PIC X(16) VALUE X'E68EE68FE690E691E692E693E694E695'.             
183000     03  PIC X(16) VALUE X'E696E697E698E699E69AE69BFFFDFFFD'.             
183100*    -- TAB2-IND = 55 (X'37')                                             
183200     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183300     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183400     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183500     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183600     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183700     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183800     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
183900     03  PIC X(16) VALUE X'FFFDFFFDFFFDFFFDFFFDFFFDFFFDFFFD'.             
184000     03  PIC X(16) VALUE X'FFFDE69CE69DE69EE69FE6A0E6A1E6A2'.             
184100     03  PIC X(16) VALUE X'E6A3E6A4E6A5E6A6E6A7E6A8E6A9E6AA'.             
184200     03  PIC X(16) VALUE X'E6ABE6ACE6ADE6AEE6AFE6B0E6B1E6B2'.             
184300     03  PIC X(16) VALUE X'E6B3E6B4E6B5E6B6E6B7E6B8E6B9E6BA'.             
184400     03  PIC X(16) VALUE X'E6BBE6BCE6BDE6BEE6BFE6C0E6C1E6C2'.             
184500     03  PIC X(16) VALUE X'E6C3E6C4E6C5E6C6E6C7E6C8E6C9E6CA'.             
184600     03  PIC X(16) VALUE X'E6CBE6CCE6CDE6CEE6CFE6D0E6D1E6D2'.             
184700     03  PIC X(16) VALUE X'E6D3E6D4E6D5E6D6E6D7E6D8E6D9E6DA'.             
184800     03  PIC X(16) VALUE X'FFFDE6DBE6DCE6DDE6DEE6DFE6E0E6E1'.             
184900     03  PIC X(16) VALUE X'E6E2E6E3E6E4E6E5E6E6E6E7E6E8E6E9'.             
185000     03  PIC X(16) VALUE X'E6EAE6EBE6ECE6EDE6EEE6EFE6F0E6F1'.             
185100     03  PIC X(16) VALUE X'E6F2E6F3E6F4E6F5E6F6E6F7E6F8E6F9'.             
185200     03  PIC X(16) VALUE X'E6FAE6FBE6FCE6FDE6FEE6FFE700E701'.             
185300     03  PIC X(16) VALUE X'E702E703E704E705E706E707E708E709'.             
185400     03  PIC X(16) VALUE X'E70AE70BE70CE70DE70EE70FE710E711'.             
185500     03  PIC X(16) VALUE X'E712E713E714E715E716E717E718E719'.             
185600     03  PIC X(16) VALUE X'E71AE71BE71CE71DE71EE71FE720E721'.             
185700     03  PIC X(16) VALUE X'E722E723E724E725E726E727E728E729'.             
185800     03  PIC X(16) VALUE X'E72AE72BE72CE72DE72EE72FE730E731'.             
185900     03  PIC X(16) VALUE X'E732E733E734E735E736E737E738E739'.             
186000     03  PIC X(16) VALUE X'E73AE73BE73CE73DE73EE73FE740E741'.             
186100     03  PIC X(16) VALUE X'E742E743E744E745E746E747E748E749'.             
186200     03  PIC X(16) VALUE X'E74AE74BE74CE74DE74EE74FE750E751'.             
186300     03  PIC X(16) VALUE X'E752E753E754E755E756E757FFFDFFFD'.             
186400 01  FILLER  REDEFINES TAB2-CP837-TO-UCS.                                 
186500     03  FILLER                    OCCURS 55.                             
186600       05  CP837-TO-UCS-X          OCCURS 256.                            
186700         07  CP837-TO-UCS  PIC S9(4) COMP.                                
