000100     EJECT                                                                
000110*    ------ JAPANESE SINGLE BYTE CODE (KATAKANA) ----------               
000120*    ------ (ALTERNATIVE CODE USED TOGETHER WITH SMALL ----               
000130*    ------ EUROPEAN LETTERS. SEE WCNV290U FOR NORMAL CODE.               
000200*    -- CREATED BY REXX UNITAB.                                           
000300*    -- CONV FROM CCS-ID 1027 (HEX 0403) TO UNICODE UCS-2                 
000400*    -- DATA FROM D:/MBTABS/UCSTAB/040334B0.U1D                           
000500*    -- SBDS -> DBCS TABLE. ELEMENT N POINTS TO UCS VALUE                 
000600*    -- (HEXADECIMAL) FOR BYTE VALUE N-1.                                 
000700*    -- INVALID VALUES -> 001A (SUB)                                      
000800 01  TAB-CP1027-TO-UCS.                                                   
000900     03  PIC X(16) VALUE X'0000000100020003009C00090086007F'.             
001000     03  PIC X(16) VALUE X'0097008D008E000B000C000D000E000F'.             
001100     03  PIC X(16) VALUE X'0010001100120013009D008500080087'.             
001200     03  PIC X(16) VALUE X'001800190092008F001C001D001E001F'.             
001300     03  PIC X(16) VALUE X'00800081008200830084000A0017001B'.             
001400     03  PIC X(16) VALUE X'00880089008A008B008C000500060007'.             
001500     03  PIC X(16) VALUE X'00900091001600930094009500960004'.             
001600     03  PIC X(16) VALUE X'00980099009A009B00140015009E001A'.             
001700     03  PIC X(16) VALUE X'0020001AFF61FF62FF63FF64FF65FF66'.             
001800     03  PIC X(16) VALUE X'FF67FF6800A2002E003C0028002B007C'.             
001900     03  PIC X(16) VALUE X'0026FF69FF6AFF6BFF6CFF6DFF6EFF6F'.             
002000     03  PIC X(16) VALUE X'FF70FF7100210024002A0029003B00AC'.             
002100     03  PIC X(16) VALUE X'002D002FFF72FF73FF74FF75FF76FF77'.             
002200     03  PIC X(16) VALUE X'FF78FF79001A002C0025005F003E003F'.             
002300     03  PIC X(16) VALUE X'FF7AFF7BFF7CFF7DFF7EFF7FFF80FF81'.             
002400     03  PIC X(16) VALUE X'FF820060003A002300400027003D0022'.             
002500     03  PIC X(16) VALUE X'001A0061006200630064006500660067'.             
002600     03  PIC X(16) VALUE X'00680069FF83FF84FF85FF86FF87FF88'.             
002700     03  PIC X(16) VALUE X'001A006A006B006C006D006E006F0070'.             
002800     03  PIC X(16) VALUE X'00710072FF89FF8AFF8BFF8CFF8DFF8E'.             
002900     03  PIC X(16) VALUE X'203E007E007300740075007600770078'.             
003000     03  PIC X(16) VALUE X'0079007AFF8FFF90FF91005BFF92FF93'.             
003100     03  PIC X(16) VALUE X'005E00A300A5FF94FF95FF96FF97FF98'.             
003200     03  PIC X(16) VALUE X'FF99FF9AFF9BFF9CFF9D005DFF9EFF9F'.             
003300     03  PIC X(16) VALUE X'007B0041004200430044004500460047'.             
003400     03  PIC X(16) VALUE X'00480049001A001A001A001A001A001A'.             
003500     03  PIC X(16) VALUE X'007D004A004B004C004D004E004F0050'.             
003600     03  PIC X(16) VALUE X'00510052001A001A001A001A001A001A'.             
003700     03  PIC X(16) VALUE X'005C001A005300540055005600570058'.             
003800     03  PIC X(16) VALUE X'0059005A001A001A001A001A001A001A'.             
003900     03  PIC X(16) VALUE X'00300031003200330034003500360037'.             
004000     03  PIC X(16) VALUE X'00380039001A001A001A001A001A009F'.             
004100 01  FILLER  REDEFINES TAB-CP1027-TO-UCS.                                 
004200     03  CP1027-TO-UCS-X   OCCURS 256.                                    
004300       05  CP1027-TO-UCS     PIC S9(4) COMP.                              
