000100     EJECT                                                                
000200*    --------------- THAI SINGLE BYTE CODE ---------------                
000300*    -- CREATED BY REXX EBCTAB.                                           
000400*    -- CONV FROM UNICODE UCS-2 TO CODE PAGE 838                          
000500*    -- (= CCS-ID 9030 (HEX 2346)).                                       
000600*    -- DATA FROM D:/MBTABS/UCSTAB/34B02346.U1D                           
000700*    -- DBCS -> SBCS TABLE. FIRST SOURCE BYTE IS USED AS                  
000800*    -- INDEX INTO FIRST TABLE WHICH GIVES ROW NUMBER OF                  
000900*    -- SECOND TABLE. SECOND SOURCE BYTE IS USED AS INDEX                 
001000*    -- INTO THAT ROW WHICH CONTAINS THE SBCS VALUE (HEX)                 
001100*    -- FOR THE TWO SOURCE BYTES.                                         
001200*    -- INVALID SOURCE VALUES -> HEX 3F (SBCS SUB)                        
001300 01  TAB1-UCS-TO-CP838.                                                   
001400     03  PIC X(16) VALUE X'00020001000100010001000100010001'.             
001500     03  PIC X(16) VALUE X'00010001000100010001000100030001'.             
001600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004100     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004500     03  PIC X(16) VALUE X'00010001000100010001000100010004'.             
004600 01  FILLER  REDEFINES TAB1-UCS-TO-CP838.                                 
004700     03  TAB2-IND-U838  PIC S9(4) COMP  OCCURS 256.                       
004800                                                                          
004900 01  TAB2-UCS-TO-CP838.                                                   
005000*    -- TAB2-IND = 1 (X'1')                                               
005100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
005900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
006700*    -- TAB2-IND = 2 (X'2')                                               
006800     03  PIC X(16) VALUE X'00010203372D2E2F1605250B0C0D0E0F'.             
006900     03  PIC X(16) VALUE X'101112133C3D322618193F271C1D1E1F'.             
007000     03  PIC X(16) VALUE X'405A7F7B5B6C507D4D5D5C4E6B604B61'.             
007100     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
007200     03  PIC X(16) VALUE X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
007300     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E949E059696D'.             
007400     03  PIC X(16) VALUE X'79818283848586878889919293949596'.             
007500     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A9C04FD0A107'.             
007600     03  PIC X(16) VALUE X'202122232415061728292A2B2C090A1B'.             
007700     03  PIC X(16) VALUE X'30311A333435360838393A3B04143EFF'.             
007800     03  PIC X(16) VALUE X'413F4A3F3F3F6A3F3F3F3F3F5F3F3F3F'.             
007900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
008400*    -- TAB2-IND = 3 (X'3')                                               
008500     03  PIC X(16) VALUE X'3F424344454647485253545556575862'.             
008600     03  PIC X(16) VALUE X'636465666768727374757677788A8B8C'.             
008700     03  PIC X(16) VALUE X'8D8E8F9A9B9C9D9E9FAAABACADAEAFBA'.             
008800     03  PIC X(16) VALUE X'BBBCBDBEBFCBCCCDCECFDA3F3F3F3F70'.             
008900     03  PIC X(16) VALUE X'DBDCDDDEDFEAEBECEDEEEFFAFBFC7180'.             
009000     03  PIC X(16) VALUE X'B0B1B2B3B4B5B6B7B8B990A03F3F3F3F'.             
009100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
009900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010100*    -- TAB2-IND = 4 (X'4')                                               
010200     03  PIC X(16) VALUE X'3F5A7F7B5B6C507D4D5D5C4E6B604B61'.             
010300     03  PIC X(16) VALUE X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'.             
010400     03  PIC X(16) VALUE X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'.             
010500     03  PIC X(16) VALUE X'D7D8D9E2E3E4E5E6E7E8E949E059696D'.             
010600     03  PIC X(16) VALUE X'79818283848586878889919293949596'.             
010700     03  PIC X(16) VALUE X'979899A2A3A4A5A6A7A8A9C04FD0A13F'.             
010800     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
010900     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011000     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011100     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011200     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011300     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011400     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011500     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011600     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011700     03  PIC X(16) VALUE X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'.             
011800 01  FILLER  REDEFINES TAB2-UCS-TO-CP838.                                 
011900     03  FILLER                    OCCURS 4.                              
012000       05  UCS-TO-CP838   PIC X  OCCURS 256.                              
