000100     EJECT                                                                
000200*    ------ TRADITIONAL CHINESE (TAIWAN) DOUBLE BYTE CODE ------          
000210*    -- CREATED BY REXX EBCTAB2.                                          
000300*    -- CONV FROM UNICODE UCS-2 TO CCS-ID 835 (HEX 0343)                  
000400*    -- DATA FROM D:/MBTABS/UCSTAB/34B00343.U2D                           
000500*    -- DBCS -> DBCS TABLE. FIRST SOURCE BYTE IS USED AS                  
000600*    -- INDEX INTO FIRST TABLE WHICH GIVES ROW NUMBER OF                  
000700*    -- SECOND TABLE. SECOND SOURCE BYTE IS USED AS INDEX                 
000800*    -- INTO THAT ROW WHICH CONTAINS THE DBCS VALUE (HEX)                 
000900*    -- FOR THE TWO SOURCE BYTES.                                         
001000*    -- INVALID SOURCE VALUES -> HEX FEFE (DBCS SUB)                      
001100 01  TAB1-UCS-TO-CP835.                                                   
001200     03  PIC X(16) VALUE X'00020001000300040005000100010001'.             
001300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001600     03  PIC X(16) VALUE X'0006000700080009000A000B000C000D'.             
001700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
001800     03  PIC X(16) VALUE X'000E000F001000110001000100010001'.             
001900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002000     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
002100     03  PIC X(16) VALUE X'00010001000100010001000100120013'.             
002200     03  PIC X(16) VALUE X'001400150016001700180019001A001B'.             
002300     03  PIC X(16) VALUE X'001C001D001E001F0020002100220023'.             
002400     03  PIC X(16) VALUE X'002400250026002700280029002A002B'.             
002500     03  PIC X(16) VALUE X'002C002D002E002F0030003100320033'.             
002600     03  PIC X(16) VALUE X'003400350036003700380039003A003B'.             
002700     03  PIC X(16) VALUE X'003C003D003E003F0040004100420043'.             
002800     03  PIC X(16) VALUE X'004400450046004700480049004A004B'.             
002900     03  PIC X(16) VALUE X'004C004D004E004F0050005100520053'.             
003000     03  PIC X(16) VALUE X'005400550056005700580059005A005B'.             
003100     03  PIC X(16) VALUE X'005C005D005E005F0060006100620063'.             
003200     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003300     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003400     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003500     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003600     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003700     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003800     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
003900     03  PIC X(16) VALUE X'00010001000100010001000100010001'.             
004000     03  PIC X(16) VALUE X'006400650066006700680069006A006B'.             
004100     03  PIC X(16) VALUE X'006C006D006E006F0070007100720073'.             
004200     03  PIC X(16) VALUE X'007400750076007700780079007A007B'.             
004300     03  PIC X(16) VALUE X'007C0001007D000100010001007E007F'.             
004400 01  FILLER  REDEFINES TAB1-UCS-TO-CP835.                                 
004500     03  TAB2-IND-U835  PIC S9(4) COMP  OCCURS 256.                       
004600                                                                          
004700 01  TAB2-UCS-TO-CP835.                                                   
004800*    -- TAB2-IND = 1 (X'1')                                               
004900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
005900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
006900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
007900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008100*    -- TAB2-IND = 2 (X'2')                                               
008200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
008900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
009900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE446A'.             
010300     03  PIC X(16) VALUE X'4460FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010400     03  PIC X(16) VALUE X'44ED444BFEFEFEFE44EEFEFE437946E5'.             
010500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
010800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE447A'.             
010900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE447B'.             
011300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011400*    -- TAB2-IND = 3 (X'3')                                               
011500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
011900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
012900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
013800     03  PIC X(16) VALUE X'FEFEFEFE445BFEFEFEFEFEFEFEFEFEFE'.             
013900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE4553'.             
014000     03  PIC X(16) VALUE X'FEFE455145524554FEFE4752FEFEFEFE'.             
014100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014200     03  PIC X(16) VALUE X'FEFE4555FEFEFEFEFEFEFEFEFEFEFEFE'.             
014300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014700*    -- TAB2-IND = 4 (X'4')                                               
014800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
014900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
015900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
016600     03  PIC X(16) VALUE X'FEFE4161416241634164416541664167'.             
016700     03  PIC X(16) VALUE X'41684169416A416B416C416D416E416F'.             
016800     03  PIC X(16) VALUE X'41704171FEFE41724173417441754176'.             
016900     03  PIC X(16) VALUE X'41774178FEFEFEFEFEFEFEFEFEFEFEFE'.             
017000     03  PIC X(16) VALUE X'FEFE4141414241434144414541464147'.             
017100     03  PIC X(16) VALUE X'41484149414A414B414C414D414E414F'.             
017200     03  PIC X(16) VALUE X'41504151FEFE41524153415441554156'.             
017300     03  PIC X(16) VALUE X'41574158FEFEFEFEFEFEFEFEFEFEFEFE'.             
017400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
017500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
017600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
017700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
017800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
017900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
018000*    -- TAB2-IND = 5 (X'5')                                               
018100     03  PIC X(16) VALUE X'FEFE41C6FEFEFEFEFEFEFEFEFEFEFEFE'.             
018200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
018300     03  PIC X(16) VALUE X'41C041C141C241C341C441C541C741C8'.             
018400     03  PIC X(16) VALUE X'41C941CA41CB41CC41CD41CE41CF41D0'.             
018500     03  PIC X(16) VALUE X'41D141D241D341D441D541D641D741D8'.             
018600     03  PIC X(16) VALUE X'41D941DA41DB41DC41DD41DE41DF41E0'.             
018700     03  PIC X(16) VALUE X'41804181418241834184418541874188'.             
018800     03  PIC X(16) VALUE X'4189418A418B418C418D418E418F4190'.             
018900     03  PIC X(16) VALUE X'41914192419341944195419641974198'.             
019000     03  PIC X(16) VALUE X'4199419A419B419C419D419E419F41A0'.             
019100     03  PIC X(16) VALUE X'FEFE4186FEFEFEFEFEFEFEFEFEFEFEFE'.             
019200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
019900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
020900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021300*    -- TAB2-IND = 6 (X'6')                                               
021400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
021600     03  PIC X(16) VALUE X'445AFEFEFEFEFEFE444AFEFEFEFEFEFE'.             
021700     03  PIC X(16) VALUE X'44614471FEFEFEFE44624472FEFEFEFE'.             
021800     03  PIC X(16) VALUE X'43774378FEFEFEFEFEFE447E447F4345'.             
021900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022000     03  PIC X(16) VALUE X'4373FEFE445044EFFEFE4279FEFEFEFE'.             
022100     03  PIC X(16) VALUE X'FEFEFEFEFEFE446BFEFEFEFE42A1FEFE'.             
022200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
022900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
023900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
024600*    -- TAB2-IND = 7 (X'7')                                               
024700     03  PIC X(16) VALUE X'FEFEFEFEFEFE444EFEFE46BBFEFEFEFE'.             
024800     03  PIC X(16) VALUE X'FEFE46DBFEFEFEFEFEFEFEFEFEFEFEFE'.             
024900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE446EFEFE'.             
025000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025100     03  PIC X(16) VALUE X'FEFE446FFEFEFEFEFEFEFEFEFEFEFEFE'.             
025200     03  PIC X(16) VALUE X'FEFEFEFEFEFE4372FEFEFEFEFEFEFEFE'.             
025300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
025900     03  PIC X(16) VALUE X'41F141F241F341F441F541F641F741F8'.             
026000     03  PIC X(16) VALUE X'41F941FAFEFEFEFEFEFEFEFEFEFEFEFE'.             
026100     03  PIC X(16) VALUE X'41B141B241B341B441B541B641B741B8'.             
026200     03  PIC X(16) VALUE X'41B941BAFEFEFEFEFEFEFEFEFEFEFEFE'.             
026300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
026400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
026500     03  PIC X(16) VALUE X'44F144F244F044F3FEFEFEFE46D446D5'.             
026600     03  PIC X(16) VALUE X'46D746D6FEFEFEFEFEFEFEFEFEFEFEFE'.             
026700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
026800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
026900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027000     03  PIC X(16) VALUE X'46EF46F0FEFEFEFEFEFEFEFEFEFEFEFE'.             
027100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027300     03  PIC X(16) VALUE X'FEFEFEFE436EFEFE436FFEFEFEFEFEFE'.             
027400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE46EE'.             
027600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
027900*    -- TAB2-IND = 8 (X'8')                                               
028000     03  PIC X(16) VALUE X'4370FEFE434E4371FEFEFEFEFEFE434F'.             
028100     03  PIC X(16) VALUE X'4364FEFEFEFE4365FEFEFEFEFEFEFEFE'.             
028200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE46DAFEFEFEFE'.             
028300     03  PIC X(16) VALUE X'FEFEFEFE46C5FEFEFEFE4361444D46CC'.             
028400     03  PIC X(16) VALUE X'46CBFEFEFEFEFEFEFEFE447CFEFE436C'.             
028500     03  PIC X(16) VALUE X'436D46C846C946D04363FEFE46D1FEFE'.             
028600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE44684478FEFEFEFE'.             
028700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE43A14360FEFEFEFE'.             
028800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
028900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
029000     03  PIC X(16) VALUE X'FEFEFEFE46C6FEFEFEFEFEFEFEFEFEFE'.             
029100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
029200     03  PIC X(16) VALUE X'444C46C7FEFEFEFEFEFEFEFE44674477'.             
029300     03  PIC X(16) VALUE X'FEFEFEFE435D435EFEFEFEFEFEFEFEFE'.             
029400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
029500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
029600     03  PIC X(16) VALUE X'FEFEFEFE43684369FEFEFEFE43664367'.             
029700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
029800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE46D2FEFEFEFE'.             
029900     03  PIC X(16) VALUE X'FEFE46D3FEFEFEFEFEFEFEFEFEFEFEFE'.             
030000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE46CAFEFEFEFE'.             
030100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE46CD'.             
030400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
030900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031200*    -- TAB2-IND = 9 (X'9')                                               
031300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031500     03  PIC X(16) VALUE X'FEFEFEFE434DFEFEFEFEFEFEFEFEFEFE'.             
031600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
031900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
032900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
033900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
034500*    -- TAB2-IND = 10 (X'A')                                              
034600     03  PIC X(16) VALUE X'47814782478347844785478647874788'.             
034700     03  PIC X(16) VALUE X'4789478A478B478C478D478E478F4790'.             
034800     03  PIC X(16) VALUE X'47914792479347944795479647974798'.             
034900     03  PIC X(16) VALUE X'4799479A479B479C479D479E479F47A0'.             
035000     03  PIC X(16) VALUE X'FEFE47A1FEFEFEFEFEFEFEFEFEFEFEFE'.             
035100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
035800     03  PIC X(16) VALUE X'46414642464346444645464646474648'.             
035900     03  PIC X(16) VALUE X'4649464AFEFEFEFEFEFEFEFEFEFEFEFE'.             
036000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE4651465246534654'.             
036100     03  PIC X(16) VALUE X'46554656465746584659465AFEFEFEFE'.             
036200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
036900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
037800*    -- TAB2-IND = 11 (X'B')                                              
037900     03  PIC X(16) VALUE X'467543B7467643B8FEFEFEFEFEFEFEFE'.             
038000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE4678FEFEFEFE43B9'.             
038100     03  PIC X(16) VALUE X'4679FEFEFEFE43E1467AFEFEFEFE43E3'.             
038200     03  PIC X(16) VALUE X'467BFEFEFEFE43E2467343EEFEFEFEFE'.             
038300     03  PIC X(16) VALUE X'43E9FEFEFEFE43E4467243F0FEFEFEFE'.             
038400     03  PIC X(16) VALUE X'43EBFEFEFEFE43E64671FEFEFEFE43EA'.             
038500     03  PIC X(16) VALUE X'43EFFEFEFEFE43E54670FEFEFEFE43EC'.             
038600     03  PIC X(16) VALUE X'43F1FEFEFEFE43E7466FFEFEFEFE43ED'.             
038700     03  PIC X(16) VALUE X'FEFEFEFE43F2FEFEFEFEFEFEFEFEFEFE'.             
038800     03  PIC X(16) VALUE X'FEFEFEFEFEFE43E8FEFEFEFEFEFEFEFE'.             
038900     03  PIC X(16) VALUE X'4681FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
039000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE4682FEFE'.             
039100     03  PIC X(16) VALUE X'FEFE4684FEFEFEFEFEFEFEFEFEFEFEFE'.             
039200     03  PIC X(16) VALUE X'FEFEFEFE4683FEFEFEFE467C467D467F'.             
039300     03  PIC X(16) VALUE X'467E4689468A468B46B7FEFEFEFEFEFE'.             
039400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
039500     03  PIC X(16) VALUE X'FEFE4660466146624663466446654666'.             
039600     03  PIC X(16) VALUE X'4667466E466D466C466B466A46694668'.             
039700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE46744677FEFEFEFE'.             
039800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
039900     03  PIC X(16) VALUE X'44EA44E9FEFEFEFEFEFEFEFEFEFEFEFE'.             
040000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
040100     03  PIC X(16) VALUE X'FEFEFEFE44E344E2FEFEFEFEFEFEFEFE'.             
040200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE44EC44EBFEFEFEFE'.             
040300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE44E844E7'.             
040400     03  PIC X(16) VALUE X'FEFEFEFEFEFE44E0FEFEFEFE44E444E1'.             
040500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
040600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
040700     03  PIC X(16) VALUE X'FEFEFEFE4685468646884687FEFEFEFE'.             
040800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE437A'.             
040900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041100*    -- TAB2-IND = 12 (X'C')                                              
041200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE44E644E5FEFE'.             
041300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
041900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042000     03  PIC X(16) VALUE X'4479FEFE4469FEFEFEFEFEFEFEFEFEFE'.             
042100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042500     03  PIC X(16) VALUE X'FEFEFEFE4376FEFEFEFE4375FEFE4374'.             
042600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
042900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
043900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044400*    -- TAB2-IND = 13 (X'D')                                              
044500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
044900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE425CFEFEFEFE'.             
045300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
045900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
046900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
047700*    -- TAB2-IND = 14 (X'E')                                              
047800     03  PIC X(16) VALUE X'40404344434146B9FEFE445D445E445F'.             
047900     03  PIC X(16) VALUE X'44644474446544754342434344424443'.             
048000     03  PIC X(16) VALUE X'44664476446C447D44634473FEFEFEFE'.             
048100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE46E946EAFEFE'.             
048200     03  PIC X(16) VALUE X'FEFE4541454245434544454545464547'.             
048300     03  PIC X(16) VALUE X'45484549FEFEFEFEFEFEFEFEFEFEFEFE'.             
048400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
048500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
048600     03  PIC X(16) VALUE X'FEFE4447448144484482444944834451'.             
048700     03  PIC X(16) VALUE X'448444524485448644C0448744C14488'.             
048800     03  PIC X(16) VALUE X'44C2448944C3448A44C4448C44C5448D'.             
048900     03  PIC X(16) VALUE X'44C6448E44C7448F44C8449044C94491'.             
049000     03  PIC X(16) VALUE X'44CA449244CB4456449344CC449444CD'.             
049100     03  PIC X(16) VALUE X'449544CE4496449744984499449A449D'.             
049200     03  PIC X(16) VALUE X'44CF44D5449E44D044D6449F44D144D7'.             
049300     03  PIC X(16) VALUE X'44A244D244D844A344D344D944A444A5'.             
049400     03  PIC X(16) VALUE X'44A644A744A8445344A9445444AA4455'.             
049500     03  PIC X(16) VALUE X'44AC44AD44AE44AF44BA44BB445744BC'.             
049600     03  PIC X(16) VALUE X'44DA44DB444644BDFEFEFEFEFEFEFEFE'.             
049700     03  PIC X(16) VALUE X'FEFEFEFEFEFE43BE43BF44DC44DDFEFE'.             
049800     03  PIC X(16) VALUE X'FEFE4347438143484382434943834351'.             
049900     03  PIC X(16) VALUE X'438443524385438643C0438743C14388'.             
050000     03  PIC X(16) VALUE X'43C2438943C3438A43C4438C43C5438D'.             
050100     03  PIC X(16) VALUE X'43C6438E43C7438F43C8439043C94391'.             
050200     03  PIC X(16) VALUE X'43CA439243CB4356439343CC439443CD'.             
050300     03  PIC X(16) VALUE X'439543CE4396439743984399439A439D'.             
050400     03  PIC X(16) VALUE X'43CF43D5439E43D043D6439F43D143D7'.             
050500     03  PIC X(16) VALUE X'43A243D243D843A343D343D943A443A5'.             
050600     03  PIC X(16) VALUE X'43A643A743A8435343A9435443AA4355'.             
050700     03  PIC X(16) VALUE X'43AC43AD43AE43AF43BA43BB435743BC'.             
050800     03  PIC X(16) VALUE X'43DA43DB434643BD43D44359435AFEFE'.             
050900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE435843DC43DDFEFE'.             
051000*    -- TAB2-IND = 15 (X'F')                                              
051100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE455645574558'.             
051200     03  PIC X(16) VALUE X'4559455A455B455C455D455E455F4560'.             
051300     03  PIC X(16) VALUE X'45614562456345644565456645674568'.             
051400     03  PIC X(16) VALUE X'4569456A456B456C456D456E456F4570'.             
051500     03  PIC X(16) VALUE X'45714572457345744575457645774578'.             
051600     03  PIC X(16) VALUE X'4579457AFEFEFEFEFEFEFEFEFEFEFEFE'.             
051700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
051800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
051900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
052900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
053900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054300*    -- TAB2-IND = 16 (X'10')                                             
054400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
054900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055000     03  PIC X(16) VALUE X'FEFE446DFEFEFEFEFEFEFEFEFEFEFEFE'.             
055100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
055900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056400     03  PIC X(16) VALUE X'FEFEFEFEFEFE46BAFEFEFEFEFEFEFEFE'.             
056500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
056900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057600*    -- TAB2-IND = 17 (X'11')                                             
057700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
057900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
058900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE46E246E3'.             
059500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE46DD46DE46DFFEFE'.             
059700     03  PIC X(16) VALUE X'FEFE46E1FEFEFEFEFEFEFEFEFEFEFEFE'.             
059800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
059900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE46E4FEFEFEFEFEFE'.             
060200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE46E0FEFE'.             
060300     03  PIC X(16) VALUE X'FEFE46CF46CEFEFEFEFE46DCFEFEFEFE'.             
060400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
060900*    -- TAB2-IND = 18 (X'12')                                             
061000     03  PIC X(16) VALUE X'4C414C43FEFE4C44FEFEFEFEFEFE6946'.             
061100     03  PIC X(16) VALUE X'4C574C554C584C5669474C836950694E'.             
061200     03  PIC X(16) VALUE X'4C824C81FEFEFEFE4CE14CE04CDFFEFE'.             
061300     03  PIC X(16) VALUE X'4CE24CDEFEFEFEFEFEFEFEFE4DA14DA2'.             
061400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE4FE3FEFE'.             
061500     03  PIC X(16) VALUE X'4842FEFEFEFE4C59FEFE4C846951FEFE'.             
061600     03  PIC X(16) VALUE X'4C8569644E8C6B52FEFEFEFE4843FEFE'.             
061700     03  PIC X(16) VALUE X'4C5A4C86FEFE4CE36965FEFEFEFE4844'.             
061800     03  PIC X(16) VALUE X'FEFEFEFE69414C45FEFE4C5CFEFE6948'.             
061900     03  PIC X(16) VALUE X'4C5DFEFEFEFE4C87FEFE4CE44CE64CE5'.             
062000     03  PIC X(16) VALUE X'FEFEFEFE4DA34DA4FEFEFEFE4FE4FEFE'.             
062100     03  PIC X(16) VALUE X'53FD4C42FEFEFEFE69424C464C5F4C5E'.             
062200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
062300     03  PIC X(16) VALUE X'FEFE4DA5FEFEFEFEFEFEFEFEFEFEFEFE'.             
062400     03  PIC X(16) VALUE X'FEFEFEFEFEFE4FE5FEFEFEFEFEFEFEFE'.             
062500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE5692726F'.             
062600     03  PIC X(16) VALUE X'FEFEFEFE5BA97977797848464C47FEFE'.             
062700     03  PIC X(16) VALUE X'4C89FEFEFEFE4FE64C4869494C60FEFE'.             
062800     03  PIC X(16) VALUE X'FEFE4C8A4C8C69524C8D4C8BFEFEFEFE'.             
062900     03  PIC X(16) VALUE X'FEFE4DA6FEFE4FE7FEFEFEFE4FE851E6'.             
063000     03  PIC X(16) VALUE X'48484C614C8EFEFE4DA74DA94DA8FEFE'.             
063100     03  PIC X(16) VALUE X'4E8DFEFEFEFE4FE94FEA51E751E8FEFE'.             
063200     03  PIC X(16) VALUE X'FEFEFEFEFEFE5441FEFEFEFE7979FEFE'.             
063300     03  PIC X(16) VALUE X'FEFE8F664C49FEFEFEFEFEFEFEFEFEFE'.             
063400     03  PIC X(16) VALUE X'4C904C8F69534C914C97FEFE4C924C93'.             
063500     03  PIC X(16) VALUE X'695569544C954C96FEFE4C94FEFEFEFE'.             
063600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE4CE94CEA4CEB4CEC'.             
063700     03  PIC X(16) VALUE X'4CE84CEF696BFEFE6967696A4CF04D43'.             
063800     03  PIC X(16) VALUE X'FEFE6969FEFE4CED4CEE4CE7FEFEFEFE'.             
063900     03  PIC X(16) VALUE X'69666968FEFEFEFEFEFEFEFEFEFEFEFE'.             
064000     03  PIC X(16) VALUE X'4DB669904DB34DB7699A698E4DB46992'.             
064100     03  PIC X(16) VALUE X'FEFEFEFEFEFE4DB5FEFE4DB8FEFE4DAA'.             
064200*    -- TAB2-IND = 19 (X'13')                                             
064300     03  PIC X(16) VALUE X'69914DB96995FEFE69996996FEFEFEFE'.             
064400     03  PIC X(16) VALUE X'69934DAB4DAD4DBAFEFE4DAF698B4DB2'.             
064500     03  PIC X(16) VALUE X'4DB04DB1699B6998698F4DAEFEFEFEFE'.             
064600     03  PIC X(16) VALUE X'698C4DACFEFEFEFEFEFE6994FEFEFEFE'.             
064700     03  PIC X(16) VALUE X'FEFEFEFE6997FEFEFEFEFEFEFEFEFEFE'.             
064800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE698D6A48FEFE4EA3'.             
064900     03  PIC X(16) VALUE X'4E96FEFEFEFE6A494E93FEFE4EA5FEFE'.             
065000     03  PIC X(16) VALUE X'4E9BFEFE4E9A69FA4E9E4E996A426A4A'.             
065100     03  PIC X(16) VALUE X'FEFE6A46FEFE4E9CFEFEFEFE4E9F4E90'.             
065200     03  PIC X(16) VALUE X'4EA869FCFEFEFEFE6B5E4E8E4EA44E8F'.             
065300     03  PIC X(16) VALUE X'4E974E986A4469FD4E9D4E9569F94E91'.             
065400     03  PIC X(16) VALUE X'6A474EA64EA94E944EA14EA74E926A45'.             
065500     03  PIC X(16) VALUE X'4EA26A4B69FB4EA06A41FEFEFEFE6A43'.             
065600     03  PIC X(16) VALUE X'FEFE4FF86B606B6C4FF0FEFE6B6D4FEB'.             
065700     03  PIC X(16) VALUE X'4FF5FEFEFEFE4FEE6B5A4FF66B596B5D'.             
065800     03  PIC X(16) VALUE X'6B646B6250414FF96B546B564FFB4FEF'.             
065900     03  PIC X(16) VALUE X'6B576B636B6A4FF46B5C6B554FF36B58'.             
066000     03  PIC X(16) VALUE X'4FF76B5BFEFE4FF2FEFE4FEDFEFE4FFC'.             
066100     03  PIC X(16) VALUE X'6B654FFD6B69FEFE6B676B6B4FFA6B5F'.             
066200     03  PIC X(16) VALUE X'6B53FEFE6B614FF16B664FEC6B68FEFE'.             
066300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
066400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE51F751EB'.             
066500     03  PIC X(16) VALUE X'FEFEFEFE6D436D4BFEFE51EA51F25241'.             
066600     03  PIC X(16) VALUE X'FEFE6D516D4F6D4AFEFEFEFEFEFE51EC'.             
066700     03  PIC X(16) VALUE X'6D506D4651FA51F151F96D41FEFE6D4D'.             
066800     03  PIC X(16) VALUE X'FEFE6D4451F56D45FEFE6CFD51FC51EF'.             
066900     03  PIC X(16) VALUE X'51F851EEFEFE6D426D47FEFE6D4E51F6'.             
067000     03  PIC X(16) VALUE X'51F36D4951FB6D4C6D4851F051FD51F4'.             
067100     03  PIC X(16) VALUE X'51ED51E9FEFEFEFEFEFEFEFEFEFEFEFE'.             
067200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6D52FEFE545B5445'.             
067300     03  PIC X(16) VALUE X'FEFE5455FEFE545A6F936F926F976F98'.             
067400     03  PIC X(16) VALUE X'5448FEFE5451FEFEFEFEFEFE545EFEFE'.             
067500*    -- TAB2-IND = 20 (X'14')                                             
067600     03  PIC X(16) VALUE X'5452FEFEFEFEFEFEFEFE6F8C544B6F8D'.             
067700     03  PIC X(16) VALUE X'FEFE5460FEFE5457544254436FA056A3'.             
067800     03  PIC X(16) VALUE X'FEFE5450544F6F8E5453727F544A6F99'.             
067900     03  PIC X(16) VALUE X'54595458544E6F916F9AFEFE6F8B544D'.             
068000     03  PIC X(16) VALUE X'6F9B54566F8F5444FEFE544754466F9C'.             
068100     03  PIC X(16) VALUE X'54545449545D545F6F96545CFEFE6F9E'.             
068200     03  PIC X(16) VALUE X'6F906F9FFEFE6F94FEFE6F9DFEFE6F95'.             
068300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE544CFEFEFEFEFEFE'.             
068400     03  PIC X(16) VALUE X'7288727BFEFE5697FEFE728172875696'.             
068500     03  PIC X(16) VALUE X'7279569A727D72765698727A569D56A2'.             
068600     03  PIC X(16) VALUE X'FEFE728CFEFE7275FEFE569EFEFE728B'.             
068700     03  PIC X(16) VALUE X'FEFEFEFE5699727C5695727772737282'.             
068800     03  PIC X(16) VALUE X'72747272727E72857286569BFEFEFEFE'.             
068900     03  PIC X(16) VALUE X'75C0728372717284FEFE56A5728956A4'.             
069000     03  PIC X(16) VALUE X'7270FEFE7278728A56A0569F569C56A1'.             
069100     03  PIC X(16) VALUE X'FEFEFEFE5693FEFEFEFE5694FEFEFEFE'.             
069200     03  PIC X(16) VALUE X'594EFEFE75C375BCFEFE594BFEFE75C4'.             
069300     03  PIC X(16) VALUE X'FEFEFEFEFEFE75BA75BD594A75BEFEFE'.             
069400     03  PIC X(16) VALUE X'FEFE594D75C2FEFE75B875B7594FFEFE'.             
069500     03  PIC X(16) VALUE X'5950594C595175B675C175BF75B9FEFE'.             
069600     03  PIC X(16) VALUE X'FEFEFEFE594975BBFEFEFEFEFEFEFEFE'.             
069700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE5BB05BAA797D5BB3'.             
069800     03  PIC X(16) VALUE X'798479875BAC5BAD79815BAB798A5BB1'.             
069900     03  PIC X(16) VALUE X'798BFEFE79865BB2FEFE797A5BAF797B'.             
070000     03  PIC X(16) VALUE X'FEFE79857983FEFE797E5BAE797C5BB4'.             
070100     03  PIC X(16) VALUE X'79827989797F7988FEFEFEFE5DFB5DF8'.             
070200     03  PIC X(16) VALUE X'FEFE5DF9FEFE7D437CF85DF75DF47CF9'.             
070300     03  PIC X(16) VALUE X'FEFEFEFE5DF67CFCFEFE7D41FEFEFEFE'.             
070400     03  PIC X(16) VALUE X'7D48FEFEFEFE7D477D425DF37CF75DF1'.             
070500     03  PIC X(16) VALUE X'7CFA5DFC7CFDFEFE7D445DF55DF27D46'.             
070600     03  PIC X(16) VALUE X'7D455DFAFEFE7CFBFEFE60428076FEFE'.             
070700     03  PIC X(16) VALUE X'80736043FEFE6041FEFE807A80778070'.             
070800*    -- TAB2-IND = 21 (X'15')                                             
070900     03  PIC X(16) VALUE X'5FFDFEFE604480715FFC604780748075'.             
071000     03  PIC X(16) VALUE X'60456046807B80788079FEFEFEFEFEFE'.             
071100     03  PIC X(16) VALUE X'625383C3625083C062526254FEFE83C1'.             
071200     03  PIC X(16) VALUE X'6251FEFE83C2FEFE83BFFEFEFEFE63C0'.             
071300     03  PIC X(16) VALUE X'86C863C186C6FEFE86C786C586C4FEFE'.             
071400     03  PIC X(16) VALUE X'FEFE86C963BFFEFEFEFE89658966FEFE'.             
071500     03  PIC X(16) VALUE X'8072896463C2664B8B5A8B5BFEFE6783'.             
071600     03  PIC X(16) VALUE X'67848E708E6F67D767D69041FEFE4C4A'.             
071700     03  PIC X(16) VALUE X'4C624C99FEFE4C984CF24CF14DBD4DBC'.             
071800     03  PIC X(16) VALUE X'4DBE4DBBFEFE4EAB4EAA4EACFEFEFEFE'.             
071900     03  PIC X(16) VALUE X'FEFEFEFE5043FEFE50425044FEFE5242'.             
072000     03  PIC X(16) VALUE X'FEFE46F16FA146F256A646F446F375C5'.             
072100     03  PIC X(16) VALUE X'FEFE46F55DFD46F6FEFE4C4BFEFE4C9A'.             
072200     03  PIC X(16) VALUE X'4DBF5045FEFE4C4C4C9D4C9B4C9CFEFE'.             
072300     03  PIC X(16) VALUE X'FEFE4DC0FEFEFEFEFEFE4EAD50475046'.             
072400     03  PIC X(16) VALUE X'5048FEFEFEFEFEFE5461FEFEFEFEFEFE'.             
072500     03  PIC X(16) VALUE X'6255FEFE484DFEFEFEFEFEFEFEFE694F'.             
072600     03  PIC X(16) VALUE X'FEFE4CF34CF4FEFEFEFE4DC1FEFE6A4C'.             
072700     03  PIC X(16) VALUE X'FEFE524452436FA36FA256A7484E4C9E'.             
072800     03  PIC X(16) VALUE X'6956FEFEFEFEFEFEFEFEFEFE6B6EFEFE'.             
072900     03  PIC X(16) VALUE X'5245FEFE5464FEFE54625463FEFEFEFE'.             
073000     03  PIC X(16) VALUE X'FEFEFEFE6256484F4CF5FEFEFEFEFEFE'.             
073100     03  PIC X(16) VALUE X'4DC2699CFEFEFEFEFEFEFEFE4EAE4EAF'.             
073200     03  PIC X(16) VALUE X'FEFE6A4DFEFEFEFE6B6F50496B70FEFE'.             
073300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6FA56FA65467FEFE'.             
073400     03  PIC X(16) VALUE X'6FA7FEFE6FA45468546654656FA8FEFE'.             
073500     03  PIC X(16) VALUE X'728DFEFEFEFEFEFE75C6FEFEFEFE798C'.             
073600     03  PIC X(16) VALUE X'7D49FEFEFEFEFEFE6048625783C4FEFE'.             
073700     03  PIC X(16) VALUE X'4C4D4C5BFEFEFEFEFEFEFEFEFEFEFEFE'.             
073800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
073900     03  PIC X(16) VALUE X'56A85953FEFE5E41FEFE69434C9FFEFE'.             
074000     03  PIC X(16) VALUE X'4CF84CF64CF7FEFEFEFE504AFEFEFEFE'.             
074100*    -- TAB2-IND = 22 (X'16')                                             
074200     03  PIC X(16) VALUE X'4C4E4C4FFEFE4C63FEFEFEFE4CA04CA1'.             
074300     03  PIC X(16) VALUE X'4CA2699E4CF9FEFE696CFEFE4DC6FEFE'.             
074400     03  PIC X(16) VALUE X'699F4DC44DC5699DFEFEFEFE4DC74DC3'.             
074500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6A4E51CE6A4FFEFE'.             
074600     03  PIC X(16) VALUE X'FEFE6A50FEFEFEFE4EB14EB0FEFEFEFE'.             
074700     03  PIC X(16) VALUE X'4EB44EB24EB3FEFEFEFEFEFE5050FEFE'.             
074800     03  PIC X(16) VALUE X'504F6B756B726B73FEFE6B715051504D'.             
074900     03  PIC X(16) VALUE X'504CFEFE504E504BFEFEFEFEFEFEFEFE'.             
075000     03  PIC X(16) VALUE X'FEFE5052FEFE52476D53FEFE6B74524C'.             
075100     03  PIC X(16) VALUE X'FEFE6D545248524B524A52495246FEFE'.             
075200     03  PIC X(16) VALUE X'FEFEFEFE6FABFEFE546B6FAE5469FEFE'.             
075300     03  PIC X(16) VALUE X'FEFEFEFE6FAA546C546A546D6FAC6FAD'.             
075400     03  PIC X(16) VALUE X'FEFE6FA96FAFFEFEFEFEFEFEFEFEFEFE'.             
075500     03  PIC X(16) VALUE X'FEFE595756A9728E7290728F729156AA'.             
075600     03  PIC X(16) VALUE X'FEFEFEFE5954FEFE59555956FEFE5BB6'.             
075700     03  PIC X(16) VALUE X'798EFEFE798D798F79905BB7FEFE5BB5'.             
075800     03  PIC X(16) VALUE X'7D4A7D4B5E435E427EE2FEFEFEFE6049'.             
075900     03  PIC X(16) VALUE X'604A604B604D807C807D604CFEFEFEFE'.             
076000     03  PIC X(16) VALUE X'FEFE6258FEFE6259FEFEFEFE8B5C8E72'.             
076100     03  PIC X(16) VALUE X'8E719042FEFE4C50FEFEFEFEFEFE4CFB'.             
076200     03  PIC X(16) VALUE X'4CFAFEFEFEFE4DC8FEFEFEFE69A0FEFE'.             
076300     03  PIC X(16) VALUE X'FEFE4EB64EB74EB54EB86A516A52FEFE'.             
076400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
076500     03  PIC X(16) VALUE X'FEFEFEFEFEFE50546B76FEFE5053FEFE'.             
076600     03  PIC X(16) VALUE X'6D5552506D56524FFEFEFEFEFEFE524D'.             
076700     03  PIC X(16) VALUE X'FEFE524EFEFEFEFEFEFE6FB0FEFEFEFE'.             
076800     03  PIC X(16) VALUE X'FEFEFEFE56AB7293FEFE56AE729257AA'.             
076900     03  PIC X(16) VALUE X'56AD56ACFEFE595AFEFE595959585BB8'.             
077000     03  PIC X(16) VALUE X'FEFEFEFE5BBB5BBC5BBAFEFE5BB9FEFE'.             
077100     03  PIC X(16) VALUE X'FEFE7D4CFEFE7D4DFEFEFEFEFEFE807F'.             
077200     03  PIC X(16) VALUE X'604E807EFEFE625A86CA63C3FEFE8B5D'.             
077300     03  PIC X(16) VALUE X'66DF48544C644CA36957FEFE4CA44CA5'.             
077400*    -- TAB2-IND = 23 (X'17')                                             
077500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE4CFC4CFDFEFE'.             
077600     03  PIC X(16) VALUE X'4DC96A536B776B78FEFE52516FB156B0'.             
077700     03  PIC X(16) VALUE X'56AF75C875C7FEFEFEFE4C514CA64D41'.             
077800     03  PIC X(16) VALUE X'FEFE56B16944FEFE696D4D42FEFE69A2'.             
077900     03  PIC X(16) VALUE X'4DCB4DCA69A14EB9FEFEFEFEFEFEFEFE'.             
078000     03  PIC X(16) VALUE X'FEFEFEFE546EFEFEFEFE7294FEFE5BBD'.             
078100     03  PIC X(16) VALUE X'7D4E5E44FEFEFEFE83C5FEFEFEFE8CEB'.             
078200     03  PIC X(16) VALUE X'48574CA7FEFEFEFE6B796D5756B456B2'.             
078300     03  PIC X(16) VALUE X'56B34C52FEFE4C65454B4CAAFEFE4CA9'.             
078400     03  PIC X(16) VALUE X'4CA84D454D44FEFE696E69A3FEFEFEFE'.             
078500     03  PIC X(16) VALUE X'FEFE5058505550575056FEFEFEFE5252'.             
078600     03  PIC X(16) VALUE X'FEFEFEFE595BFEFE4C53FEFE4CABFEFE'.             
078700     03  PIC X(16) VALUE X'4D474D46FEFE6A54FEFEFEFE5059FEFE'.             
078800     03  PIC X(16) VALUE X'FEFE485AFEFEFEFE6958FEFE4D494D48'.             
078900     03  PIC X(16) VALUE X'4DCC4DCD6A554EBAFEFE4EBBFEFE505A'.             
079000     03  PIC X(16) VALUE X'505B505CFEFE52536D58FEFEFEFE546F'.             
079100     03  PIC X(16) VALUE X'FEFEFEFE6945FEFE4CACFEFEFEFEFEFE'.             
079200     03  PIC X(16) VALUE X'FEFEFEFE69A4FEFEFEFEFEFE6A566A57'.             
079300     03  PIC X(16) VALUE X'FEFEFEFE6B7AFEFE6B7BFEFE6D5A6D59'.             
079400     03  PIC X(16) VALUE X'6D5C6D5B5254FEFE729554716FB25470'.             
079500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE75C9595CFEFE75CA'.             
079600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE7D4F5E45FEFEFEFE'.             
079700     03  PIC X(16) VALUE X'FEFEFEFE604FFEFE8B5EFEFE485CFEFE'.             
079800     03  PIC X(16) VALUE X'FEFE6959FEFE4D4AFEFEFEFEFEFEFEFE'.             
079900     03  PIC X(16) VALUE X'FEFEFEFEFEFE56B5FEFEFEFEFEFEFEFE'.             
080000     03  PIC X(16) VALUE X'4C544C664CAE4CADFEFE4CAFFEFEFEFE'.             
080100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE505EFEFE505D505F'.             
080200     03  PIC X(16) VALUE X'FEFEFEFEFEFE5255FEFEFEFEFEFE5472'.             
080300     03  PIC X(16) VALUE X'FEFE83C6655A4C674D4C4D5B4D56FEFE'.             
080400     03  PIC X(16) VALUE X'4D514D504D574D554D4E4D5C4D4F4D4B'.             
080500     03  PIC X(16) VALUE X'4D5A4D594D584D4DFEFE4D54FEFEFEFE'.             
080600     03  PIC X(16) VALUE X'4D53FEFEFEFE4D5D4D52FEFEFEFEFEFE'.             
080700*    -- TAB2-IND = 24 (X'18')                                             
080800     03  PIC X(16) VALUE X'FEFE4DD3FEFE4DD94DD5FEFE4DDB69A5'.             
080900     03  PIC X(16) VALUE X'4DD84DCE4DD14DD44DD04DD74DDA4DCF'.             
081000     03  PIC X(16) VALUE X'4DD24DD64DDCFEFEFEFEFEFEFEFEFEFE'.             
081100     03  PIC X(16) VALUE X'6A606A5DFEFE4EC86A5E4EBC4EBE4ED6'.             
081200     03  PIC X(16) VALUE X'4ED1FEFEFEFEFEFE6A656A5F4EC04EC2'.             
081300     03  PIC X(16) VALUE X'6A644EC96A5A4ED54ED74EBD4ECEFEFE'.             
081400     03  PIC X(16) VALUE X'6A584ED4FEFE4EC5FEFE4ECF4ED06A59'.             
081500     03  PIC X(16) VALUE X'4ECD4ECBFEFE4ECC4ED26A614EBFFEFE'.             
081600     03  PIC X(16) VALUE X'4ED36A634EC74EC4FEFE6A5C4EC36A66'.             
081700     03  PIC X(16) VALUE X'4EC6FEFE4ECAFEFEFEFEFEFE4EC16A62'.             
081800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6A5BFEFEFEFEFEFE'.             
081900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
082000     03  PIC X(16) VALUE X'6B8D6B8C50716B8F6B916B866B896B90'.             
082100     03  PIC X(16) VALUE X'5072FEFEFEFE6B836B87FEFEFEFE6B8B'.             
082200     03  PIC X(16) VALUE X'6D6B506D6D6F50606B885061506E5067'.             
082300     03  PIC X(16) VALUE X'5063FEFE6B845066506B50746B856B7D'.             
082400     03  PIC X(16) VALUE X'50656B7E6B81FEFE5068FEFE506A6B7C'.             
082500     03  PIC X(16) VALUE X'6B82FEFEFEFE5073506F6B8A5075FEFE'.             
082600     03  PIC X(16) VALUE X'506C6B7F5069FEFEFEFE50645062FEFE'.             
082700     03  PIC X(16) VALUE X'6B8EFEFE5070FEFEFEFEFEFEFEFEFEFE'.             
082800     03  PIC X(16) VALUE X'6D6A6D5E6D6DFEFEFEFE6D60525C526A'.             
082900     03  PIC X(16) VALUE X'525852695261526652566D5F6D655265'.             
083000     03  PIC X(16) VALUE X'6D715267FEFE525DFEFEFEFE6D676D64'.             
083100     03  PIC X(16) VALUE X'525BFEFE6D5D52686D6C52606D6E526B'.             
083200     03  PIC X(16) VALUE X'52575262525F6D6252636D686D69525E'.             
083300     03  PIC X(16) VALUE X'5264525AFEFEFEFEFEFEFEFE52596D61'.             
083400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6D66FEFE'.             
083500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6D70FEFE'.             
083600     03  PIC X(16) VALUE X'6FC6547F6FB4FEFE6FB9547854846FB7'.             
083700     03  PIC X(16) VALUE X'5473547D54836FBEFEFE547E5482FEFE'.             
083800     03  PIC X(16) VALUE X'FEFE6FC154796FB8FEFEFEFEFEFE6FC4'.             
083900     03  PIC X(16) VALUE X'6FC5FEFE547B6FC354775487FEFE6FBB'.             
084000*    -- TAB2-IND = 25 (X'19')                                             
084100     03  PIC X(16) VALUE X'FEFE5475FEFE6FC86FBC6FC0547A5486'.             
084200     03  PIC X(16) VALUE X'6FBD54816FC26FC972A4FEFE6FC75488'.             
084300     03  PIC X(16) VALUE X'54746FBF6FB6FEFE547CFEFEFEFE6FB5'.             
084400     03  PIC X(16) VALUE X'FEFEFEFE6FBAFEFEFEFEFEFEFEFEFEFE'.             
084500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6FB35485'.             
084600     03  PIC X(16) VALUE X'FEFEFEFE729CFEFE56C872AA56C656C3'.             
084700     03  PIC X(16) VALUE X'72A156BF72A556CA729B72A0729F5476'.             
084800     03  PIC X(16) VALUE X'56C572A8FEFE72AB7298FEFE596EFEFE'.             
084900     03  PIC X(16) VALUE X'72AC56CBFEFE56BD56BA72A356B7FEFE'.             
085000     03  PIC X(16) VALUE X'72A9FEFE56BE72ADFEFE729972A756C1'.             
085100     03  PIC X(16) VALUE X'729A729D72A2FEFEFEFE56C256C056CC'.             
085200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE56C7FEFE56BB5797'.             
085300     03  PIC X(16) VALUE X'FEFE56BC729E56C956C472A656B9FEFE'.             
085400     03  PIC X(16) VALUE X'FEFEFEFE56B8FEFEFEFEFEFEFEFEFEFE'.             
085500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7296729775CF'.             
085600     03  PIC X(16) VALUE X'FEFEFEFEFEFE595D596075DA597475DD'.             
085700     03  PIC X(16) VALUE X'595E75D65964596A5AC2FEFEFEFE5968'.             
085800     03  PIC X(16) VALUE X'75D359755961596975DB799E75E075D4'.             
085900     03  PIC X(16) VALUE X'FEFE75CB75D875D2596775DEFEFEFEFE'.             
086000     03  PIC X(16) VALUE X'596359775970FEFE59655962FEFE596D'.             
086100     03  PIC X(16) VALUE X'FEFE75DF75D175D775D975CD75DC595F'.             
086200     03  PIC X(16) VALUE X'75CCFEFE59665976597275CE596CFEFE'.             
086300     03  PIC X(16) VALUE X'FEFE5973596F596BFEFE75D5FEFEFEFE'.             
086400     03  PIC X(16) VALUE X'FEFEFEFEFEFE5971FEFEFEFEFEFE799C'.             
086500     03  PIC X(16) VALUE X'7998FEFE79A77991799A5BCB5BCC5BC4'.             
086600     03  PIC X(16) VALUE X'79A35BCE79967995799379A55BC2799F'.             
086700     03  PIC X(16) VALUE X'79945BC5799D5BC0799979A079A2FEFE'.             
086800     03  PIC X(16) VALUE X'FEFE79A65BC979925BC37997FEFE5BBE'.             
086900     03  PIC X(16) VALUE X'FEFE5BCA79A15BC65BC75BCD5BC146F7'.             
087000     03  PIC X(16) VALUE X'5BBF799BFEFEFEFEFEFEFEFEFEFE5BC8'.             
087100     03  PIC X(16) VALUE X'FEFEFEFE79A4FEFEFEFEFEFE5E555E50'.             
087200     03  PIC X(16) VALUE X'FEFE7D5E7D5AFEFE7D545E4A5E467D5D'.             
087300*    -- TAB2-IND = 26 (X'1A')                                             
087400     03  PIC X(16) VALUE X'5E477D577D59FEFE7D5CFEFE5E4CFEFE'.             
087500     03  PIC X(16) VALUE X'5E535E4DFEFEFEFE7D525E4E5E4F7D55'.             
087600     03  PIC X(16) VALUE X'5E54FEFE7D537D585E4B7D515E515E49'.             
087700     03  PIC X(16) VALUE X'FEFEFEFEFEFE5E487D567D5BFEFE5E52'.             
087800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE7D50'.             
087900     03  PIC X(16) VALUE X'FEFE60568091FEFE808EFEFE6050605C'.             
088000     03  PIC X(16) VALUE X'605DFEFE6053808C60558084605BFEFE'.             
088100     03  PIC X(16) VALUE X'8090605280926051FEFE808D808F6054'.             
088200     03  PIC X(16) VALUE X'808B80858082FEFEFEFE75D08088FEFE'.             
088300     03  PIC X(16) VALUE X'808180878086FEFE8083FEFE6058FEFE'.             
088400     03  PIC X(16) VALUE X'FEFEFEFEFEFE6057FEFEFEFEFEFE6059'.             
088500     03  PIC X(16) VALUE X'8089625B808AFEFEFEFEFEFE83CFFEFE'.             
088600     03  PIC X(16) VALUE X'83C8FEFE626783CC625F626383CBFEFE'.             
088700     03  PIC X(16) VALUE X'6262625E6261625C626683CD83C96265'.             
088800     03  PIC X(16) VALUE X'83C7626483CE83CA605AFEFE626883D0'.             
088900     03  PIC X(16) VALUE X'6260625DFEFEFEFEFEFEFEFE86D186D3'.             
089000     03  PIC X(16) VALUE X'63C586D486D286D086CF63C786CE63C8'.             
089100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE86CC86CD63C463C9'.             
089200     03  PIC X(16) VALUE X'63C6FEFEFEFE86CBFEFE655BFEFE8969'.             
089300     03  PIC X(16) VALUE X'8967896C896AFEFE8968896BFEFEFEFE'.             
089400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE664C8B618B62'.             
089500     03  PIC X(16) VALUE X'66E0FEFE8B638B5F8B648B60655CFEFE'.             
089600     03  PIC X(16) VALUE X'FEFEFEFE8CEC8CEE66E38CED66E266E1'.             
089700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE66E48E748E75FEFE'.             
089800     03  PIC X(16) VALUE X'6786678567878E73FEFE8F688F67FEFE'.             
089900     03  PIC X(16) VALUE X'67D867DA67D98F69685490B5FEFEFEFE'.             
090000     03  PIC X(16) VALUE X'FEFE687DFEFE90B490FDFEFEFEFE694A'.             
090100     03  PIC X(16) VALUE X'FEFEFEFE4D5F4D5EFEFE4DDF4DDE69A7'.             
090200     03  PIC X(16) VALUE X'4DDD69A6FEFEFEFE4EDA6A69FEFE6A68'.             
090300     03  PIC X(16) VALUE X'FEFEFEFE4ED84EDBFEFEFEFE6A67FEFE'.             
090400     03  PIC X(16) VALUE X'4ED9FEFEFEFEFEFEFEFEFEFEFEFE6B92'.             
090500     03  PIC X(16) VALUE X'FEFE6B935076FEFEFEFEFEFEFEFE526C'.             
090600*    -- TAB2-IND = 27 (X'1B')                                             
090700     03  PIC X(16) VALUE X'FEFE6FCA6FCB5489548AFEFEFEFE72AF'.             
090800     03  PIC X(16) VALUE X'56CD56CF72AE56CE75E15978FEFEFEFE'.             
090900     03  PIC X(16) VALUE X'FEFEFEFE5BCF5BD079A8FEFE5E57FEFE'.             
091000     03  PIC X(16) VALUE X'5E56FEFE809383D283D1FEFE917C4C68'.             
091100     03  PIC X(16) VALUE X'695AFEFE696F6970FEFEFEFEFEFEFEFE'.             
091200     03  PIC X(16) VALUE X'4DE24DE669A9FEFE4DE44DE369A84DE5'.             
091300     03  PIC X(16) VALUE X'4DE1FEFEFEFE4DE069AAFEFEFEFEFEFE'.             
091400     03  PIC X(16) VALUE X'FEFEFEFEFEFE4EE5FEFEFEFE4EE2FEFE'.             
091500     03  PIC X(16) VALUE X'4EDE6A6AFEFEFEFEFEFE6A6BFEFE4EE0'.             
091600     03  PIC X(16) VALUE X'FEFE6A6D4EDC6A6E6A6C4EDF4EE14EE4'.             
091700     03  PIC X(16) VALUE X'4EE34EDD6A6FFEFEFEFEFEFEFEFEFEFE'.             
091800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
091900     03  PIC X(16) VALUE X'FEFE507B6BA0FEFE507DFEFE507CFEFE'.             
092000     03  PIC X(16) VALUE X'6BA1507A50796B97FEFE6B96FEFE6B94'.             
092100     03  PIC X(16) VALUE X'6B996B986B956B9E6B9F6B9C6B9A5078'.             
092200     03  PIC X(16) VALUE X'FEFEFEFEFEFE6B9D507E6BA2FEFEFEFE'.             
092300     03  PIC X(16) VALUE X'6B9BFEFE526D5077FEFEFEFEFEFEFEFE'.             
092400     03  PIC X(16) VALUE X'FEFEFEFEFEFE526E6D76FEFEFEFE6D7C'.             
092500     03  PIC X(16) VALUE X'FEFEFEFEFEFE52746D7A6D81FEFE6D77'.             
092600     03  PIC X(16) VALUE X'6D7B6D7D6D7F6D79FEFE6D786D736D74'.             
092700     03  PIC X(16) VALUE X'526FFEFE527152706D756D7EFEFEFEFE'.             
092800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE5273FEFE'.             
092900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE6D726FD5FEFE'.             
093000     03  PIC X(16) VALUE X'6FD46FD96FD0FEFE6FD36FD2FEFE6FD6'.             
093100     03  PIC X(16) VALUE X'FEFE6FDA548B548EFEFEFEFE6FD16FD7'.             
093200     03  PIC X(16) VALUE X'FEFEFEFEFEFE548D6FCCFEFE527272BD'.             
093300     03  PIC X(16) VALUE X'6FD8FEFE6FCFFEFE548C6FCEFEFEFEFE'.             
093400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE72B4FEFEFEFE56D0'.             
093500     03  PIC X(16) VALUE X'56D472C472B272C056D572C2FEFE72C8'.             
093600     03  PIC X(16) VALUE X'FEFE72CCFEFEFEFE72C372B772BFFEFE'.             
093700     03  PIC X(16) VALUE X'72CD72CB72C172BC72B575E972B356D9'.             
093800     03  PIC X(16) VALUE X'72BA56DA56D672B072C672B8FEFEFEFE'.             
093900*    -- TAB2-IND = 28 (X'1C')                                             
094000     03  PIC X(16) VALUE X'72B672C956D7FEFE72CF56D156D372BE'.             
094100     03  PIC X(16) VALUE X'72B9548F56D272BB72CA72CE72C5FEFE'.             
094200     03  PIC X(16) VALUE X'72C7FEFEFEFEFEFE72B1FEFEFEFEFEFE'.             
094300     03  PIC X(16) VALUE X'FEFE75E4FEFE75ED75EC598175E5FEFE'.             
094400     03  PIC X(16) VALUE X'5982597FFEFE75E7597C75EBFEFE75E6'.             
094500     03  PIC X(16) VALUE X'75E875E2597AFEFE75F575F475F15979'.             
094600     03  PIC X(16) VALUE X'597D597E6FCD75EE597B56D875F075E3'.             
094700     03  PIC X(16) VALUE X'75F375F2FEFE75F6FEFE79B6FEFE75EF'.             
094800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
094900     03  PIC X(16) VALUE X'75EA79AE5BDA5BDD5BD879AD79B179AC'.             
095000     03  PIC X(16) VALUE X'FEFE5BD25BDC79A95BD679B0FEFE5BD4'.             
095100     03  PIC X(16) VALUE X'5BD379B35BD579B5FEFE79B25BD1FEFE'.             
095200     03  PIC X(16) VALUE X'FEFEFEFE5BDB79B779AB79B4FEFEFEFE'.             
095300     03  PIC X(16) VALUE X'79AAFEFEFEFE5BD7FEFE5BD9FEFE79AF'.             
095400     03  PIC X(16) VALUE X'FEFE79B8FEFEFEFE7D665E587D6CFEFE'.             
095500     03  PIC X(16) VALUE X'FEFE5E5D7D687D6F7D605E5F5E597D65'.             
095600     03  PIC X(16) VALUE X'605E7D647D6D5E5AFEFE5E5E7D637D69'.             
095700     03  PIC X(16) VALUE X'7D6E7D5F5E5C7D67FEFEFEFE7D6B7D71'.             
095800     03  PIC X(16) VALUE X'7D617D6AFEFE5E5B7D70FEFEFEFEFEFE'.             
095900     03  PIC X(16) VALUE X'7D62FEFEFEFEFEFE606280956060605F'.             
096000     03  PIC X(16) VALUE X'8097809CFEFE8098FEFE809B6065FEFE'.             
096100     03  PIC X(16) VALUE X'624E6064FEFE8094809AFEFE60638099'.             
096200     03  PIC X(16) VALUE X'FEFE8096FEFE6061FEFEFEFEFEFEFEFE'.             
096300     03  PIC X(16) VALUE X'FEFEFEFE83D7FEFE83D983D4626A83D6'.             
096400     03  PIC X(16) VALUE X'FEFE626983D8FEFEFEFE626C83DA626B'.             
096500     03  PIC X(16) VALUE X'83D383D5FEFEFEFEFEFEFEFE63CD86D7'.             
096600     03  PIC X(16) VALUE X'FEFE63CC86D863CB86D663CA86D5FEFE'.             
096700     03  PIC X(16) VALUE X'655E655D8B658B67FEFE8B66664D664E'.             
096800     03  PIC X(16) VALUE X'FEFEFEFE664F8CEF66E5FEFEFEFE9044'.             
096900     03  PIC X(16) VALUE X'9043687EFEFE4C694CB0FEFEFEFE4EE6'.             
097000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6D82FEFEFEFEFEFE'.             
097100     03  PIC X(16) VALUE X'FEFE59835984FEFE79B95E607D72809D'.             
097200*    -- TAB2-IND = 29 (X'1D')                                             
097300     03  PIC X(16) VALUE X'FEFEFEFEFEFE695BFEFEFEFE6A70FEFE'.             
097400     03  PIC X(16) VALUE X'FEFEFEFE4862FEFE6BA36D836FDB5490'.             
097500     03  PIC X(16) VALUE X'FEFEFEFE8B68FEFE67884C6A4D606971'.             
097600     03  PIC X(16) VALUE X'FEFE4DE74DE8FEFE507FFEFEFEFEFEFE'.             
097700     03  PIC X(16) VALUE X'56DBFEFE5E62FEFE5E635E61FEFE4C6B'.             
097800     03  PIC X(16) VALUE X'FEFE4CB14CB34CB2695C4CB44D616972'.             
097900     03  PIC X(16) VALUE X'FEFE4D62FEFEFEFEFEFEFEFEFEFE4DE9'.             
098000     03  PIC X(16) VALUE X'4DEAFEFEFEFEFEFE69ABFEFE4EE7FEFE'.             
098100     03  PIC X(16) VALUE X'6A71FEFEFEFEFEFE50846BA4FEFE5082'.             
098200     03  PIC X(16) VALUE X'508350816FDCFEFEFEFEFEFE52785277'.             
098300     03  PIC X(16) VALUE X'52795276FEFE6D8450855275FEFE5491'.             
098400     03  PIC X(16) VALUE X'5492FEFE5493FEFE72D0FEFEFEFEFEFE'.             
098500     03  PIC X(16) VALUE X'598575F756DCFEFEFEFEFEFEFEFE5BDE'.             
098600     03  PIC X(16) VALUE X'FEFE5E655E647D73FEFE6066626DFEFE'.             
098700     03  PIC X(16) VALUE X'896D8F6A90454C6C4D63FEFE4D6469B1'.             
098800     03  PIC X(16) VALUE X'4DEC4DEFFEFE69AF69AD4DEE69B069B2'.             
098900     03  PIC X(16) VALUE X'69AC4DF14DF04DED4DEB69AEFEFEFEFE'.             
099000     03  PIC X(16) VALUE X'FEFEFEFE4EF2FEFEFEFE4EEF6A766A79'.             
099100     03  PIC X(16) VALUE X'6A78FEFE4EE94EF1FEFEFEFE4EEE6A75'.             
099200     03  PIC X(16) VALUE X'6A734EEDFEFEFEFEFEFE4EE84EEBFEFE'.             
099300     03  PIC X(16) VALUE X'6A746A7B6A774EEC4EF04EF36A726A7A'.             
099400     03  PIC X(16) VALUE X'4EEAFEFEFEFEFEFEFEFEFEFE508A5092'.             
099500     03  PIC X(16) VALUE X'FEFE6BB06BA950936BB46BA56BACFEFE'.             
099600     03  PIC X(16) VALUE X'FEFE50896BA650876BAD6BB15086FEFE'.             
099700     03  PIC X(16) VALUE X'6BB26BABFEFE6BAEFEFE5095508C6BB5'.             
099800     03  PIC X(16) VALUE X'6BB3FEFE5091508F6BAA508E6BA86BA7'.             
099900     03  PIC X(16) VALUE X'508D508B509450905088FEFE6BAFFEFE'.             
100000     03  PIC X(16) VALUE X'527BFEFE52836D92527A6D8A6D86FEFE'.             
100100     03  PIC X(16) VALUE X'6D966D85FEFE527D6D8F52815284FEFE'.             
100200     03  PIC X(16) VALUE X'527E6D935282FEFE549A6D996D87FEFE'.             
100300     03  PIC X(16) VALUE X'FEFE6D896D906D946D986D956D8E6D91'.             
100400     03  PIC X(16) VALUE X'FEFEFEFE6D8B52866D8D6D8C6D97527C'.             
100500*    -- TAB2-IND = 30 (X'1E')                                             
100600     03  PIC X(16) VALUE X'6D885285FEFE527FFEFEFEFEFEFEFEFE'.             
100700     03  PIC X(16) VALUE X'FEFE54A06FE4FEFE549FFEFEFEFE6FE2'.             
100800     03  PIC X(16) VALUE X'FEFE5494FEFE5499FEFE6FE16FDE6FE3'.             
100900     03  PIC X(16) VALUE X'54956FDDFEFE54985496FEFE6FE55497'.             
101000     03  PIC X(16) VALUE X'549BFEFEFEFE549CFEFE549EFEFEFEFE'.             
101100     03  PIC X(16) VALUE X'FEFE549DFEFEFEFEFEFE6FDF6FE0FEFE'.             
101200     03  PIC X(16) VALUE X'FEFEFEFEFEFE6FE6FEFE72D756DD7648'.             
101300     03  PIC X(16) VALUE X'72D672E9FEFEFEFE56E3FEFE72E7FEFE'.             
101400     03  PIC X(16) VALUE X'56E256DE72F072E072E3FEFE56E672ED'.             
101500     03  PIC X(16) VALUE X'72E556DF56E7FEFE72EA72E8FEFEFEFE'.             
101600     03  PIC X(16) VALUE X'72D972EE72E272DDFEFE72D372EF72DF'.             
101700     03  PIC X(16) VALUE X'72D2FEFE56E572E472F172E172D572DA'.             
101800     03  PIC X(16) VALUE X'72D1FEFE56E4FEFE72DE72DB56E072D4'.             
101900     03  PIC X(16) VALUE X'FEFE72EC56E1FEFE72DC72D8FEFEFEFE'.             
102000     03  PIC X(16) VALUE X'72EBFEFEFEFEFEFEFEFEFEFEFEFE5986'.             
102100     03  PIC X(16) VALUE X'7641FEFE75FB764F76437650FEFE5988'.             
102200     03  PIC X(16) VALUE X'FEFEFEFEFEFE764C7649FEFEFEFEFEFE'.             
102300     03  PIC X(16) VALUE X'FEFEFEFE764A764D7651FEFE72E67653'.             
102400     03  PIC X(16) VALUE X'79CDFEFE5989765475F97646FEFE764B'.             
102500     03  PIC X(16) VALUE X'FEFEFEFE5987598A7652765575FD75FA'.             
102600     03  PIC X(16) VALUE X'FEFEFEFE75FCFEFEFEFE76447642598B'.             
102700     03  PIC X(16) VALUE X'FEFE764EFEFEFEFE7645FEFE764775F8'.             
102800     03  PIC X(16) VALUE X'79C179BF5BE75BE579C979C079CA79C6'.             
102900     03  PIC X(16) VALUE X'79BE79CC79BD79C45BE45BE35BE279C2'.             
103000     03  PIC X(16) VALUE X'79C75BDF5BE6FEFE79BBFEFE79C579BA'.             
103100     03  PIC X(16) VALUE X'79C35BE079C879BC5BE179CBFEFEFEFE'.             
103200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7D775E6A5E69'.             
103300     03  PIC X(16) VALUE X'5E6B7D847D797D7F7D747D837D827D86'.             
103400     03  PIC X(16) VALUE X'7D7E5E667D7D5E6CFEFE7D765E67FEFE'.             
103500     03  PIC X(16) VALUE X'7D855E687D787D7B7D817D7A7D75FEFE'.             
103600     03  PIC X(16) VALUE X'FEFEFEFEFEFE7D7C809F606A80A280A1'.             
103700     03  PIC X(16) VALUE X'80A480A6FEFE6068FEFE80A0FEFE809E'.             
103800*    -- TAB2-IND = 31 (X'1F')                                             
103900     03  PIC X(16) VALUE X'FEFE80A780A580A3FEFE80A9FEFE80A8'.             
104000     03  PIC X(16) VALUE X'606C6067FEFE6069606BFEFEFEFE80AA'.             
104100     03  PIC X(16) VALUE X'83E1FEFEFEFE83E083DFFEFE83E283DB'.             
104200     03  PIC X(16) VALUE X'FEFE83DC83E483DDFEFE626E83E6FEFE'.             
104300     03  PIC X(16) VALUE X'83E583DEFEFE86DC63D086DA86DF86DE'.             
104400     03  PIC X(16) VALUE X'83E3FEFE63CFFEFE86DD86D986E186E0'.             
104500     03  PIC X(16) VALUE X'63CEFEFE86DBFEFE626FFEFEFEFEFEFE'.             
104600     03  PIC X(16) VALUE X'655FFEFEFEFEFEFE896E8B698B6A8B6B'.             
104700     03  PIC X(16) VALUE X'66E6FEFEFEFE66E7FEFE8CF0FEFE8E77'.             
104800     03  PIC X(16) VALUE X'8E76FEFEFEFE8F6B8F6C904690B6FEFE'.             
104900     03  PIC X(16) VALUE X'4C6D4C6EFEFE4C6F4CB54D6569B34DF2'.             
105000     03  PIC X(16) VALUE X'4DF3FEFE4EF64EF74EF54EF4FEFE5096'.             
105100     03  PIC X(16) VALUE X'FEFEFEFE6BB6509850976BB7FEFEFEFE'.             
105200     03  PIC X(16) VALUE X'FEFE5287FEFE54A16FE7FEFE72F3FEFE'.             
105300     03  PIC X(16) VALUE X'56E8598D72F2598CFEFE5E6DFEFE7D87'.             
105400     03  PIC X(16) VALUE X'6270FEFE63D186E2FEFE66E8FEFE67DB'.             
105500     03  PIC X(16) VALUE X'48676973FEFE4D6669744DF6FEFE4DF4'.             
105600     03  PIC X(16) VALUE X'4DF54DF7FEFE4EF94EF8FEFE6A7C4EFA'.             
105700     03  PIC X(16) VALUE X'FEFEFEFE6A7D6BB8FEFE6BB9FEFE5099'.             
105800     03  PIC X(16) VALUE X'509B509D509A509E509CFEFEFEFEFEFE'.             
105900     03  PIC X(16) VALUE X'FEFEFEFE528B5288528A528C52896FE8'.             
106000     03  PIC X(16) VALUE X'6D9AFEFEFEFEFEFE6FEA6FE954A7FEFE'.             
106100     03  PIC X(16) VALUE X'54A3FEFEFEFE54A454A654A854A5FEFE'.             
106200     03  PIC X(16) VALUE X'54AA54A9FEFEFEFEFEFEFEFEFEFE56ED'.             
106300     03  PIC X(16) VALUE X'72F572F456ECFEFE56EB56EA56EE56E9'.             
106400     03  PIC X(16) VALUE X'FEFEFEFE765B7658598F7657765CFEFE'.             
106500     03  PIC X(16) VALUE X'5991765A598E59907659FEFE79CEFEFE'.             
106600     03  PIC X(16) VALUE X'79CF79D0FEFEFEFEFEFEFEFE5E6E5E76'.             
106700     03  PIC X(16) VALUE X'7D885E705E747D895E755E715E725E6F'.             
106800     03  PIC X(16) VALUE X'5E73606F76566070606EFEFE606D83E7'.             
106900     03  PIC X(16) VALUE X'627186E386E4FEFEFEFE665066E9FEFE'.             
107000     03  PIC X(16) VALUE X'4C70FEFE4DF8FEFEFEFEFEFEFEFEFEFE'.             
107100*    -- TAB2-IND = 32 (X'20')                                             
107200     03  PIC X(16) VALUE X'FEFE528DFEFE6FEB54ABFEFEFEFE56F1'.             
107300     03  PIC X(16) VALUE X'56F056EF59925993765D5E7762724C71'.             
107400     03  PIC X(16) VALUE X'695D4CB66975FEFEFEFE69B44DF9FEFE'.             
107500     03  PIC X(16) VALUE X'FEFEFEFE509FFEFEFEFEFEFEFEFE79D1'.             
107600     03  PIC X(16) VALUE X'FEFEFEFE4C72FEFE4CB769B5FEFEFEFE'.             
107700     03  PIC X(16) VALUE X'6A7EFEFE6A7FFEFE4EFBFEFEFEFEFEFE'.             
107800     03  PIC X(16) VALUE X'765E5994FEFE79D2FEFEFEFEFEFE63D2'.             
107900     03  PIC X(16) VALUE X'4C734C884CB869764D67FEFE4F424F41'.             
108000     03  PIC X(16) VALUE X'4EFC4EFDFEFEFEFE6BBA50A150A26BBB'.             
108100     03  PIC X(16) VALUE X'50A0FEFEFEFE52916D9B5290528E528F'.             
108200     03  PIC X(16) VALUE X'54AE54ACFEFEFEFE6FED54AD6FECFEFE'.             
108300     03  PIC X(16) VALUE X'54A272F6FEFEFEFE56F356F4FEFEFEFE'.             
108400     03  PIC X(16) VALUE X'56F2FEFE5E787D8A60716072FEFE80AB'.             
108500     03  PIC X(16) VALUE X'63D3896F8970FEFE678990B7694C4CB9'.             
108600     03  PIC X(16) VALUE X'FEFE4C74FEFE69786977FEFEFEFEFEFE'.             
108700     03  PIC X(16) VALUE X'FEFE4DFA69B769B869B6FEFE69B9FEFE'.             
108800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6A88FEFE'.             
108900     03  PIC X(16) VALUE X'6A836A856A876A844F466A81FEFE6A82'.             
109000     03  PIC X(16) VALUE X'4F434F446A866A894F456A8AFEFEFEFE'.             
109100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE6BC9FEFE6BC3'.             
109200     03  PIC X(16) VALUE X'6BBE50A46BC66BC46BBD6BCA6BCD6BC8'.             
109300     03  PIC X(16) VALUE X'6BC150A66BC750A76BC26BC56BBC6BC0'.             
109400     03  PIC X(16) VALUE X'6BCC50A8FEFE50A9FEFE6BBF6BCB50A3'.             
109500     03  PIC X(16) VALUE X'50A5FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
109600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6DAC6DA5'.             
109700     03  PIC X(16) VALUE X'6DAB6DA46DA66DA06D9EFEFE6DAD6DAA'.             
109800     03  PIC X(16) VALUE X'6D9CFEFE52936DA86DA9FEFE6DA76D9F'.             
109900     03  PIC X(16) VALUE X'6D9D52926DA36DA1FEFEFEFE6DA26DAE'.             
110000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
110100     03  PIC X(16) VALUE X'54B3FEFE54B2FEFE6FEE54AF6FF0FEFE'.             
110200     03  PIC X(16) VALUE X'54B46FF1FEFEFEFE54B7FEFE54B56FF2'.             
110300     03  PIC X(16) VALUE X'6DAF6FF4FEFE54B1FEFE54B0FEFE6FEF'.             
110400*    -- TAB2-IND = 33 (X'21')                                             
110500     03  PIC X(16) VALUE X'6FF354B6FEFEFEFEFEFEFEFE56F656F5'.             
110600     03  PIC X(16) VALUE X'FEFEFEFEFEFE72F872FC734156F77344'.             
110700     03  PIC X(16) VALUE X'FEFE56FB7346FEFE56FDFEFE56F95744'.             
110800     03  PIC X(16) VALUE X'FEFE574172FA56F8FEFE72F972F77348'.             
110900     03  PIC X(16) VALUE X'72FBFEFE56FA73475742734373425743'.             
111000     03  PIC X(16) VALUE X'72FD56FCFEFEFEFEFEFEFEFE7349FEFE'.             
111100     03  PIC X(16) VALUE X'7345766D76747669599776657675765F'.             
111200     03  PIC X(16) VALUE X'76727670766AFEFE7673766CFEFE7664'.             
111300     03  PIC X(16) VALUE X'76767662766F7660FEFE7677FEFE5998'.             
111400     03  PIC X(16) VALUE X'FEFE767179D576635995FEFE7667FEFE'.             
111500     03  PIC X(16) VALUE X'59967666766BFEFEFEFE7668FEFEFEFE'.             
111600     03  PIC X(16) VALUE X'FEFE766EFEFEFEFEFEFEFEFE79D9FEFE'.             
111700     03  PIC X(16) VALUE X'FEFEFEFE79DC79D4FEFE79D6FEFE79DB'.             
111800     03  PIC X(16) VALUE X'79DA5BE8FEFE766179D8FEFEFEFE5BE9'.             
111900     03  PIC X(16) VALUE X'FEFE79D379D7FEFEFEFEFEFEFEFE7D91'.             
112000     03  PIC X(16) VALUE X'FEFE7D987D8FFEFE7D967D8D7D957D99'.             
112100     03  PIC X(16) VALUE X'7D8C7D907D8BFEFE5E79FEFE7D8E5E7A'.             
112200     03  PIC X(16) VALUE X'7D947D937D92FEFEFEFE7D97FEFEFEFE'.             
112300     03  PIC X(16) VALUE X'FEFEFEFE80AF80B1607480B2FEFE80AD'.             
112400     03  PIC X(16) VALUE X'FEFE80AC80B6FEFE80B4607380B780AE'.             
112500     03  PIC X(16) VALUE X'80B380B580B0FEFEFEFEFEFEFEFE83EB'.             
112600     03  PIC X(16) VALUE X'83F083EA83EFFEFE83E883F283EE83F3'.             
112700     03  PIC X(16) VALUE X'83ED83E983F1FEFE83F483ECFEFE86E5'.             
112800     03  PIC X(16) VALUE X'63D7FEFE63D5FEFE63D463D6FEFEFEFE'.             
112900     03  PIC X(16) VALUE X'8971FEFE8AC08B6CFEFEFEFE8CF18CF2'.             
113000     03  PIC X(16) VALUE X'FEFE66EAFEFE8E78FEFE678AFEFE8E79'.             
113100     03  PIC X(16) VALUE X'FEFE8F6E67DDFEFE67DC8F6D6855FEFE'.             
113200     03  PIC X(16) VALUE X'9047FEFEFEFE486EFEFE4C754DFB69BA'.             
113300     03  PIC X(16) VALUE X'6A8B4FD55745FEFEFEFE4C764D6A4D69'.             
113400     03  PIC X(16) VALUE X'4D68FEFEFEFE4F47FEFEFEFE54B8FEFE'.             
113500     03  PIC X(16) VALUE X'79DD4C774C784C794CBAFEFEFEFE5294'.             
113600     03  PIC X(16) VALUE X'FEFE6DB0FEFEFEFEFEFE59994C7A695E'.             
113700*    -- TAB2-IND = 34 (X'22')                                             
113800     03  PIC X(16) VALUE X'FEFEFEFE4D6B4D6C6979FEFE4DFCFEFE'.             
113900     03  PIC X(16) VALUE X'FEFEFEFE6A8CFEFE4F48FEFE6A8DFEFE'.             
114000     03  PIC X(16) VALUE X'FEFE50AFFEFEFEFE6BCF50AD50AC6BCE'.             
114100     03  PIC X(16) VALUE X'50AA6BD050AB50AEFEFE5295FEFE5297'.             
114200     03  PIC X(16) VALUE X'6DB46DB16DB26DB36DB55296FEFEFEFE'.             
114300     03  PIC X(16) VALUE X'6FF66FF5FEFE54BAFEFE54B9FEFEFEFE'.             
114400     03  PIC X(16) VALUE X'FEFEFEFEFEFE5748734BFEFE57475749'.             
114500     03  PIC X(16) VALUE X'5746FEFEFEFEFEFEFEFE599B734AFEFE'.             
114600     03  PIC X(16) VALUE X'599C7679FEFE599D7678599AFEFEFEFE'.             
114700     03  PIC X(16) VALUE X'FEFEFEFE79E079E25BEA79E179DF79DE'.             
114800     03  PIC X(16) VALUE X'FEFEFEFEFEFE7D9C5E7F5E7DFEFE5E7E'.             
114900     03  PIC X(16) VALUE X'7D9A7D9BFEFE5E7B80BB80B9FEFE6076'.             
115000     03  PIC X(16) VALUE X'80BA607760755E7CFEFEFEFE83F783F5'.             
115100     03  PIC X(16) VALUE X'83F680B886E763D886E68972897383F8'.             
115200     03  PIC X(16) VALUE X'8B6DFEFE4C7B4D6D4E4169BB4DFDFEFE'.             
115300     03  PIC X(16) VALUE X'50B05BEB48734CBB4D6E5298599E4874'.             
115400     03  PIC X(16) VALUE X'697AFEFE697BFEFE69BCFEFEFEFE4F4A'.             
115500     03  PIC X(16) VALUE X'6A916A8F4F4B6A8E6A906A92FEFE4F49'.             
115600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE50B450B550B2'.             
115700     03  PIC X(16) VALUE X'FEFEFEFE50B16DB950B3FEFEFEFEFEFE'.             
115800     03  PIC X(16) VALUE X'5299FEFE6DB86DBA6DB76DBB529A54BD'.             
115900     03  PIC X(16) VALUE X'6FF7FEFE6FF954BB6FFA54BC6FF8FEFE'.             
116000     03  PIC X(16) VALUE X'6DB6734C734F7350734D574D574C574A'.             
116100     03  PIC X(16) VALUE X'574B734EFEFEFEFEFEFEFEFE574EFEFE'.             
116200     03  PIC X(16) VALUE X'FEFE59A059A1FEFE59A279E379E579E7'.             
116300     03  PIC X(16) VALUE X'5BED5BEC599F79E679E4FEFE7DA0FEFE'.             
116400     03  PIC X(16) VALUE X'FEFE7D9E7DA45E817DA57DA25E827D9F'.             
116500     03  PIC X(16) VALUE X'7D9D7DA3607980BD7DA1607B80BE607A'.             
116600     03  PIC X(16) VALUE X'607D80BF6078607CFEFE83FD83FB83FA'.             
116700     03  PIC X(16) VALUE X'83FC83F9FEFEFEFE6652FEFE8CF38CF4'.             
116800     03  PIC X(16) VALUE X'FEFE8E7A8F6F68A14875FEFE50B64F4C'.             
116900     03  PIC X(16) VALUE X'FEFEFEFE529BFEFEFEFEFEFE4C7C4CBC'.             
117000*    -- TAB2-IND = 35 (X'23')                                             
117100     03  PIC X(16) VALUE X'FEFE4D6F69BDFEFE4F4D6A93FEFE6DBC'.             
117200     03  PIC X(16) VALUE X'529CFEFE5E834C7DFEFEFEFEFEFE4E42'.             
117300     03  PIC X(16) VALUE X'FEFEFEFE5BEE4C7E4CBD4CBEFEFE4D71'.             
117400     03  PIC X(16) VALUE X'4D70FEFE69BE4E43FEFE6A94FEFE4F4E'.             
117500     03  PIC X(16) VALUE X'FEFEFEFE6BD26BD36BD4FEFE50B750B8'.             
117600     03  PIC X(16) VALUE X'6BD150B9FEFEFEFEFEFE529D6DBDFEFE'.             
117700     03  PIC X(16) VALUE X'6FFC54BEFEFE6FFBFEFE574F73515750'.             
117800     03  PIC X(16) VALUE X'7352FEFEFEFEFEFE59A3FEFEFEFEFEFE'.             
117900     03  PIC X(16) VALUE X'79E8FEFEFEFE7DA77DA6FEFE5E84FEFE'.             
118000     03  PIC X(16) VALUE X'607E80C06273844163D9FEFE67DE9049'.             
118100     03  PIC X(16) VALUE X'4879FEFEFEFEFEFE6BD5FEFE6DBE5751'.             
118200     03  PIC X(16) VALUE X'767A5BEFFEFEFEFEFEFEFEFE6560FEFE'.             
118300     03  PIC X(16) VALUE X'FEFE487A4F50FEFE4F4F529EFEFE6FFD'.             
118400     03  PIC X(16) VALUE X'FEFE575358A85754575259A4FEFE7DA8'.             
118500     03  PIC X(16) VALUE X'5E85607FFEFE694D69BFFEFE6A964F51'.             
118600     03  PIC X(16) VALUE X'6A954F52FEFEFEFE50BD6BD86BD750BC'.             
118700     03  PIC X(16) VALUE X'50BA50BB6BD6FEFEFEFE52A06DBF52A3'.             
118800     03  PIC X(16) VALUE X'529F52A552A152A252A4FEFEFEFEFEFE'.             
118900     03  PIC X(16) VALUE X'54C154C054BFFEFEFEFEFEFE73545755'.             
119000     03  PIC X(16) VALUE X'57585756FEFE7353575BFEFE57577355'.             
119100     03  PIC X(16) VALUE X'575A5759FEFEFEFEFEFE767C767BFEFE'.             
119200     03  PIC X(16) VALUE X'59A759A559A6767D5BF079EA5BF179E9'.             
119300     03  PIC X(16) VALUE X'FEFEFEFE80C1FEFEFEFE60827DA96081'.             
119400     03  PIC X(16) VALUE X'FEFE5E86FEFE86E9844263DA86E88B6E'.             
119500     03  PIC X(16) VALUE X'8CF58CF6FEFE4CBFFEFE4D72FEFEFEFE'.             
119600     03  PIC X(16) VALUE X'FEFE697CFEFEFEFE4F544F56FEFE69C2'.             
119700     03  PIC X(16) VALUE X'6A996A986A97FEFE69C169C04E454F55'.             
119800     03  PIC X(16) VALUE X'4F534E44FEFEFEFEFEFE50BE6BD9FEFE'.             
119900     03  PIC X(16) VALUE X'50BF6A9EFEFE6AA06A9F6BDAFEFEFEFE'.             
120000     03  PIC X(16) VALUE X'6A9BFEFE4F5A4F58FEFE6A9A6A9C6AA2'.             
120100     03  PIC X(16) VALUE X'FEFE4F57FEFE6A9D6AA650C1FEFE6AA3'.             
120200     03  PIC X(16) VALUE X'4F59FEFE6AA16AA4FEFE50C0FEFE50C2'.             
120300*    -- TAB2-IND = 36 (X'24')                                             
120400     03  PIC X(16) VALUE X'6AA5FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
120500     03  PIC X(16) VALUE X'FEFE6BEE6BE16BDF6BED6BE852AA50C3'.             
120600     03  PIC X(16) VALUE X'6BE96BEC52A66BEB50C450C950C76BE2'.             
120700     03  PIC X(16) VALUE X'FEFE6BDD6BE450CE6BEF52A76BE5FEFE'.             
120800     03  PIC X(16) VALUE X'52A850CA6BE7FEFE6DCE52A96BDC50CB'.             
120900     03  PIC X(16) VALUE X'52AB50CC50C850CD6BE66BDB6BEA50C5'.             
121000     03  PIC X(16) VALUE X'FEFEFEFE6BDE6BE36BE050C6FEFE6DC0'.             
121100     03  PIC X(16) VALUE X'FEFE6DC1FEFEFEFEFEFEFEFEFEFEFEFE'.             
121200     03  PIC X(16) VALUE X'6DCB70446DCC52B16DCF6DC552B06DC7'.             
121300     03  PIC X(16) VALUE X'FEFE6DC8FEFEFEFE6DCA52ACFEFEFEFE'.             
121400     03  PIC X(16) VALUE X'54C5FEFEFEFE6DC66DC254C6FEFEFEFE'.             
121500     03  PIC X(16) VALUE X'6DD054C270426DC9FEFE70416DC46DCD'.             
121600     03  PIC X(16) VALUE X'FEFEFEFE52AF54C352B554C46DD17043'.             
121700     03  PIC X(16) VALUE X'52AE54C852B452B352B254C76DD254C9'.             
121800     03  PIC X(16) VALUE X'52ADFEFE6DC3FEFEFEFEFEFEFEFEFEFE'.             
121900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE575C'.             
122000     03  PIC X(16) VALUE X'70477049FEFE704B54CA54D07358704F'.             
122100     03  PIC X(16) VALUE X'7046575E7356FEFE54CF54CD7051FEFE'.             
122200     03  PIC X(16) VALUE X'7357FEFE7048FEFE54CE704C54D1704E'.             
122300     03  PIC X(16) VALUE X'FEFEFEFE54CC704D7050704AFEFE54CB'.             
122400     03  PIC X(16) VALUE X'575FFEFE7045575DFEFEFEFEFEFEFEFE'.             
122500     03  PIC X(16) VALUE X'5760FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
122600     03  PIC X(16) VALUE X'735A736359AAFEFE5762576759AB7365'.             
122700     03  PIC X(16) VALUE X'576E767F735B57665769576473597367'.             
122800     03  PIC X(16) VALUE X'736A768FFEFE736876845765576C5770'.             
122900     03  PIC X(16) VALUE X'7362767E73665761768173697683735E'.             
123000     03  PIC X(16) VALUE X'FEFE59A8FEFE735C735D576BFEFEFEFE'.             
123100     03  PIC X(16) VALUE X'576A7360576F736457687361FEFE576D'.             
123200     03  PIC X(16) VALUE X'59AC59A97682FEFE735FFEFE5763FEFE'.             
123300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
123400     03  PIC X(16) VALUE X'59B159B576865BF659B3768A59B779EB'.             
123500     03  PIC X(16) VALUE X'768C5BF859AF59B2768DFEFE768E7694'.             
123600*    -- TAB2-IND = 37 (X'25')                                             
123700     03  PIC X(16) VALUE X'59B95BF9FEFE7690769576895C46FEFE'.             
123800     03  PIC X(16) VALUE X'5BFA59B876877696FEFE5C4559B65BF3'.             
123900     03  PIC X(16) VALUE X'7693FEFE59BA768B768559B07688FEFE'.             
124000     03  PIC X(16) VALUE X'7691FEFE5BF25BF759AD7692FEFE5BF5'.             
124100     03  PIC X(16) VALUE X'FEFEFEFEFEFE59AEFEFEFEFEFEFE5C44'.             
124200     03  PIC X(16) VALUE X'7DAB79F6FEFE79EE7DAAFEFE79F279F4'.             
124300     03  PIC X(16) VALUE X'FEFEFEFE79F1FEFE5C43FEFE79F05C47'.             
124400     03  PIC X(16) VALUE X'FEFEFEFEFEFE7DBAFEFEFEFE5C425E88'.             
124500     03  PIC X(16) VALUE X'79F77DACFEFEFEFE5BFD79EF79F35E87'.             
124600     03  PIC X(16) VALUE X'5BF479EC79ED5E895BFC5C415BFB79F5'.             
124700     03  PIC X(16) VALUE X'FEFEFEFE7DB07DB17DB660877DBDFEFE'.             
124800     03  PIC X(16) VALUE X'5E8FFEFE5E8E7DB8FEFE60867DAD5E8D'.             
124900     03  PIC X(16) VALUE X'FEFE7DBC5E8B5E8CFEFE7DB980D26084'.             
125000     03  PIC X(16) VALUE X'59B4FEFE7DBB608B7DB3FEFE6085FEFE'.             
125100     03  PIC X(16) VALUE X'608A7DAE7DB27DAF7DB55E9060835E8A'.             
125200     03  PIC X(16) VALUE X'FEFE80C47DB7FEFE6089FEFE608CFEFE'.             
125300     03  PIC X(16) VALUE X'7DB4FEFE608880C3FEFEFEFEFEFEFEFE'.             
125400     03  PIC X(16) VALUE X'FEFE80C8627780C2844E80D16090FEFE'.             
125500     03  PIC X(16) VALUE X'608E627580CE80CA6094FEFE8445FEFE'.             
125600     03  PIC X(16) VALUE X'FEFEFEFE609280C9FEFE8443FEFE80CD'.             
125700     03  PIC X(16) VALUE X'FEFE80D080C7FEFE6093FEFEFEFE608D'.             
125800     03  PIC X(16) VALUE X'8444627680CF608F609180CC609580CB'.             
125900     03  PIC X(16) VALUE X'80C680C5627480D3844786EB6279FEFE'.             
126000     03  PIC X(16) VALUE X'844DFEFE844BFEFE86ECFEFE627A844C'.             
126100     03  PIC X(16) VALUE X'FEFE844963DC86EAFEFE8446844863DD'.             
126200     03  PIC X(16) VALUE X'627C63DB627B63DF844A6278FEFEFEFE'.             
126300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE897CFEFE'.             
126400     03  PIC X(16) VALUE X'8974FEFEFEFEFEFEFEFEFEFE86F28975'.             
126500     03  PIC X(16) VALUE X'86EEFEFEFEFE656186F086EF63DE86ED'.             
126600     03  PIC X(16) VALUE X'86F1897D8979897BFEFE89768977FEFE'.             
126700     03  PIC X(16) VALUE X'897A89786653FEFEFEFE665666556654'.             
126800     03  PIC X(16) VALUE X'66EB8CF766EC8B6F678B8E7B678C67DF'.             
126900*    -- TAB2-IND = 38 (X'26')                                             
127000     03  PIC X(16) VALUE X'6856904AFEFE904B904CFEFEFEFE91AA'.             
127100     03  PIC X(16) VALUE X'4CC0697D4D73FEFE4E474E484E46FEFE'.             
127200     03  PIC X(16) VALUE X'4E494F5C4F5BFEFE6BF050D050CFFEFE'.             
127300     03  PIC X(16) VALUE X'FEFE705257715772FEFEFEFEFEFE59BB'.             
127400     03  PIC X(16) VALUE X'79F85C485C4979FA79FC79FBFEFE7DBF'.             
127500     03  PIC X(16) VALUE X'FEFE7DBE5E917DC0FEFE80D46096FEFE'.             
127600     03  PIC X(16) VALUE X'627DFEFE63E0656263E1FEFE4CC1FEFE'.             
127700     03  PIC X(16) VALUE X'FEFEFEFE6AA7FEFEFEFE6BF150D250D1'.             
127800     03  PIC X(16) VALUE X'50D352B66DD36DD4FEFEFEFE705354D2'.             
127900     03  PIC X(16) VALUE X'577359BC76974CC2FEFE4C7F4CC3FEFE'.             
128000     03  PIC X(16) VALUE X'697E4D774D764D744D75FEFEFEFEFEFE'.             
128100     03  PIC X(16) VALUE X'4E4C69CA69CC4E4B69C4FEFE69C5FEFE'.             
128200     03  PIC X(16) VALUE X'69CB69C769C94E4A69C669C369C8FEFE'.             
128300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE4F634F6C4F6A'.             
128400     03  PIC X(16) VALUE X'6AB16AAE6AB64F686AB7FEFE4F616AB4'.             
128500     03  PIC X(16) VALUE X'FEFE4F676AB06AAF4F656AB54F6650D4'.             
128600     03  PIC X(16) VALUE X'4F606AB2FEFE6AA84F5DFEFE4F706AAD'.             
128700     03  PIC X(16) VALUE X'6AB34F624F64FEFE6AA9FEFE6AAA6AAB'.             
128800     03  PIC X(16) VALUE X'FEFE4F6F4F694F6E6AAC4F6D4F5F4F5E'.             
128900     03  PIC X(16) VALUE X'4F6BFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
129000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
129100     03  PIC X(16) VALUE X'50E26BFD6BF650DD50F06BF26BF96BFB'.             
129200     03  PIC X(16) VALUE X'6C4150EBFEFE6BFA6BF350E96BF7FEFE'.             
129300     03  PIC X(16) VALUE X'6C4250DAFEFE6BFC50E450E36BF550D8'.             
129400     03  PIC X(16) VALUE X'FEFEFEFE50D9FEFE50D7FEFE50EF50E7'.             
129500     03  PIC X(16) VALUE X'50E150D56BF850E050D650E850F16DD5'.             
129600     03  PIC X(16) VALUE X'50E56BF450DB50DE50DFFEFE50ED50EE'.             
129700     03  PIC X(16) VALUE X'50EC50E650EA50DC52B7FEFEFEFEFEFE'.             
129800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
129900     03  PIC X(16) VALUE X'FEFEFEFEFEFE6DDB52C352BB52BD52C2'.             
130000     03  PIC X(16) VALUE X'6DE752C0705454D352C56DD86DE052C1'.             
130100     03  PIC X(16) VALUE X'6DDF6DDC6DE46DE652BA52BE52C454D5'.             
130200*    -- TAB2-IND = 39 (X'27')                                             
130300     03  PIC X(16) VALUE X'6DE152BC52C76DDAFEFEFEFEFEFE52BF'.             
130400     03  PIC X(16) VALUE X'54D452B9FEFE6DD76DDE6DD66DD96DDD'.             
130500     03  PIC X(16) VALUE X'705552C6FEFE6DE26DE36DE552B8FEFE'.             
130600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
130700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
130800     03  PIC X(16) VALUE X'54E3706154E154E270577067FEFE54D8'.             
130900     03  PIC X(16) VALUE X'FEFEFEFE736B70697063FEFE705AFEFE'.             
131000     03  PIC X(16) VALUE X'706C705D54DE7383706054E054D7FEFE'.             
131100     03  PIC X(16) VALUE X'706E706254DA705B7058705954DB7068'.             
131200     03  PIC X(16) VALUE X'706F54DD705F705E54E554E454D654DC'.             
131300     03  PIC X(16) VALUE X'54DF706BFEFEFEFE706554D97056706D'.             
131400     03  PIC X(16) VALUE X'70647066706AFEFEFEFEFEFEFEFEFEFE'.             
131500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE736CFEFE577B'.             
131600     03  PIC X(16) VALUE X'5790578FFEFE5784FEFE737E737A7377'.             
131700     03  PIC X(16) VALUE X'738A577E5776FEFEFEFE737C59CC577A'.             
131800     03  PIC X(16) VALUE X'7385FEFE5791578E7381736FFEFEFEFE'.             
131900     03  PIC X(16) VALUE X'578D7387736E578257867386FEFE7378'.             
132000     03  PIC X(16) VALUE X'57875781736DFEFE59BE73897376578C'.             
132100     03  PIC X(16) VALUE X'73797388578BFEFE7698FEFE57777374'.             
132200     03  PIC X(16) VALUE X'577C5788FEFE5783737D737373717384'.             
132300     03  PIC X(16) VALUE X'57745789577859BD73825779FEFE5775'.             
132400     03  PIC X(16) VALUE X'5785577F577D7375578A7372737F737B'.             
132500     03  PIC X(16) VALUE X'769A7699FEFEFEFEFEFEFEFEFEFEFEFE'.             
132600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE737076AAFEFE'.             
132700     03  PIC X(16) VALUE X'59C0FEFE76B0769F76AD79FD59C376B1'.             
132800     03  PIC X(16) VALUE X'76B459C276A276B376B259C4769B59BF'.             
132900     03  PIC X(16) VALUE X'59C7FEFE59C576AFFEFE76A559C976B6'.             
133000     03  PIC X(16) VALUE X'76AE76B759D159CF76AC76ABFEFE76A9'.             
133100     03  PIC X(16) VALUE X'76A359C8FEFE59C6705C769CFEFE7A5E'.             
133200     03  PIC X(16) VALUE X'769D59C159CE7A42FEFE59CA59CB769E'.             
133300     03  PIC X(16) VALUE X'76B57A4176A676A159CD76A776A4FEFE'.             
133400     03  PIC X(16) VALUE X'FEFE59D2FEFEFEFEFEFEFEFEFEFEFEFE'.             
133500*    -- TAB2-IND = 40 (X'28')                                             
133600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE5C58FEFE'.             
133700     03  PIC X(16) VALUE X'FEFE7A457A587A5D7A515C547A625C51'.             
133800     03  PIC X(16) VALUE X'7A43FEFE7A445C4A5C537A4B5C565C57'.             
133900     03  PIC X(16) VALUE X'7A4CFEFE7A597A5F5C52FEFE5C4C7A4A'.             
134000     03  PIC X(16) VALUE X'7A467A617A4F7A507A477A5B7A527A5C'.             
134100     03  PIC X(16) VALUE X'7A54FEFE5C4D7DC15C505C4E7A607A57'.             
134200     03  PIC X(16) VALUE X'7A53FEFEFEFE7A485E9B7A565C557A4E'.             
134300     03  PIC X(16) VALUE X'FEFE7A4DFEFEFEFEFEFE5C4F5C4B7DD6'.             
134400     03  PIC X(16) VALUE X'7A5A7A55FEFE7A49FEFEFEFEFEFEFEFE'.             
134500     03  PIC X(16) VALUE X'FEFEFEFEFEFE7DD1FEFE7DC27DCDFEFE'.             
134600     03  PIC X(16) VALUE X'7DD45E9959D07DD25E94FEFEFEFEFEFE'.             
134700     03  PIC X(16) VALUE X'5E937DD9FEFE7DC37DD07DC47DCF5E97'.             
134800     03  PIC X(16) VALUE X'7DD376A8FEFEFEFEFEFE7DDA7DCB5E9A'.             
134900     03  PIC X(16) VALUE X'80E26097FEFE7DD87DD75E9C80D56098'.             
135000     03  PIC X(16) VALUE X'80D6FEFE7DC77DC87DC57DCA7DC67DDB'.             
135100     03  PIC X(16) VALUE X'5E9660995E985E9DFEFE7DC9FEFE7DD5'.             
135200     03  PIC X(16) VALUE X'FEFEFEFE7DCEFEFEFEFE80D9FEFE5E92'.             
135300     03  PIC X(16) VALUE X'609C845580DE80DD80DFFEFEFEFE80DC'.             
135400     03  PIC X(16) VALUE X'609D68CB60A360A0FEFE60A180D780DA'.             
135500     03  PIC X(16) VALUE X'80E460A960A7FEFE80DB76A0609A80E1'.             
135600     03  PIC X(16) VALUE X'80D8FEFE60AA80E05E95609F7DCCFEFE'.             
135700     03  PIC X(16) VALUE X'FEFE60A2FEFE60A660A860A560A4FEFE'.             
135800     03  PIC X(16) VALUE X'609E80E3609B60ABFEFEFEFEFEFEFEFE'.             
135900     03  PIC X(16) VALUE X'FEFEFEFEFEFE628262838454628C6289'.             
136000     03  PIC X(16) VALUE X'FEFE627F628784566285627EFEFE6286'.             
136100     03  PIC X(16) VALUE X'FEFE845363E36281FEFE628863E28452'.             
136200     03  PIC X(16) VALUE X'8451FEFE628AFEFE628BFEFE8450844F'.             
136300     03  PIC X(16) VALUE X'63E4845962848457FEFEFEFEFEFEFEFE'.             
136400     03  PIC X(16) VALUE X'63E5FEFE63EA86F586F7FEFE63E7FEFE'.             
136500     03  PIC X(16) VALUE X'86F886F4FEFE86F663E863EBFEFE86F3'.             
136600     03  PIC X(16) VALUE X'63E663E9656484586563FEFEFEFE6569'.             
136700     03  PIC X(16) VALUE X'8982FEFE65676568898589816565897E'.             
136800*    -- TAB2-IND = 41 (X'29')                                             
136900     03  PIC X(16) VALUE X'66578983FEFE8984897FFEFE65668B70'.             
137000     03  PIC X(16) VALUE X'FEFE8B73FEFEFEFE8B748B728B756658'.             
137100     03  PIC X(16) VALUE X'8B71FEFEFEFE8CFB66EE8CFA8CF98CF8'.             
137200     03  PIC X(16) VALUE X'66ED66EFFEFE8E7C678E678DFEFEFEFE'.             
137300     03  PIC X(16) VALUE X'8F718F708F73685767E0904E8F72FEFE'.             
137400     03  PIC X(16) VALUE X'FEFE904D68596858687F90B891414CC4'.             
137500     03  PIC X(16) VALUE X'FEFEFEFE76B8845A4882FEFE4E4D6AB8'.             
137600     03  PIC X(16) VALUE X'4F734F71FEFE4F72FEFE6C4350F252C8'.             
137700     03  PIC X(16) VALUE X'FEFE6DE8FEFE6DE9FEFE52C97071FEFE'.             
137800     03  PIC X(16) VALUE X'54E654E77070FEFEFEFEFEFEFEFE5798'.             
137900     03  PIC X(16) VALUE X'FEFE5794FEFE738B579B579A57935796'.             
138000     03  PIC X(16) VALUE X'57995795FEFEFEFE76BC579259D3FEFE'.             
138100     03  PIC X(16) VALUE X'FEFEFEFE59D559D676BB76BE59D476B9'.             
138200     03  PIC X(16) VALUE X'76BDFEFE76BAFEFE5C59FEFEFEFE7A63'.             
138300     03  PIC X(16) VALUE X'FEFEFEFE5E9E7DDC628D60AC80E560AD'.             
138400     03  PIC X(16) VALUE X'60AE80E780E680E8845CFEFEFEFE845B'.             
138500     03  PIC X(16) VALUE X'86FA86F963EC63ED8B76FEFEFEFE4CC5'.             
138600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE76BFFEFEFEFEFEFE'.             
138700     03  PIC X(16) VALUE X'59D859D77A64FEFE8986678F904F4CC6'.             
138800     03  PIC X(16) VALUE X'FEFE54E8FEFE579D579C76C076C15C5A'.             
138900     03  PIC X(16) VALUE X'7DDD5E9F845DFEFE4CC74D78FEFE50F3'.             
139000     03  PIC X(16) VALUE X'6C44FEFE6DEA52CA579EFEFE76C259D9'.             
139100     03  PIC X(16) VALUE X'5C5BFEFE80E980EAFEFEFEFE86FB656A'.             
139200     03  PIC X(16) VALUE X'91424CC8FEFE6C4550F452CBFEFE6DEB'.             
139300     03  PIC X(16) VALUE X'FEFE54E970757073707454EA7072FEFE'.             
139400     03  PIC X(16) VALUE X'FEFEFEFEFEFE57A057A1738C57A2579F'.             
139500     03  PIC X(16) VALUE X'76C3FEFE76C47A65FEFEFEFE5EA15EA0'.             
139600     03  PIC X(16) VALUE X'FEFEFEFE86FC8987FEFE8B788B778CFC'.             
139700     03  PIC X(16) VALUE X'4887695F52CCFEFEFEFE4CC94D79FEFE'.             
139800     03  PIC X(16) VALUE X'4E4F4E4EFEFEFEFE4E504E5169CE69CD'.             
139900     03  PIC X(16) VALUE X'6AB94F746ABC6ABB6ABA6ABDFEFEFEFE'.             
140000     03  PIC X(16) VALUE X'FEFEFEFE50F56C4B6C476C50FEFEFEFE'.             
140100*    -- TAB2-IND = 42 (X'2A')                                             
140200     03  PIC X(16) VALUE X'50FCFEFE50FA6C4C6C486C4F50F95143'.             
140300     03  PIC X(16) VALUE X'6C4A6C4651426C4D50F86C4E50FB50FD'.             
140400     03  PIC X(16) VALUE X'6C526C516C4950F750F65141FEFEFEFE'.             
140500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE6DF06DF6FEFE52D2'.             
140600     03  PIC X(16) VALUE X'52CF6DED6DF2FEFE52D552CD6DF152D0'.             
140700     03  PIC X(16) VALUE X'52D3FEFEFEFE6DF4FEFE52CE6DF952D1'.             
140800     03  PIC X(16) VALUE X'FEFE52D46DEE6DF36DF76DEF6DECFEFE'.             
140900     03  PIC X(16) VALUE X'FEFE6DF86DF5FEFEFEFEFEFEFEFEFEFE'.             
141000     03  PIC X(16) VALUE X'FEFE54F254EB54EEFEFE54F1FEFE7078'.             
141100     03  PIC X(16) VALUE X'FEFE54EC7076FEFE54F0FEFEFEFE54ED'.             
141200     03  PIC X(16) VALUE X'FEFE707954EFFEFEFEFEFEFEFEFEFEFE'.             
141300     03  PIC X(16) VALUE X'FEFE739057A4738F739157A357A87077'.             
141400     03  PIC X(16) VALUE X'FEFE738E7392FEFE57A5738D57A7FEFE'.             
141500     03  PIC X(16) VALUE X'57A6FEFE76CBFEFE76C6FEFE59DA59DE'.             
141600     03  PIC X(16) VALUE X'59DB76C976CCFEFE59DCFEFE59DD59E2'.             
141700     03  PIC X(16) VALUE X'7A6E76CA59E076C776C5FEFE59E1FEFE'.             
141800     03  PIC X(16) VALUE X'76C8FEFEFEFEFEFE5C61FEFE7A665C5E'.             
141900     03  PIC X(16) VALUE X'5C5F5C5D7A6B7A6A7A675C63FEFEFEFE'.             
142000     03  PIC X(16) VALUE X'7A6959DFFEFEFEFE7A6D7A685C605C5C'.             
142100     03  PIC X(16) VALUE X'5C627A6CFEFEFEFEFEFE5EA4FEFE7DE0'.             
142200     03  PIC X(16) VALUE X'7DDF7DDE5EA2FEFEFEFEFEFEFEFEFEFE'.             
142300     03  PIC X(16) VALUE X'5EA380ED80F060B0FEFEFEFE60AF80F1'.             
142400     03  PIC X(16) VALUE X'80EC60B280EEFEFE60B180EBFEFE80EF'.             
142500     03  PIC X(16) VALUE X'6293629084668465FEFE8464845FFEFE'.             
142600     03  PIC X(16) VALUE X'8460FEFEFEFEFEFE6291FEFE628E6292'.             
142700     03  PIC X(16) VALUE X'845E628F846184628467FEFEFEFE8463'.             
142800     03  PIC X(16) VALUE X'FEFEFEFE86FDFEFEFEFEFEFE63EFFEFE'.             
142900     03  PIC X(16) VALUE X'898A63EE89888989656B665A8B79FEFE'.             
143000     03  PIC X(16) VALUE X'6659FEFEFEFE8D418D42FEFE66F0FEFE'.             
143100     03  PIC X(16) VALUE X'8CFD6790FEFE9050685A90B990BAFEFE'.             
143200     03  PIC X(16) VALUE X'4CCAFEFE4E524E534F75FEFE6C5352D6'.             
143300     03  PIC X(16) VALUE X'54F357A9FEFEFEFE56B6FEFE59E359E4'.             
143400*    -- TAB2-IND = 43 (X'2B')                                             
143500     03  PIC X(16) VALUE X'595276CDFEFE5C647DE27DE1FEFEFEFE'.             
143600     03  PIC X(16) VALUE X'4CCB4E546C545145FEFE5144FEFE6DFA'.             
143700     03  PIC X(16) VALUE X'6DFBFEFE707A707B54F454F5FEFE54F6'.             
143800     03  PIC X(16) VALUE X'7393FEFEFEFE57ABFEFE59E6FEFE59E5'.             
143900     03  PIC X(16) VALUE X'7A6F7BC27DE38468FEFEFEFE656C66F1'.             
144000     03  PIC X(16) VALUE X'4CCCFEFE4D7C4D7D4D7B4D7E4D7AFEFE'.             
144100     03  PIC X(16) VALUE X'FEFE4E57FEFE69D64E564E58FEFEFEFE'.             
144200     03  PIC X(16) VALUE X'69D169D069D369D269D54E5569CF69D4'.             
144300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE6ABE4F7F6ABF'.             
144400     03  PIC X(16) VALUE X'6AC34F7EFEFE6AC76AC26AC54F774F78'.             
144500     03  PIC X(16) VALUE X'4F794F7AFEFE4F82FEFE6AC14F7C4F83'.             
144600     03  PIC X(16) VALUE X'FEFE6AC06AC6FEFE4F7B6AC44F7D4F76'.             
144700     03  PIC X(16) VALUE X'4F81FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
144800     03  PIC X(16) VALUE X'FEFEFEFE515AFEFE6C565146FEFE5150'.             
144900     03  PIC X(16) VALUE X'51515149515B514B6C5E51566C59514C'.             
145000     03  PIC X(16) VALUE X'6C686C696C616C5A51596C6651545152'.             
145100     03  PIC X(16) VALUE X'FEFE6C67FEFE6C656C5D6C556C5C514D'.             
145200     03  PIC X(16) VALUE X'FEFE5153FEFE51476C606C5F6C57FEFE'.             
145300     03  PIC X(16) VALUE X'51556C636C5851586C6A5148FEFE514F'.             
145400     03  PIC X(16) VALUE X'6C5B6C645157FEFE514A514EFEFE6C62'.             
145500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
145600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE6E5E52DE'.             
145700     03  PIC X(16) VALUE X'52EBFEFE6E596E4F52E46E4D52DD6E48'.             
145800     03  PIC X(16) VALUE X'52E76E556E426E44FEFEFEFEFEFEFEFE'.             
145900     03  PIC X(16) VALUE X'6E476DFC6E546E6452E26E496E5BFEFE'.             
146000     03  PIC X(16) VALUE X'6E416E626E636E666E5D6E4E6E5652E8'.             
146100     03  PIC X(16) VALUE X'52DB52E352EF52D852DAFEFEFEFEFEFE'.             
146200     03  PIC X(16) VALUE X'6E4652EC52E56E606E4352EE52E96E4C'.             
146300     03  PIC X(16) VALUE X'FEFEFEFE52ED6E536E4B52E66E5F6E57'.             
146400     03  PIC X(16) VALUE X'FEFE52E06E656E4A52DC6E5C6E5252E1'.             
146500     03  PIC X(16) VALUE X'6E5852D96DFD52EA554852DF6E516E50'.             
146600     03  PIC X(16) VALUE X'6E45FEFE6E61FEFE6E5AFEFEFEFE52D7'.             
146700*    -- TAB2-IND = 44 (X'2C')                                             
146800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
146900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
147000     03  PIC X(16) VALUE X'FEFEFEFE7090554F7091FEFE70855544'.             
147100     03  PIC X(16) VALUE X'5550FEFE707DFEFE7087708FFEFE707C'.             
147200     03  PIC X(16) VALUE X'709854F7FEFEFEFEFEFE70977092FEFE'.             
147300     03  PIC X(16) VALUE X'70935542554D7089FEFE708A7094708B'.             
147400     03  PIC X(16) VALUE X'FEFE7086707F7081708E7088FEFEFEFE'.             
147500     03  PIC X(16) VALUE X'54F854FC70967082554B5547FEFEFEFE'.             
147600     03  PIC X(16) VALUE X'554A555154FD554C708D554E54FAFEFE'.             
147700     03  PIC X(16) VALUE X'54F9707EFEFE708355457095708C7084'.             
147800     03  PIC X(16) VALUE X'55495546FEFE54FB5541FEFEFEFEFEFE'.             
147900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
148000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
148100     03  PIC X(16) VALUE X'FEFEFEFEFEFE73A8FEFE73987399739D'.             
148200     03  PIC X(16) VALUE X'FEFE73AC73A9FEFE73A273A157B273A5'.             
148300     03  PIC X(16) VALUE X'73B47394FEFE73B573A773B973AD57B1'.             
148400     03  PIC X(16) VALUE X'73AB57AC57C157B7FEFE57BB57BA7395'.             
148500     03  PIC X(16) VALUE X'FEFE73B273B873B073B7FEFEFEFE73A4'.             
148600     03  PIC X(16) VALUE X'739673B673A657AF57BCFEFE73AF57B5'.             
148700     03  PIC X(16) VALUE X'FEFEFEFEFEFE73AE739757BDFEFE57BF'.             
148800     03  PIC X(16) VALUE X'73B157C057AE739E73B3FEFEFEFE57B4'.             
148900     03  PIC X(16) VALUE X'57BE73A073AA739B739F57B9739A57AD'.             
149000     03  PIC X(16) VALUE X'57B657B373A3554376E457B0FEFEFEFE'.             
149100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
149200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE57B8FEFE76E776FD'.             
149300     03  PIC X(16) VALUE X'76F259FAFEFE59F576E159F676F1FEFE'.             
149400     03  PIC X(16) VALUE X'76EA76F759F276CF76F959E876D759EB'.             
149500     03  PIC X(16) VALUE X'59EAFEFE59FBFEFE76D176F376F459ED'.             
149600     03  PIC X(16) VALUE X'59E976DFFEFE59F476DAFEFE76F559F0'.             
149700     03  PIC X(16) VALUE X'76ED76FA76D476D976D3FEFE59EF76E6'.             
149800     03  PIC X(16) VALUE X'7A8676D559F376DE76F659EE76DB76D8'.             
149900     03  PIC X(16) VALUE X'76E959F159E759FD76EC76EBFEFEFEFE'.             
150000*    -- TAB2-IND = 45 (X'2D')                                             
150100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE76D059EC76F876E0'.             
150200     03  PIC X(16) VALUE X'76E2FEFE76EF76EE76CE59F759F976D6'.             
150300     03  PIC X(16) VALUE X'76DD76E559F876DC76E876FBFEFE76F0'.             
150400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE91C6FEFE'.             
150500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE76FCFEFEFEFE'.             
150600     03  PIC X(16) VALUE X'FEFEFEFE76D2FEFEFEFEFEFEFEFE7A9A'.             
150700     03  PIC X(16) VALUE X'5C6CFEFE7A987A837A887A81FEFE7A94'.             
150800     03  PIC X(16) VALUE X'7A727A79FEFE7A927A9C7A84FEFE7A76'.             
150900     03  PIC X(16) VALUE X'7A8A7A8F7A7AFEFE7A8C7A77FEFEFEFE'.             
151000     03  PIC X(16) VALUE X'7A7E7A7F5C6E7A937A91FEFE7A737A96'.             
151100     03  PIC X(16) VALUE X'FEFE7A977A995C725C6AFEFE739C7A7B'.             
151200     03  PIC X(16) VALUE X'7A8E7A7C5C675C777A955C755C717A71'.             
151300     03  PIC X(16) VALUE X'5C69FEFE7A745C76FEFE7A857A70FEFE'.             
151400     03  PIC X(16) VALUE X'5C6F7A897A785C707A825C6659FC7A8B'.             
151500     03  PIC X(16) VALUE X'76E37A75FEFEFEFE7A905C6B7A8D5C68'.             
151600     03  PIC X(16) VALUE X'7A875C737A7D7A9BFEFEFEFEFEFEFEFE'.             
151700     03  PIC X(16) VALUE X'FEFEFEFE5C6D7B4EFEFEFEFE5C74FEFE'.             
151800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7DF17DEFFEFE'.             
151900     03  PIC X(16) VALUE X'7E487DEDFEFE7E425C655EA77DE97E47'.             
152000     03  PIC X(16) VALUE X'FEFE7DEE7DFC5EAC5EA5FEFE7E45FEFE'.             
152100     03  PIC X(16) VALUE X'7DE77E44FEFE5EB77DF87E4B5EB57DF0'.             
152200     03  PIC X(16) VALUE X'5EA67DF27E435EAF7DEB5EB35EA97DF4'.             
152300     03  PIC X(16) VALUE X'7DEA7DE4FEFE7E415EB07E4A7DE55EAD'.             
152400     03  PIC X(16) VALUE X'FEFE7DFAFEFE5EAE7DEC7DF77DF37DF5'.             
152500     03  PIC X(16) VALUE X'FEFE5EA87E495EB67DF6FEFE7E4CFEFE'.             
152600     03  PIC X(16) VALUE X'FEFE7DE67DFB5EAB5EB45EB27DE87DFD'.             
152700     03  PIC X(16) VALUE X'5EB1FEFEFEFE5EAA7DF9FEFEFEFEFEFE'.             
152800     03  PIC X(16) VALUE X'FEFE7E46FEFEFEFEFEFEFEFEFEFEFEFE'.             
152900     03  PIC X(16) VALUE X'FEFEFEFE80FDFEFE80F980F5814C8149'.             
153000     03  PIC X(16) VALUE X'60B5FEFEFEFE815080FC60C08146FEFE'.             
153100     03  PIC X(16) VALUE X'FEFE80F8814560BD8159FEFE81568148'.             
153200     03  PIC X(16) VALUE X'80F6FEFEFEFE814D814F60B9814380FB'.             
153300*    -- TAB2-IND = 46 (X'2E')                                             
153400     03  PIC X(16) VALUE X'80F260B660BEFEFE815260BF80F38158'.             
153500     03  PIC X(16) VALUE X'814B815160BCFEFEFEFE814EFEFE8155'.             
153600     03  PIC X(16) VALUE X'FEFE60C1FEFE60BB814780F7815A80F4'.             
153700     03  PIC X(16) VALUE X'815360B8FEFE8141FEFE814260B760B4'.             
153800     03  PIC X(16) VALUE X'80FA60BAFEFE60B3FEFE815481578144'.             
153900     03  PIC X(16) VALUE X'8475FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
154000     03  PIC X(16) VALUE X'FEFEFEFE846DFEFE846962A0FEFEFEFE'.             
154100     03  PIC X(16) VALUE X'6295629A6296847784836294846F8478'.             
154200     03  PIC X(16) VALUE X'814A8479FEFEFEFE629BFEFE8489629F'.             
154300     03  PIC X(16) VALUE X'62A2846BFEFE629EFEFE84878488847D'.             
154400     03  PIC X(16) VALUE X'847C8474FEFEFEFE847E84868485FEFE'.             
154500     03  PIC X(16) VALUE X'6299629784768473FEFE8470848462A1'.             
154600     03  PIC X(16) VALUE X'8482629D629CFEFE847BFEFE846A846C'.             
154700     03  PIC X(16) VALUE X'846E8481847A6298FEFE8471FEFE847F'.             
154800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE8472FEFE'.             
154900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE63F78752'.             
155000     03  PIC X(16) VALUE X'63F08743FEFE874E63F28755FEFE874A'.             
155100     03  PIC X(16) VALUE X'FEFE8745FEFEFEFE87568741874CFEFE'.             
155200     03  PIC X(16) VALUE X'63F987518757874B63F1874D874263F8'.             
155300     03  PIC X(16) VALUE X'FEFEFEFE8754874763F4FEFE87498746'.             
155400     03  PIC X(16) VALUE X'63FA874863F363F6875087448753FEFE'.             
155500     03  PIC X(16) VALUE X'874FFEFEFEFEFEFE656E899565736574'.             
155600     03  PIC X(16) VALUE X'FEFEFEFEFEFE656D8994FEFE89918992'.             
155700     03  PIC X(16) VALUE X'6571898C89906570FEFE898DFEFEFEFE'.             
155800     03  PIC X(16) VALUE X'FEFEFEFE6572656FFEFE898B898F8993'.             
155900     03  PIC X(16) VALUE X'FEFEFEFEFEFE8B7F8B7C8B86FEFE8B85'.             
156000     03  PIC X(16) VALUE X'8B838B7DFEFE665EFEFEFEFEFEFEFEFE'.             
156100     03  PIC X(16) VALUE X'FEFE8B7E665D63F58B82665C8B878B81'.             
156200     03  PIC X(16) VALUE X'8B7B898EFEFEFEFEFEFE665BFEFE8B7A'.             
156300     03  PIC X(16) VALUE X'8D46FEFE8D458B8466F2FEFE8D498D4A'.             
156400     03  PIC X(16) VALUE X'8D448D48FEFE8D43FEFEFEFEFEFEFEFE'.             
156500     03  PIC X(16) VALUE X'8E818D47679367918E7EFEFEFEFEFEFE'.             
156600*    -- TAB2-IND = 47 (X'2F')                                             
156700     03  PIC X(16) VALUE X'8E82FEFE8E7D8E7F6792FEFEFEFEFEFE'.             
156800     03  PIC X(16) VALUE X'8F758F7667E18F74FEFEFEFEFEFE9053'.             
156900     03  PIC X(16) VALUE X'685B9051905290BBFEFEFEFE68A29145'.             
157000     03  PIC X(16) VALUE X'914391449146FEFEFEFEFEFE91ABFEFE'.             
157100     03  PIC X(16) VALUE X'4CCD4E59FEFE515CFEFE6C6BFEFEFEFE'.             
157200     03  PIC X(16) VALUE X'6E67FEFEFEFEFEFE7099709BFEFE709A'.             
157300     03  PIC X(16) VALUE X'FEFE709C57C273BB709DFEFE73BA73BC'.             
157400     03  PIC X(16) VALUE X'73BD77415A42774277445A435A417743'.             
157500     03  PIC X(16) VALUE X'FEFE7AA27AA07A9FFEFE7A9E7A9D5C78'.             
157600     03  PIC X(16) VALUE X'7AA15EB87E4D7E4F5EB97E4E60C3FEFE'.             
157700     03  PIC X(16) VALUE X'60C2815BFEFEFEFE848B848A848CFEFE'.             
157800     03  PIC X(16) VALUE X'FEFE62A3FEFE875863FBFEFE89966575'.             
157900     03  PIC X(16) VALUE X'8B8867E24CCE4D7F4E5A4F84515D515E'.             
158000     03  PIC X(16) VALUE X'FEFEFEFE52F0FEFEFEFE709EFEFEFEFE'.             
158100     03  PIC X(16) VALUE X'FEFEFEFE5C79FEFEFEFEFEFE81DA62A4'.             
158200     03  PIC X(16) VALUE X'65764CCFFEFE4E5BFEFEFEFE6C6D515F'.             
158300     03  PIC X(16) VALUE X'6C6CFEFE6E6852F16E69FEFE52F2FEFE'.             
158400     03  PIC X(16) VALUE X'70A055535552FEFE73C273C073C173BF'.             
158500     03  PIC X(16) VALUE X'FEFE73BEFEFEFEFE774577485A457746'.             
158600     03  PIC X(16) VALUE X'5A447747FEFE7AA3FEFEFEFE7E507E51'.             
158700     03  PIC X(16) VALUE X'7E52FEFE815E815D60C4815C815F848D'.             
158800     03  PIC X(16) VALUE X'FEFEFEFE848E848FFEFE875963FC6577'.             
158900     03  PIC X(16) VALUE X'8B89FEFE67946960FEFE52F36E6A5554'.             
159000     03  PIC X(16) VALUE X'FEFEFEFE57C3FEFE5A467749FEFE5C7B'.             
159100     03  PIC X(16) VALUE X'5C7AFEFEFEFE7E537E5460C560C68491'.             
159200     03  PIC X(16) VALUE X'8490899790544CD069614D81FEFE4F85'.             
159300     03  PIC X(16) VALUE X'6AC8FEFE52F45C7C4CD1FEFE6E6B52F5'.             
159400     03  PIC X(16) VALUE X'6E6CFEFE63FD4CD2FEFEFEFE6C6EFEFE'.             
159500     03  PIC X(16) VALUE X'6E6DFEFE70A570A470A2FEFE70A170A6'.             
159600     03  PIC X(16) VALUE X'70A3FEFEFEFE57C457C5FEFEFEFE5A47'.             
159700     03  PIC X(16) VALUE X'774AFEFE774B774CFEFEFEFEFEFE7AA8'.             
159800     03  PIC X(16) VALUE X'7AA97AA7FEFE7AA57AA65C7D7E558162'.             
159900*    -- TAB2-IND = 48 (X'30')                                             
160000     03  PIC X(16) VALUE X'8161816081638493849262A58494FEFE'.             
160100     03  PIC X(16) VALUE X'6441875AFEFE89988B8A8F77FEFE4CD3'.             
160200     03  PIC X(16) VALUE X'4D834D82FEFE51606962697F4E5CFEFE'.             
160300     03  PIC X(16) VALUE X'69D76AC96ACA5161FEFE6C6FFEFE52F6'.             
160400     03  PIC X(16) VALUE X'6E6E6E6FFEFE5555555970A755585556'.             
160500     03  PIC X(16) VALUE X'5557FEFE73C357C65A4AFEFE5A485A49'.             
160600     03  PIC X(16) VALUE X'774DFEFEFEFE5EBA4CD4FEFE6981FEFE'.             
160700     03  PIC X(16) VALUE X'4D84FEFEFEFE6984FEFEFEFE4D876983'.             
160800     03  PIC X(16) VALUE X'4D864D854F866982FEFEFEFE69D8FEFE'.             
160900     03  PIC X(16) VALUE X'FEFEFEFE69DC69DE69DF4E664E6769DB'.             
161000     03  PIC X(16) VALUE X'4E62FEFE69D9FEFE69DD4E63FEFE4E5E'.             
161100     03  PIC X(16) VALUE X'FEFE4E5FFEFE4E6569DA4E5D4F874E60'.             
161200     03  PIC X(16) VALUE X'4E614E64FEFEFEFEFEFE6ADB6AD96ACC'.             
161300     03  PIC X(16) VALUE X'4F936AD34F8E6ACDFEFE6AD5FEFE6AD2'.             
161400     03  PIC X(16) VALUE X'4F916AD14F986ADA4F9AFEFE4F9CFEFE'.             
161500     03  PIC X(16) VALUE X'6ACBFEFE4F8F6ADCFEFE4F964F99FEFE'.             
161600     03  PIC X(16) VALUE X'6C874F894FA04F976ACE4F8C4F9B6AD6'.             
161700     03  PIC X(16) VALUE X'4F8A4F8B6C856ACF4F924F9D6ADD6AD0'.             
161800     03  PIC X(16) VALUE X'4F90FEFE4F956C704F9E6AD74F94FEFE'.             
161900     03  PIC X(16) VALUE X'4F9F4F886AD44F8D6AD86C86FEFEFEFE'.             
162000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
162100     03  PIC X(16) VALUE X'FEFEFEFEFEFE516D517D6C775174FEFE'.             
162200     03  PIC X(16) VALUE X'6C8D5165FEFE51686C84FEFE6C756C79'.             
162300     03  PIC X(16) VALUE X'517051726C7C5179516B5169516A5178'.             
162400     03  PIC X(16) VALUE X'6C8951736C7B6C7D517151766C7E6C8C'.             
162500     03  PIC X(16) VALUE X'FEFE52F7517CFEFE51666C8BFEFE6C8F'.             
162600     03  PIC X(16) VALUE X'6C7A6C916C82516F6C76516E51815175'.             
162700     03  PIC X(16) VALUE X'FEFE6C746E78517B517F6C836C88FEFE'.             
162800     03  PIC X(16) VALUE X'5182517A516C5162FEFE5167FEFE6C78'.             
162900     03  PIC X(16) VALUE X'51636C90FEFE6C726C716C7F6C73517E'.             
163000     03  PIC X(16) VALUE X'555A51776C815164FEFE5349FEFEFEFE'.             
163100     03  PIC X(16) VALUE X'FEFE6C8EFEFEFEFEFEFEFEFEFEFEFEFE'.             
163200*    -- TAB2-IND = 49 (X'31')                                             
163300     03  PIC X(16) VALUE X'6E7F6E83FEFE6E866E7AFEFEFEFE6E89'.             
163400     03  PIC X(16) VALUE X'6E8C6E8E6E7752F852FD70AC53506E87'.             
163500     03  PIC X(16) VALUE X'6E8F6E7E6E76FEFEFEFEFEFE70C75343'.             
163600     03  PIC X(16) VALUE X'6E846E7B6E7D5348FEFE6E8153426E73'.             
163700     03  PIC X(16) VALUE X'6E8AFEFE6E8DFEFEFEFE52FCFEFE534B'.             
163800     03  PIC X(16) VALUE X'6E70534D52FA53516E8B6E72534E70C1'.             
163900     03  PIC X(16) VALUE X'6C8A534152F96E796E71534F53476E85'.             
164000     03  PIC X(16) VALUE X'534C534A6E7C53446E74534553466E75'.             
164100     03  PIC X(16) VALUE X'6E8852FB6E82FEFEFEFEFEFEFEFEFEFE'.             
164200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
164300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
164400     03  PIC X(16) VALUE X'70AF55625567FEFEFEFEFEFE70B870BE'.             
164500     03  PIC X(16) VALUE X'70BA70AD70B070A970AA556E555F70B9'.             
164600     03  PIC X(16) VALUE X'70C25569555BFEFE556470B1556670B2'.             
164700     03  PIC X(16) VALUE X'70BCFEFEFEFEFEFE556870CB70AB5561'.             
164800     03  PIC X(16) VALUE X'5560556C70A870C970BD70CA70C470B6'.             
164900     03  PIC X(16) VALUE X'70C5FEFE70BF70C870C6556D70B7555E'.             
165000     03  PIC X(16) VALUE X'555D5565556B70C3556A70B457C7FEFE'.             
165100     03  PIC X(16) VALUE X'70CC70B370AE5563556F555CFEFE70BB'.             
165200     03  PIC X(16) VALUE X'70C0FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
165300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
165400     03  PIC X(16) VALUE X'FEFEFEFE57E973C573C9FEFE57D657D4'.             
165500     03  PIC X(16) VALUE X'FEFEFEFE57CB73C773C657DFFEFE73CC'.             
165600     03  PIC X(16) VALUE X'57D9FEFE73DE73EA57C873DB73D457EB'.             
165700     03  PIC X(16) VALUE X'73C4FEFE73E0FEFE57E857DC57E757D2'.             
165800     03  PIC X(16) VALUE X'73D073E273DA57D357CD73E8FEFE73E1'.             
165900     03  PIC X(16) VALUE X'73E357D557DD73E573CE73DF73D373E7'.             
166000     03  PIC X(16) VALUE X'57E257CA57E073D873D673D757D773D2'.             
166100     03  PIC X(16) VALUE X'73D157CC73CB73E957CE73D557ECFEFE'.             
166200     03  PIC X(16) VALUE X'57E673CA57E357E157EA73DC57E570B5'.             
166300     03  PIC X(16) VALUE X'73DD57E473E457C973D957DB73CD57DA'.             
166400     03  PIC X(16) VALUE X'FEFE57D857D057CF774E73E6FEFEFEFE'.             
166500*    -- TAB2-IND = 50 (X'32')                                             
166600     03  PIC X(16) VALUE X'73CFFEFEFEFE7763FEFE57D1FEFEFEFE'.             
166700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
166800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
166900     03  PIC X(16) VALUE X'FEFE5A6757DE5A55775D5A63FEFE7751'.             
167000     03  PIC X(16) VALUE X'5A525A4E776F5A545A585A535A5C7773'.             
167100     03  PIC X(16) VALUE X'776AFEFEFEFE77585A615A5B77645A4B'.             
167200     03  PIC X(16) VALUE X'777077695A4F775E5A5E777B777CFEFE'.             
167300     03  PIC X(16) VALUE X'5A4C776E5A607762775477555A647759'.             
167400     03  PIC X(16) VALUE X'7760775AFEFE5A625A6A7756774F7750'.             
167500     03  PIC X(16) VALUE X'FEFE77525A51775FFEFE5A5F5A68FEFE'.             
167600     03  PIC X(16) VALUE X'FEFE7761777977715A4D77775A59FEFE'.             
167700     03  PIC X(16) VALUE X'5A57FEFE777D5A567767775B77655A6D'.             
167800     03  PIC X(16) VALUE X'776B776877575A6977757772777A5A50'.             
167900     03  PIC X(16) VALUE X'77665A6CFEFE776DFEFEFEFE5A5A5A5D'.             
168000     03  PIC X(16) VALUE X'FEFE776C5A6B775C73C8FEFEFEFE7776'.             
168100     03  PIC X(16) VALUE X'77747778FEFEFEFEFEFEFEFEFEFEFEFE'.             
168200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
168300     03  PIC X(16) VALUE X'77535A66FEFEFEFEFEFE7AC87AC77AAD'.             
168400     03  PIC X(16) VALUE X'5C84FEFE7AC67AB07AB1FEFE5C8E7ACF'.             
168500     03  PIC X(16) VALUE X'5C897AC5FEFE7AAA5C8F5C857AB97AAF'.             
168600     03  PIC X(16) VALUE X'7AB27ACA5C7E7AD17AC95C887ABE5C93'.             
168700     03  PIC X(16) VALUE X'FEFEFEFE5C925C8CFEFEFEFE7AD05C7F'.             
168800     03  PIC X(16) VALUE X'7ABC7AB37AC07ACC5C94FEFE5C827ABB'.             
168900     03  PIC X(16) VALUE X'91C77AB45C8BFEFE5C8A7AB77AC17ACB'.             
169000     03  PIC X(16) VALUE X'7AAE7AB85C837AC25C905C877AB55C86'.             
169100     03  PIC X(16) VALUE X'7AAC7ABA7ACE5A655ED67ABD7E567ABF'.             
169200     03  PIC X(16) VALUE X'7ACD5C8D7AB65C815C9160D87AABFEFE'.             
169300     03  PIC X(16) VALUE X'7AC4FEFEFEFEFEFE7AC3FEFEFEFEFEFE'.             
169400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
169500     03  PIC X(16) VALUE X'FEFEFEFEFEFE7E725ED37E677E6C5EC8'.             
169600     03  PIC X(16) VALUE X'FEFE7E585ED5FEFE5EBF7E577E785ED7'.             
169700     03  PIC X(16) VALUE X'7E5B7E6BFEFE7E5D7E7B7E775EBD5EC7'.             
169800*    -- TAB2-IND = 51 (X'33')                                             
169900     03  PIC X(16) VALUE X'817D5ED45EC57E59FEFE7E765EC97E73'.             
170000     03  PIC X(16) VALUE X'7E817E5F7E68FEFEFEFE7E7E7E745EC4'.             
170100     03  PIC X(16) VALUE X'FEFEFEFE7E665EBE5EBC5ECEFEFEFEFE'.             
170200     03  PIC X(16) VALUE X'7E647E617E62FEFE7E7AFEFE7E7F7E7D'.             
170300     03  PIC X(16) VALUE X'5EC27E825EC65ECDFEFE7E5A81657E63'.             
170400     03  PIC X(16) VALUE X'FEFE5EC05ED25ECF5EC37E6D7E5E5ED0'.             
170500     03  PIC X(16) VALUE X'7E6F5ECA5ECC5EBBFEFE7E717E697E5C'.             
170600     03  PIC X(16) VALUE X'5ECB7E797E7C7E657E70FEFE5EC160C7'.             
170700     03  PIC X(16) VALUE X'7E6E8164FEFE7E75FEFEFEFEFEFEFEFE'.             
170800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE7E60816E'.             
170900     03  PIC X(16) VALUE X'817860CA8177818460CC8175FEFE8179'.             
171000     03  PIC X(16) VALUE X'60D7FEFE817060CFFEFE817C849C60DB'.             
171100     03  PIC X(16) VALUE X'60DA817E816D818960D5FEFE60CB8182'.             
171200     03  PIC X(16) VALUE X'FEFE8186818B817F817360CE60D160D9'.             
171300     03  PIC X(16) VALUE X'60D4FEFE81767E6AFEFEFEFE8172818A'.             
171400     03  PIC X(16) VALUE X'60D0FEFE60D3818C60C8818181668187'.             
171500     03  PIC X(16) VALUE X'644AFEFE8174FEFE60C9816F60CD8167'.             
171600     03  PIC X(16) VALUE X'5ED1816BFEFE8185816C816A60D2FEFE'.             
171700     03  PIC X(16) VALUE X'8183FEFE8169817B817A8188817160D6'.             
171800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE849FFEFE'.             
171900     03  PIC X(16) VALUE X'62B262A884AB849762AA84A362B162AC'.             
172000     03  PIC X(16) VALUE X'84A1875C84A784AD84A6849584A484AF'.             
172100     03  PIC X(16) VALUE X'84B162A784B062AD62B3FEFE62B0FEFE'.             
172200     03  PIC X(16) VALUE X'84AA62AF84A5FEFE8499849EFEFE84A9'.             
172300     03  PIC X(16) VALUE X'62AE62AB62A662A9849DFEFE81688498'.             
172400     03  PIC X(16) VALUE X'849B84AC84A08496875B84AE849A84A8'.             
172500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE875E644EFEFEFEFE'.             
172600     03  PIC X(16) VALUE X'6442FEFEFEFE64468760876687646444'.             
172700     03  PIC X(16) VALUE X'6445644C8767875F6447FEFE87638762'.             
172800     03  PIC X(16) VALUE X'8768644DFEFE6448644B8761644F6449'.             
172900     03  PIC X(16) VALUE X'645064438765FEFE875DFEFEFEFE89A5'.             
173000     03  PIC X(16) VALUE X'FEFEFEFE657C89A289A4FEFE657A89A0'.             
173100*    -- TAB2-IND = 52 (X'34')                                             
173200     03  PIC X(16) VALUE X'89A1899CFEFEFEFE84A2899D657B8999'.             
173300     03  PIC X(16) VALUE X'FEFE657889A66579899A899B899F657E'.             
173400     03  PIC X(16) VALUE X'FEFE657DFEFEFEFE899E66648B8E8B94'.             
173500     03  PIC X(16) VALUE X'66658B8B6662665F8B966663FEFE6660'.             
173600     03  PIC X(16) VALUE X'8B8D8B908B918B928B95FEFE89A38B8C'.             
173700     03  PIC X(16) VALUE X'66618B938B978B8FFEFEFEFEFEFE8D4D'.             
173800     03  PIC X(16) VALUE X'66F48D5066F58D588D4F8D4CFEFE8D4E'.             
173900     03  PIC X(16) VALUE X'8D528D558D548D578D4BFEFE66F38D53'.             
174000     03  PIC X(16) VALUE X'8D568D598D518E838E848E888E89FEFE'.             
174100     03  PIC X(16) VALUE X'8E868E878E85FEFE6795FEFEFEFEFEFE'.             
174200     03  PIC X(16) VALUE X'FEFE67E38F7BFEFEFEFE8F788F798F7A'.             
174300     03  PIC X(16) VALUE X'67E4FEFE90569055FEFE90BE688190BC'.             
174400     03  PIC X(16) VALUE X'90BF90BD914768A368B19193917DFEFE'.             
174500     03  PIC X(16) VALUE X'919291C091C14CD5FEFEFEFEFEFEFEFE'.             
174600     03  PIC X(16) VALUE X'4E6869E0FEFEFEFE6ADEFEFE4FA1FEFE'.             
174700     03  PIC X(16) VALUE X'4FA4FEFE6ADFFEFE4FA24FA3FEFEFEFE'.             
174800     03  PIC X(16) VALUE X'FEFEFEFE6C9A6C9C6C976C946C96FEFE'.             
174900     03  PIC X(16) VALUE X'FEFEFEFE5186FEFEFEFEFEFE5184FEFE'.             
175000     03  PIC X(16) VALUE X'FEFE6C9851856C956C9251836C99FEFE'.             
175100     03  PIC X(16) VALUE X'6C9351876C9BFEFEFEFEFEFEFEFE6E91'.             
175200     03  PIC X(16) VALUE X'FEFE6E95FEFEFEFE535AFEFEFEFEFEFE'.             
175300     03  PIC X(16) VALUE X'FEFE6E98FEFE53525355535753595356'.             
175400     03  PIC X(16) VALUE X'6E946E93FEFE53546E966E97FEFE6E90'.             
175500     03  PIC X(16) VALUE X'5358FEFE5353FEFEFEFEFEFE6E92FEFE'.             
175600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE70DA70DB70DC'.             
175700     03  PIC X(16) VALUE X'5574FEFE557070D1FEFE70D970DE5575'.             
175800     03  PIC X(16) VALUE X'FEFE70CF70D570CE70D8FEFEFEFE70D4'.             
175900     03  PIC X(16) VALUE X'5571557370DDFEFE70CD70D070D6FEFE'.             
176000     03  PIC X(16) VALUE X'70D770DF70D3FEFE5572FEFEFEFEFEFE'.             
176100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE57F1'.             
176200     03  PIC X(16) VALUE X'73F1FEFEFEFE73F373EFFEFE73FB73ED'.             
176300     03  PIC X(16) VALUE X'73FA57ED73EB778273F557F0FEFE73F6'.             
176400*    -- TAB2-IND = 53 (X'35')                                             
176500     03  PIC X(16) VALUE X'73F9FEFE73FDFEFE73F2FEFE73F7FEFE'.             
176600     03  PIC X(16) VALUE X'FEFE57EE57EF73FC73F073EC7441FEFE'.             
176700     03  PIC X(16) VALUE X'73F4FEFEFEFE73F8FEFEFEFEFEFE73EE'.             
176800     03  PIC X(16) VALUE X'FEFE5A6E5A6F778C5A75FEFE777F7789'.             
176900     03  PIC X(16) VALUE X'777E5A7277877785FEFE77865A70FEFE'.             
177000     03  PIC X(16) VALUE X'778AFEFEFEFEFEFEFEFEFEFE77837781'.             
177100     03  PIC X(16) VALUE X'5A7177847788FEFEFEFEFEFE5A73FEFE'.             
177200     03  PIC X(16) VALUE X'FEFEFEFE778BFEFEFEFEFEFEFEFEFEFE'.             
177300     03  PIC X(16) VALUE X'FEFE7AD77ADE7AE07AE6FEFE5CA17AD2'.             
177400     03  PIC X(16) VALUE X'FEFE5C99FEFE7AE15C9E7AE75C95FEFE'.             
177500     03  PIC X(16) VALUE X'7AE4FEFE7AD47AE57AD3FEFE5CA3FEFE'.             
177600     03  PIC X(16) VALUE X'7ADF5C967AE8FEFE5C9B7AD85CA07AE3'.             
177700     03  PIC X(16) VALUE X'7AD67ADD7AD97AD55C985C9F5C9D5C9A'.             
177800     03  PIC X(16) VALUE X'5CA25C977ADCFEFE5C9CFEFE5A74FEFE'.             
177900     03  PIC X(16) VALUE X'7AE2FEFE7ADAFEFEFEFEFEFEFEFEFEFE'.             
178000     03  PIC X(16) VALUE X'7ADBFEFEFEFE7E8AFEFE5EDAFEFEFEFE'.             
178100     03  PIC X(16) VALUE X'7E867E8C7E88FEFE5EDC7E877E8B7E83'.             
178200     03  PIC X(16) VALUE X'FEFE7E855EDBFEFEFEFEFEFEFEFE7E89'.             
178300     03  PIC X(16) VALUE X'7E84FEFE5EDDFEFE5ED8FEFEFEFE7E8D'.             
178400     03  PIC X(16) VALUE X'FEFE5ED98192818F819B8195819760DC'.             
178500     03  PIC X(16) VALUE X'81918199FEFEFEFE81988196FEFE819C'.             
178600     03  PIC X(16) VALUE X'60DF8193819AFEFE60DDFEFEFEFE818E'.             
178700     03  PIC X(16) VALUE X'819060DE818D819DFEFE8194FEFEFEFE'.             
178800     03  PIC X(16) VALUE X'84B562BAFEFEFEFE84C084BE62B484B4'.             
178900     03  PIC X(16) VALUE X'84B784B884B362BE62BF84B284C184BC'.             
179000     03  PIC X(16) VALUE X'62B862B584BB84B9FEFEFEFE62BB84BD'.             
179100     03  PIC X(16) VALUE X'62B6FEFE62B7FEFE84BA62B984B6FEFE'.             
179200     03  PIC X(16) VALUE X'84BF62BC84C284C362BDFEFEFEFE6452'.             
179300     03  PIC X(16) VALUE X'64598769876FFEFE876D645564546451'.             
179400     03  PIC X(16) VALUE X'876BFEFEFEFEFEFE645764566453FEFE'.             
179500     03  PIC X(16) VALUE X'876E876A876CFEFE6458FEFEFEFEFEFE'.             
179600     03  PIC X(16) VALUE X'658389A9FEFE657F658189AB658289A8'.             
179700*    -- TAB2-IND = 54 (X'36')                                             
179800     03  PIC X(16) VALUE X'FEFE89A78B9B89AAFEFE8B9C66668B9A'.             
179900     03  PIC X(16) VALUE X'FEFEFEFE8B99FEFE8B986667FEFEFEFE'.             
180000     03  PIC X(16) VALUE X'66F6FEFEFEFE8D5A8D5BFEFEFEFEFEFE'.             
180100     03  PIC X(16) VALUE X'FEFE8E8C8E8B6796FEFE8E8A8F7C8F7D'.             
180200     03  PIC X(16) VALUE X'FEFEFEFE905790C0FEFEFEFE914891AC'.             
180300     03  PIC X(16) VALUE X'68C591B64CD6FEFE51885189FEFEFEFE'.             
180400     03  PIC X(16) VALUE X'535BFEFEFEFEFEFEFEFE645A4CD7FEFE'.             
180500     03  PIC X(16) VALUE X'518A55765CA44CD8FEFE57F25EDE6963'.             
180600     03  PIC X(16) VALUE X'FEFE6E9970E0FEFE7E8EFEFE645B4CD9'.             
180700     03  PIC X(16) VALUE X'518B6E9A6E9B778D5A76FEFEFEFE7AE9'.             
180800     03  PIC X(16) VALUE X'FEFEFEFE5CA57E8FFEFEFEFE60E0FEFE'.             
180900     03  PIC X(16) VALUE X'66684CDA778E4CDBFEFE4E6A69E14E69'.             
181000     03  PIC X(16) VALUE X'4FA74FA64FA56AE0FEFEFEFEFEFE518C'.             
181100     03  PIC X(16) VALUE X'FEFE518D6C9DFEFE6E9CFEFE6E9F535D'.             
181200     03  PIC X(16) VALUE X'6E9DFEFE535C6E9E535EFEFE70E370E2'.             
181300     03  PIC X(16) VALUE X'70E15577FEFE7443744457F374427445'.             
181400     03  PIC X(16) VALUE X'5A7857F4FEFEFEFE5A7777927791FEFE'.             
181500     03  PIC X(16) VALUE X'778F7790FEFE77937AEB7AEA7AEEFEFE'.             
181600     03  PIC X(16) VALUE X'7AED7AEC5EDF7E92FEFE7E915EE07E90'.             
181700     03  PIC X(16) VALUE X'819EFEFE819F60E1FEFE84C484C5FEFE'.             
181800     03  PIC X(16) VALUE X'FEFE8BA166698BA08B9F8B9D8B9E6797'.             
181900     03  PIC X(16) VALUE X'8D5C8F7E9149FEFE4CDCFEFE69854D88'.             
182000     03  PIC X(16) VALUE X'6986FEFEFEFEFEFE69E269E3FEFEFEFE'.             
182100     03  PIC X(16) VALUE X'FEFEFEFE6AE6FEFEFEFE6AE2FEFE6AE1'.             
182200     03  PIC X(16) VALUE X'518E6AE54FA96AE34FA86AE76AE4FEFE'.             
182300     03  PIC X(16) VALUE X'FEFE6CA16EA06C9F6CA6FEFE518FFEFE'.             
182400     03  PIC X(16) VALUE X'51926CA76CA3FEFE6CA4FEFE6C9E5191'.             
182500     03  PIC X(16) VALUE X'6CA051906CA5FEFE6CA2FEFEFEFE6EA4'.             
182600     03  PIC X(16) VALUE X'53605361FEFE6EA76EA1FEFE6EA6FEFE'.             
182700     03  PIC X(16) VALUE X'6EA2535F6EA56EA3FEFEFEFEFEFEFEFE'.             
182800     03  PIC X(16) VALUE X'FEFEFEFEFEFE70E970E6FEFE70E8557C'.             
182900     03  PIC X(16) VALUE X'557B557970E570EA5578557A70E7744D'.             
183000*    -- TAB2-IND = 55 (X'37')                                             
183100     03  PIC X(16) VALUE X'70E470EBFEFEFEFEFEFEFEFEFEFE7448'.             
183200     03  PIC X(16) VALUE X'744CFEFE744B779577A0FEFEFEFE744E'.             
183300     03  PIC X(16) VALUE X'FEFE7449779457F8FEFEFEFE57F77447'.             
183400     03  PIC X(16) VALUE X'744A57F9FEFE57F657F57446744FFEFE'.             
183500     03  PIC X(16) VALUE X'FEFEFEFE7797779EFEFE5A7A779D779A'.             
183600     03  PIC X(16) VALUE X'FEFE5A7CFEFEFEFEFEFE779CFEFEFEFE'.             
183700     03  PIC X(16) VALUE X'77967798779B77995A7B779F5A795CA6'.             
183800     03  PIC X(16) VALUE X'FEFEFEFE7AF27AF17AEFFEFE5CA95CA8'.             
183900     03  PIC X(16) VALUE X'7AF3FEFE7AF07E935EE15CA7FEFEFEFE'.             
184000     03  PIC X(16) VALUE X'FEFE7AF57AF4FEFE7E967E9460E2FEFE'.             
184100     03  PIC X(16) VALUE X'5EE27E9581A1FEFEFEFEFEFEFEFE60E3'.             
184200     03  PIC X(16) VALUE X'81A081A981A881A6FEFE81A581A281A3'.             
184300     03  PIC X(16) VALUE X'81A481A781AAFEFEFEFE84CA84C784C8'.             
184400     03  PIC X(16) VALUE X'62C084C684CC84CB84C9FEFE87718772'.             
184500     03  PIC X(16) VALUE X'645CFEFE645D8770FEFE658589AC6584'.             
184600     03  PIC X(16) VALUE X'666AFEFE666B66F78D5E8D5D8E8D8F7F'.             
184700     03  PIC X(16) VALUE X'67E590599058905A4D896EA8557D57FA'.             
184800     03  PIC X(16) VALUE X'74504D8A69874CDDFEFEFEFE69E4FEFE'.             
184900     03  PIC X(16) VALUE X'FEFEFEFE6AEC6AEA6AEB6AE84FAA6AE9'.             
185000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE6CAFFEFE5195'.             
185100     03  PIC X(16) VALUE X'6CAD6CA96CACFEFE6CA851976CABFEFE'.             
185200     03  PIC X(16) VALUE X'51945193FEFE51966CAE6CAAFEFEFEFE'.             
185300     03  PIC X(16) VALUE X'FEFEFEFE536553686EB06EAF6EAE5362'.             
185400     03  PIC X(16) VALUE X'6EB76EADFEFE536470F0FEFE6EB46EB2'.             
185500     03  PIC X(16) VALUE X'5367FEFE6EAA6EB5FEFE6EAC6EB66EB3'.             
185600     03  PIC X(16) VALUE X'6EABFEFE53636EB86EA95366FEFEFEFE'.             
185700     03  PIC X(16) VALUE X'FEFEFEFE70F570EC70F7FEFE70EF70FA'.             
185800     03  PIC X(16) VALUE X'70FB70ED70F970F670F470F85584FEFE'.             
185900     03  PIC X(16) VALUE X'5582FEFEFEFE70F2FEFE70EEFEFE70F1'.             
186000     03  PIC X(16) VALUE X'70FC70F355836EB1FEFE557E5581FEFE'.             
186100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE745E74537451FEFE'.             
186200     03  PIC X(16) VALUE X'7452FEFE7459FEFE745A74565842745B'.             
186300*    -- TAB2-IND = 56 (X'38')                                             
186400     03  PIC X(16) VALUE X'74587455FEFE57FD745457FB58417457'.             
186500     03  PIC X(16) VALUE X'745F557F57FC745D745C5843FEFEFEFE'.             
186600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE77A5FEFE'.             
186700     03  PIC X(16) VALUE X'FEFEFEFE77A65A87FEFE77ACFEFEFEFE'.             
186800     03  PIC X(16) VALUE X'77AE77A75A8177AB77AA5A825A88FEFE'.             
186900     03  PIC X(16) VALUE X'5A8977AD5A7E77A477A277A877A15A86'.             
187000     03  PIC X(16) VALUE X'77A377A977AF5A7F5A855A835A84FEFE'.             
187100     03  PIC X(16) VALUE X'FEFEFEFE5A7DFEFEFEFEFEFEFEFE5CB0'.             
187200     03  PIC X(16) VALUE X'7AFC5CAF7B43FEFE7AF6FEFE7B44FEFE'.             
187300     03  PIC X(16) VALUE X'FEFEFEFE7AF77AF8FEFE7B457B427AFD'.             
187400     03  PIC X(16) VALUE X'7B417AFA7AF9FEFE7B465CACFEFE7AFB'.             
187500     03  PIC X(16) VALUE X'FEFE5CB15CAB5CB25CB3FEFE5CAE5CAD'.             
187600     03  PIC X(16) VALUE X'FEFEFEFE7E975EE45EE3FEFEFEFE7E9C'.             
187700     03  PIC X(16) VALUE X'FEFE60E45EE5FEFEFEFE5EE77E9D5CAA'.             
187800     03  PIC X(16) VALUE X'5EE67E997E9B7E98FEFE7E9AFEFEFEFE'.             
187900     03  PIC X(16) VALUE X'FEFE81B4FEFEFEFE81B381B060E784CD'.             
188000     03  PIC X(16) VALUE X'60E881AFFEFE60E6FEFE81B181AE81AB'.             
188100     03  PIC X(16) VALUE X'81B281AC81AD60E5FEFEFEFEFEFEFEFE'.             
188200     03  PIC X(16) VALUE X'8776FEFE84D1FEFE84D084D2FEFE8773'.             
188300     03  PIC X(16) VALUE X'62C3FEFE84CEFEFE62C1FEFE62C562C4'.             
188400     03  PIC X(16) VALUE X'84CF84D3FEFE62C2FEFE877A64606586'.             
188500     03  PIC X(16) VALUE X'6461645E87778775FEFE8778FEFE877B'.             
188600     03  PIC X(16) VALUE X'645F87798774FEFEFEFE89AF89B28BA4'.             
188700     03  PIC X(16) VALUE X'89ADFEFE8D5F89B3FEFE666C89B16587'.             
188800     03  PIC X(16) VALUE X'89AE89B089B48BA5FEFE8BA3FEFEFEFE'.             
188900     03  PIC X(16) VALUE X'FEFEFEFE666D8BA2FEFEFEFEFEFE66F8'.             
189000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE67998F8267988F84'.             
189100     03  PIC X(16) VALUE X'8F818F83685C90C14D8B6CB070FD7141'.             
189200     03  PIC X(16) VALUE X'58447B4762C6666E67E690C24D8CFEFE'.             
189300     03  PIC X(16) VALUE X'6CB146F8FEFEFEFE6EB9FEFE6EBAFEFE'.             
189400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE7142714358455846'.             
189500     03  PIC X(16) VALUE X'FEFEFEFEFEFE77B0FEFE7B4A7B497B48'.             
189600*    -- TAB2-IND = 57 (X'39')                                             
189700     03  PIC X(16) VALUE X'7E9EFEFE7E9F7EA05EE8FEFEFEFE81B6'.             
189800     03  PIC X(16) VALUE X'81B5FEFEFEFE84D462C762C8FEFE877F'.             
189900     03  PIC X(16) VALUE X'877C877D877E89B689B565888BA68E8E'.             
190000     03  PIC X(16) VALUE X'4D8DFEFE5369FEFE58477B4BFEFE4D8E'.             
190100     03  PIC X(16) VALUE X'FEFE71445848FEFEFEFE5A8A5A8BFEFE'.             
190200     03  PIC X(16) VALUE X'4D8F4D9069E54FAC4FAB536A6EBB77B1'.             
190300     03  PIC X(16) VALUE X'4D914D924D934D94FEFEFEFEFEFE4FAD'.             
190400     03  PIC X(16) VALUE X'4FAE6AEE6AEDFEFEFEFE51986CB46CB2'.             
190500     03  PIC X(16) VALUE X'6CB3FEFEFEFEFEFEFEFEFEFEFEFE6EBC'.             
190600     03  PIC X(16) VALUE X'6EBDFEFEFEFE536E536CFEFE536D536B'.             
190700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE5585FEFEFEFEFEFE'.             
190800     03  PIC X(16) VALUE X'FEFE55895588714555875586FEFE7146'.             
190900     03  PIC X(16) VALUE X'FEFEFEFE584B746174605849584AFEFE'.             
191000     03  PIC X(16) VALUE X'FEFEFEFE5A8D5A8C77B3FEFEFEFE77B2'.             
191100     03  PIC X(16) VALUE X'584CFEFEFEFEFEFEFEFEFEFE5CB47B4D'.             
191200     03  PIC X(16) VALUE X'5CB57B4CFEFEFEFEFEFE7EA181B760E9'.             
191300     03  PIC X(16) VALUE X'84D5FEFEFEFEFEFE8781FEFE6670666F'.             
191400     03  PIC X(16) VALUE X'FEFEFEFE67E74D956CB5FEFEFEFE584D'.             
191500     03  PIC X(16) VALUE X'7EA25EE948A8FEFE6AEF6AF0FEFEFEFE'.             
191600     03  PIC X(16) VALUE X'6CB6519A519BFEFEFEFE5199FEFEFEFE'.             
191700     03  PIC X(16) VALUE X'FEFEFEFE5372537353705371FEFE6EBE'.             
191800     03  PIC X(16) VALUE X'FEFEFEFE6EBF536FFEFEFEFEFEFEFEFE'.             
191900     03  PIC X(16) VALUE X'7147FEFE558D558EFEFE5850714DFEFE'.             
192000     03  PIC X(16) VALUE X'55935591714E71495590558F558A714C'.             
192100     03  PIC X(16) VALUE X'714B71485592FEFE714A558BFEFE558C'.             
192200     03  PIC X(16) VALUE X'FEFEFEFE585174657466585274627464'.             
192300     03  PIC X(16) VALUE X'746874677463FEFE584E584FFEFE77BB'.             
192400     03  PIC X(16) VALUE X'5A925A9177B55A8FFEFE77B85A9377B9'.             
192500     03  PIC X(16) VALUE X'5A9477B65A8E5A9077BAFEFE77B777B4'.             
192600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7B5AFEFE7B4F'.             
192700     03  PIC X(16) VALUE X'5CB75CBA5CB95CBE5CBD7B5B7B597B52'.             
192800     03  PIC X(16) VALUE X'7B567B555CBB7B587B547B5C7B535CBC'.             
192900*    -- TAB2-IND = 58 (X'3A')                                             
193000     03  PIC X(16) VALUE X'5CB65CB8FEFE7B51FEFEFEFEFEFEFEFE'.             
193100     03  PIC X(16) VALUE X'7EA45EED7EA85EEC7EA55EEBFEFE7B50'.             
193200     03  PIC X(16) VALUE X'7B577EA7FEFE5EEE7EA97EA67EA3FEFE'.             
193300     03  PIC X(16) VALUE X'FEFE81BA81BE81C081BC81BB81B960EC'.             
193400     03  PIC X(16) VALUE X'60EA60EF60F081BD60ED81B860EE5EEA'.             
193500     03  PIC X(16) VALUE X'81BF60EBFEFEFEFEFEFE84D7FEFE84D6'.             
193600     03  PIC X(16) VALUE X'84DE84D884DD84DA62C984DCFEFEFEFE'.             
193700     03  PIC X(16) VALUE X'62CAFEFE62CBFEFE84DB84D9FEFEFEFE'.             
193800     03  PIC X(16) VALUE X'FEFEFEFE64638782FEFEFEFE64628785'.             
193900     03  PIC X(16) VALUE X'87838784FEFEFEFE6464FEFEFEFEFEFE'.             
194000     03  PIC X(16) VALUE X'89BAFEFE658B89BBFEFEFEFE658989BC'.             
194100     03  PIC X(16) VALUE X'658A89B989BDFEFE89B7FEFEFEFE6671'.             
194200     03  PIC X(16) VALUE X'8BA7667266F9FEFE89B866FAFEFEFEFE'.             
194300     03  PIC X(16) VALUE X'FEFE679A8E8FFEFE67E98F8567E8FEFE'.             
194400     03  PIC X(16) VALUE X'905B68826883FEFEFEFE91BC48A9FEFE'.             
194500     03  PIC X(16) VALUE X'53746EC0FEFE5A955A964D964E6B69E6'.             
194600     03  PIC X(16) VALUE X'FEFE6AF14FAFFEFE519CFEFE53755376'.             
194700     03  PIC X(16) VALUE X'5377746A714F5594FEFEFEFE58537469'.             
194800     03  PIC X(16) VALUE X'FEFEFEFE77BD5A98FEFE77BC5A97FEFE'.             
194900     03  PIC X(16) VALUE X'FEFE7B5D60F181C481C181C281C3FEFE'.             
195000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE8786FEFE89BEFEFE'.             
195100     03  PIC X(16) VALUE X'FEFEFEFE8D618D60FEFE8F864D976CB7'.             
195200     03  PIC X(16) VALUE X'5595FEFEFEFEFEFE5A997B5EFEFEFEFE'.             
195300     03  PIC X(16) VALUE X'7EAAFEFE60F284DFFEFE89BF8D624D98'.             
195400     03  PIC X(16) VALUE X'FEFEFEFE519D537A6EC1537B5379FEFE'.             
195500     03  PIC X(16) VALUE X'537871505596FEFEFEFE55975598FEFE'.             
195600     03  PIC X(16) VALUE X'FEFEFEFE5855746B5854FEFEFEFEFEFE'.             
195700     03  PIC X(16) VALUE X'FEFEFEFE77BE58565A9A7B5F5CBF5CC0'.             
195800     03  PIC X(16) VALUE X'FEFE5EEFFEFE5EF060F362CD84E062CC'.             
195900     03  PIC X(16) VALUE X'FEFE87876465FEFE89C08D634D994FB0'.             
196000     03  PIC X(16) VALUE X'6CBA6CB9519E6CB8519F6CBBFEFE6EC7'.             
196100     03  PIC X(16) VALUE X'537E537D6EC96EC85383FEFE5382FEFE'.             
196200*    -- TAB2-IND = 59 (X'3B')                                             
196300     03  PIC X(16) VALUE X'FEFE537CFEFE6EC36EC46EC5FEFE5384'.             
196400     03  PIC X(16) VALUE X'6EC2537F6EC65381FEFEFEFEFEFEFEFE'.             
196500     03  PIC X(16) VALUE X'7153715771557154FEFE7158FEFEFEFE'.             
196600     03  PIC X(16) VALUE X'FEFE7159715A7152FEFE7151FEFE559A'.             
196700     03  PIC X(16) VALUE X'559BFEFE715B7156FEFE7474FEFE715C'.             
196800     03  PIC X(16) VALUE X'559C5599FEFEFEFEFEFE746EFEFE746D'.             
196900     03  PIC X(16) VALUE X'FEFE746F7470747274717476585A5857'.             
197000     03  PIC X(16) VALUE X'585B746C585C7475585974735858FEFE'.             
197100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE77C177C377BF77C0'.             
197200     03  PIC X(16) VALUE X'FEFEFEFE77C477C677C777C277C55A9B'.             
197300     03  PIC X(16) VALUE X'FEFEFEFE7B63FEFE7B687B607B64FEFE'.             
197400     03  PIC X(16) VALUE X'FEFE7B697B655CC15CC9FEFE5CC47B61'.             
197500     03  PIC X(16) VALUE X'7B625EF45CCC5CC5FEFE5CCA5CC37B67'.             
197600     03  PIC X(16) VALUE X'5CCB7B665CC75CC25CC87B6A7EAF7EB1'.             
197700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
197800     03  PIC X(16) VALUE X'FEFE5CC6FEFEFEFE7EAC5EF27EB25EF3'.             
197900     03  PIC X(16) VALUE X'7EB07EAB7EAE7EB35EF17EADFEFE60F5'.             
198000     03  PIC X(16) VALUE X'81C881C7FEFE60F860F681C560F481C6'.             
198100     03  PIC X(16) VALUE X'FEFE60F7FEFEFEFEFEFE84E8FEFE84EA'.             
198200     03  PIC X(16) VALUE X'FEFE84E984E184E584E484E262CF62D0'.             
198300     03  PIC X(16) VALUE X'62CE84E384E684E7FEFE62D1FEFE646A'.             
198400     03  PIC X(16) VALUE X'878FFEFE646787896469646BFEFEFEFE'.             
198500     03  PIC X(16) VALUE X'6468878E878A6466878D8788878C878B'.             
198600     03  PIC X(16) VALUE X'FEFEFEFE89C2658E658F658CFEFE658D'.             
198700     03  PIC X(16) VALUE X'FEFEFEFE89C1FEFE8BAAFEFEFEFE6673'.             
198800     03  PIC X(16) VALUE X'FEFE8BA88BA9FEFE8D648D678D658D66'.             
198900     03  PIC X(16) VALUE X'8E90FEFEFEFE679B905C90C3FEFE6884'.             
199000     03  PIC X(16) VALUE X'914A914B68B24D9A5385FEFE77C8FEFE'.             
199100     03  PIC X(16) VALUE X'7B6BFEFE4D9B4FB1FEFE51A0FEFE6ECA'.             
199200     03  PIC X(16) VALUE X'6ECB559DFEFEFEFE77C95A9C5CCD646C'.             
199300     03  PIC X(16) VALUE X'87908BAB8D684D9CFEFEFEFEFEFE6CC1'.             
199400     03  PIC X(16) VALUE X'6CBC6CBE6CC06CBF6CBD51A1FEFEFEFE'.             
199500*    -- TAB2-IND = 60 (X'3C')                                             
199600     03  PIC X(16) VALUE X'FEFEFEFE53866ED4FEFE6ECF6ECCFEFE'.             
199700     03  PIC X(16) VALUE X'FEFE6ED3FEFEFEFE538853896ED26ED1'.             
199800     03  PIC X(16) VALUE X'6ED06ECD6ECE6ED55387FEFEFEFEFEFE'.             
199900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE55A1FEFE55A7'.             
200000     03  PIC X(16) VALUE X'55A67165715F715DFEFE55A4747D559F'.             
200100     03  PIC X(16) VALUE X'7162716671687164715E55A571637161'.             
200200     03  PIC X(16) VALUE X'559E716955A8716755A27160FEFE55A3'.             
200300     03  PIC X(16) VALUE X'55A0FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
200400     03  PIC X(16) VALUE X'FEFEFEFEFEFE585EFEFE747EFEFEFEFE'.             
200500     03  PIC X(16) VALUE X'74777479747BFEFE747C747A585FFEFE'.             
200600     03  PIC X(16) VALUE X'747FFEFE7478FEFEFEFEFEFEFEFEFEFE'.             
200700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE77CD5A9D77D5FEFE'.             
200800     03  PIC X(16) VALUE X'77CAFEFE77D6FEFE77CB77CCFEFEFEFE'.             
200900     03  PIC X(16) VALUE X'77D477D377D0585D5A9E77CE77D15A9F'.             
201000     03  PIC X(16) VALUE X'77D277CFFEFEFEFEFEFEFEFEFEFEFEFE'.             
201100     03  PIC X(16) VALUE X'FEFE7B76FEFE7B7A5CD4FEFE7EB95CD7'.             
201200     03  PIC X(16) VALUE X'7B78FEFEFEFE7B757B707B727B737B6C'.             
201300     03  PIC X(16) VALUE X'FEFE5CD3FEFEFEFE5CD2FEFE5CCE7B6F'.             
201400     03  PIC X(16) VALUE X'FEFE5CD5FEFE5CD67B6E7B717B795CD0'.             
201500     03  PIC X(16) VALUE X'5CD17B777B6DFEFEFEFEFEFE7EBB5EF6'.             
201600     03  PIC X(16) VALUE X'7EBD7B747EBF5EFA7EC07EBCFEFE5EF7'.             
201700     03  PIC X(16) VALUE X'7EB85EF97EB57EBA7EBE7EB7FEFEFEFE'.             
201800     03  PIC X(16) VALUE X'5CCFFEFE7EB45EF87EB6FEFEFEFEFEFE'.             
201900     03  PIC X(16) VALUE X'FEFEFEFE60FB81CA6142FEFE60FDFEFE'.             
202000     03  PIC X(16) VALUE X'FEFE5EF5FEFE81D181D260FAFEFEFEFE'.             
202100     03  PIC X(16) VALUE X'81D081D360FC60F981CC81C981CE81CB'.             
202200     03  PIC X(16) VALUE X'614381CDFEFEFEFE81CF6141FEFEFEFE'.             
202300     03  PIC X(16) VALUE X'FEFEFEFE62D384F1FEFE84EB84EF84F5'.             
202400     03  PIC X(16) VALUE X'84F684F284F384F0FEFE84EDFEFE62D5'.             
202500     03  PIC X(16) VALUE X'62D284EC84EEFEFE62D484F4FEFE6470'.             
202600     03  PIC X(16) VALUE X'FEFEFEFE87968791646FFEFEFEFE646D'.             
202700     03  PIC X(16) VALUE X'FEFE8798646E879487958792879989C3'.             
202800*    -- TAB2-IND = 61 (X'3D')                                             
202900     03  PIC X(16) VALUE X'FEFE64718793FEFE879A8797FEFEFEFE'.             
203000     03  PIC X(16) VALUE X'FEFE89C7FEFEFEFE89C4FEFE6590FEFE'.             
203100     03  PIC X(16) VALUE X'89C889CA89C989C589C6FEFEFEFE8BB0'.             
203200     03  PIC X(16) VALUE X'FEFE6674FEFE8BAD8BAF8BAC8BB1FEFE'.             
203300     03  PIC X(16) VALUE X'FEFE8BAEFEFE8D6A8D6D8D6966FB8D6B'.             
203400     03  PIC X(16) VALUE X'8D6C8D6E66FC674166FD8E91FEFE8E93'.             
203500     03  PIC X(16) VALUE X'FEFE8E92FEFEFEFEFEFE8F87FEFEFEFE'.             
203600     03  PIC X(16) VALUE X'90C4914C4D9DFEFEFEFE6AF251A26CC3'.             
203700     03  PIC X(16) VALUE X'51A351A46CC2FEFE6EDA6ED9538A538D'.             
203800     03  PIC X(16) VALUE X'538C538B6ED66ED86ED7FEFEFEFE716C'.             
203900     03  PIC X(16) VALUE X'55AA7170716F716E716A55A955AD55B0'.             
204000     03  PIC X(16) VALUE X'FEFEFEFE55B1716B716D55AF55AE55AC'.             
204100     03  PIC X(16) VALUE X'55AB7487FEFE748574815860FEFE7482'.             
204200     03  PIC X(16) VALUE X'5861748374847486FEFE5862FEFEFEFE'.             
204300     03  PIC X(16) VALUE X'77DAFEFE77D977D877D7FEFEFEFEFEFE'.             
204400     03  PIC X(16) VALUE X'FEFE7B7E5CD8FEFE7B7B7B7DFEFE5CD9'.             
204500     03  PIC X(16) VALUE X'FEFE5CDA7B7CFEFEFEFEFEFEFEFEFEFE'.             
204600     03  PIC X(16) VALUE X'7EC9FEFE7EC27EC3FEFE5EFD5EFB5EFC'.             
204700     03  PIC X(16) VALUE X'7ECBFEFE7ECA7EC77EC67EC57EC47EC8'.             
204800     03  PIC X(16) VALUE X'7EC1FEFE81D481D981D7FEFEFEFEFEFE'.             
204900     03  PIC X(16) VALUE X'81D681D581D8FEFE84F7FEFE62D66472'.             
205000     03  PIC X(16) VALUE X'879CFEFE6473879B89CC89CB6591FEFE'.             
205100     03  PIC X(16) VALUE X'8BB266758D6F67EA8F88FEFE90C690C5'.             
205200     03  PIC X(16) VALUE X'6988538E538F7488FEFE5CDC4D9E4FB4'.             
205300     03  PIC X(16) VALUE X'4FB34FB2FEFEFEFEFEFE6CC4FEFEFEFE'.             
205400     03  PIC X(16) VALUE X'51A651A5FEFE5392FEFE6EDC6EDF6EDD'.             
205500     03  PIC X(16) VALUE X'FEFE53905391FEFEFEFE6EDB6EDEFEFE'.             
205600     03  PIC X(16) VALUE X'55B8FEFEFEFEFEFE71777179717855B5'.             
205700     03  PIC X(16) VALUE X'7173FEFEFEFE55B355B2FEFE55B655B4'.             
205800     03  PIC X(16) VALUE X'FEFE55B771767171717271757174FEFE'.             
205900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE748B748C'.             
206000     03  PIC X(16) VALUE X'748AFEFE74895863FEFEFEFEFEFEFEFE'.             
206100*    -- TAB2-IND = 62 (X'3E')                                             
206200     03  PIC X(16) VALUE X'5AA4FEFE77DB77DD77DF5AA3FEFEFEFE'.             
206300     03  PIC X(16) VALUE X'5AA1FEFE77DC5AA277DE5AA0FEFEFEFE'.             
206400     03  PIC X(16) VALUE X'7B897B7F7B837B875CE07B85FEFE7B84'.             
206500     03  PIC X(16) VALUE X'7B817B825CDE7B885CDDFEFE5CE25CE1'.             
206600     03  PIC X(16) VALUE X'5CDFFEFE7B86FEFEFEFEFEFE7ED1FEFE'.             
206700     03  PIC X(16) VALUE X'7ED0FEFEFEFE7ECCFEFEFEFE5F417ECF'.             
206800     03  PIC X(16) VALUE X'7ECE5F42FEFEFEFEFEFEFEFEFEFE6148'.             
206900     03  PIC X(16) VALUE X'FEFE81DBFEFE614961456147FEFE6144'.             
207000     03  PIC X(16) VALUE X'6146FEFEFEFEFEFE84F8FEFE62D984FA'.             
207100     03  PIC X(16) VALUE X'84F9FEFE7ECD62DB62DA62D762D8FEFE'.             
207200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE87A1FEFE879F6474'.             
207300     03  PIC X(16) VALUE X'87A0FEFE87A2879E879DFEFEFEFE89CD'.             
207400     03  PIC X(16) VALUE X'659465926593FEFEFEFEFEFEFEFE8BB3'.             
207500     03  PIC X(16) VALUE X'8BB46677FEFE66768D718D728D70FEFE'.             
207600     03  PIC X(16) VALUE X'8F898F8AFEFEFEFE4D9F69E74FB5FEFE'.             
207700     03  PIC X(16) VALUE X'6CC551A851A76CC6FEFEFEFE6EE15393'.             
207800     03  PIC X(16) VALUE X'6EE05394FEFEFEFE55B9717C717A7181'.             
207900     03  PIC X(16) VALUE X'55BA717B717F717D717EFEFEFEFE748D'.             
208000     03  PIC X(16) VALUE X'748FFEFE5864FEFE748E58655AA75AA6'.             
208100     03  PIC X(16) VALUE X'5AA577E0FEFEFEFEFEFEFEFE7B8C5CE3'.             
208200     03  PIC X(16) VALUE X'5CE4FEFE7B8B7B8AFEFEFEFEFEFEFEFE'.             
208300     03  PIC X(16) VALUE X'7ED25F445F437ED37ED4FEFE614B614A'.             
208400     03  PIC X(16) VALUE X'FEFE854181DC81DE81DD84FD84FB8542'.             
208500     03  PIC X(16) VALUE X'84FCFEFE62DCFEFEFEFEFEFE87A36475'.             
208600     03  PIC X(16) VALUE X'87A487A5FEFEFEFE65956596FEFE6742'.             
208700     03  PIC X(16) VALUE X'FEFEFEFE685D4DA0FEFEFEFEFEFEFEFE'.             
208800     03  PIC X(16) VALUE X'FEFE6EE2FEFEFEFEFEFEFEFEFEFEFEFE'.             
208900     03  PIC X(16) VALUE X'718255BBFEFEFEFEFEFEFEFEFEFE58FD'.             
209000     03  PIC X(16) VALUE X'58FCFEFEFEFE5AA977E25AA877E1FEFE'.             
209100     03  PIC X(16) VALUE X'FEFEFEFEFEFE7B8DFEFE5F457ED55F46'.             
209200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE67438D73'.             
209300     03  PIC X(16) VALUE X'FEFE4E6C51A96CC7FEFE5396FEFE5395'.             
209400*    -- TAB2-IND = 63 (X'3F')                                             
209500     03  PIC X(16) VALUE X'6EE36EE4FEFEFEFE7184718655BCFEFE'.             
209600     03  PIC X(16) VALUE X'7188718B7189FEFEFEFEFEFE718A7187'.             
209700     03  PIC X(16) VALUE X'718355BD718C7185FEFEFEFEFEFEFEFE'.             
209800     03  PIC X(16) VALUE X'7498586B74A15868FEFE749A586CFEFE'.             
209900     03  PIC X(16) VALUE X'5866FEFE749574A274967493586AFEFE'.             
210000     03  PIC X(16) VALUE X'5867FEFE7499749C5869749D586D749E'.             
210100     03  PIC X(16) VALUE X'7494749B749F749774927490FEFEFEFE'.             
210200     03  PIC X(16) VALUE X'74A0FEFEFEFE77E4FEFEFEFEFEFEFEFE'.             
210300     03  PIC X(16) VALUE X'77E9FEFEFEFEFEFE77E577EB5AAC7491'.             
210400     03  PIC X(16) VALUE X'77E65AAA77E35AB177E75AB077E85AB2'.             
210500     03  PIC X(16) VALUE X'5AAD5AB35AAEFEFE5AAFFEFE5AABFEFE'.             
210600     03  PIC X(16) VALUE X'77EAFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
210700     03  PIC X(16) VALUE X'5CE77B98FEFE7B9B7B8F7B947B8E5CE9'.             
210800     03  PIC X(16) VALUE X'FEFE7B92FEFEFEFEFEFE7B905CE8FEFE'.             
210900     03  PIC X(16) VALUE X'7B977B967B937B957B915F4A7B9A5CE5'.             
211000     03  PIC X(16) VALUE X'7B99FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
211100     03  PIC X(16) VALUE X'FEFEFEFE7EE5FEFE5F517EE0FEFE5F50'.             
211200     03  PIC X(16) VALUE X'7ED6FEFE7ED85F497EDD7EDC7EDF5F4E'.             
211300     03  PIC X(16) VALUE X'7EDA7ED9FEFEFEFE5F4D5F487EDB5F4B'.             
211400     03  PIC X(16) VALUE X'7EE17EE3FEFE7EDE7ED75F4CFEFEFEFE'.             
211500     03  PIC X(16) VALUE X'61535F47FEFEFEFE7EE4FEFEFEFEFEFE'.             
211600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE81E2614CFEFE81E4'.             
211700     03  PIC X(16) VALUE X'FEFE614DFEFEFEFE614F81E7FEFE81DF'.             
211800     03  PIC X(16) VALUE X'5F4F81E5FEFEFEFEFEFEFEFE81E1FEFE'.             
211900     03  PIC X(16) VALUE X'5CE66152FEFEFEFE614EFEFE61506151'.             
212000     03  PIC X(16) VALUE X'FEFE62DF81E681E06154FEFE81E3FEFE'.             
212100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE854C8547FEFEFEFE'.             
212200     03  PIC X(16) VALUE X'855162DD854962E1854F854685438552'.             
212300     03  PIC X(16) VALUE X'647B62E2854E854462E0854862E48545'.             
212400     03  PIC X(16) VALUE X'854A62E3854D8550FEFEFEFEFEFEFEFE'.             
212500     03  PIC X(16) VALUE X'87B787B887A887AF87ADFEFEFEFE6479'.             
212600     03  PIC X(16) VALUE X'87B4854BFEFE87ABFEFE87B5647887AA'.             
212700*    -- TAB2-IND = 64 (X'40')                                             
212800     03  PIC X(16) VALUE X'87A987B387B087B2FEFE87A687B66476'.             
212900     03  PIC X(16) VALUE X'FEFE87B187BA87AE647A647787AC87A7'.             
213000     03  PIC X(16) VALUE X'87B962DEFEFEFEFEFEFEFEFEFEFEFEFE'.             
213100     03  PIC X(16) VALUE X'FEFE89D0FEFEFEFE89CE89D4659A89D2'.             
213200     03  PIC X(16) VALUE X'89D1659C89D7659BFEFE89D889D56598'.             
213300     03  PIC X(16) VALUE X'89D689CF659965978BB889D3FEFEFEFE'.             
213400     03  PIC X(16) VALUE X'89D9FEFEFEFE8BB5FEFEFEFEFEFE667C'.             
213500     03  PIC X(16) VALUE X'667A8BB7FEFE8BB98BB6667B66786679'.             
213600     03  PIC X(16) VALUE X'667DFEFEFEFE6745FEFE8D78FEFE8D77'.             
213700     03  PIC X(16) VALUE X'8D758D748D76FEFE67446746FEFEFEFE'.             
213800     03  PIC X(16) VALUE X'679CFEFEFEFE8E958E94FEFEFEFE8F8B'.             
213900     03  PIC X(16) VALUE X'FEFE8F8D8F8F8F8E8F8CFEFEFEFE67EC'.             
214000     03  PIC X(16) VALUE X'67EBFEFEFEFE685F685E6860905E905D'.             
214100     03  PIC X(16) VALUE X'FEFE914D90C7914E68A4FEFE68A5917E'.             
214200     03  PIC X(16) VALUE X'FEFEFEFE68CA4E6DFEFE6CC8FEFEFEFE'.             
214300     03  PIC X(16) VALUE X'6EE66EE76EE5FEFEFEFE5397FEFE6EE8'.             
214400     03  PIC X(16) VALUE X'6EE96EEAFEFEFEFE718D7193FEFEFEFE'.             
214500     03  PIC X(16) VALUE X'719155BE718FFEFE71907192FEFEFEFE'.             
214600     03  PIC X(16) VALUE X'FEFE718E586EFEFE74A3587074A5586F'.             
214700     03  PIC X(16) VALUE X'74A4FEFEFEFEFEFEFEFEFEFE77ED5AB4'.             
214800     03  PIC X(16) VALUE X'FEFE77EF77EC74A6FEFE5AB5FEFEFEFE'.             
214900     03  PIC X(16) VALUE X'77EEFEFEFEFEFEFEFEFEFEFEFEFE7B9E'.             
215000     03  PIC X(16) VALUE X'FEFE5CEA7B9C5CEB7B9D5CECFEFEFEFE'.             
215100     03  PIC X(16) VALUE X'FEFE5F527EE97EE67EE85F535F547EE7'.             
215200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE81E8FEFEFEFE'.             
215300     03  PIC X(16) VALUE X'81E9FEFE615581EB81EAFEFE46F9FEFE'.             
215400     03  PIC X(16) VALUE X'855685578553FEFE855462E562E68555'.             
215500     03  PIC X(16) VALUE X'FEFE6482FEFEFEFE647D6483647E6481'.             
215600     03  PIC X(16) VALUE X'647CFEFE647FFEFEFEFEFEFEFEFE659D'.             
215700     03  PIC X(16) VALUE X'87BBFEFE8BBBFEFE8BBAFEFE8D796747'.             
215800     03  PIC X(16) VALUE X'67488F918E96FEFE8F90FEFE914F9194'.             
215900     03  PIC X(16) VALUE X'4E6EFEFEFEFE4FB6FEFE6CC951AAFEFE'.             
216000*    -- TAB2-IND = 65 (X'41')                                             
216100     03  PIC X(16) VALUE X'539A6EED53986EEB539D5399539E539C'.             
216200     03  PIC X(16) VALUE X'6EEC539B55C255C1719E55CA7197719D'.             
216300     03  PIC X(16) VALUE X'55C67196719C719A55C555C7719955C0'.             
216400     03  PIC X(16) VALUE X'719855CB55C855CC55C971957194719B'.             
216500     03  PIC X(16) VALUE X'55C355BF55C4FEFEFEFEFEFEFEFEFEFE'.             
216600     03  PIC X(16) VALUE X'74B574AEFEFE5ABA74ADFEFE5874587B'.             
216700     03  PIC X(16) VALUE X'5878587E587D5879FEFE74A774AAFEFE'.             
216800     03  PIC X(16) VALUE X'74A9587574AB74B4587674A874B174B2'.             
216900     03  PIC X(16) VALUE X'587774AF587C5872587A74AC587174B0'.             
217000     03  PIC X(16) VALUE X'FEFEFEFE74B3FEFEFEFEFEFE784377F7'.             
217100     03  PIC X(16) VALUE X'5AB7784177FB77F377FC5AB977F4FEFE'.             
217200     03  PIC X(16) VALUE X'77F0FEFEFEFE5CF277F9FEFE5AB67842'.             
217300     03  PIC X(16) VALUE X'FEFE5ABD5ABF77F2FEFEFEFE5ABE77F5'.             
217400     03  PIC X(16) VALUE X'5AB877FD77F677FAFEFE77F85ABB77F1'.             
217500     03  PIC X(16) VALUE X'5AC058735ABC5AC1FEFEFEFEFEFEFEFE'.             
217600     03  PIC X(16) VALUE X'FEFE5CEE7BA57BA77BA97BADFEFE7BA3'.             
217700     03  PIC X(16) VALUE X'7BA15CF0FEFE7BA87BAC7BA47BA0FEFE'.             
217800     03  PIC X(16) VALUE X'7B9FFEFEFEFEFEFE7BAA7BA27BA65CF1'.             
217900     03  PIC X(16) VALUE X'FEFE5CEF7BAE5CED7BABFEFE7EFAFEFE'.             
218000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE5F577EF261627EFC'.             
218100     03  PIC X(16) VALUE X'5F5A7F435F607EEDFEFEFEFE7EFD7EEA'.             
218200     03  PIC X(16) VALUE X'FEFE7F427EEEFEFE5F675F647F417EF8'.             
218300     03  PIC X(16) VALUE X'5F565F5E5F5DFEFE5F5C5F62FEFE7EEB'.             
218400     03  PIC X(16) VALUE X'5F637EF95F5F5F557EFB5F585F595F61'.             
218500     03  PIC X(16) VALUE X'7EF07EEF7EECFEFE7EF47EF17EF55F66'.             
218600     03  PIC X(16) VALUE X'FEFE7F445F5B7EF67EF7FEFE7EF3FEFE'.             
218700     03  PIC X(16) VALUE X'FEFEFEFE5F65FEFEFEFEFEFEFEFE81F0'.             
218800     03  PIC X(16) VALUE X'615A6163615F81EDFEFE615C616081F9'.             
218900     03  PIC X(16) VALUE X'615681F1FEFE615EFEFEFEFE81F481EF'.             
219000     03  PIC X(16) VALUE X'615D616181EEFEFE615BFEFE81F86158'.             
219100     03  PIC X(16) VALUE X'81F781F6616480BC6157FEFE81F581EC'.             
219200     03  PIC X(16) VALUE X'FEFE616581F36159FEFEFEFEFEFEFEFE'.             
219300*    -- TAB2-IND = 66 (X'42')                                             
219400     03  PIC X(16) VALUE X'FEFEFEFEFEFE81F2FEFEFEFEFEFEFEFE'.             
219500     03  PIC X(16) VALUE X'62E962EE62E78564855B8567855F8565'.             
219600     03  PIC X(16) VALUE X'62EF62E88558855E856885618566855A'.             
219700     03  PIC X(16) VALUE X'FEFEFEFE856262EA856062ED62EC855C'.             
219800     03  PIC X(16) VALUE X'855D8559856362EB856A8569FEFEFEFE'.             
219900     03  PIC X(16) VALUE X'FEFE87C687C2648AFEFE87BC64846494'.             
220000     03  PIC X(16) VALUE X'87C8648C648887BF648F649287CA6487'.             
220100     03  PIC X(16) VALUE X'87C1649087CC87C987BD648B64856493'.             
220200     03  PIC X(16) VALUE X'87C4648E87BE648987CB648D648687C5'.             
220300     03  PIC X(16) VALUE X'649187C3FEFEFEFE87C7FEFEFEFEFEFE'.             
220400     03  PIC X(16) VALUE X'89DB89E165A389E4659E659F89DC89E3'.             
220500     03  PIC X(16) VALUE X'89DE65A465A1FEFE89DAFEFE65A089E0'.             
220600     03  PIC X(16) VALUE X'89E265A289DF89DDFEFEFEFEFEFEFEFE'.             
220700     03  PIC X(16) VALUE X'8BC566826683667EFEFE667FFEFE8BC1'.             
220800     03  PIC X(16) VALUE X'8BBFFEFE8BC366858BC48BBD8BBC8BC0'.             
220900     03  PIC X(16) VALUE X'8BBE66818BC28D7A674B674A8D7BFEFE'.             
221000     03  PIC X(16) VALUE X'8D7D8D7C674CFEFEFEFEFEFE8E9B8E98'.             
221100     03  PIC X(16) VALUE X'8E99FEFE8E978E9A679E8E9CFEFE679D'.             
221200     03  PIC X(16) VALUE X'FEFE8F92FEFE68616863905F686290C8'.             
221300     03  PIC X(16) VALUE X'915191539150915268B8FEFEFEFEFEFE'.             
221400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
221500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
221600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
221700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
221800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
221900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222600*    -- TAB2-IND = 67 (X'43')                                             
222700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
222900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
223000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
223100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
223200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
223300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE4E6FFEFE'.             
223400     03  PIC X(16) VALUE X'539F70D255CDFEFEFEFE587F78447845'.             
223500     03  PIC X(16) VALUE X'FEFEFEFEFEFE856B649587CDFEFEFEFE'.             
223600     03  PIC X(16) VALUE X'65A5FEFE8BC78BC6674D8E9DFEFE8F93'.             
223700     03  PIC X(16) VALUE X'688569E8FEFEFEFE51AB4FB7FEFEFEFE'.             
223800     03  PIC X(16) VALUE X'6EEEFEFEFEFE71A4719F71A371A155CE'.             
223900     03  PIC X(16) VALUE X'71A271A0FEFE74B6FEFE784678477BB1'.             
224000     03  PIC X(16) VALUE X'7BB25CF45CF57BB07BB37BAF5CF3FEFE'.             
224100     03  PIC X(16) VALUE X'5F68FEFE5CF67F45FEFE616681FA6167'.             
224200     03  PIC X(16) VALUE X'FEFE62F0856E856C856D87D087CF87CE'.             
224300     03  PIC X(16) VALUE X'FEFEFEFEFEFE8BC8FEFE66848BC98F94'.             
224400     03  PIC X(16) VALUE X'688690C94E7051AD51AC6EF053A0FEFE'.             
224500     03  PIC X(16) VALUE X'FEFE6EEF71A6FEFE55CF74B771A5FEFE'.             
224600     03  PIC X(16) VALUE X'FEFEFEFE588274BA74B874B95881FEFE'.             
224700     03  PIC X(16) VALUE X'7849784A7848FEFE5CF97BB57BB47BB6'.             
224800     03  PIC X(16) VALUE X'5CF85CF7FEFEFEFE81FB81FDFEFE6168'.             
224900     03  PIC X(16) VALUE X'81FC856F62F189E6FEFE89E566868BCA'.             
225000     03  PIC X(16) VALUE X'668866878D7E8E9E679F4E716EF153A1'.             
225100     03  PIC X(16) VALUE X'71A955D171A871A7FEFE55D0FEFE74C0'.             
225200     03  PIC X(16) VALUE X'FEFE74C274BB74BC588374BD588474C1'.             
225300     03  PIC X(16) VALUE X'74BE74BF5885FEFE5AC35AC4FEFE784B'.             
225400     03  PIC X(16) VALUE X'FEFEFEFEFEFE7BB77BB8FEFE7F495F6B'.             
225500     03  PIC X(16) VALUE X'5F695F6A7F467F47FEFE7F488245FEFE'.             
225600     03  PIC X(16) VALUE X'82466169824382428244824162F48570'.             
225700     03  PIC X(16) VALUE X'62F262F387D2649687D18955FEFE89E7'.             
225800     03  PIC X(16) VALUE X'89E865A6FEFE65A764978BCB8BCC8D7F'.             
225900*    -- TAB2-IND = 68 (X'44')                                             
226000     03  PIC X(16) VALUE X'674E4E72FEFE4E7353A251AE55D26EF2'.             
226100     03  PIC X(16) VALUE X'FEFEFEFEFEFE5AC54E7453A46EF36EF4'.             
226200     03  PIC X(16) VALUE X'53A353A54E75FEFE6EF555D471AA55D6'.             
226300     03  PIC X(16) VALUE X'55D355D5FEFE74C55886FEFE74C474C3'.             
226400     03  PIC X(16) VALUE X'FEFE7BB9FEFEFEFE7F4AFEFE616AFEFE'.             
226500     03  PIC X(16) VALUE X'62F585728571FEFE87D3FEFEFEFEFEFE'.             
226600     03  PIC X(16) VALUE X'8E9FFEFEFEFE4E766AF36CCA53A66EF6'.             
226700     03  PIC X(16) VALUE X'FEFE71ACFEFEFEFEFEFE55D771AB55D8'.             
226800     03  PIC X(16) VALUE X'FEFEFEFEFEFE74C7FEFEFEFE588874C6'.             
226900     03  PIC X(16) VALUE X'74C8FEFE5887FEFEFEFEFEFEFEFE784D'.             
227000     03  PIC X(16) VALUE X'784E784C5AC6FEFEFEFEFEFE5CFAFEFE'.             
227100     03  PIC X(16) VALUE X'5CFBFEFE5F6DFEFE7F4C7F4B5F6CFEFE'.             
227200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE8247FEFEFEFE8248'.             
227300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE8573FEFEFEFE649B'.             
227400     03  PIC X(16) VALUE X'649A64986499649CFEFE89E965A965A8'.             
227500     03  PIC X(16) VALUE X'8BCD8D81FEFEFEFEFEFE67EE67ED4E77'.             
227600     03  PIC X(16) VALUE X'FEFEFEFE709FFEFE5CFD5AC75CFC5F6E'.             
227700     03  PIC X(16) VALUE X'FEFE4E7869894E794E7AFEFEFEFE6CCB'.             
227800     03  PIC X(16) VALUE X'6AF6FEFE6AF74FB9FEFE6AF44FB8FEFE'.             
227900     03  PIC X(16) VALUE X'4FBB6AF54FBD4FBC6AF84FBAFEFEFEFE'.             
228000     03  PIC X(16) VALUE X'FEFE51B351B16CCDFEFE51B0FEFEFEFE'.             
228100     03  PIC X(16) VALUE X'FEFE51B551B751B4FEFE6CD06CCC51B8'.             
228200     03  PIC X(16) VALUE X'FEFE51B24FBEFEFE51B66CCFFEFEFEFE'.             
228300     03  PIC X(16) VALUE X'6CCEFEFE51AFFEFEFEFEFEFEFEFEFEFE'.             
228400     03  PIC X(16) VALUE X'FEFEFEFE6EFC53AA53AB6F41FEFE6EF8'.             
228500     03  PIC X(16) VALUE X'6EFB6F476F45FEFE53AC6F4B53AF6F48'.             
228600     03  PIC X(16) VALUE X'6EFD6EFAFEFEFEFE78506F4653A76F49'.             
228700     03  PIC X(16) VALUE X'6EF76F4353A953AE6F4453B253B0FEFE'.             
228800     03  PIC X(16) VALUE X'6EF953ADFEFE6F4253B153A86F4AFEFE'.             
228900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE55DDFEFE55E6'.             
229000     03  PIC X(16) VALUE X'55DB55D971AE55E155DE71B0FEFEFEFE'.             
229100     03  PIC X(16) VALUE X'55E071AF71AD71B255E555E3784FFEFE'.             
229200*    -- TAB2-IND = 69 (X'45')                                             
229300     03  PIC X(16) VALUE X'71B371B155DAFEFEFEFE55DC55DFFEFE'.             
229400     03  PIC X(16) VALUE X'55E2FEFE55E4FEFEFEFEFEFEFEFEFEFE'.             
229500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE74D2588AFEFE'.             
229600     03  PIC X(16) VALUE X'74C974CBFEFE74CCFEFE74D474D074CE'.             
229700     03  PIC X(16) VALUE X'FEFE74D174D5588B588F74CAFEFE74D3'.             
229800     03  PIC X(16) VALUE X'FEFE588DFEFE588C74CF74CDFEFE5889'.             
229900     03  PIC X(16) VALUE X'588EFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
230000     03  PIC X(16) VALUE X'FEFE5ACD7858FEFEFEFE78565ACFFEFE'.             
230100     03  PIC X(16) VALUE X'FEFEFEFEFEFE78517BC7FEFE5ACE7855'.             
230200     03  PIC X(16) VALUE X'FEFEFEFE78525ACA5AD078575ACC7854'.             
230300     03  PIC X(16) VALUE X'5F6F5ACB78535AD15AC95AC8FEFEFEFE'.             
230400     03  PIC X(16) VALUE X'FEFEFEFEFEFE7BBF7BBDFEFE7BC3FEFE'.             
230500     03  PIC X(16) VALUE X'7BBB7BC87BC0FEFE7BBA5D445D4A7BC5'.             
230600     03  PIC X(16) VALUE X'FEFE7BBEFEFE5D47FEFEFEFE5D457BC6'.             
230700     03  PIC X(16) VALUE X'5D425D417BC15D465AD2FEFE7BC47BBC'.             
230800     03  PIC X(16) VALUE X'5D435D485D49FEFEFEFEFEFEFEFE5F74'.             
230900     03  PIC X(16) VALUE X'5F70FEFE5F757F4FFEFEFEFE7F4E7F50'.             
231000     03  PIC X(16) VALUE X'5F727F4D5F737F537F527F51FEFE5F71'.             
231100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE824CFEFE824F'.             
231200     03  PIC X(16) VALUE X'6170824E616F616B616C616D824B824A'.             
231300     03  PIC X(16) VALUE X'616EFEFE824D8249FEFEFEFE8575857F'.             
231400     03  PIC X(16) VALUE X'62F862F7FEFE8579857BFEFE8576FEFE'.             
231500     03  PIC X(16) VALUE X'857A8574857D62F6857C8578FEFE857E'.             
231600     03  PIC X(16) VALUE X'FEFE8577649F87D487DA64A364A564A2'.             
231700     03  PIC X(16) VALUE X'64A1FEFE64A0649E87D587D8649D87D9'.             
231800     03  PIC X(16) VALUE X'FEFE64A487D7FEFE87D665AAFEFE65AB'.             
231900     03  PIC X(16) VALUE X'89EC89EA89EBFEFEFEFE8BCFFEFE8BCE'.             
232000     03  PIC X(16) VALUE X'66898D83674F8D82FEFE8EA08F9567EF'.             
232100     03  PIC X(16) VALUE X'9154915568644E7BFEFE51B978595F76'.             
232200     03  PIC X(16) VALUE X'64A687DB4E7CFEFE55E855E7785AFEFE'.             
232300     03  PIC X(16) VALUE X'FEFEFEFE85814E7D53B3FEFEFEFE785B'.             
232400     03  PIC X(16) VALUE X'785C785D5F7762F94E7EFEFE51BA6F4C'.             
232500*    -- TAB2-IND = 70 (X'46')                                             
232600     03  PIC X(16) VALUE X'55E971B45890FEFE785E5D4BFEFE5F78'.             
232700     03  PIC X(16) VALUE X'62FA64A765AC8D844E7F51BBFEFEFEFE'.             
232800     03  PIC X(16) VALUE X'55EA74D65AD3FEFE5F797F548250FEFE'.             
232900     03  PIC X(16) VALUE X'FEFEFEFEFEFE4E815AD47BC95F7A4E82'.             
233000     03  PIC X(16) VALUE X'6CD16F4D53B4FEFEFEFE71B6FEFEFEFE'.             
233100     03  PIC X(16) VALUE X'55EDFEFE55EB55EC55EEFEFEFEFE71B5'.             
233200     03  PIC X(16) VALUE X'FEFEFEFE74DB74D874DA589158935892'.             
233300     03  PIC X(16) VALUE X'74D7589474D9FEFE785F7860FEFE7861'.             
233400     03  PIC X(16) VALUE X'7BCCFEFE7BCDFEFE7BCB7BCEFEFE5D4C'.             
233500     03  PIC X(16) VALUE X'FEFE7BCAFEFE5F7BFEFEFEFE82558251'.             
233600     03  PIC X(16) VALUE X'8254825682538252FEFE858285838584'.             
233700     03  PIC X(16) VALUE X'62FB62FC87DD87DC87DEFEFE89EE89ED'.             
233800     03  PIC X(16) VALUE X'FEFE8BD1FEFE8BD28BD0FEFE6750FEFE'.             
233900     03  PIC X(16) VALUE X'8D858D86FEFE8F96906090CA4E834FBF'.             
234000     03  PIC X(16) VALUE X'FEFE64A84E84FEFE74DC7862FEFE688D'.             
234100     03  PIC X(16) VALUE X'69E9FEFEFEFEFEFE69EA69EC4E8569ED'.             
234200     03  PIC X(16) VALUE X'69EBFEFEFEFE6B436B446AFBFEFEFEFE'.             
234300     03  PIC X(16) VALUE X'FEFEFEFE6B424FC1FEFE4FC26AFC6AFA'.             
234400     03  PIC X(16) VALUE X'6AF96AFD4FC06B416F4EFEFEFEFEFEFE'.             
234500     03  PIC X(16) VALUE X'6CD651BE6CD56CD7FEFE51BD6CDC51C1'.             
234600     03  PIC X(16) VALUE X'6CD26CE06CE651C86CE351C5FEFE6CD9'.             
234700     03  PIC X(16) VALUE X'6CDF6CE1FEFE6CD451C451BF6CDA51C6'.             
234800     03  PIC X(16) VALUE X'51C951C3FEFE51BC6CDE6CD86CE551CB'.             
234900     03  PIC X(16) VALUE X'51C751C26CDD55EF6CDB51C051CAFEFE'.             
235000     03  PIC X(16) VALUE X'6CD3FEFE6CE26CE4FEFEFEFEFEFEFEFE'.             
235100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
235200     03  PIC X(16) VALUE X'FEFE53C553BF53C753C46F556F5853C0'.             
235300     03  PIC X(16) VALUE X'FEFE6F4FFEFE53B953C3FEFE53C653C8'.             
235400     03  PIC X(16) VALUE X'6F646F5BFEFE53B86F6353BC53BA53B5'.             
235500     03  PIC X(16) VALUE X'6F53FEFE6F626F576F5A6F67FEFE53C9'.             
235600     03  PIC X(16) VALUE X'6F6153C16F5C6F666F596F5D6F60FEFE'.             
235700     03  PIC X(16) VALUE X'FEFE6F516F656F5FFEFEFEFE6F50FEFE'.             
235800*    -- TAB2-IND = 71 (X'47')                                             
235900     03  PIC X(16) VALUE X'6F5453C253BD53B653BB53B753CA6F52'.             
236000     03  PIC X(16) VALUE X'71C753BEFEFEFEFE6F5E6D63FEFEFEFE'.             
236100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE71CA55FD'.             
236200     03  PIC X(16) VALUE X'FEFE71BAFEFE71C571C1FEFE71D4FEFE'.             
236300     03  PIC X(16) VALUE X'71CCFEFE71C2FEFE71CB71BC71C071D7'.             
236400     03  PIC X(16) VALUE X'564371CF71C655F071D571B8FEFE71CE'.             
236500     03  PIC X(16) VALUE X'FEFE564255FA71B755F855F755FC71CD'.             
236600     03  PIC X(16) VALUE X'55F455FB6F56786371C8FEFEFEFE71BE'.             
236700     03  PIC X(16) VALUE X'564171BF71C3564471B971D1FEFE71D0'.             
236800     03  PIC X(16) VALUE X'71D855F655F371D671D271C971C455F9'.             
236900     03  PIC X(16) VALUE X'55F571BB55F171D355F2FEFE71BDFEFE'.             
237000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
237100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
237200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
237300     03  PIC X(16) VALUE X'FEFEFEFEFEFE74E274E474E974FD58A2'.             
237400     03  PIC X(16) VALUE X'5898FEFE74E158A358A474EC74F374F9'.             
237500     03  PIC X(16) VALUE X'FEFE74E6FEFE74EDFEFEFEFE58A574FB'.             
237600     03  PIC X(16) VALUE X'74F658A0589E74F274EE74E0589574E5'.             
237700     03  PIC X(16) VALUE X'74DDFEFE589D589F74EA74E7589A74F7'.             
237800     03  PIC X(16) VALUE X'589774E8754174F0FEFE74EF5896FEFE'.             
237900     03  PIC X(16) VALUE X'58A1FEFE589974DE74E374F474FA58A6'.             
238000     03  PIC X(16) VALUE X'74DF74EB74F1589CFEFEFEFE74FC74F5'.             
238100     03  PIC X(16) VALUE X'74F8FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
238200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE589BFEFE7873'.             
238300     03  PIC X(16) VALUE X'78675ADC7885788D78905ADA786F7889'.             
238400     03  PIC X(16) VALUE X'7870787E5AE7787A5AE4FEFE787B7864'.             
238500     03  PIC X(16) VALUE X'FEFE788AFEFEFEFE5AED7887787C7892'.             
238600     03  PIC X(16) VALUE X'78777BEEFEFE78955AEB787578825AEE'.             
238700     03  PIC X(16) VALUE X'5AD9787978937872786B7876FEFE786A'.             
238800     03  PIC X(16) VALUE X'78685AD5788B7871788EFEFE788F5ADD'.             
238900     03  PIC X(16) VALUE X'5AE25ADE5AE678865ADF787D786DFEFE'.             
239000     03  PIC X(16) VALUE X'5AD7786578887891786C5AE578967878'.             
239100*    -- TAB2-IND = 72 (X'48')                                             
239200     03  PIC X(16) VALUE X'FEFE7874FEFE5AD65AEAFEFE78845AEC'.             
239300     03  PIC X(16) VALUE X'FEFE787F5AE15ADB5AE35AD85AE97881'.             
239400     03  PIC X(16) VALUE X'786E78837869788CFEFEFEFEFEFEFEFE'.             
239500     03  PIC X(16) VALUE X'FEFEFEFEFEFE7894FEFEFEFEFEFEFEFE'.             
239600     03  PIC X(16) VALUE X'FEFEFEFEFEFE7866FEFEFEFEFEFEFEFE'.             
239700     03  PIC X(16) VALUE X'FEFE7BEDFEFE7C465CDB7BF2FEFE7BF0'.             
239800     03  PIC X(16) VALUE X'7BDB5D507BEB7C427BE75D587C417BE5'.             
239900     03  PIC X(16) VALUE X'5AE87BF57BE67BFC5D575D4FFEFE7BD0'.             
240000     03  PIC X(16) VALUE X'7BD8FEFE7BF17BE97C457BEC5D5D7BFD'.             
240100     03  PIC X(16) VALUE X'FEFE5D54FEFE7BEF7BF77BDC7BF6FEFE'.             
240200     03  PIC X(16) VALUE X'7C4A7BD77BF8FEFE7C48FEFE7BD15AE0'.             
240300     03  PIC X(16) VALUE X'FEFE7BDF7BDE5D56FEFE7BE27BE47BF3'.             
240400     03  PIC X(16) VALUE X'7C475D59FEFE5D5AFEFE7BD65D527BDA'.             
240500     03  PIC X(16) VALUE X'7C435D5BFEFE5D535D555D5C7C497BF9'.             
240600     03  PIC X(16) VALUE X'7BF4FEFEFEFE7BE17BE05D517BD25D4E'.             
240700     03  PIC X(16) VALUE X'7BEA7BD37BE8FEFEFEFE7BDD7C44FEFE'.             
240800     03  PIC X(16) VALUE X'FEFEFEFE5D4DFEFEFEFEFEFE7BD9FEFE'.             
240900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7BD57BFB7BD4'.             
241000     03  PIC X(16) VALUE X'5F897F7CFEFEFEFE7F6BFEFEFEFE7F55'.             
241100     03  PIC X(16) VALUE X'7F735F817F647F6E5F847F675F827F58'.             
241200     03  PIC X(16) VALUE X'7F767F577F6AFEFE7F56FEFEFEFE7F68'.             
241300     03  PIC X(16) VALUE X'7F717F6F7F637F5E7F5CFEFE7F5D7F70'.             
241400     03  PIC X(16) VALUE X'7F7B7F655F83FEFE7F60FEFE7F74FEFE'.             
241500     03  PIC X(16) VALUE X'5F867F5F7F597F695F8AFEFEFEFE5F7D'.             
241600     03  PIC X(16) VALUE X'5F877F617F5BFEFE5F7F7BFA5F7E7F6C'.             
241700     03  PIC X(16) VALUE X'FEFE5F7C5F8C5F857F6D7F627F5A7F75'.             
241800     03  PIC X(16) VALUE X'7F665F8B7F795F887F78FEFE7F727F77'.             
241900     03  PIC X(16) VALUE X'FEFEFEFEFEFE7F7AFEFEFEFEFEFEFEFE'.             
242000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE827E'.             
242100     03  PIC X(16) VALUE X'827F82728271826D617CFEFE61748282'.             
242200     03  PIC X(16) VALUE X'82817BCF826A826E8268FEFE827B826C'.             
242300     03  PIC X(16) VALUE X'FEFE828382658263826F82798274617E'.             
242400*    -- TAB2-IND = 73 (X'49')                                             
242500     03  PIC X(16) VALUE X'825AFEFE8278FEFEFEFEFEFE617F7BE3'.             
242600     03  PIC X(16) VALUE X'8266825D826082878267825E825C8259'.             
242700     03  PIC X(16) VALUE X'FEFE617882706177617B826B82736171'.             
242800     03  PIC X(16) VALUE X'828482886173FEFE82628276827A825F'.             
242900     03  PIC X(16) VALUE X'8285617AFEFE61798257617D827D8261'.             
243000     03  PIC X(16) VALUE X'8275825B826982646175617682778289'.             
243100     03  PIC X(16) VALUE X'8286827CFEFEFEFEFEFEFEFEFEFEFEFE'.             
243200     03  PIC X(16) VALUE X'FEFEFEFEFEFE8258FEFE61728595FEFE'.             
243300     03  PIC X(16) VALUE X'858C858FFEFE634585918586858D8593'.             
243400     03  PIC X(16) VALUE X'6342634662FDFEFEFEFE85888598FEFE'.             
243500     03  PIC X(16) VALUE X'FEFE8592FEFE858985A1859B858587F1'.             
243600     03  PIC X(16) VALUE X'858B6341FEFE8596FEFE85A06349FEFE'.             
243700     03  PIC X(16) VALUE X'859D858A85908594858E85A2859F859C'.             
243800     03  PIC X(16) VALUE X'634363446348858785A363478599FEFE'.             
243900     03  PIC X(16) VALUE X'FEFE8597FEFEFEFEFEFE859A884187EB'.             
244000     03  PIC X(16) VALUE X'87F087FD87EF87E787ECFEFE64ABFEFE'.             
244100     03  PIC X(16) VALUE X'87E087F887FA87DF64AA87FC87F464B1'.             
244200     03  PIC X(16) VALUE X'87FB87ED64B387E5859E87F587F287E1'.             
244300     03  PIC X(16) VALUE X'884364ADFEFEFEFE64AE87E387F3FEFE'.             
244400     03  PIC X(16) VALUE X'884287F687E964B064AC87F787EA8844'.             
244500     03  PIC X(16) VALUE X'87E487EE87F987E687E8FEFE65B587E2'.             
244600     03  PIC X(16) VALUE X'64B265AE64A9FEFEFEFEFEFEFEFE64AF'.             
244700     03  PIC X(16) VALUE X'65B28A41FEFE89F489EF89F58A428A46'.             
244800     03  PIC X(16) VALUE X'8A4565B465B3FEFEFEFE89F68A4789F9'.             
244900     03  PIC X(16) VALUE X'89F1FEFE89F389F289F889FD89F089F7'.             
245000     03  PIC X(16) VALUE X'89FC65B1FEFE89FAFEFE65AF89FB65AD'.             
245100     03  PIC X(16) VALUE X'65B08BE28A43FEFEFEFE668DFEFE8BDA'.             
245200     03  PIC X(16) VALUE X'8BDE8BD68BD9FEFE8BE1668B8BE68BDF'.             
245300     03  PIC X(16) VALUE X'FEFE8BD78BE78BE0668E668F8BE4FEFE'.             
245400     03  PIC X(16) VALUE X'8BD8668A668C8BD38BDB8BD5FEFE8BE5'.             
245500     03  PIC X(16) VALUE X'8BE38BD48BDCFEFEFEFEFEFE8D8D6690'.             
245600     03  PIC X(16) VALUE X'8BDD675267546751FEFE8D928D8A8D88'.             
245700*    -- TAB2-IND = 74 (X'4A')                                             
245800     03  PIC X(16) VALUE X'8D8C8D89FEFEFEFE8D8E8D9067556757'.             
245900     03  PIC X(16) VALUE X'FEFE8D8F675867568D91FEFEFEFEFEFE'.             
246000     03  PIC X(16) VALUE X'FEFE6753FEFEFEFEFEFEFEFEFEFE67A0'.             
246100     03  PIC X(16) VALUE X'8EA18EA767A28D8B8EA6FEFE8EAD8EA4'.             
246200     03  PIC X(16) VALUE X'8EAB8EAA8D878EA58A448EAE8EA38EA8'.             
246300     03  PIC X(16) VALUE X'FEFE8EAC8EA2FEFE8F9A67A18EA9FEFE'.             
246400     03  PIC X(16) VALUE X'FEFE90658F9B8F998F978F988F9CFEFE'.             
246500     03  PIC X(16) VALUE X'68659063906190669064FEFE90676866'.             
246600     03  PIC X(16) VALUE X'9062FEFEFEFE90CBFEFEFEFE91569157'.             
246700     03  PIC X(16) VALUE X'9158FEFEFEFE91B791AD69EE51CCFEFE'.             
246800     03  PIC X(16) VALUE X'53CBFEFE71DA71D9564558A77543FEFE'.             
246900     03  PIC X(16) VALUE X'FEFE7542FEFE5AEF5D5FFEFE5D5E5D60'.             
247000     03  PIC X(16) VALUE X'FEFE7F7D828A85A485A685A5FEFE64B4'.             
247100     03  PIC X(16) VALUE X'88458A4891954E86FEFE6CE96CEA6CE8'.             
247200     03  PIC X(16) VALUE X'6CE751CDFEFE6F6B6F69FEFEFEFE6F68'.             
247300     03  PIC X(16) VALUE X'FEFE53CC53CE53CD6F6AFEFEFEFEFEFE'.             
247400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE71E671E371E1'.             
247500     03  PIC X(16) VALUE X'FEFEFEFE564671E4564B71DE71EDFEFE'.             
247600     03  PIC X(16) VALUE X'71EF71DFFEFE564871F071EB71DD71E2'.             
247700     03  PIC X(16) VALUE X'71EC71E871E5FEFE564D71EE71E0FEFE'.             
247800     03  PIC X(16) VALUE X'FEFE71E971DB564C564971E7FEFE71EA'.             
247900     03  PIC X(16) VALUE X'71DC564A5647FEFEFEFEFEFEFEFE58B1'.             
248000     03  PIC X(16) VALUE X'754A58B0FEFE754D755058AD58AB7545'.             
248100     03  PIC X(16) VALUE X'754E754C754975517552755475557544'.             
248200     03  PIC X(16) VALUE X'58AA75477546755358AC754858AE58A9'.             
248300     03  PIC X(16) VALUE X'754B58B2FEFE58AF754FFEFEFEFEFEFE'.             
248400     03  PIC X(16) VALUE X'5AF678A5FEFE789A5AF3FEFE7C5078A3'.             
248500     03  PIC X(16) VALUE X'78975AF1789C5AF478A0789E5AF75AF0'.             
248600     03  PIC X(16) VALUE X'FEFEFEFE7898789B5AF5FEFE7899FEFE'.             
248700     03  PIC X(16) VALUE X'78A478A2789D789F78A15AF2FEFEFEFE'.             
248800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE7C517C577C4D'.             
248900     03  PIC X(16) VALUE X'7C535D617C4F5D67FEFEFEFE5D66FEFE'.             
249000*    -- TAB2-IND = 75 (X'4B')                                             
249100     03  PIC X(16) VALUE X'5D657C565D685D697C4C7C595D6A5D64'.             
249200     03  PIC X(16) VALUE X'5D637C555D6B7C4B7C4E7C587C54FEFE'.             
249300     03  PIC X(16) VALUE X'FEFE7F9E7F935D62FEFEFEFEFEFEFEFE'.             
249400     03  PIC X(16) VALUE X'5F937F877F9C7F885F8EFEFE7F85FEFE'.             
249500     03  PIC X(16) VALUE X'7F8E7F865F907F7F7F9B5F917F987F99'.             
249600     03  PIC X(16) VALUE X'7F815F967F90FEFE7F8A7F917F84FEFE'.             
249700     03  PIC X(16) VALUE X'7F9D7F957F8F7F7E5F927F96FEFE5F95'.             
249800     03  PIC X(16) VALUE X'7F9AFEFE7F945F8F7F92FEFE7F8C5F8D'.             
249900     03  PIC X(16) VALUE X'7F837F8B7F977F89FEFEFEFE7F8DFEFE'.             
250000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE618A7C52829C82A5'.             
250100     03  PIC X(16) VALUE X'829B82978294618B82925F94828B6189'.             
250200     03  PIC X(16) VALUE X'829161888296829382A3829E8298829D'.             
250300     03  PIC X(16) VALUE X'6184829582A8828C828D82A4618582A9'.             
250400     03  PIC X(16) VALUE X'618782AA829A7F8282A0829982A2829F'.             
250500     03  PIC X(16) VALUE X'FEFEFEFEFEFE8290618282A76183828E'.             
250600     03  PIC X(16) VALUE X'618685B082A182A6FEFEFEFEFEFEFEFE'.             
250700     03  PIC X(16) VALUE X'FEFE85AD6181634A85B785B3FEFE85B1'.             
250800     03  PIC X(16) VALUE X'85AC85BBFEFEFEFEFEFE634EFEFE85A8'.             
250900     03  PIC X(16) VALUE X'85B485B585AB85AA85B8FEFE85AE85A9'.             
251000     03  PIC X(16) VALUE X'85AFFEFE85BA85A785B985B6634C634B'.             
251100     03  PIC X(16) VALUE X'FEFEFEFE634D85B28A59FEFEFEFEFEFE'.             
251200     03  PIC X(16) VALUE X'FEFEFEFE884764BA884B8848884F8855'.             
251300     03  PIC X(16) VALUE X'884AFEFE885E64B78858884D88598854'.             
251400     03  PIC X(16) VALUE X'885B884C64BC64BB884E885C8846885A'.             
251500     03  PIC X(16) VALUE X'64B5FEFE885288518856884964B9FEFE'.             
251600     03  PIC X(16) VALUE X'64BD8850885764BE8853FEFEFEFEFEFE'.             
251700     03  PIC X(16) VALUE X'FEFE64B664B88A558A53FEFEFEFE8A5A'.             
251800     03  PIC X(16) VALUE X'8A578A5BFEFE8A4C8A548A5F885D8A50'.             
251900     03  PIC X(16) VALUE X'65B9828F8A4B8A588A528A4F8A4A8A49'.             
252000     03  PIC X(16) VALUE X'8A5EFEFE8A4E8A4D65B78A56FEFE65B6'.             
252100     03  PIC X(16) VALUE X'FEFEFEFE65B88A518A5DFEFE8BEB8BEC'.             
252200     03  PIC X(16) VALUE X'FEFE66948BE966918BF1FEFE66958BF3'.             
252300*    -- TAB2-IND = 76 (X'4C')                                             
252400     03  PIC X(16) VALUE X'8BE88A5C8BF58BEAFEFE66928BF0FEFE'.             
252500     03  PIC X(16) VALUE X'8BF28BED8BF48BEF8BEE6693FEFEFEFE'.             
252600     03  PIC X(16) VALUE X'8D948D95FEFE8D976759675A8D988D96'.             
252700     03  PIC X(16) VALUE X'FEFE8D93FEFE8EB18EB48EB0FEFE67A6'.             
252800     03  PIC X(16) VALUE X'8EB267A567A467A38EB38FA18F9FFEFE'.             
252900     03  PIC X(16) VALUE X'8F9E8EAF8FA08EB58F9DFEFE906A9048'.             
253000     03  PIC X(16) VALUE X'906868679069906BFEFE90CE688790CD'.             
253100     03  PIC X(16) VALUE X'90CC6888FEFE68A6917F919791969198'.             
253200     03  PIC X(16) VALUE X'4E876F6CFEFE71F171F2FEFEFEFEFEFE'.             
253300     03  PIC X(16) VALUE X'78A6FEFE8EB690CF4E8853CF6F6DFEFE'.             
253400     03  PIC X(16) VALUE X'FEFEFEFE755658B3FEFE78A878A75AF8'.             
253500     03  PIC X(16) VALUE X'FEFE5D6C82AB618CFEFE618DFEFEFEFE'.             
253600     03  PIC X(16) VALUE X'FEFE634F68894E89FEFEFEFEFEFE6F6E'.             
253700     03  PIC X(16) VALUE X'51CF6F706F6F53D0FEFE71F3FEFE71FA'.             
253800     03  PIC X(16) VALUE X'564E71F871F6FEFE71FD71F471F5564F'.             
253900     03  PIC X(16) VALUE X'FEFE5653FEFEFEFE7241565271FC71F9'.             
254000     03  PIC X(16) VALUE X'71F75650565171FBFEFEFEFEFEFEFEFE'.             
254100     03  PIC X(16) VALUE X'58B57557FEFE58BA756758B97569FEFE'.             
254200     03  PIC X(16) VALUE X'FEFE755D58B77568FEFE755858B87564'.             
254300     03  PIC X(16) VALUE X'75607562755C7563FEFEFEFE58B4755F'.             
254400     03  PIC X(16) VALUE X'FEFE755E755AFEFE7565FEFEFEFE7561'.             
254500     03  PIC X(16) VALUE X'7559FEFE755B58B67566FEFEFEFEFEFE'.             
254600     03  PIC X(16) VALUE X'FEFE5AFB78B3FEFEFEFEFEFE78AF78B1'.             
254700     03  PIC X(16) VALUE X'78AC78AB78A9FEFE78B078B278AEFEFE'.             
254800     03  PIC X(16) VALUE X'78AD5AF95AFAFEFEFEFEFEFEFEFEFEFE'.             
254900     03  PIC X(16) VALUE X'FEFE78B55D747C5B7C617C5C7C5DFEFE'.             
255000     03  PIC X(16) VALUE X'7C62FEFE5D76FEFE5D6E5D757C5A78AA'.             
255100     03  PIC X(16) VALUE X'5D715D6F7C607C5F5D705D727C5E5D6D'.             
255200     03  PIC X(16) VALUE X'FEFE5D73FEFEFEFEFEFEFEFEFEFE7FA0'.             
255300     03  PIC X(16) VALUE X'5F9DFEFEFEFE7FAB7FAAFEFE7FA55F9F'.             
255400     03  PIC X(16) VALUE X'7FA97FA17FA25F975F99FEFE7FA77F9F'.             
255500     03  PIC X(16) VALUE X'5F9B5F9A7FA37FA87FA65F9C7FA4FEFE'.             
255600*    -- TAB2-IND = 77 (X'4D')                                             
255700     03  PIC X(16) VALUE X'FEFE78B45F98FEFEFEFE82AC82B3618F'.             
255800     03  PIC X(16) VALUE X'FEFE82B7619382AF82ADFEFE82B6FEFE'.             
255900     03  PIC X(16) VALUE X'618E82B56190619182AE619282B482B0'.             
256000     03  PIC X(16) VALUE X'82B182B25F9EFEFEFEFEFEFE85BC85C8'.             
256100     03  PIC X(16) VALUE X'FEFE635485C385C5FEFE635285BD85C1'.             
256200     03  PIC X(16) VALUE X'FEFE85C46350635385C785BF85C085C6'.             
256300     03  PIC X(16) VALUE X'85BE85C263518860FEFE885F64C08865'.             
256400     03  PIC X(16) VALUE X'64C2FEFEFEFE64BF886164C38862FEFE'.             
256500     03  PIC X(16) VALUE X'FEFE88638866FEFE64C1FEFE8A64FEFE'.             
256600     03  PIC X(16) VALUE X'FEFE8A67FEFE8A618A63FEFEFEFE8A62'.             
256700     03  PIC X(16) VALUE X'8A658A6688648A60FEFEFEFE66988BF9'.             
256800     03  PIC X(16) VALUE X'8BFC8C418BF78BF88BFB8BFD66996697'.             
256900     03  PIC X(16) VALUE X'66968BFA8BF68D99675BFEFE8D9AFEFE'.             
257000     03  PIC X(16) VALUE X'FEFE8EB867A78EBA67A88EB78EB967F1'.             
257100     03  PIC X(16) VALUE X'FEFE8FA267F0906E906DFEFE906CFEFE'.             
257200     03  PIC X(16) VALUE X'FEFE9159915A915C915BFEFE69EF4E8A'.             
257300     03  PIC X(16) VALUE X'FEFE53D1756A5AFCFEFE7C6365BAFEFE'.             
257400     03  PIC X(16) VALUE X'8C42FEFEFEFE4FC3FEFEFEFEFEFE58BC'.             
257500     03  PIC X(16) VALUE X'FEFEFEFEFEFE58BBFEFE78B65AFD78B8'.             
257600     03  PIC X(16) VALUE X'78B7FEFEFEFE7C645D777FAC7FAF7FAE'.             
257700     03  PIC X(16) VALUE X'FEFE7FAD82B882BA82B9FEFE6356FEFE'.             
257800     03  PIC X(16) VALUE X'FEFEFEFE6355FEFE64C4886788698868'.             
257900     03  PIC X(16) VALUE X'FEFEFEFE65BBFEFEFEFEFEFE8C448C43'.             
258000     03  PIC X(16) VALUE X'FEFE8D9B675CFEFEFEFE67A98FA48FA3'.             
258100     03  PIC X(16) VALUE X'68A7FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
258200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
258300     03  PIC X(16) VALUE X'FEFEFEFE4FC46F7153D2756D756BFEFE'.             
258400     03  PIC X(16) VALUE X'FEFE756C78BA78BB7C6B78B9FEFE7C65'.             
258500     03  PIC X(16) VALUE X'7C697C687C6A5D787C677C667C6CFEFE'.             
258600     03  PIC X(16) VALUE X'7FB27FB0FEFE7FB182BD82BBFEFEFEFE'.             
258700     03  PIC X(16) VALUE X'82BC85C9886A886B65BCFEFE8C458D9C'.             
258800     03  PIC X(16) VALUE X'675DFEFE8EBB8FA567F2FEFE906F915D'.             
258900*    -- TAB2-IND = 78 (X'4E')                                             
259000     03  PIC X(16) VALUE X'4FC5FEFE53D453D56F72FEFEFEFE6F73'.             
259100     03  PIC X(16) VALUE X'53D3FEFE5659FEFE5657FEFE5656565D'.             
259200     03  PIC X(16) VALUE X'5655565E7242565BFEFE5658565C565A'.             
259300     03  PIC X(16) VALUE X'5654FEFEFEFE58C4FEFE58BE757158C3'.             
259400     03  PIC X(16) VALUE X'FEFEFEFE58C558BFFEFE58C0FEFE756F'.             
259500     03  PIC X(16) VALUE X'FEFEFEFE58BDFEFE757058C2FEFEFEFE'.             
259600     03  PIC X(16) VALUE X'756E58C1FEFEFEFE5B4BFEFE5B4DFEFE'.             
259700     03  PIC X(16) VALUE X'FEFE78BE5B4C5B415B45FEFE5D8C7C71'.             
259800     03  PIC X(16) VALUE X'78C05B46FEFEFEFE78C378C45B4AFEFE'.             
259900     03  PIC X(16) VALUE X'78C6FEFE78C8FEFE78C978BD78BC78CA'.             
260000     03  PIC X(16) VALUE X'5B4978C778C5FEFE5B475B435B4E78C1'.             
260100     03  PIC X(16) VALUE X'78C278BFFEFE5B48FEFEFEFE5B44FEFE'.             
260200     03  PIC X(16) VALUE X'5B427C705D875D82FEFEFEFE5D7CFEFE'.             
260300     03  PIC X(16) VALUE X'5D8D5D7DFEFE5D795D895D865D88FEFE'.             
260400     03  PIC X(16) VALUE X'5D7E5D845D7A5D7B7C787C757C6D7C72'.             
260500     03  PIC X(16) VALUE X'FEFE5D8A7C795D8B5D81FEFEFEFE7C6F'.             
260600     03  PIC X(16) VALUE X'FEFE7C777C737C767C745D857C6E5D7F'.             
260700     03  PIC X(16) VALUE X'FEFEFEFEFEFE7FB55FA15FA4FEFE7FB7'.             
260800     03  PIC X(16) VALUE X'FEFE5FAC7FB65FA6FEFE61987FB8FEFE'.             
260900     03  PIC X(16) VALUE X'5FAB7FB45FADFEFEFEFEFEFE5FA2FEFE'.             
261000     03  PIC X(16) VALUE X'5D835FA5FEFE5FA35FA75FA95FA05FAE'.             
261100     03  PIC X(16) VALUE X'5FAAFEFE5FA87FB3FEFEFEFEFEFEFEFE'.             
261200     03  PIC X(16) VALUE X'619FFEFE619BFEFEFEFEFEFE61A2FEFE'.             
261300     03  PIC X(16) VALUE X'82C061A382CC82C5619482CD82C7619E'.             
261400     03  PIC X(16) VALUE X'82C8FEFE619D82CB619782C982BF6196'.             
261500     03  PIC X(16) VALUE X'85D4619CFEFE6199FEFE61A1FEFE82BE'.             
261600     03  PIC X(16) VALUE X'FEFE82C2619582C182C382C461A082C6'.             
261700     03  PIC X(16) VALUE X'82CA82CEFEFE61A4635C85CF85D585D2'.             
261800     03  PIC X(16) VALUE X'85CA85D685CBFEFE85D1FEFE6357635D'.             
261900     03  PIC X(16) VALUE X'85D7FEFEFEFE6359FEFE6363635E85D9'.             
262000     03  PIC X(16) VALUE X'85D3635A85CC636485CD85CE63656362'.             
262100     03  PIC X(16) VALUE X'619AFEFE635885DA6366FEFE635F85D8'.             
262200*    -- TAB2-IND = 79 (X'4F')                                             
262300     03  PIC X(16) VALUE X'635B63606361FEFE64CC887088798876'.             
262400     03  PIC X(16) VALUE X'8878FEFE64C98871FEFE887764C58873'.             
262500     03  PIC X(16) VALUE X'64CD886F8874887B85D08875886E64C6'.             
262600     03  PIC X(16) VALUE X'886D64C7887C64C8887A64CB886CFEFE'.             
262700     03  PIC X(16) VALUE X'64CAFEFE88728A6A8A788A738A758A69'.             
262800     03  PIC X(16) VALUE X'65BDFEFE8A6865C065BFFEFE8A778A6F'.             
262900     03  PIC X(16) VALUE X'8A6C8A72FEFE8A6BFEFE8A6D8A768A74'.             
263000     03  PIC X(16) VALUE X'FEFE65BE8A7B8A798A708A7A8A71FEFE'.             
263100     03  PIC X(16) VALUE X'8C49669A8C50FEFEFEFE8EBE66A18A6E'.             
263200     03  PIC X(16) VALUE X'8C47669D8C488C4DFEFEFEFE669F66A0'.             
263300     03  PIC X(16) VALUE X'8C468C4F8C518C4A8C4C8C4E8C4B8C52'.             
263400     03  PIC X(16) VALUE X'669C66A2669EFEFE669B8D9FFEFE6762'.             
263500     03  PIC X(16) VALUE X'8D9DFEFEFEFE8DA1FEFE8DA267608DA3'.             
263600     03  PIC X(16) VALUE X'8DA0FEFE8D9E6763675F8DA4FEFE6761'.             
263700     03  PIC X(16) VALUE X'675EFEFEFEFEFEFE67AAFEFEFEFE67AB'.             
263800     03  PIC X(16) VALUE X'8EBD8EBC8EBF8EC0FEFE67AC8FA68FAB'.             
263900     03  PIC X(16) VALUE X'67F3FEFE8FA8FEFE8FA78FAA8FA9FEFE'.             
264000     03  PIC X(16) VALUE X'9073FEFE686890729070FEFE9071FEFE'.             
264100     03  PIC X(16) VALUE X'FEFEFEFE688B688A90D090D1688CFEFE'.             
264200     03  PIC X(16) VALUE X'915E915F68B3FEFE68B9FEFE919991B8'.             
264300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
264900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265500*    -- TAB2-IND = 80 (X'50')                                             
265600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
265900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
266000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
266100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
266200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE4FC6'.             
266300     03  PIC X(16) VALUE X'FEFE7572FEFE75737C7A7FB982CF64CF'.             
266400     03  PIC X(16) VALUE X'FEFE64CE8A7C8C53FEFE90744FC77243'.             
266500     03  PIC X(16) VALUE X'565F58C67C7C7C7B61A582D061A6887D'.             
266600     03  PIC X(16) VALUE X'65C1FEFEFEFEFEFE68C24FC86CEB7244'.             
266700     03  PIC X(16) VALUE X'FEFEFEFE58C7FEFE75747575FEFE78CB'.             
266800     03  PIC X(16) VALUE X'FEFE5B4F5D8EFEFE7C7E7C7D7C7FFEFE'.             
266900     03  PIC X(16) VALUE X'7FBA7FBB5FAF636761A76368FEFE8882'.             
267000     03  PIC X(16) VALUE X'887E8881887F64D0FEFE8A7D8C558C54'.             
267100     03  PIC X(16) VALUE X'6B45566156607245FEFE7576FEFEFEFE'.             
267200     03  PIC X(16) VALUE X'78CD78CC5B50FEFE7C827C837C81FEFE'.             
267300     03  PIC X(16) VALUE X'FEFE5D905D8FFEFE5FB15FB0FEFE82D1'.             
267400     03  PIC X(16) VALUE X'85DD85DB85DC636988848883FEFE8A81'.             
267500     03  PIC X(16) VALUE X'8A7F8A7E8C56FEFE919A4FC953D6FEFE'.             
267600     03  PIC X(16) VALUE X'53D756625663724772467577FEFE58CD'.             
267700     03  PIC X(16) VALUE X'58CB58C858CC58CA58C9FEFEFEFE5B51'.             
267800     03  PIC X(16) VALUE X'78D0FEFE5D955B535B5878D25B5A5B59'.             
267900     03  PIC X(16) VALUE X'5B5C78D178CE5B565B525B5478CF5B5B'.             
268000     03  PIC X(16) VALUE X'5B575B555D975D965D945D98FEFE5D92'.             
268100     03  PIC X(16) VALUE X'5D93FEFE5D91FEFE7C84FEFEFEFE7FBD'.             
268200     03  PIC X(16) VALUE X'FEFE5FB35FB45FB2FEFE7FBCFEFE7FBE'.             
268300     03  PIC X(16) VALUE X'FEFE82D482D6FEFE61B082D761A982D3'.             
268400     03  PIC X(16) VALUE X'61A861B261AE61AF61AB82D261AA82D8'.             
268500     03  PIC X(16) VALUE X'82D5FEFE61B1FEFE61AC61AD85DFFEFE'.             
268600     03  PIC X(16) VALUE X'85E185E0FEFE85E2636A85DEFEFEFEFE'.             
268700     03  PIC X(16) VALUE X'64D4888564D164D564D364D28A82FEFE'.             
268800*    -- TAB2-IND = 81 (X'51')                                             
268900     03  PIC X(16) VALUE X'8A85FEFE8A84FEFE8A8365C28C578C58'.             
269000     03  PIC X(16) VALUE X'66A38C5966A4FEFEFEFE6765FEFE6764'.             
269100     03  PIC X(16) VALUE X'8EC1FEFEFEFE67AD8EC28FAC67F467F5'.             
269200     03  PIC X(16) VALUE X'FEFE9075FEFE688EFEFEFEFEFEFEFEFE'.             
269300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
269900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
270000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
270100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE4FCAFEFE58CF58CE'.             
270200     03  PIC X(16) VALUE X'7C857C86FEFE5FB585E361B385E48886'.             
270300     03  PIC X(16) VALUE X'4FCBFEFE6F7453D953D8FEFE72485664'.             
270400     03  PIC X(16) VALUE X'7249757AFEFE7579FEFE7578FEFEFEFE'.             
270500     03  PIC X(16) VALUE X'78D45B5FFEFEFEFE78D35B5EFEFEFEFE'.             
270600     03  PIC X(16) VALUE X'FEFE78D55B5DFEFE7C887C8B7C897C8A'.             
270700     03  PIC X(16) VALUE X'7C8E7C877C8F7C8C7C8D5FB77FBFFEFE'.             
270800     03  PIC X(16) VALUE X'FEFE5FB6FEFE82DC82DAFEFEFEFE61B4'.             
270900     03  PIC X(16) VALUE X'82D982DBFEFE61B5FEFE85E5FEFE85E6'.             
271000     03  PIC X(16) VALUE X'64D6FEFE8C5B8C5D8C5A8C5C8DA58EC3'.             
271100     03  PIC X(16) VALUE X'FEFEFEFE91814FCC53DA724A724C724B'.             
271200     03  PIC X(16) VALUE X'FEFE757D58D1FEFE757BFEFE58D0757E'.             
271300     03  PIC X(16) VALUE X'FEFE757F757CFEFEFEFE78E15B6778D9'.             
271400     03  PIC X(16) VALUE X'78DFFEFEFEFE5B625B6578D85B6078DC'.             
271500     03  PIC X(16) VALUE X'7C955B64FEFE78D7FEFE78DD78DA78E0'.             
271600     03  PIC X(16) VALUE X'78D678DE5B635B6678DB5B61FEFE5D9A'.             
271700     03  PIC X(16) VALUE X'7C915D997C987C975DA0FEFE5DA17C99'.             
271800     03  PIC X(16) VALUE X'5D9B7C965D9F7C9B7C92FEFE7C945D9C'.             
271900     03  PIC X(16) VALUE X'7C907C937C9A5D9D7C9CFEFEFEFEFEFE'.             
272000     03  PIC X(16) VALUE X'FEFEFEFE5D9EFEFE5FB87FC47FCA7FC2'.             
272100*    -- TAB2-IND = 82 (X'52')                                             
272200     03  PIC X(16) VALUE X'7FCBFEFE7FC17FC67FCC7FC97FC87FC7'.             
272300     03  PIC X(16) VALUE X'FEFE7FC07FC5FEFEFEFE7FC3FEFE61BA'.             
272400     03  PIC X(16) VALUE X'61B782E582EA82EC82E982E282E482EE'.             
272500     03  PIC X(16) VALUE X'82EB82E682EF82E382ED61B861BE61BC'.             
272600     03  PIC X(16) VALUE X'82DD61BD61B982DE82E082DF82E782E8'.             
272700     03  PIC X(16) VALUE X'FEFE61BBFEFE61B6FEFEFEFE82E1FEFE'.             
272800     03  PIC X(16) VALUE X'85F0636CFEFE85E7636D637085ECFEFE'.             
272900     03  PIC X(16) VALUE X'85E9636FFEFEFEFE85ED85EE85E885F1'.             
273000     03  PIC X(16) VALUE X'85EA85EF636EFEFE636B85EBFEFE888C'.             
273100     03  PIC X(16) VALUE X'64D964D764DA64D8888B88888887FEFE'.             
273200     03  PIC X(16) VALUE X'888AFEFEFEFE88898A9365C88A8A8A89'.             
273300     03  PIC X(16) VALUE X'FEFE65C38A8F8A8E8A868A918A8B65C7'.             
273400     03  PIC X(16) VALUE X'8A888A908A8765C465C68A8C65C58A8D'.             
273500     03  PIC X(16) VALUE X'FEFE8A928C61FEFE66A98C5EFEFE8C62'.             
273600     03  PIC X(16) VALUE X'FEFEFEFE66A68C6066ABFEFE66A8FEFE'.             
273700     03  PIC X(16) VALUE X'8C5FFEFE66AA8C6366A5FEFEFEFEFEFE'.             
273800     03  PIC X(16) VALUE X'FEFE67676769FEFE8DA867688DA666A7'.             
273900     03  PIC X(16) VALUE X'8DA7676667AE67B08EC567AF8EC4FEFE'.             
274000     03  PIC X(16) VALUE X'8FB167F68FB067F78FAE8FAD8FB28FB3'.             
274100     03  PIC X(16) VALUE X'9076FEFE8FAFFEFEFEFE90D590D290D3'.             
274200     03  PIC X(16) VALUE X'90D468A8FEFE9162916191609182FEFE'.             
274300     03  PIC X(16) VALUE X'91AE919B68BA4FCD5665FEFEFEFEFEFE'.             
274400     03  PIC X(16) VALUE X'FEFEFEFE5DA2FEFEFEFEFEFEFEFEFEFE'.             
274500     03  PIC X(16) VALUE X'FEFEFEFE61BFFEFEFEFE85F2FEFEFEFE'.             
274600     03  PIC X(16) VALUE X'65C9FEFE8C64FEFEFEFEFEFEFEFEFEFE'.             
274700     03  PIC X(16) VALUE X'FEFE919C4FCE51D053DC53DBFEFE5668'.             
274800     03  PIC X(16) VALUE X'FEFE724D5666724E5667FEFEFEFE7585'.             
274900     03  PIC X(16) VALUE X'7581FEFEFEFE58D275847583758258D3'.             
275000     03  PIC X(16) VALUE X'75867587FEFEFEFEFEFE78E878E678EA'.             
275100     03  PIC X(16) VALUE X'78EB78F1FEFE78ED78EFFEFE78E778E2'.             
275200     03  PIC X(16) VALUE X'FEFE78EEFEFEFEFE78F078E978EC78E3'.             
275300     03  PIC X(16) VALUE X'5B6978E578E45B685B6AFEFE5DA57C9E'.             
275400*    -- TAB2-IND = 83 (X'53')                                             
275500     03  PIC X(16) VALUE X'7CA07C9F7CA45DA3FEFE7CA17C9D7CA2'.             
275600     03  PIC X(16) VALUE X'7CA35DA45DA67CA5FEFE7FD07FCFFEFE'.             
275700     03  PIC X(16) VALUE X'7FCD7FCE5FBA5FBC5FB95FBB82F682F7'.             
275800     03  PIC X(16) VALUE X'82F2FEFE82F361C161C661C061C761C2'.             
275900     03  PIC X(16) VALUE X'82F4FEFEFEFE82F582F161C861C4FEFE'.             
276000     03  PIC X(16) VALUE X'FEFE61C361C5FEFE82F0FEFE85F46372'.             
276100     03  PIC X(16) VALUE X'FEFEFEFE85F6637485F985F585F385F8'.             
276200     03  PIC X(16) VALUE X'637385F7FEFE6371FEFEFEFE64DC64DF'.             
276300     03  PIC X(16) VALUE X'888EFEFE64DD888D64DB64DE8A948A95'.             
276400     03  PIC X(16) VALUE X'8A9665CAFEFE8A97FEFE65CB66AD8C67'.             
276500     03  PIC X(16) VALUE X'8C688C668C658C6966AC8DAC8DAA8DAB'.             
276600     03  PIC X(16) VALUE X'8DAD8DA98DAE8EC7FEFE8EC88EC667B1'.             
276700     03  PIC X(16) VALUE X'8FB467F88FB590789077FEFEFEFEFEFE'.             
276800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
276900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
277000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
277100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
277200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
277300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
277400     03  PIC X(16) VALUE X'FEFEFEFEFEFE4FCF5B6BFEFEFEFE5DA7'.             
277500     03  PIC X(16) VALUE X'FEFEFEFEFEFE5FBDFEFEFEFE6376FEFE'.             
277600     03  PIC X(16) VALUE X'6375FEFEFEFEFEFEFEFE66AE674967B2'.             
277700     03  PIC X(16) VALUE X'4FD056695DA8FEFE8C6A48E2FEFEFEFE'.             
277800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE6B47'.             
277900     03  PIC X(16) VALUE X'FEFEFEFE4FD1FEFE4FD44FD34FD2FEFE'.             
278000     03  PIC X(16) VALUE X'FEFE6B46FEFE6CEDFEFE6CEF51D1FEFE'.             
278100     03  PIC X(16) VALUE X'FEFE51D36CEC6CEE51D26CF16CF06CF2'.             
278200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
278300     03  PIC X(16) VALUE X'6F786F7653DF6F7553E453E153DEFEFE'.             
278400     03  PIC X(16) VALUE X'53E5FEFE53E053E3FEFE53E26F77FEFE'.             
278500     03  PIC X(16) VALUE X'53DDFEFEFEFEFEFE566F72507256566C'.             
278600     03  PIC X(16) VALUE X'5673FEFE566E725372555671724F7252'.             
278700*    -- TAB2-IND = 84 (X'54')                                             
278800     03  PIC X(16) VALUE X'566D566A7251567072545672566BFEFE'.             
278900     03  PIC X(16) VALUE X'FEFEFEFEFEFE7589758C58D5FEFE58DF'.             
279000     03  PIC X(16) VALUE X'58DB758AFEFEFEFE58E358DC58E158D7'.             
279100     03  PIC X(16) VALUE X'FEFE58D458D658E2758B58DA58DD58D9'.             
279200     03  PIC X(16) VALUE X'58DE758D58E058D87588FEFEFEFEFEFE'.             
279300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE78F25B6C78F4'.             
279400     03  PIC X(16) VALUE X'FEFE5B6E5B70FEFE78F35B6D5B71FEFE'.             
279500     03  PIC X(16) VALUE X'5B6FFEFEFEFEFEFE5DAE7CAA5DB67CA7'.             
279600     03  PIC X(16) VALUE X'FEFE5DB75DACFEFE7CA8FEFEFEFE5DB1'.             
279700     03  PIC X(16) VALUE X'FEFE7CA95DAA5DA9FEFE5DB45DB35DB2'.             
279800     03  PIC X(16) VALUE X'5DB05DB57CA65DAB5DAD5DAFFEFEFEFE'.             
279900     03  PIC X(16) VALUE X'5FBF5FC2FEFE5FC65FC05FC55FC3FEFE'.             
280000     03  PIC X(16) VALUE X'5FBEFEFE5FC45FC1FEFEFEFEFEFE82FB'.             
280100     03  PIC X(16) VALUE X'61CB61C9FEFE82FCFEFE61CC61CA82FA'.             
280200     03  PIC X(16) VALUE X'82F9FEFE637A82F86378637785FA61CD'.             
280300     03  PIC X(16) VALUE X'637985FB637C85FC637B64E1889064E0'.             
280400     03  PIC X(16) VALUE X'64E564E364E465CD64E2888F85FD65CC'.             
280500     03  PIC X(16) VALUE X'65CEFEFE66AF66B0FEFE8DAFFEFE686A'.             
280600     03  PIC X(16) VALUE X'68694FD6FEFEFEFE69F45674FEFE69F1'.             
280700     03  PIC X(16) VALUE X'69F269F0FEFE69F3FEFEFEFE6B4B6B48'.             
280800     03  PIC X(16) VALUE X'6B4D6B494FD74FDAFEFE6B4A4FD96B4C'.             
280900     03  PIC X(16) VALUE X'FEFEFEFE4FD8FEFEFEFEFEFEFEFE6CF5'.             
281000     03  PIC X(16) VALUE X'6CF751D66CF36CF66CF451D451D7FEFE'.             
281100     03  PIC X(16) VALUE X'51D5FEFEFEFEFEFEFEFE6F7A6F7E6F7B'.             
281200     03  PIC X(16) VALUE X'FEFE53E8FEFE53E9FEFE6F7DFEFE6F7F'.             
281300     03  PIC X(16) VALUE X'6F82FEFE53E66F81FEFEFEFE53E7FEFE'.             
281400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE75946F7C72577260'.             
281500     03  PIC X(16) VALUE X'725E7259725A725F72615676FEFE725C'.             
281600     03  PIC X(16) VALUE X'725856755677725B7262725DFEFEFEFE'.             
281700     03  PIC X(16) VALUE X'58E47597758F7595759658E5FEFE758E'.             
281800     03  PIC X(16) VALUE X'75906F797592759375915B73FEFEFEFE'.             
281900     03  PIC X(16) VALUE X'FEFE78FB864178FC78F958E65B7578F8'.             
282000*    -- TAB2-IND = 85 (X'55')                                             
282100     03  PIC X(16) VALUE X'794178FD5B72794478F7794378F57942'.             
282200     03  PIC X(16) VALUE X'78FA5B74FEFE7CB1FEFE7CAC7CB27CAD'.             
282300     03  PIC X(16) VALUE X'7CAB7CAE5DB8FEFE7CB0FEFE7CAF5DB9'.             
282400     03  PIC X(16) VALUE X'5FC85FC77FD77FDA7FD27FD65FC97FD5'.             
282500     03  PIC X(16) VALUE X'7FD37FD97FD47FD17FD8FEFE834561D0'.             
282600     03  PIC X(16) VALUE X'8A9883428343834178F661CF834682FD'.             
282700     03  PIC X(16) VALUE X'61CE61D183448642637D86438644FEFE'.             
282800     03  PIC X(16) VALUE X'889164E68A998A9AFEFEFEFE8A9B8C6C'.             
282900     03  PIC X(16) VALUE X'8C6B8DB1FEFE8DB08ECA8ECB8EC98FB6'.             
283000     03  PIC X(16) VALUE X'67F94FDB53EB53EA567A567972647265'.             
283100     03  PIC X(16) VALUE X'7263FEFE5678759BFEFE759C759858E7'.             
283200     03  PIC X(16) VALUE X'7599FEFE759AFEFEFEFEFEFEFEFE7947'.             
283300     03  PIC X(16) VALUE X'7949794579485B7679465B77FEFEFEFE'.             
283400     03  PIC X(16) VALUE X'79F95DBC5DBBFEFE5DBAFEFE7CB37CB4'.             
283500     03  PIC X(16) VALUE X'FEFEFEFE7FDC7FDE5FCD5FCAFEFE5FCC'.             
283600     03  PIC X(16) VALUE X'5FCB7FDD7FDBFEFEFEFEFEFEFEFEFEFE'.             
283700     03  PIC X(16) VALUE X'834D834A834B61D5834C8347834861D2'.             
283800     03  PIC X(16) VALUE X'FEFE61D3834961D4FEFE8648FEFE8649'.             
283900     03  PIC X(16) VALUE X'86468647637E8645FEFEFEFEFEFEFEFE'.             
284000     03  PIC X(16) VALUE X'FEFE88958892889464E9889864E88896'.             
284100     03  PIC X(16) VALUE X'88998897889364E7FEFE8A9DFEFE8A9E'.             
284200     03  PIC X(16) VALUE X'8A9CFEFE8AA065CF65D08C6E66B28A9F'.             
284300     03  PIC X(16) VALUE X'8C6D66B18DB48DB5676A8DB3FEFE8DB2'.             
284400     03  PIC X(16) VALUE X'FEFE8ECC67B3FEFE907990D790D6FEFE'.             
284500     03  PIC X(16) VALUE X'688F68A990D89183FEFE68BB4FDC51D8'.             
284600     03  PIC X(16) VALUE X'FEFE5DBDFEFE676B4FDD53EC58E85B78'.             
284700     03  PIC X(16) VALUE X'65D151D9FEFE6F846F837266FEFE567D'.             
284800     03  PIC X(16) VALUE X'567B567F7268FEFE567E567CFEFEFEFE'.             
284900     03  PIC X(16) VALUE X'FEFEFEFE726758EB75A2FEFE58EA58EC'.             
285000     03  PIC X(16) VALUE X'75A758EE75A475A5759D58ED75A8FEFE'.             
285100     03  PIC X(16) VALUE X'FEFE759FFEFE75A0759E58E9FEFE75A6'.             
285200     03  PIC X(16) VALUE X'75A175A3FEFEFEFEFEFE7955FEFE7954'.             
285300*    -- TAB2-IND = 86 (X'56')                                             
285400     03  PIC X(16) VALUE X'7952794A7959794D7957795E79565B81'.             
285500     03  PIC X(16) VALUE X'FEFE5B7C794BFEFE79515B7EFEFE7950'.             
285600     03  PIC X(16) VALUE X'5B7F5B827953FEFE5B795B7A795F795D'.             
285700     03  PIC X(16) VALUE X'FEFE795C794EFEFE795AFEFE5B7DFEFE'.             
285800     03  PIC X(16) VALUE X'FEFEFEFEFEFE5B7B795B794C794F7958'.             
285900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE80447CBEFEFE'.             
286000     03  PIC X(16) VALUE X'7CB77CCA7CD37CBA5DC8FEFE7CC75DBE'.             
286100     03  PIC X(16) VALUE X'5DC05DCC7CB8FEFEFEFE5DC15DC35DCD'.             
286200     03  PIC X(16) VALUE X'5DC2FEFEFEFEFEFEFEFE5DCB7CC0FEFE'.             
286300     03  PIC X(16) VALUE X'7CB55DC97CBF5DC57CD15DCA7CCF7CC3'.             
286400     03  PIC X(16) VALUE X'7CCD5DC77CB67CD07CCBFEFE7CD25DBF'.             
286500     03  PIC X(16) VALUE X'FEFEFEFE5DCE5DC4FEFEFEFE7CBCFEFE'.             
286600     03  PIC X(16) VALUE X'7CC47CC8FEFE7CCC5DC67CBB7CB97CC5'.             
286700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE7CC27CC1FEFE7CC6'.             
286800     03  PIC X(16) VALUE X'7CC9FEFE7CCEFEFEFEFEFEFE7FE1FEFE'.             
286900     03  PIC X(16) VALUE X'5FCE7FEB7FE35FD35FD77FF47FFC7FED'.             
287000     03  PIC X(16) VALUE X'5FCFFEFE7FF17CBDFEFE5FD07FF87FFD'.             
287100     03  PIC X(16) VALUE X'7FF5FEFE7FF780437FF97FE77FF0FEFE'.             
287200     03  PIC X(16) VALUE X'FEFE5FD8FEFE5FD47FE57FF25FD27FEC'.             
287300     03  PIC X(16) VALUE X'5FD17FFA7FE97FE25FD58042FEFEFEFE'.             
287400     03  PIC X(16) VALUE X'7FE47FF67FF37FEE7FE07FDF7FE87FFB'.             
287500     03  PIC X(16) VALUE X'5FD680417FE67FEA61DAFEFEFEFEFEFE'.             
287600     03  PIC X(16) VALUE X'FEFEFEFE61E261DD836E836B835361D8'.             
287700     03  PIC X(16) VALUE X'FEFEFEFEFEFE61D761DEFEFEFEFEFEFE'.             
287800     03  PIC X(16) VALUE X'835161DC835D834F835061D6836D61E0'.             
287900     03  PIC X(16) VALUE X'83608365835F865B835B836383618354'.             
288000     03  PIC X(16) VALUE X'834E836961DF836AFEFE8364FEFE8359'.             
288100     03  PIC X(16) VALUE X'83578352FEFEFEFEFEFE835A83678356'.             
288200     03  PIC X(16) VALUE X'8366836CFEFEFEFE61DBFEFE83628368'.             
288300     03  PIC X(16) VALUE X'835E835861D9FEFEFEFEFEFE7FEF835C'.             
288400     03  PIC X(16) VALUE X'61E18355FEFEFEFEFEFEFEFEFEFE8661'.             
288500     03  PIC X(16) VALUE X'63828660865D86706386FEFE866D8665'.             
288600*    -- TAB2-IND = 87 (X'57')                                             
288700     03  PIC X(16) VALUE X'866F86568663FEFE6388FEFE864EFEFE'.             
288800     03  PIC X(16) VALUE X'864C866EFEFE866C866B865A8659864F'.             
288900     03  PIC X(16) VALUE X'638AFEFE8655865F866A638D8671FEFE'.             
289000     03  PIC X(16) VALUE X'64F1638F63898653FEFE865C864B864D'.             
289100     03  PIC X(16) VALUE X'637F638C638586548664865E638B864A'.             
289200     03  PIC X(16) VALUE X'64EC866686696387FEFE8658638E6384'.             
289300     03  PIC X(16) VALUE X'FEFEFEFEFEFE6383866286686381FEFE'.             
289400     03  PIC X(16) VALUE X'86518667FEFEFEFE8652FEFEFEFEFEFE'.             
289500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE8657889F'.             
289600     03  PIC X(16) VALUE X'FEFE88A464EE64F088AA64EA88B988B0'.             
289700     03  PIC X(16) VALUE X'88A588A688AFFEFE64F788AE889E88AD'.             
289800     03  PIC X(16) VALUE X'88A188BA64F664F488A2FEFE88B5FEFE'.             
289900     03  PIC X(16) VALUE X'88A788B4FEFE88B6889D64EFFEFE88B7'.             
290000     03  PIC X(16) VALUE X'FEFEFEFE88ABFEFE64F388A8FEFEFEFE'.             
290100     03  PIC X(16) VALUE X'64F588B1FEFEFEFEFEFE64ED88A388B2'.             
290200     03  PIC X(16) VALUE X'FEFE88AC865088B388A0FEFE64F2FEFE'.             
290300     03  PIC X(16) VALUE X'88B8FEFE64EB889BFEFEFEFEFEFEFEFE'.             
290400     03  PIC X(16) VALUE X'8AAE8AA765D3FEFE8AA28AB18AA988A9'.             
290500     03  PIC X(16) VALUE X'FEFE8AB38AA3FEFE65D28AAD65D465DC'.             
290600     03  PIC X(16) VALUE X'65DA8AAF65DB8AA5FEFE8AA68AAB8AB0'.             
290700     03  PIC X(16) VALUE X'FEFE889A65D58AB88AB58AB98AAC8AA8'.             
290800     03  PIC X(16) VALUE X'8AB68C798AAAFEFE65D8FEFE65D7889C'.             
290900     03  PIC X(16) VALUE X'65D98AB28AB465D68AB78AA1FEFE8AA4'.             
291000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
291100     03  PIC X(16) VALUE X'8C83FEFE8C7266B68C81FEFEFEFE8C70'.             
291200     03  PIC X(16) VALUE X'66B7FEFE8C7BFEFE8C7766BC8C828C71'.             
291300     03  PIC X(16) VALUE X'8C7466B48C84FEFE8C7C8C7F66BA66BF'.             
291400     03  PIC X(16) VALUE X'66BD8C788C73FEFE66B866B98C6F66B5'.             
291500     03  PIC X(16) VALUE X'FEFE66B366BB8C7E66BEFEFE8C7A8C85'.             
291600     03  PIC X(16) VALUE X'66C0FEFEFEFEFEFE8C76FEFE8C7DFEFE'.             
291700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE8DC28DD08DC4'.             
291800     03  PIC X(16) VALUE X'8DCB8C758DC98DB88DCE676E8DBC8DCD'.             
291900*    -- TAB2-IND = 88 (X'58')                                             
292000     03  PIC X(16) VALUE X'8DC3FEFEFEFE676DFEFEFEFE8DD28DC5'.             
292100     03  PIC X(16) VALUE X'FEFE8DCA8DCC8DB68DCF8DC18DC68DBA'.             
292200     03  PIC X(16) VALUE X'8DBE8DD18DC88DB78DBB8DBD8DC7FEFE'.             
292300     03  PIC X(16) VALUE X'676C8DC0FEFEFEFEFEFEFEFEFEFEFEFE'.             
292400     03  PIC X(16) VALUE X'8DB9FEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
292500     03  PIC X(16) VALUE X'8DBF8ED08ED567BA8ED7FEFE67B4FEFE'.             
292600     03  PIC X(16) VALUE X'8ED38ED967B967B5FEFE67B68ECF8ED6'.             
292700     03  PIC X(16) VALUE X'67B88ED467B78ECE8ED28ED1FEFE8ECD'.             
292800     03  PIC X(16) VALUE X'8ED8FEFEFEFEFEFE67FA8FBD8FC08FBC'.             
292900     03  PIC X(16) VALUE X'8FBE8FBF8FB98FBA8FB7FEFEFEFE8FBB'.             
293000     03  PIC X(16) VALUE X'8FB867FB67FCFEFEFEFE907BFEFE907D'.             
293100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE907C907EFEFE'.             
293200     03  PIC X(16) VALUE X'686CFEFE907A686B686DFEFEFEFEFEFE'.             
293300     03  PIC X(16) VALUE X'90DA90DB689090D9FEFE916491639165'.             
293400     03  PIC X(16) VALUE X'68AB916668AA916791849187918668B4'.             
293500     03  PIC X(16) VALUE X'9185FEFEFEFEFEFE68BE68BC68BD68C3'.             
293600     03  PIC X(16) VALUE X'91B091B191AF91B9FEFEFEFEFEFEFEFE'.             
293700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
293800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
293900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
294900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295200*    -- TAB2-IND = 89 (X'59')                                             
295300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
295900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
296700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFE51DA'.             
296800     03  PIC X(16) VALUE X'FEFEFEFE75A97960836F8C86FEFEFEFE'.             
296900     03  PIC X(16) VALUE X'51DBFEFE53ED5681FEFEFEFE75AAFEFE'.             
297000     03  PIC X(16) VALUE X'75AB58EFFEFE5B85796279615B895B84'.             
297100     03  PIC X(16) VALUE X'79635B865B885B875B83FEFEFEFEFEFE'.             
297200     03  PIC X(16) VALUE X'5DCFFEFEFEFE7CD77CD5FEFE7CD67CD4'.             
297300     03  PIC X(16) VALUE X'FEFE5FD9FEFE5FDC5FDE5FDDFEFEFEFE'.             
297400     03  PIC X(16) VALUE X'5FDA5FDBFEFE8371837061E38372FEFE'.             
297500     03  PIC X(16) VALUE X'837361E4FEFEFEFEFEFE8679867788C0'.             
297600     03  PIC X(16) VALUE X'FEFE8675867663908672867A86748678'.             
297700     03  PIC X(16) VALUE X'88BCFEFEFEFE88BEFEFE88BF64FC88BB'.             
297800     03  PIC X(16) VALUE X'64FB88BD64F864F964FA8673FEFEFEFE'.             
297900     03  PIC X(16) VALUE X'65DF8ABC8ABA8ABB65DD65E065DEFEFE'.             
298000     03  PIC X(16) VALUE X'FEFEFEFE8C878C8866C1FEFE8DD38DD5'.             
298100     03  PIC X(16) VALUE X'8DD4676F67BB8EDC8EDB8EDAFEFEFEFE'.             
298200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298500*    -- TAB2-IND = 90 (X'5A')                                             
298600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
298900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE51DCFEFE698AFEFE'.             
299000     03  PIC X(16) VALUE X'69F74E8B69F569F869F6FEFEFEFEFEFE'.             
299100     03  PIC X(16) VALUE X'6B4FFEFE4FE1FEFE4FE26B514FDF6B50'.             
299200     03  PIC X(16) VALUE X'6B4E4FE04FDEFEFEFEFEFEFEFEFEFEFE'.             
299300     03  PIC X(16) VALUE X'FEFE6CF86CFB51DF6CFA6CF9FEFE51DE'.             
299400     03  PIC X(16) VALUE X'51DDFEFE51E16CFC51E0FEFEFEFEFEFE'.             
299500     03  PIC X(16) VALUE X'FEFEFEFE6F8953EF53F053F16F8A6F86'.             
299600     03  PIC X(16) VALUE X'53EE6F87FEFE6F886F85FEFEFEFEFEFE'.             
299700     03  PIC X(16) VALUE X'5688FEFEFEFE5685726956865689726A'.             
299800     03  PIC X(16) VALUE X'FEFE5684568256835687FEFEFEFEFEFE'.             
299900     03  PIC X(16) VALUE X'FEFEFEFE58F075AE58F875ADFEFE75B0'.             
300000     03  PIC X(16) VALUE X'58F475AF5B9158F258F558F158F658F7'.             
300100     03  PIC X(16) VALUE X'58F3FEFEFEFEFEFE75AC5B8D7965FEFE'.             
300200     03  PIC X(16) VALUE X'7969FEFEFEFE79685B925B8E5B8F7964'.             
300300     03  PIC X(16) VALUE X'796679675B8A5B8CFEFE5B905B8BFEFE'.             
300400     03  PIC X(16) VALUE X'FEFE7CDA7CD87CD95DD15DD2FEFE7CDB'.             
300500     03  PIC X(16) VALUE X'5DD05FDFFEFE5FE15FE0FEFE8045FEFE'.             
300600     03  PIC X(16) VALUE X'FEFE80468375FEFE8374FEFEFEFE6391'.             
300700     03  PIC X(16) VALUE X'6392867B6393FEFE88C3FEFE88C1FEFE'.             
300800     03  PIC X(16) VALUE X'88C264FDFEFE8ABD66C2FEFE48EBFEFE'.             
300900     03  PIC X(16) VALUE X'654151E2FEFE568A726BFEFEFEFE75B1'.             
301000     03  PIC X(16) VALUE X'58F95B93796A796C5B955B945B965B97'.             
301100     03  PIC X(16) VALUE X'796B5DD55DD65DD45FE25DD37CDCFEFE'.             
301200     03  PIC X(16) VALUE X'FEFEFEFE5FE38376867C639465428ABE'.             
301300     03  PIC X(16) VALUE X'8AC265E38ABF65E465E28AC365E58AC1'.             
301400     03  PIC X(16) VALUE X'FEFE8C8965E166C3FEFE90DCFEFEFEFE'.             
301500     03  PIC X(16) VALUE X'51E358FB58FAFEFEFEFEFEFEFEFE5B98'.             
301600     03  PIC X(16) VALUE X'796E796D5B99FEFEFEFE7CE05DDA5DD7'.             
301700     03  PIC X(16) VALUE X'7CDF5DD97CDD5DD8FEFE7CDEFEFE8047'.             
301800*    -- TAB2-IND = 91 (X'5B')                                             
301900     03  PIC X(16) VALUE X'5FE4FEFE8379FEFE61E5837761E661E7'.             
302000     03  PIC X(16) VALUE X'837861E8FEFE867DFEFE63986395639A'.             
302100     03  PIC X(16) VALUE X'867F6396867E6399FEFEFEFE6397FEFE'.             
302200     03  PIC X(16) VALUE X'88C688C8FEFEFEFE654388C7654488C5'.             
302300     03  PIC X(16) VALUE X'88C4FEFE8AC58AC465E68AC68C8E66C5'.             
302400     03  PIC X(16) VALUE X'8C8D8C8A66C48C8B8C8CFEFE8DD68DD7'.             
302500     03  PIC X(16) VALUE X'6770FEFE67BEFEFEFEFE8EDDFEFEFEFE'.             
302600     03  PIC X(16) VALUE X'67BC67BD8EDEFEFEFEFE67FD68418FC1'.             
302700     03  PIC X(16) VALUE X'FEFEFEFE689190DE6893FEFE90DD90DF'.             
302800     03  PIC X(16) VALUE X'68929168FEFE919DFEFEFEFEFEFEFEFE'.             
302900     03  PIC X(16) VALUE X'FEFEFEFE51E4FEFEFEFEFEFE5DDBFEFE'.             
303000     03  PIC X(16) VALUE X'8048FEFE837A639B639CFEFE51E5FEFE'.             
303100     03  PIC X(16) VALUE X'61E966C653F2FEFEFEFEFEFE639DFEFE'.             
303200     03  PIC X(16) VALUE X'686E53F375B2FEFE796FFEFE7971FEFE'.             
303300     03  PIC X(16) VALUE X'7970FEFE7CE47CE15DDCFEFE5DDD7CE2'.             
303400     03  PIC X(16) VALUE X'7CE3FEFE804A804F5FE58049804B8052'.             
303500     03  PIC X(16) VALUE X'804D8051804E804C80505FE6FEFEFEFE'.             
303600     03  PIC X(16) VALUE X'837DFEFE837B61EBFEFE61EA837C61EC'.             
303700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE8683FEFEFEFE8682'.             
303800     03  PIC X(16) VALUE X'639E868188C9FEFE88CB88CD88CCFEFE'.             
303900     03  PIC X(16) VALUE X'654588CA8ACD65E78ACB8ACE65E8FEFE'.             
304000     03  PIC X(16) VALUE X'8AC9FEFE8ACC8ACA8AC765E98AC8FEFE'.             
304100     03  PIC X(16) VALUE X'FEFEFEFEFEFE8C8FFEFEFEFE8C918C90'.             
304200     03  PIC X(16) VALUE X'FEFE8DD8FEFE8DD9FEFEFEFEFEFE8EDF'.             
304300     03  PIC X(16) VALUE X'FEFE6843FEFE6842907F9081689490E0'.             
304400     03  PIC X(16) VALUE X'FEFE68B5FEFE53F45B9A80548053837F'.             
304500     03  PIC X(16) VALUE X'837EFEFEFEFE654688CF88CE8AD18ACF'.             
304600     03  PIC X(16) VALUE X'8AD28AD0FEFEFEFE66C78C928C938C94'.             
304700     03  PIC X(16) VALUE X'FEFE8EE0FEFE8FC2FEFE90E1FEFEFEFE'.             
304800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE53F5FEFEFEFE'.             
304900     03  PIC X(16) VALUE X'868488D0FEFE53F6FEFEFEFE5FE7FEFE'.             
305000     03  PIC X(16) VALUE X'868565EA8AD366C8FEFE8DDA8DDB67BF'.             
305100*    -- TAB2-IND = 92 (X'5C')                                             
305200     03  PIC X(16) VALUE X'908253F75941594275B35B9B5B9C7972'.             
305300     03  PIC X(16) VALUE X'5B9DFEFE5DE1FEFE5DE37CE67CE77CE5'.             
305400     03  PIC X(16) VALUE X'5DDE5DDF5DE25DE0FEFEFEFE80555FE8'.             
305500     03  PIC X(16) VALUE X'5FE9FEFEFEFE838761EF83828381FEFE'.             
305600     03  PIC X(16) VALUE X'838661EDFEFEFEFE63A5FEFE83838388'.             
305700     03  PIC X(16) VALUE X'83858384FEFE61EEFEFE63A3FEFE8687'.             
305800     03  PIC X(16) VALUE X'639FFEFE8688FEFEFEFE8686FEFE63A2'.             
305900     03  PIC X(16) VALUE X'63A063A4FEFE63A1FEFEFEFEFEFEFEFE'.             
306000     03  PIC X(16) VALUE X'FEFE88D1FEFE88D688D288D56547FEFE'.             
306100     03  PIC X(16) VALUE X'87C088D488D3FEFE65ED65EB65EE65EC'.             
306200     03  PIC X(16) VALUE X'8AD48AD58AD665EFFEFEFEFEFEFE8C98'.             
306300     03  PIC X(16) VALUE X'66CA8C96FEFE66CB8C958C9766C98DDF'.             
306400     03  PIC X(16) VALUE X'8DDCFEFE8DDD8DDE8EE167C1FEFE67C0'.             
306500     03  PIC X(16) VALUE X'FEFE8FC48FC36844FEFEFEFEFEFE686F'.             
306600     03  PIC X(16) VALUE X'689568AC9169919E919FFEFEFEFEFEFE'.             
306700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
306800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
306900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
307000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
307100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
307200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
307300     03  PIC X(16) VALUE X'53F87973FEFEFEFE7CE8805680575FEA'.             
307400     03  PIC X(16) VALUE X'FEFE5FEB838961F0FEFEFEFE6548FEFE'.             
307500     03  PIC X(16) VALUE X'8AD7FEFE65F08C9B66CC8C9A8C9C8C99'.             
307600     03  PIC X(16) VALUE X'8EE48DE08DE1FEFE6771FEFE8EE3FEFE'.             
307700     03  PIC X(16) VALUE X'FEFE8EE2FEFE8FC591A0FEFEFEFEFEFE'.             
307800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
307900     03  PIC X(16) VALUE X'FEFEFEFEFEFE53F9FEFEFEFEFEFE53FA'.             
308000     03  PIC X(16) VALUE X'FEFEFEFE568B726CFEFE75B4FEFE5B9E'.             
308100     03  PIC X(16) VALUE X'FEFE5BA15B9F7974FEFE5BA3FEFE5BA0'.             
308200     03  PIC X(16) VALUE X'FEFEFEFE5BA2FEFE5DE5FEFE7CE9FEFE'.             
308300     03  PIC X(16) VALUE X'FEFE7CEA838BFEFE5DE45DE65DE7FEFE'.             
308400*    -- TAB2-IND = 93 (X'5D')                                             
308500     03  PIC X(16) VALUE X'8059FEFE80585FECFEFE5FEDFEFE805A'.             
308600     03  PIC X(16) VALUE X'838A5FEF61F1FEFE5FEEFEFEFEFEFEFE'.             
308700     03  PIC X(16) VALUE X'63A6838C61F361F2838D8390838E838F'.             
308800     03  PIC X(16) VALUE X'61F4FEFE63AB63A9FEFEFEFE63A8868A'.             
308900     03  PIC X(16) VALUE X'FEFE63AAFEFEFEFE868988D7FEFE868B'.             
309000     03  PIC X(16) VALUE X'63A7868C88DA88D888D988DE65F488DD'.             
309100     03  PIC X(16) VALUE X'88E088DF88DC88DBFEFE6549FEFEFEFE'.             
309200     03  PIC X(16) VALUE X'FEFEFEFE8ADAFEFE8AD965F365F165F2'.             
309300     03  PIC X(16) VALUE X'FEFE8AD8FEFE8C9FFEFE66CDFEFE8C9E'.             
309400     03  PIC X(16) VALUE X'8C9D66CEFEFE8DE68DE5FEFE8DE3FEFE'.             
309500     03  PIC X(16) VALUE X'8DE2677367728DE78FC668458EE667C2'.             
309600     03  PIC X(16) VALUE X'8EE58DE4FEFE8FC76870FEFE68AD916A'.             
309700     03  PIC X(16) VALUE X'FEFE91A1FEFEFEFEFEFEFEFEFEFEFEFE'.             
309800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
309900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
310000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
310100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
310200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
310300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFE53FB75B5'.             
310400     03  PIC X(16) VALUE X'88E153FCFEFEFEFE805C805B868DFEFE'.             
310500     03  PIC X(16) VALUE X'FEFE88E3FEFE88E2FEFE65F58CA08CA1'.             
310600     03  PIC X(16) VALUE X'6774FEFEFEFE91A2568C5BA55BA47CEB'.             
310700     03  PIC X(16) VALUE X'7CED5DE97CEC5DE85DEA7CEEFEFEFEFE'.             
310800     03  PIC X(16) VALUE X'FEFE805E8060805FFEFE8062FEFEFEFE'.             
310900     03  PIC X(16) VALUE X'FEFE5FF08061805DFEFEFEFEFEFE8063'.             
311000     03  PIC X(16) VALUE X'FEFE8397FEFE839A839C839283968393'.             
311100     03  PIC X(16) VALUE X'61F661F961FB8394839561FA8398839B'.             
311200     03  PIC X(16) VALUE X'839961FCFEFE61F8839161F5FEFE61F7'.             
311300     03  PIC X(16) VALUE X'FEFEFEFE63AD869386918690FEFE8696'.             
311400     03  PIC X(16) VALUE X'FEFE86958694FEFE868F63AC868EFEFE'.             
311500     03  PIC X(16) VALUE X'869263AEFEFEFEFE88E6FEFE88EA88E7'.             
311600     03  PIC X(16) VALUE X'88E988E888E588EB88EE88EC88ED654B'.             
311700*    -- TAB2-IND = 94 (X'5E')                                             
311800     03  PIC X(16) VALUE X'FEFE654A88E488EF8ADF8AE28AE48AE3'.             
311900     03  PIC X(16) VALUE X'FEFE8ADD8AE18ADCFEFE8ADE65F68ADB'.             
312000     03  PIC X(16) VALUE X'FEFE8AE0FEFEFEFE8CAE8CA366CFFEFE'.             
312100     03  PIC X(16) VALUE X'FEFE66D08CA28CA78CAD8CA58CACFEFE'.             
312200     03  PIC X(16) VALUE X'8CA9FEFE8CA88CAB8CA68CA4FEFE8CAA'.             
312300     03  PIC X(16) VALUE X'FEFE8DEE8DEC67758DEB8DF18DEFFEFE'.             
312400     03  PIC X(16) VALUE X'67768DEA8DE8FEFE8DE967788DED6777'.             
312500     03  PIC X(16) VALUE X'8DF08EE78EEDFEFEFEFE8EE867C68EEE'.             
312600     03  PIC X(16) VALUE X'67C58EEC8EEB67C48EEA67C38EE9FEFE'.             
312700     03  PIC X(16) VALUE X'8FCD8FCF8FCEFEFE8FCB68478FC88FCC'.             
312800     03  PIC X(16) VALUE X'8FD1FEFE8FD08FC98FCA684690836873'.             
312900     03  PIC X(16) VALUE X'FEFE908468716872FEFEFEFE90E26896'.             
313000     03  PIC X(16) VALUE X'9188FEFE68B6FEFE91A368B791A491A5'.             
313100     03  PIC X(16) VALUE X'91B391B268C691BDFEFEFEFEFEFEFEFE'.             
313200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
313900     03  PIC X(16) VALUE X'568DFEFEFEFE7CF0FEFE7CEFFEFE5FF1'.             
314000     03  PIC X(16) VALUE X'5FF28064FEFE839D8699FEFEFEFE61FD'.             
314100     03  PIC X(16) VALUE X'63AF8697FEFE869A63B0FEFE88F08698'.             
314200     03  PIC X(16) VALUE X'8AE565F78CAFFEFEFEFEFEFE8DF48DF2'.             
314300     03  PIC X(16) VALUE X'FEFEFEFE8DF3FEFEFEFE8EEFFEFE67C7'.             
314400     03  PIC X(16) VALUE X'8FD2687668486874687590E368AEFEFE'.             
314500     03  PIC X(16) VALUE X'568EFEFEFEFEFEFE8AE6FEFEFEFE726D'.             
314600     03  PIC X(16) VALUE X'FEFE5DEBFEFE8065FEFEFEFE5FF38066'.             
314700     03  PIC X(16) VALUE X'FEFEFEFEFEFE839F839E63B262416242'.             
314800     03  PIC X(16) VALUE X'FEFE83A283A183A0FEFEFEFE869B869E'.             
314900     03  PIC X(16) VALUE X'FEFE869D869C63B188F488F288F1FEFE'.             
315000*    -- TAB2-IND = 95 (X'5F')                                             
315100     03  PIC X(16) VALUE X'FEFE88F3FEFE65F88AE88AE965F9FEFE'.             
315200     03  PIC X(16) VALUE X'8AE7FEFE8CB18CB08CB366D18CB2FEFE'.             
315300     03  PIC X(16) VALUE X'8DF58DF78DF6FEFEFEFE8EF08EF38EF1'.             
315400     03  PIC X(16) VALUE X'8EF28FD36849FEFEFEFEFEFE90859086'.             
315500     03  PIC X(16) VALUE X'9087FEFE689768AF91A6568FFEFE6243'.             
315600     03  PIC X(16) VALUE X'63B38AEAFEFE8FD4FEFEFEFE91B4726E'.             
315700     03  PIC X(16) VALUE X'FEFE68C75690869FFEFE8AEBFEFE8CB4'.             
315800     03  PIC X(16) VALUE X'FEFEFEFE8EF48FD55691FEFE80678068'.             
315900     03  PIC X(16) VALUE X'FEFE5FF45FF583A46245624483A3FEFE'.             
316000     03  PIC X(16) VALUE X'88F5FEFE8AEC8AEE8AED65FC65FB65FA'.             
316100     03  PIC X(16) VALUE X'FEFE67C98EF5FEFE67C88FD78FD6FEFE'.             
316200     03  PIC X(16) VALUE X'689890E459437CF1FEFEFEFEFEFE806B'.             
316300     03  PIC X(16) VALUE X'8069806AFEFEFEFE83ADFEFE83A883A5'.             
316400     03  PIC X(16) VALUE X'83ACFEFEFEFEFEFE83AEFEFEFEFE6247'.             
316500     03  PIC X(16) VALUE X'83AB83A7FEFEFEFE83A683AA83A96246'.             
316600     03  PIC X(16) VALUE X'FEFEFEFE86AA86A586A386AC86A4FEFE'.             
316700     03  PIC X(16) VALUE X'86A0FEFE86A6FEFEFEFE86A1894186A2'.             
316800     03  PIC X(16) VALUE X'86ADFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
316900     03  PIC X(16) VALUE X'86A963B486A886A7FEFE86ABFEFEFEFE'.             
317000     03  PIC X(16) VALUE X'FEFEFEFE88F688F9FEFEFEFE88F8FEFE'.             
317100     03  PIC X(16) VALUE X'894388FB8942FEFE88FD88FC88FAFEFE'.             
317200     03  PIC X(16) VALUE X'88F7FEFE654E654DFEFE654F654C8944'.             
317300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE8AF48AF7FEFE'.             
317400     03  PIC X(16) VALUE X'8AF58AF9FEFEFEFEFEFE8AFAFEFE8AF2'.             
317500     03  PIC X(16) VALUE X'66448AF3FEFE8AF18AF8FEFE8AF08AEF'.             
317600     03  PIC X(16) VALUE X'6643664165FDFEFEFEFEFEFEFEFEFEFE'.             
317700     03  PIC X(16) VALUE X'FEFEFEFEFEFE8AF68CBD8CC366D48CBE'.             
317800     03  PIC X(16) VALUE X'FEFE8CC18CC566D58CC0FEFE8CB8FEFE'.             
317900     03  PIC X(16) VALUE X'8CB78CC48CBBFEFE8CB98CC28CBA66D3'.             
318000     03  PIC X(16) VALUE X'66D2FEFE8CB58CB68CBFFEFEFEFEFEFE'.             
318100     03  PIC X(16) VALUE X'8CBCFEFEFEFEFEFEFEFEFEFEFEFE8DFA'.             
318200     03  PIC X(16) VALUE X'8DFDFEFEFEFEFEFEFEFE6642FEFEFEFE'.             
318300*    -- TAB2-IND = 96 (X'60')                                             
318400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE8DFB8E448E42'.             
318500     03  PIC X(16) VALUE X'8DF98E47FEFE8DF8FEFE677A8E43FEFE'.             
318600     03  PIC X(16) VALUE X'FEFEFEFE8DFC67798E46FEFEFEFE8E45'.             
318700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE8EF88EF7FEFEFEFE'.             
318800     03  PIC X(16) VALUE X'FEFE8F41FEFE8EFA8EFD67CBFEFEFEFE'.             
318900     03  PIC X(16) VALUE X'8EFB8EFCFEFE8EF68EF967CAFEFEFEFE'.             
319000     03  PIC X(16) VALUE X'FEFE684B8FE28FDD8FE1FEFE8FE48FE0'.             
319100     03  PIC X(16) VALUE X'FEFE8FDCFEFE684D8FDF8FE3684C8FDA'.             
319200     03  PIC X(16) VALUE X'8E418FDEFEFEFEFE8FDBFEFE8FD8FEFE'.             
319300     03  PIC X(16) VALUE X'8FD9684A908B908D9090908C9091FEFE'.             
319400     03  PIC X(16) VALUE X'908AFEFE9088FEFE6877908E68796878'.             
319500     03  PIC X(16) VALUE X'9089908FFEFEFEFEFEFEFEFE90E96899'.             
319600     03  PIC X(16) VALUE X'90EAFEFE90E890E5FEFEFEFE90E790E6'.             
319700     03  PIC X(16) VALUE X'916BFEFEFEFEFEFEFEFE916D916CFEFE'.             
319800     03  PIC X(16) VALUE X'FEFE918BFEFE918A9189918CFEFE68BF'.             
319900     03  PIC X(16) VALUE X'68C091BA91BEFEFEFEFEFEFEFEFEFEFE'.             
320000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
320900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
321000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
321100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
321200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE594479757CF4'.             
321300     03  PIC X(16) VALUE X'FEFE5DEC7CF2FEFEFEFE7CF3FEFEFEFE'.             
321400     03  PIC X(16) VALUE X'FEFE806C806D5FF85FF6806E5FF783B3'.             
321500     03  PIC X(16) VALUE X'FEFE83B683B083B783AF83B1FEFE83B2'.             
321600*    -- TAB2-IND = 97 (X'61')                                             
321700     03  PIC X(16) VALUE X'83B5FEFEFEFE624A83BA83B9624883B4'.             
321800     03  PIC X(16) VALUE X'83B86249FEFEFEFEFEFEFEFEFEFEFEFE'.             
321900     03  PIC X(16) VALUE X'86B7FEFE63B9FEFE86B263B5FEFE86AF'.             
322000     03  PIC X(16) VALUE X'86B586B8FEFE63BAFEFE86B486B186B9'.             
322100     03  PIC X(16) VALUE X'86B0FEFE86B663B6FEFE86AE63B7FEFE'.             
322200     03  PIC X(16) VALUE X'63B886B3FEFEFEFEFEFE89568949894A'.             
322300     03  PIC X(16) VALUE X'894D894BFEFE8945FEFEFEFE89488952'.             
322400     03  PIC X(16) VALUE X'894CFEFEFEFE6550FEFE895489516551'.             
322500     03  PIC X(16) VALUE X'89538946894F8950FEFE894EFEFEFEFE'.             
322600     03  PIC X(16) VALUE X'FEFEFEFE8B418B438B46FEFEFEFE8AFD'.             
322700     03  PIC X(16) VALUE X'FEFE66458B488AFC8B49FEFE8B458B47'.             
322800     03  PIC X(16) VALUE X'8B4B8B448B4C8B428AFB6646FEFE8B4A'.             
322900     03  PIC X(16) VALUE X'664766D7FEFEFEFEFEFEFEFEFEFE8947'.             
323000     03  PIC X(16) VALUE X'8CDF8CD666D98CD266DAFEFEFEFE8CDB'.             
323100     03  PIC X(16) VALUE X'8CD58CCB66D88CD88CD38CD4FEFE8CC6'.             
323200     03  PIC X(16) VALUE X'8CCD8CDCFEFE8CD9FEFE8CD1FEFE8CDD'.             
323300     03  PIC X(16) VALUE X'8CCC8CC78CDAFEFE8CC98CD78CCE8CDE'.             
323400     03  PIC X(16) VALUE X'8CCA66D68CC88CCF8CD0FEFEFEFEFEFE'.             
323500     03  PIC X(16) VALUE X'8E4EFEFE8E4CFEFE8E51FEFE8E5D8E54'.             
323600     03  PIC X(16) VALUE X'8E4D8E498E568E4F8E528E4B8E598E48'.             
323700     03  PIC X(16) VALUE X'8E508E558E578E5A8E4AFEFE8E5E8E5F'.             
323800     03  PIC X(16) VALUE X'8E588E5C8E53FEFE8F518F54FEFE67CC'.             
323900     03  PIC X(16) VALUE X'FEFE8F538F588F5667CD8F4D8F438F42'.             
324000     03  PIC X(16) VALUE X'67CF8F4F8F508F4C8F44FEFE8F498E5B'.             
324100     03  PIC X(16) VALUE X'FEFE8F4567CE8F4BFEFE8F4AFEFE8F46'.             
324200     03  PIC X(16) VALUE X'8F52FEFE8F478FE98F558F578F4E8F48'.             
324300     03  PIC X(16) VALUE X'8FEA8FEC8FE6684EFEFE8FF38FF1684F'.             
324400     03  PIC X(16) VALUE X'8FF08FEF8FE88FE58FEB8FF48FE78FED'.             
324500     03  PIC X(16) VALUE X'FEFE909A909F90959098687A909CFEFE'.             
324600     03  PIC X(16) VALUE X'90A38FEEFEFE909690A090A4909B9094'.             
324700     03  PIC X(16) VALUE X'909EFEFE909D90A290A18FF290999093'.             
324800     03  PIC X(16) VALUE X'9097689A689B9092FEFE90F590EC90F4'.             
324900*    -- TAB2-IND = 98 (X'62')                                             
325000     03  PIC X(16) VALUE X'90F190F290EB90EE90F690F090EF90ED'.             
325100     03  PIC X(16) VALUE X'FEFE90F3FEFE916EFEFE916FFEFE9171'.             
325200     03  PIC X(16) VALUE X'917091739172918E918D91A7FEFE91A8'.             
325300     03  PIC X(16) VALUE X'FEFE91B568C468C8FEFE91BF68C9FEFE'.             
325400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
325500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
325600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
325700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
325800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
325900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
326000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
326100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
326200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
326300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
326400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE5945FEFEFEFE'.             
326500     03  PIC X(16) VALUE X'FEFE677B8F59FEFE689C689DFEFE5946'.             
326600     03  PIC X(16) VALUE X'7CF5FEFE5DED83BBFEFEFEFE86BB86BC'.             
326700     03  PIC X(16) VALUE X'86BA8958895765528B4E89598B4DFEFE'.             
326800     03  PIC X(16) VALUE X'FEFE8CE166DB66DD8CE0FEFEFEFE66DC'.             
326900     03  PIC X(16) VALUE X'FEFE8E608E628E618F5A67D0FEFE687B'.             
327000     03  PIC X(16) VALUE X'90F79174FEFEFEFE91C25947FEFE806F'.             
327100     03  PIC X(16) VALUE X'FEFE624BFEFEFEFEFEFE86BE86BDFEFE'.             
327200     03  PIC X(16) VALUE X'895AFEFEFEFEFEFE66DE677C8FF591BB'.             
327300     03  PIC X(16) VALUE X'FEFEFEFEFEFE59485FF9FEFE624CFEFE'.             
327400     03  PIC X(16) VALUE X'8CE2FEFE90A55BA6FEFEFEFEFEFEFEFE'.             
327500     03  PIC X(16) VALUE X'895BFEFEFEFEFEFE68B05BA7624D6553'.             
327600     03  PIC X(16) VALUE X'90A65BA8FEFE83BC63BC86BF86C0FEFE'.             
327700     03  PIC X(16) VALUE X'63BBFEFE895C65576555655665548B4F'.             
327800     03  PIC X(16) VALUE X'6648FEFEFEFEFEFE8E648E638E668E65'.             
327900     03  PIC X(16) VALUE X'677DFEFEFEFE8F5BFEFE8F5D8F5C67D1'.             
328000     03  PIC X(16) VALUE X'8FF6FEFE90A790A8687C9175918F68C1'.             
328100     03  PIC X(16) VALUE X'FEFE797686C1895D8CE37CF6FEFE895E'.             
328200*    -- TAB2-IND = 99 (X'63')                                             
328300     03  PIC X(16) VALUE X'8B518B50FEFEFEFEFEFEFEFE90A9689E'.             
328400     03  PIC X(16) VALUE X'FEFE91769190FEFEFEFEFEFE5DEE83BD'.             
328500     03  PIC X(16) VALUE X'83BEFEFE86C25DEFFEFE66498B52FEFE'.             
328600     03  PIC X(16) VALUE X'8F5F67D28F608F5E90AAFEFE90F8FEFE'.             
328700     03  PIC X(16) VALUE X'5DF0FEFE89618960895F8B53FEFEFEFE'.             
328800     03  PIC X(16) VALUE X'8B578B568B558B54664A8CE48E68677E'.             
328900     03  PIC X(16) VALUE X'8E678F618FF98FF868508FF790AD90AC'.             
329000     03  PIC X(16) VALUE X'90ABFEFEFEFE5FFAFEFE86C36558FEFE'.             
329100     03  PIC X(16) VALUE X'8CE58CE68FFA90AEFEFEFEFE90F99177'.             
329200     03  PIC X(16) VALUE X'91A991C45FFB65598B588CE78F6290AF'.             
329300     03  PIC X(16) VALUE X'FEFEFEFE624FFEFE89628B598CE88CE9'.             
329400     03  PIC X(16) VALUE X'8CEA8E6DFEFE8E6967D38E6C8E6B677F'.             
329500     03  PIC X(16) VALUE X'8E6A6782FEFE67818F648F6367D467D5'.             
329600     03  PIC X(16) VALUE X'FEFEFEFE68528FFB6851FEFE90B290B3'.             
329700     03  PIC X(16) VALUE X'90B190B068A0FEFE90FA90FB90FC689F'.             
329800     03  PIC X(16) VALUE X'9178917B917A9179FEFEFEFE91C3FEFE'.             
329900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFE63BDFEFEFEFE'.             
330100     03  PIC X(16) VALUE X'66518E6E8F65FEFE68538FFCFEFEFEFE'.             
330200     03  PIC X(16) VALUE X'91C5FEFEFEFEFEFE63BEFEFEFEFEFEFE'.             
330300     03  PIC X(16) VALUE X'8963FEFE8FFDFEFE9191FEFEFEFEFEFE'.             
330400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
330900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
331500*    -- TAB2-IND = 100 (X'64')                                            
331600     03  PIC X(16) VALUE X'C241C242C243C244C245C246C247C248'.             
331700     03  PIC X(16) VALUE X'C249C24AC24BC24CC24DC24EC24FC250'.             
331800     03  PIC X(16) VALUE X'C251C252C253C254C255C256C257C258'.             
331900     03  PIC X(16) VALUE X'C259C25AC25BC25CC25DC25EC25FC260'.             
332000     03  PIC X(16) VALUE X'C261C262C263C264C265C266C267C268'.             
332100     03  PIC X(16) VALUE X'C269C26AC26BC26CC26DC26EC26FC270'.             
332200     03  PIC X(16) VALUE X'C271C272C273C274C275C276C277C278'.             
332300     03  PIC X(16) VALUE X'C279C27AC27BC27CC27DC27EC27FC281'.             
332400     03  PIC X(16) VALUE X'C282C283C284C285C286C287C288C289'.             
332500     03  PIC X(16) VALUE X'C28AC28BC28CC28DC28EC28FC290C291'.             
332600     03  PIC X(16) VALUE X'C292C293C294C295C296C297C298C299'.             
332700     03  PIC X(16) VALUE X'C29AC29BC29CC29DC29EC29FC2A0C2A1'.             
332800     03  PIC X(16) VALUE X'C2A2C2A3C2A4C2A5C2A6C2A7C2A8C2A9'.             
332900     03  PIC X(16) VALUE X'C2AAC2ABC2ACC2ADC2AEC2AFC2B0C2B1'.             
333000     03  PIC X(16) VALUE X'C2B2C2B3C2B4C2B5C2B6C2B7C2B8C2B9'.             
333100     03  PIC X(16) VALUE X'C2BAC2BBC2BCC2BDC2BEC2BFC2C0C2C1'.             
333200     03  PIC X(16) VALUE X'C2C2C2C3C2C4C2C5C2C6C2C7C2C8C2C9'.             
333300     03  PIC X(16) VALUE X'C2CAC2CBC2CCC2CDC2CEC2CFC2D0C2D1'.             
333400     03  PIC X(16) VALUE X'C2D2C2D3C2D4C2D5C2D6C2D7C2D8C2D9'.             
333500     03  PIC X(16) VALUE X'C2DAC2DBC2DCC2DDC2DEC2DFC2E0C2E1'.             
333600     03  PIC X(16) VALUE X'C2E2C2E3C2E4C2E5C2E6C2E7C2E8C2E9'.             
333700     03  PIC X(16) VALUE X'C2EAC2EBC2ECC2EDC2EEC2EFC2F0C2F1'.             
333800     03  PIC X(16) VALUE X'C2F2C2F3C2F4C2F5C2F6C2F7C2F8C2F9'.             
333900     03  PIC X(16) VALUE X'C2FAC2FBC2FCC2FDC341C342C343C344'.             
334000     03  PIC X(16) VALUE X'C345C346C347C348C349C34AC34BC34C'.             
334100     03  PIC X(16) VALUE X'C34DC34EC34FC350C351C352C353C354'.             
334200     03  PIC X(16) VALUE X'C355C356C357C358C359C35AC35BC35C'.             
334300     03  PIC X(16) VALUE X'C35DC35EC35FC360C361C362C363C364'.             
334400     03  PIC X(16) VALUE X'C365C366C367C368C369C36AC36BC36C'.             
334500     03  PIC X(16) VALUE X'C36DC36EC36FC370C371C372C373C374'.             
334600     03  PIC X(16) VALUE X'C375C376C377C378C379C37AC37BC37C'.             
334700     03  PIC X(16) VALUE X'C37DC37EC37FC381C382C383C384C385'.             
334800*    -- TAB2-IND = 101 (X'65')                                            
334900     03  PIC X(16) VALUE X'C386C387C388C389C38AC38BC38CC38D'.             
335000     03  PIC X(16) VALUE X'C38EC38FC390C391C392C393C394C395'.             
335100     03  PIC X(16) VALUE X'C396C397C398C399C39AC39BC39CC39D'.             
335200     03  PIC X(16) VALUE X'C39EC39FC3A0C3A1C3A2C3A3C3A4C3A5'.             
335300     03  PIC X(16) VALUE X'C3A6C3A7C3A8C3A9C3AAC3ABC3ACC3AD'.             
335400     03  PIC X(16) VALUE X'C3AEC3AFC3B0C3B1C3B2C3B3C3B4C3B5'.             
335500     03  PIC X(16) VALUE X'C3B6C3B7C3B8C3B9C3BAC3BBC3BCC3BD'.             
335600     03  PIC X(16) VALUE X'C3BEC3BFC3C0C3C1C3C2C3C3C3C4C3C5'.             
335700     03  PIC X(16) VALUE X'C3C6C3C7C3C8C3C9C3CAC3CBC3CCC3CD'.             
335800     03  PIC X(16) VALUE X'C3CEC3CFC3D0C3D1C3D2C3D3C3D4C3D5'.             
335900     03  PIC X(16) VALUE X'C3D6C3D7C3D8C3D9C3DAC3DBC3DCC3DD'.             
336000     03  PIC X(16) VALUE X'C3DEC3DFC3E0C3E1C3E2C3E3C3E4C3E5'.             
336100     03  PIC X(16) VALUE X'C3E6C3E7C3E8C3E9C3EAC3EBC3ECC3ED'.             
336200     03  PIC X(16) VALUE X'C3EEC3EFC3F0C3F1C3F2C3F3C3F4C3F5'.             
336300     03  PIC X(16) VALUE X'C3F6C3F7C3F8C3F9C3FAC3FBC3FCC3FD'.             
336400     03  PIC X(16) VALUE X'C441C442C443C444C445C446C447C448'.             
336500     03  PIC X(16) VALUE X'C449C44AC44BC44CC44DC44EC44FC450'.             
336600     03  PIC X(16) VALUE X'C451C452C453C454C455C456C457C458'.             
336700     03  PIC X(16) VALUE X'C459C45AC45BC45CC45DC45EC45FC460'.             
336800     03  PIC X(16) VALUE X'C461C462C463C464C465C466C467C468'.             
336900     03  PIC X(16) VALUE X'C469C46AC46BC46CC46DC46EC46FC470'.             
337000     03  PIC X(16) VALUE X'C471C472C473C474C475C476C477C478'.             
337100     03  PIC X(16) VALUE X'C479C47AC47BC47CC47DC47EC47FC481'.             
337200     03  PIC X(16) VALUE X'C482C483C484C485C486C487C488C489'.             
337300     03  PIC X(16) VALUE X'C48AC48BC48CC48DC48EC48FC490C491'.             
337400     03  PIC X(16) VALUE X'C492C493C494C495C496C497C498C499'.             
337500     03  PIC X(16) VALUE X'C49AC49BC49CC49DC49EC49FC4A0C4A1'.             
337600     03  PIC X(16) VALUE X'C4A2C4A3C4A4C4A5C4A6C4A7C4A8C4A9'.             
337700     03  PIC X(16) VALUE X'C4AAC4ABC4ACC4ADC4AEC4AFC4B0C4B1'.             
337800     03  PIC X(16) VALUE X'C4B2C4B3C4B4C4B5C4B6C4B7C4B8C4B9'.             
337900     03  PIC X(16) VALUE X'C4BAC4BBC4BCC4BDC4BEC4BFC4C0C4C1'.             
338000     03  PIC X(16) VALUE X'C4C2C4C3C4C4C4C5C4C6C4C7C4C8C4C9'.             
338100*    -- TAB2-IND = 102 (X'66')                                            
338200     03  PIC X(16) VALUE X'C4CAC4CBC4CCC4CDC4CEC4CFC4D0C4D1'.             
338300     03  PIC X(16) VALUE X'C4D2C4D3C4D4C4D5C4D6C4D7C4D8C4D9'.             
338400     03  PIC X(16) VALUE X'C4DAC4DBC4DCC4DDC4DEC4DFC4E0C4E1'.             
338500     03  PIC X(16) VALUE X'C4E2C4E3C4E4C4E5C4E6C4E7C4E8C4E9'.             
338600     03  PIC X(16) VALUE X'C4EAC4EBC4ECC4EDC4EEC4EFC4F0C4F1'.             
338700     03  PIC X(16) VALUE X'C4F2C4F3C4F4C4F5C4F6C4F7C4F8C4F9'.             
338800     03  PIC X(16) VALUE X'C4FAC4FBC4FCC4FDC541C542C543C544'.             
338900     03  PIC X(16) VALUE X'C545C546C547C548C549C54AC54BC54C'.             
339000     03  PIC X(16) VALUE X'C54DC54EC54FC550C551C552C553C554'.             
339100     03  PIC X(16) VALUE X'C555C556C557C558C559C55AC55BC55C'.             
339200     03  PIC X(16) VALUE X'C55DC55EC55FC560C561C562C563C564'.             
339300     03  PIC X(16) VALUE X'C565C566C567C568C569C56AC56BC56C'.             
339400     03  PIC X(16) VALUE X'C56DC56EC56FC570C571C572C573C574'.             
339500     03  PIC X(16) VALUE X'C575C576C577C578C579C57AC57BC57C'.             
339600     03  PIC X(16) VALUE X'C57DC57EC57FC581C582C583C584C585'.             
339700     03  PIC X(16) VALUE X'C586C587C588C589C58AC58BC58CC58D'.             
339800     03  PIC X(16) VALUE X'C58EC58FC590C591C592C593C594C595'.             
339900     03  PIC X(16) VALUE X'C596C597C598C599C59AC59BC59CC59D'.             
340000     03  PIC X(16) VALUE X'C59EC59FC5A0C5A1C5A2C5A3C5A4C5A5'.             
340100     03  PIC X(16) VALUE X'C5A6C5A7C5A8C5A9C5AAC5ABC5ACC5AD'.             
340200     03  PIC X(16) VALUE X'C5AEC5AFC5B0C5B1C5B2C5B3C5B4C5B5'.             
340300     03  PIC X(16) VALUE X'C5B6C5B7C5B8C5B9C5BAC5BBC5BCC5BD'.             
340400     03  PIC X(16) VALUE X'C5BEC5BFC5C0C5C1C5C2C5C3C5C4C5C5'.             
340500     03  PIC X(16) VALUE X'C5C6C5C7C5C8C5C9C5CAC5CBC5CCC5CD'.             
340600     03  PIC X(16) VALUE X'C5CEC5CFC5D0C5D1C5D2C5D3C5D4C5D5'.             
340700     03  PIC X(16) VALUE X'C5D6C5D7C5D8C5D9C5DAC5DBC5DCC5DD'.             
340800     03  PIC X(16) VALUE X'C5DEC5DFC5E0C5E1C5E2C5E3C5E4C5E5'.             
340900     03  PIC X(16) VALUE X'C5E6C5E7C5E8C5E9C5EAC5EBC5ECC5ED'.             
341000     03  PIC X(16) VALUE X'C5EEC5EFC5F0C5F1C5F2C5F3C5F4C5F5'.             
341100     03  PIC X(16) VALUE X'C5F6C5F7C5F8C5F9C5FAC5FBC5FCC5FD'.             
341200     03  PIC X(16) VALUE X'C641C642C643C644C645C646C647C648'.             
341300     03  PIC X(16) VALUE X'C649C64AC64BC64CC64DC64EC64FC650'.             
341400*    -- TAB2-IND = 103 (X'67')                                            
341500     03  PIC X(16) VALUE X'C651C652C653C654C655C656C657C658'.             
341600     03  PIC X(16) VALUE X'C659C65AC65BC65CC65DC65EC65FC660'.             
341700     03  PIC X(16) VALUE X'C661C662C663C664C665C666C667C668'.             
341800     03  PIC X(16) VALUE X'C669C66AC66BC66CC66DC66EC66FC670'.             
341900     03  PIC X(16) VALUE X'C671C672C673C674C675C676C677C678'.             
342000     03  PIC X(16) VALUE X'C679C67AC67BC67CC67DC67EC67FC681'.             
342100     03  PIC X(16) VALUE X'C682C683C684C685C686C687C688C689'.             
342200     03  PIC X(16) VALUE X'C68AC68BC68CC68DC68EC68FC690C691'.             
342300     03  PIC X(16) VALUE X'C692C693C694C695C696C697C698C699'.             
342400     03  PIC X(16) VALUE X'C69AC69BC69CC69DC69EC69FC6A0C6A1'.             
342500     03  PIC X(16) VALUE X'C6A2C6A3C6A4C6A5C6A6C6A7C6A8C6A9'.             
342600     03  PIC X(16) VALUE X'C6AAC6ABC6ACC6ADC6AEC6AFC6B0C6B1'.             
342700     03  PIC X(16) VALUE X'C6B2C6B3C6B4C6B5C6B6C6B7C6B8C6B9'.             
342800     03  PIC X(16) VALUE X'C6BAC6BBC6BCC6BDC6BEC6BFC6C0C6C1'.             
342900     03  PIC X(16) VALUE X'C6C2C6C3C6C4C6C5C6C6C6C7C6C8C6C9'.             
343000     03  PIC X(16) VALUE X'C6CAC6CBC6CCC6CDC6CEC6CFC6D0C6D1'.             
343100     03  PIC X(16) VALUE X'C6D2C6D3C6D4C6D5C6D6C6D7C6D8C6D9'.             
343200     03  PIC X(16) VALUE X'C6DAC6DBC6DCC6DDC6DEC6DFC6E0C6E1'.             
343300     03  PIC X(16) VALUE X'C6E2C6E3C6E4C6E5C6E6C6E7C6E8C6E9'.             
343400     03  PIC X(16) VALUE X'C6EAC6EBC6ECC6EDC6EEC6EFC6F0C6F1'.             
343500     03  PIC X(16) VALUE X'C6F2C6F3C6F4C6F5C6F6C6F7C6F8C6F9'.             
343600     03  PIC X(16) VALUE X'C6FAC6FBC6FCC6FDC741C742C743C744'.             
343700     03  PIC X(16) VALUE X'C745C746C747C748C749C74AC74BC74C'.             
343800     03  PIC X(16) VALUE X'C74DC74EC74FC750C751C752C753C754'.             
343900     03  PIC X(16) VALUE X'C755C756C757C758C759C75AC75BC75C'.             
344000     03  PIC X(16) VALUE X'C75DC75EC75FC760C761C762C763C764'.             
344100     03  PIC X(16) VALUE X'C765C766C767C768C769C76AC76BC76C'.             
344200     03  PIC X(16) VALUE X'C76DC76EC76FC770C771C772C773C774'.             
344300     03  PIC X(16) VALUE X'C775C776C777C778C779C77AC77BC77C'.             
344400     03  PIC X(16) VALUE X'C77DC77EC77FC781C782C783C784C785'.             
344500     03  PIC X(16) VALUE X'C786C787C788C789C78AC78BC78CC78D'.             
344600     03  PIC X(16) VALUE X'C78EC78FC790C791C792C793C794C795'.             
344700*    -- TAB2-IND = 104 (X'68')                                            
344800     03  PIC X(16) VALUE X'C796C797C798C799C79AC79BC79CC79D'.             
344900     03  PIC X(16) VALUE X'C79EC79FC7A0C7A1C7A2C7A3C7A4C7A5'.             
345000     03  PIC X(16) VALUE X'C7A6C7A7C7A8C7A9C7AAC7ABC7ACC7AD'.             
345100     03  PIC X(16) VALUE X'C7AEC7AFC7B0C7B1C7B2C7B3C7B4C7B5'.             
345200     03  PIC X(16) VALUE X'C7B6C7B7C7B8C7B9C7BAC7BBC7BCC7BD'.             
345300     03  PIC X(16) VALUE X'C7BEC7BFC7C0C7C1C7C2C7C3C7C4C7C5'.             
345400     03  PIC X(16) VALUE X'C7C6C7C7C7C8C7C9C7CAC7CBC7CCC7CD'.             
345500     03  PIC X(16) VALUE X'C7CEC7CFC7D0C7D1C7D2C7D3C7D4C7D5'.             
345600     03  PIC X(16) VALUE X'C7D6C7D7C7D8C7D9C7DAC7DBC7DCC7DD'.             
345700     03  PIC X(16) VALUE X'C7DEC7DFC7E0C7E1C7E2C7E3C7E4C7E5'.             
345800     03  PIC X(16) VALUE X'C7E6C7E7C7E8C7E9C7EAC7EBC7ECC7ED'.             
345900     03  PIC X(16) VALUE X'C7EEC7EFC7F0C7F1C7F2C7F3C7F4C7F5'.             
346000     03  PIC X(16) VALUE X'C7F6C7F7C7F8C7F9C7FAC7FBC7FCC7FD'.             
346100     03  PIC X(16) VALUE X'C841C842C843C844C845C846C847C848'.             
346200     03  PIC X(16) VALUE X'C849C84AC84BC84CC84DC84EC84FC850'.             
346300     03  PIC X(16) VALUE X'C851C852C853C854C855C856C857C858'.             
346400     03  PIC X(16) VALUE X'C859C85AC85BC85CC85DC85EC85FC860'.             
346500     03  PIC X(16) VALUE X'C861C862C863C864C865C866C867C868'.             
346600     03  PIC X(16) VALUE X'C869C86AC86BC86CC86DC86EC86FC870'.             
346700     03  PIC X(16) VALUE X'C871C872C873C874C875C876C877C878'.             
346800     03  PIC X(16) VALUE X'C879C87AC87BC87CC87DC87EC87FC881'.             
346900     03  PIC X(16) VALUE X'C882C883C884C885C886C887C888C889'.             
347000     03  PIC X(16) VALUE X'C88AC88BC88CC88DC88EC88FC890C891'.             
347100     03  PIC X(16) VALUE X'C892C893C894C895C896C897C898C899'.             
347200     03  PIC X(16) VALUE X'C89AC89BC89CC89DC89EC89FC8A0C8A1'.             
347300     03  PIC X(16) VALUE X'C8A2C8A3C8A4C8A5C8A6C8A7C8A8C8A9'.             
347400     03  PIC X(16) VALUE X'C8AAC8ABC8ACC8ADC8AEC8AFC8B0C8B1'.             
347500     03  PIC X(16) VALUE X'C8B2C8B3C8B4C8B5C8B6C8B7C8B8C8B9'.             
347600     03  PIC X(16) VALUE X'C8BAC8BBC8BCC8BDC8BEC8BFC8C0C8C1'.             
347700     03  PIC X(16) VALUE X'C8C2C8C3C8C4C8C5C8C6C8C7C8C8C8C9'.             
347800     03  PIC X(16) VALUE X'C8CAC8CBC8CCC8CDC8CEC8CFC8D0C8D1'.             
347900     03  PIC X(16) VALUE X'C8D2C8D3C8D4C8D5C8D6C8D7C8D8C8D9'.             
348000*    -- TAB2-IND = 105 (X'69')                                            
348100     03  PIC X(16) VALUE X'C8DAC8DBC8DCC8DDC8DEC8DFC8E0C8E1'.             
348200     03  PIC X(16) VALUE X'C8E2C8E3C8E4C8E5C8E6C8E7C8E8C8E9'.             
348300     03  PIC X(16) VALUE X'C8EAC8EBC8ECC8EDC8EEC8EFC8F0C8F1'.             
348400     03  PIC X(16) VALUE X'C8F2C8F3C8F4C8F5C8F6C8F7C8F8C8F9'.             
348500     03  PIC X(16) VALUE X'C8FAC8FBC8FCC8FDC941C942C943C944'.             
348600     03  PIC X(16) VALUE X'C945C946C947C948C949C94AC94BC94C'.             
348700     03  PIC X(16) VALUE X'C94DC94EC94FC950C951C952C953C954'.             
348800     03  PIC X(16) VALUE X'C955C956C957C958C959C95AC95BC95C'.             
348900     03  PIC X(16) VALUE X'C95DC95EC95FC960C961C962C963C964'.             
349000     03  PIC X(16) VALUE X'C965C966C967C968C969C96AC96BC96C'.             
349100     03  PIC X(16) VALUE X'C96DC96EC96FC970C971C972C973C974'.             
349200     03  PIC X(16) VALUE X'C975C976C977C978C979C97AC97BC97C'.             
349300     03  PIC X(16) VALUE X'C97DC97EC97FC981C982C983C984C985'.             
349400     03  PIC X(16) VALUE X'C986C987C988C989C98AC98BC98CC98D'.             
349500     03  PIC X(16) VALUE X'C98EC98FC990C991C992C993C994C995'.             
349600     03  PIC X(16) VALUE X'C996C997C998C999C99AC99BC99CC99D'.             
349700     03  PIC X(16) VALUE X'C99EC99FC9A0C9A1C9A2C9A3C9A4C9A5'.             
349800     03  PIC X(16) VALUE X'C9A6C9A7C9A8C9A9C9AAC9ABC9ACC9AD'.             
349900     03  PIC X(16) VALUE X'C9AEC9AFC9B0C9B1C9B2C9B3C9B4C9B5'.             
350000     03  PIC X(16) VALUE X'C9B6C9B7C9B8C9B9C9BAC9BBC9BCC9BD'.             
350100     03  PIC X(16) VALUE X'C9BEC9BFC9C0C9C1C9C2C9C3C9C4C9C5'.             
350200     03  PIC X(16) VALUE X'C9C6C9C7C9C8C9C9C9CAC9CBC9CCC9CD'.             
350300     03  PIC X(16) VALUE X'C9CEC9CFC9D0C9D1C9D2C9D3C9D4C9D5'.             
350400     03  PIC X(16) VALUE X'C9D6C9D7C9D8C9D9C9DAC9DBC9DCC9DD'.             
350500     03  PIC X(16) VALUE X'C9DEC9DFC9E0C9E1C9E2C9E3C9E4C9E5'.             
350600     03  PIC X(16) VALUE X'C9E6C9E7C9E8C9E9C9EAC9EBC9ECC9ED'.             
350700     03  PIC X(16) VALUE X'C9EEC9EFC9F0C9F1C9F2C9F3C9F4C9F5'.             
350800     03  PIC X(16) VALUE X'C9F6C9F7C9F8C9F9C9FAC9FBC9FCC9FD'.             
350900     03  PIC X(16) VALUE X'CA41CA42CA43CA44CA45CA46CA47CA48'.             
351000     03  PIC X(16) VALUE X'CA49CA4ACA4BCA4CCA4DCA4ECA4FCA50'.             
351100     03  PIC X(16) VALUE X'CA51CA52CA53CA54CA55CA56CA57CA58'.             
351200     03  PIC X(16) VALUE X'CA59CA5ACA5BCA5CCA5DCA5ECA5FCA60'.             
351300*    -- TAB2-IND = 106 (X'6A')                                            
351400     03  PIC X(16) VALUE X'CA61CA62CA63CA64CA65CA66CA67CA68'.             
351500     03  PIC X(16) VALUE X'CA69CA6ACA6BCA6CCA6DCA6ECA6FCA70'.             
351600     03  PIC X(16) VALUE X'CA71CA72CA73CA74CA75CA76CA77CA78'.             
351700     03  PIC X(16) VALUE X'CA79CA7ACA7BCA7CCA7DCA7ECA7FCA81'.             
351800     03  PIC X(16) VALUE X'CA82CA83CA84CA85CA86CA87CA88CA89'.             
351900     03  PIC X(16) VALUE X'CA8ACA8BCA8CCA8DCA8ECA8FCA90CA91'.             
352000     03  PIC X(16) VALUE X'CA92CA93CA94CA95CA96CA97CA98CA99'.             
352100     03  PIC X(16) VALUE X'CA9ACA9BCA9CCA9DCA9ECA9FCAA0CAA1'.             
352200     03  PIC X(16) VALUE X'CAA2CAA3CAA4CAA5CAA6CAA7CAA8CAA9'.             
352300     03  PIC X(16) VALUE X'CAAACAABCAACCAADCAAECAAFCAB0CAB1'.             
352400     03  PIC X(16) VALUE X'CAB2CAB3CAB4CAB5CAB6CAB7CAB8CAB9'.             
352500     03  PIC X(16) VALUE X'CABACABBCABCCABDCABECABFCAC0CAC1'.             
352600     03  PIC X(16) VALUE X'CAC2CAC3CAC4CAC5CAC6CAC7CAC8CAC9'.             
352700     03  PIC X(16) VALUE X'CACACACBCACCCACDCACECACFCAD0CAD1'.             
352800     03  PIC X(16) VALUE X'CAD2CAD3CAD4CAD5CAD6CAD7CAD8CAD9'.             
352900     03  PIC X(16) VALUE X'CADACADBCADCCADDCADECADFCAE0CAE1'.             
353000     03  PIC X(16) VALUE X'CAE2CAE3CAE4CAE5CAE6CAE7CAE8CAE9'.             
353100     03  PIC X(16) VALUE X'CAEACAEBCAECCAEDCAEECAEFCAF0CAF1'.             
353200     03  PIC X(16) VALUE X'CAF2CAF3CAF4CAF5CAF6CAF7CAF8CAF9'.             
353300     03  PIC X(16) VALUE X'CAFACAFBCAFCCAFDCB41CB42CB43CB44'.             
353400     03  PIC X(16) VALUE X'CB45CB46CB47CB48CB49CB4ACB4BCB4C'.             
353500     03  PIC X(16) VALUE X'CB4DCB4ECB4FCB50CB51CB52CB53CB54'.             
353600     03  PIC X(16) VALUE X'CB55CB56CB57CB58CB59CB5ACB5BCB5C'.             
353700     03  PIC X(16) VALUE X'CB5DCB5ECB5FCB60CB61CB62CB63CB64'.             
353800     03  PIC X(16) VALUE X'CB65CB66CB67CB68CB69CB6ACB6BCB6C'.             
353900     03  PIC X(16) VALUE X'CB6DCB6ECB6FCB70CB71CB72CB73CB74'.             
354000     03  PIC X(16) VALUE X'CB75CB76CB77CB78CB79CB7ACB7BCB7C'.             
354100     03  PIC X(16) VALUE X'CB7DCB7ECB7FCB81CB82CB83CB84CB85'.             
354200     03  PIC X(16) VALUE X'CB86CB87CB88CB89CB8ACB8BCB8CCB8D'.             
354300     03  PIC X(16) VALUE X'CB8ECB8FCB90CB91CB92CB93CB94CB95'.             
354400     03  PIC X(16) VALUE X'CB96CB97CB98CB99CB9ACB9BCB9CCB9D'.             
354500     03  PIC X(16) VALUE X'CB9ECB9FCBA0CBA1CBA2CBA3CBA4CBA5'.             
354600*    -- TAB2-IND = 107 (X'6B')                                            
354700     03  PIC X(16) VALUE X'CBA6CBA7CBA8CBA9CBAACBABCBACCBAD'.             
354800     03  PIC X(16) VALUE X'CBAECBAFCBB0CBB1CBB2CBB3CBB4CBB5'.             
354900     03  PIC X(16) VALUE X'CBB6CBB7CBB8CBB9CBBACBBBCBBCCBBD'.             
355000     03  PIC X(16) VALUE X'CBBECBBFCBC0CBC1CBC2CBC3CBC4CBC5'.             
355100     03  PIC X(16) VALUE X'CBC6CBC7CBC8CBC9CBCACBCBCBCCCBCD'.             
355200     03  PIC X(16) VALUE X'CBCECBCFCBD0CBD1CBD2CBD3CBD4CBD5'.             
355300     03  PIC X(16) VALUE X'CBD6CBD7CBD8CBD9CBDACBDBCBDCCBDD'.             
355400     03  PIC X(16) VALUE X'CBDECBDFCBE0CBE1CBE2CBE3CBE4CBE5'.             
355500     03  PIC X(16) VALUE X'CBE6CBE7CBE8CBE9CBEACBEBCBECCBED'.             
355600     03  PIC X(16) VALUE X'CBEECBEFCBF0CBF1CBF2CBF3CBF4CBF5'.             
355700     03  PIC X(16) VALUE X'CBF6CBF7CBF8CBF9CBFACBFBCBFCCBFD'.             
355800     03  PIC X(16) VALUE X'CC41CC42CC43CC44CC45CC46CC47CC48'.             
355900     03  PIC X(16) VALUE X'CC49CC4ACC4BCC4CCC4DCC4ECC4FCC50'.             
356000     03  PIC X(16) VALUE X'CC51CC52CC53CC54CC55CC56CC57CC58'.             
356100     03  PIC X(16) VALUE X'CC59CC5ACC5BCC5CCC5DCC5ECC5FCC60'.             
356200     03  PIC X(16) VALUE X'CC61CC62CC63CC64CC65CC66CC67CC68'.             
356300     03  PIC X(16) VALUE X'CC69CC6ACC6BCC6CCC6DCC6ECC6FCC70'.             
356400     03  PIC X(16) VALUE X'CC71CC72CC73CC74CC75CC76CC77CC78'.             
356500     03  PIC X(16) VALUE X'CC79CC7ACC7BCC7CCC7DCC7ECC7FCC81'.             
356600     03  PIC X(16) VALUE X'CC82CC83CC84CC85CC86CC87CC88CC89'.             
356700     03  PIC X(16) VALUE X'CC8ACC8BCC8CCC8DCC8ECC8FCC90CC91'.             
356800     03  PIC X(16) VALUE X'CC92CC93CC94CC95CC96CC97CC98CC99'.             
356900     03  PIC X(16) VALUE X'CC9ACC9BCC9CCC9DCC9ECC9FCCA0CCA1'.             
357000     03  PIC X(16) VALUE X'CCA2CCA3CCA4CCA5CCA6CCA7CCA8CCA9'.             
357100     03  PIC X(16) VALUE X'CCAACCABCCACCCADCCAECCAFCCB0CCB1'.             
357200     03  PIC X(16) VALUE X'CCB2CCB3CCB4CCB5CCB6CCB7CCB8CCB9'.             
357300     03  PIC X(16) VALUE X'CCBACCBBCCBCCCBDCCBECCBFCCC0CCC1'.             
357400     03  PIC X(16) VALUE X'CCC2CCC3CCC4CCC5CCC6CCC7CCC8CCC9'.             
357500     03  PIC X(16) VALUE X'CCCACCCBCCCCCCCDCCCECCCFCCD0CCD1'.             
357600     03  PIC X(16) VALUE X'CCD2CCD3CCD4CCD5CCD6CCD7CCD8CCD9'.             
357700     03  PIC X(16) VALUE X'CCDACCDBCCDCCCDDCCDECCDFCCE0CCE1'.             
357800     03  PIC X(16) VALUE X'CCE2CCE3CCE4CCE5CCE6CCE7CCE8CCE9'.             
357900*    -- TAB2-IND = 108 (X'6C')                                            
358000     03  PIC X(16) VALUE X'CCEACCEBCCECCCEDCCEECCEFCCF0CCF1'.             
358100     03  PIC X(16) VALUE X'CCF2CCF3CCF4CCF5CCF6CCF7CCF8CCF9'.             
358200     03  PIC X(16) VALUE X'CCFACCFBCCFCCCFDCD41CD42CD43CD44'.             
358300     03  PIC X(16) VALUE X'CD45CD46CD47CD48CD49CD4ACD4BCD4C'.             
358400     03  PIC X(16) VALUE X'CD4DCD4ECD4FCD50CD51CD52CD53CD54'.             
358500     03  PIC X(16) VALUE X'CD55CD56CD57CD58CD59CD5ACD5BCD5C'.             
358600     03  PIC X(16) VALUE X'CD5DCD5ECD5FCD60CD61CD62CD63CD64'.             
358700     03  PIC X(16) VALUE X'CD65CD66CD67CD68CD69CD6ACD6BCD6C'.             
358800     03  PIC X(16) VALUE X'CD6DCD6ECD6FCD70CD71CD72CD73CD74'.             
358900     03  PIC X(16) VALUE X'CD75CD76CD77CD78CD79CD7ACD7BCD7C'.             
359000     03  PIC X(16) VALUE X'CD7DCD7ECD7FCD81CD82CD83CD84CD85'.             
359100     03  PIC X(16) VALUE X'CD86CD87CD88CD89CD8ACD8BCD8CCD8D'.             
359200     03  PIC X(16) VALUE X'CD8ECD8FCD90CD91CD92CD93CD94CD95'.             
359300     03  PIC X(16) VALUE X'CD96CD97CD98CD99CD9ACD9BCD9CCD9D'.             
359400     03  PIC X(16) VALUE X'CD9ECD9FCDA0CDA1CDA2CDA3CDA4CDA5'.             
359500     03  PIC X(16) VALUE X'CDA6CDA7CDA8CDA9CDAACDABCDACCDAD'.             
359600     03  PIC X(16) VALUE X'CDAECDAFCDB0CDB1CDB2CDB3CDB4CDB5'.             
359700     03  PIC X(16) VALUE X'CDB6CDB7CDB8CDB9CDBACDBBCDBCCDBD'.             
359800     03  PIC X(16) VALUE X'CDBECDBFCDC0CDC1CDC2CDC3CDC4CDC5'.             
359900     03  PIC X(16) VALUE X'CDC6CDC7CDC8CDC9CDCACDCBCDCCCDCD'.             
360000     03  PIC X(16) VALUE X'CDCECDCFCDD0CDD1CDD2CDD3CDD4CDD5'.             
360100     03  PIC X(16) VALUE X'CDD6CDD7CDD8CDD9CDDACDDBCDDCCDDD'.             
360200     03  PIC X(16) VALUE X'CDDECDDFCDE0CDE1CDE2CDE3CDE4CDE5'.             
360300     03  PIC X(16) VALUE X'CDE6CDE7CDE8CDE9CDEACDEBCDECCDED'.             
360400     03  PIC X(16) VALUE X'CDEECDEFCDF0CDF1CDF2CDF3CDF4CDF5'.             
360500     03  PIC X(16) VALUE X'CDF6CDF7CDF8CDF9CDFACDFBCDFCCDFD'.             
360600     03  PIC X(16) VALUE X'CE41CE42CE43CE44CE45CE46CE47CE48'.             
360700     03  PIC X(16) VALUE X'CE49CE4ACE4BCE4CCE4DCE4ECE4FCE50'.             
360800     03  PIC X(16) VALUE X'CE51CE52CE53CE54CE55CE56CE57CE58'.             
360900     03  PIC X(16) VALUE X'CE59CE5ACE5BCE5CCE5DCE5ECE5FCE60'.             
361000     03  PIC X(16) VALUE X'CE61CE62CE63CE64CE65CE66CE67CE68'.             
361100     03  PIC X(16) VALUE X'CE69CE6ACE6BCE6CCE6DCE6ECE6FCE70'.             
361200*    -- TAB2-IND = 109 (X'6D')                                            
361300     03  PIC X(16) VALUE X'CE71CE72CE73CE74CE75CE76CE77CE78'.             
361400     03  PIC X(16) VALUE X'CE79CE7ACE7BCE7CCE7DCE7ECE7FCE81'.             
361500     03  PIC X(16) VALUE X'CE82CE83CE84CE85CE86CE87CE88CE89'.             
361600     03  PIC X(16) VALUE X'CE8ACE8BCE8CCE8DCE8ECE8FCE90CE91'.             
361700     03  PIC X(16) VALUE X'CE92CE93CE94CE95CE96CE97CE98CE99'.             
361800     03  PIC X(16) VALUE X'CE9ACE9BCE9CCE9DCE9ECE9FCEA0CEA1'.             
361900     03  PIC X(16) VALUE X'CEA2CEA3CEA4CEA5CEA6CEA7CEA8CEA9'.             
362000     03  PIC X(16) VALUE X'CEAACEABCEACCEADCEAECEAFCEB0CEB1'.             
362100     03  PIC X(16) VALUE X'CEB2CEB3CEB4CEB5CEB6CEB7CEB8CEB9'.             
362200     03  PIC X(16) VALUE X'CEBACEBBCEBCCEBDCEBECEBFCEC0CEC1'.             
362300     03  PIC X(16) VALUE X'CEC2CEC3CEC4CEC5CEC6CEC7CEC8CEC9'.             
362400     03  PIC X(16) VALUE X'CECACECBCECCCECDCECECECFCED0CED1'.             
362500     03  PIC X(16) VALUE X'CED2CED3CED4CED5CED6CED7CED8CED9'.             
362600     03  PIC X(16) VALUE X'CEDACEDBCEDCCEDDCEDECEDFCEE0CEE1'.             
362700     03  PIC X(16) VALUE X'CEE2CEE3CEE4CEE5CEE6CEE7CEE8CEE9'.             
362800     03  PIC X(16) VALUE X'CEEACEEBCEECCEEDCEEECEEFCEF0CEF1'.             
362900     03  PIC X(16) VALUE X'CEF2CEF3CEF4CEF5CEF6CEF7CEF8CEF9'.             
363000     03  PIC X(16) VALUE X'CEFACEFBCEFCCEFDCF41CF42CF43CF44'.             
363100     03  PIC X(16) VALUE X'CF45CF46CF47CF48CF49CF4ACF4BCF4C'.             
363200     03  PIC X(16) VALUE X'CF4DCF4ECF4FCF50CF51CF52CF53CF54'.             
363300     03  PIC X(16) VALUE X'CF55CF56CF57CF58CF59CF5ACF5BCF5C'.             
363400     03  PIC X(16) VALUE X'CF5DCF5ECF5FCF60CF61CF62CF63CF64'.             
363500     03  PIC X(16) VALUE X'CF65CF66CF67CF68CF69CF6ACF6BCF6C'.             
363600     03  PIC X(16) VALUE X'CF6DCF6ECF6FCF70CF71CF72CF73CF74'.             
363700     03  PIC X(16) VALUE X'CF75CF76CF77CF78CF79CF7ACF7BCF7C'.             
363800     03  PIC X(16) VALUE X'CF7DCF7ECF7FCF81CF82CF83CF84CF85'.             
363900     03  PIC X(16) VALUE X'CF86CF87CF88CF89CF8ACF8BCF8CCF8D'.             
364000     03  PIC X(16) VALUE X'CF8ECF8FCF90CF91CF92CF93CF94CF95'.             
364100     03  PIC X(16) VALUE X'CF96CF97CF98CF99CF9ACF9BCF9CCF9D'.             
364200     03  PIC X(16) VALUE X'CF9ECF9FCFA0CFA1CFA2CFA3CFA4CFA5'.             
364300     03  PIC X(16) VALUE X'CFA6CFA7CFA8CFA9CFAACFABCFACCFAD'.             
364400     03  PIC X(16) VALUE X'CFAECFAFCFB0CFB1CFB2CFB3CFB4CFB5'.             
364500*    -- TAB2-IND = 110 (X'6E')                                            
364600     03  PIC X(16) VALUE X'CFB6CFB7CFB8CFB9CFBACFBBCFBCCFBD'.             
364700     03  PIC X(16) VALUE X'CFBECFBFCFC0CFC1CFC2CFC3CFC4CFC5'.             
364800     03  PIC X(16) VALUE X'CFC6CFC7CFC8CFC9CFCACFCBCFCCCFCD'.             
364900     03  PIC X(16) VALUE X'CFCECFCFCFD0CFD1CFD2CFD3CFD4CFD5'.             
365000     03  PIC X(16) VALUE X'CFD6CFD7CFD8CFD9CFDACFDBCFDCCFDD'.             
365100     03  PIC X(16) VALUE X'CFDECFDFCFE0CFE1CFE2CFE3CFE4CFE5'.             
365200     03  PIC X(16) VALUE X'CFE6CFE7CFE8CFE9CFEACFEBCFECCFED'.             
365300     03  PIC X(16) VALUE X'CFEECFEFCFF0CFF1CFF2CFF3CFF4CFF5'.             
365400     03  PIC X(16) VALUE X'CFF6CFF7CFF8CFF9CFFACFFBCFFCCFFD'.             
365500     03  PIC X(16) VALUE X'D041D042D043D044D045D046D047D048'.             
365600     03  PIC X(16) VALUE X'D049D04AD04BD04CD04DD04ED04FD050'.             
365700     03  PIC X(16) VALUE X'D051D052D053D054D055D056D057D058'.             
365800     03  PIC X(16) VALUE X'D059D05AD05BD05CD05DD05ED05FD060'.             
365900     03  PIC X(16) VALUE X'D061D062D063D064D065D066D067D068'.             
366000     03  PIC X(16) VALUE X'D069D06AD06BD06CD06DD06ED06FD070'.             
366100     03  PIC X(16) VALUE X'D071D072D073D074D075D076D077D078'.             
366200     03  PIC X(16) VALUE X'D079D07AD07BD07CD07DD07ED07FD081'.             
366300     03  PIC X(16) VALUE X'D082D083D084D085D086D087D088D089'.             
366400     03  PIC X(16) VALUE X'D08AD08BD08CD08DD08ED08FD090D091'.             
366500     03  PIC X(16) VALUE X'D092D093D094D095D096D097D098D099'.             
366600     03  PIC X(16) VALUE X'D09AD09BD09CD09DD09ED09FD0A0D0A1'.             
366700     03  PIC X(16) VALUE X'D0A2D0A3D0A4D0A5D0A6D0A7D0A8D0A9'.             
366800     03  PIC X(16) VALUE X'D0AAD0ABD0ACD0ADD0AED0AFD0B0D0B1'.             
366900     03  PIC X(16) VALUE X'D0B2D0B3D0B4D0B5D0B6D0B7D0B8D0B9'.             
367000     03  PIC X(16) VALUE X'D0BAD0BBD0BCD0BDD0BED0BFD0C0D0C1'.             
367100     03  PIC X(16) VALUE X'D0C2D0C3D0C4D0C5D0C6D0C7D0C8D0C9'.             
367200     03  PIC X(16) VALUE X'D0CAD0CBD0CCD0CDD0CED0CFD0D0D0D1'.             
367300     03  PIC X(16) VALUE X'D0D2D0D3D0D4D0D5D0D6D0D7D0D8D0D9'.             
367400     03  PIC X(16) VALUE X'D0DAD0DBD0DCD0DDD0DED0DFD0E0D0E1'.             
367500     03  PIC X(16) VALUE X'D0E2D0E3D0E4D0E5D0E6D0E7D0E8D0E9'.             
367600     03  PIC X(16) VALUE X'D0EAD0EBD0ECD0EDD0EED0EFD0F0D0F1'.             
367700     03  PIC X(16) VALUE X'D0F2D0F3D0F4D0F5D0F6D0F7D0F8D0F9'.             
367800*    -- TAB2-IND = 111 (X'6F')                                            
367900     03  PIC X(16) VALUE X'D0FAD0FBD0FCD0FDD141D142D143D144'.             
368000     03  PIC X(16) VALUE X'D145D146D147D148D149D14AD14BD14C'.             
368100     03  PIC X(16) VALUE X'D14DD14ED14FD150D151D152D153D154'.             
368200     03  PIC X(16) VALUE X'D155D156D157D158D159D15AD15BD15C'.             
368300     03  PIC X(16) VALUE X'D15DD15ED15FD160D161D162D163D164'.             
368400     03  PIC X(16) VALUE X'D165D166D167D168D169D16AD16BD16C'.             
368500     03  PIC X(16) VALUE X'D16DD16ED16FD170D171D172D173D174'.             
368600     03  PIC X(16) VALUE X'D175D176D177D178D179D17AD17BD17C'.             
368700     03  PIC X(16) VALUE X'D17DD17ED17FD181D182D183D184D185'.             
368800     03  PIC X(16) VALUE X'D186D187D188D189D18AD18BD18CD18D'.             
368900     03  PIC X(16) VALUE X'D18ED18FD190D191D192D193D194D195'.             
369000     03  PIC X(16) VALUE X'D196D197D198D199D19AD19BD19CD19D'.             
369100     03  PIC X(16) VALUE X'D19ED19FD1A0D1A1D1A2D1A3D1A4D1A5'.             
369200     03  PIC X(16) VALUE X'D1A6D1A7D1A8D1A9D1AAD1ABD1ACD1AD'.             
369300     03  PIC X(16) VALUE X'D1AED1AFD1B0D1B1D1B2D1B3D1B4D1B5'.             
369400     03  PIC X(16) VALUE X'D1B6D1B7D1B8D1B9D1BAD1BBD1BCD1BD'.             
369500     03  PIC X(16) VALUE X'D1BED1BFD1C0D1C1D1C2D1C3D1C4D1C5'.             
369600     03  PIC X(16) VALUE X'D1C6D1C7D1C8D1C9D1CAD1CBD1CCD1CD'.             
369700     03  PIC X(16) VALUE X'D1CED1CFD1D0D1D1D1D2D1D3D1D4D1D5'.             
369800     03  PIC X(16) VALUE X'D1D6D1D7D1D8D1D9D1DAD1DBD1DCD1DD'.             
369900     03  PIC X(16) VALUE X'D1DED1DFD1E0D1E1D1E2D1E3D1E4D1E5'.             
370000     03  PIC X(16) VALUE X'D1E6D1E7D1E8D1E9D1EAD1EBD1ECD1ED'.             
370100     03  PIC X(16) VALUE X'D1EED1EFD1F0D1F1D1F2D1F3D1F4D1F5'.             
370200     03  PIC X(16) VALUE X'D1F6D1F7D1F8D1F9D1FAD1FBD1FCD1FD'.             
370300     03  PIC X(16) VALUE X'D241D242D243D244D245D246D247D248'.             
370400     03  PIC X(16) VALUE X'D249D24AD24BD24CD24DD24ED24FD250'.             
370500     03  PIC X(16) VALUE X'D251D252D253D254D255D256D257D258'.             
370600     03  PIC X(16) VALUE X'D259D25AD25BD25CD25DD25ED25FD260'.             
370700     03  PIC X(16) VALUE X'D261D262D263D264D265D266D267D268'.             
370800     03  PIC X(16) VALUE X'D269D26AD26BD26CD26DD26ED26FD270'.             
370900     03  PIC X(16) VALUE X'D271D272D273D274D275D276D277D278'.             
371000     03  PIC X(16) VALUE X'D279D27AD27BD27CD27DD27ED27FD281'.             
371100*    -- TAB2-IND = 112 (X'70')                                            
371200     03  PIC X(16) VALUE X'D282D283D284D285D286D287D288D289'.             
371300     03  PIC X(16) VALUE X'D28AD28BD28CD28DD28ED28FD290D291'.             
371400     03  PIC X(16) VALUE X'D292D293D294D295D296D297D298D299'.             
371500     03  PIC X(16) VALUE X'D29AD29BD29CD29DD29ED29FD2A0D2A1'.             
371600     03  PIC X(16) VALUE X'D2A2D2A3D2A4D2A5D2A6D2A7D2A8D2A9'.             
371700     03  PIC X(16) VALUE X'D2AAD2ABD2ACD2ADD2AED2AFD2B0D2B1'.             
371800     03  PIC X(16) VALUE X'D2B2D2B3D2B4D2B5D2B6D2B7D2B8D2B9'.             
371900     03  PIC X(16) VALUE X'D2BAD2BBD2BCD2BDD2BED2BFD2C0D2C1'.             
372000     03  PIC X(16) VALUE X'D2C2D2C3D2C4D2C5D2C6D2C7D2C8D2C9'.             
372100     03  PIC X(16) VALUE X'D2CAD2CBD2CCD2CDD2CED2CFD2D0D2D1'.             
372200     03  PIC X(16) VALUE X'D2D2D2D3D2D4D2D5D2D6D2D7D2D8D2D9'.             
372300     03  PIC X(16) VALUE X'D2DAD2DBD2DCD2DDD2DED2DFD2E0D2E1'.             
372400     03  PIC X(16) VALUE X'D2E2D2E3D2E4D2E5D2E6D2E7D2E8D2E9'.             
372500     03  PIC X(16) VALUE X'D2EAD2EBD2ECD2EDD2EED2EFD2F0D2F1'.             
372600     03  PIC X(16) VALUE X'D2F2D2F3D2F4D2F5D2F6D2F7D2F8D2F9'.             
372700     03  PIC X(16) VALUE X'D2FAD2FBD2FCD2FDD341D342D343D344'.             
372800     03  PIC X(16) VALUE X'D345D346D347D348D349D34AD34BD34C'.             
372900     03  PIC X(16) VALUE X'D34DD34ED34FD350D351D352D353D354'.             
373000     03  PIC X(16) VALUE X'D355D356D357D358D359D35AD35BD35C'.             
373100     03  PIC X(16) VALUE X'D35DD35ED35FD360D361D362D363D364'.             
373200     03  PIC X(16) VALUE X'D365D366D367D368D369D36AD36BD36C'.             
373300     03  PIC X(16) VALUE X'D36DD36ED36FD370D371D372D373D374'.             
373400     03  PIC X(16) VALUE X'D375D376D377D378D379D37AD37BD37C'.             
373500     03  PIC X(16) VALUE X'D37DD37ED37FD381D382D383D384D385'.             
373600     03  PIC X(16) VALUE X'D386D387D388D389D38AD38BD38CD38D'.             
373700     03  PIC X(16) VALUE X'D38ED38FD390D391D392D393D394D395'.             
373800     03  PIC X(16) VALUE X'D396D397D398D399D39AD39BD39CD39D'.             
373900     03  PIC X(16) VALUE X'D39ED39FD3A0D3A1D3A2D3A3D3A4D3A5'.             
374000     03  PIC X(16) VALUE X'D3A6D3A7D3A8D3A9D3AAD3ABD3ACD3AD'.             
374100     03  PIC X(16) VALUE X'D3AED3AFD3B0D3B1D3B2D3B3D3B4D3B5'.             
374200     03  PIC X(16) VALUE X'D3B6D3B7D3B8D3B9D3BAD3BBD3BCD3BD'.             
374300     03  PIC X(16) VALUE X'D3BED3BFD3C0D3C1D3C2D3C3D3C4D3C5'.             
374400*    -- TAB2-IND = 113 (X'71')                                            
374500     03  PIC X(16) VALUE X'D3C6D3C7D3C8D3C9D3CAD3CBD3CCD3CD'.             
374600     03  PIC X(16) VALUE X'D3CED3CFD3D0D3D1D3D2D3D3D3D4D3D5'.             
374700     03  PIC X(16) VALUE X'D3D6D3D7D3D8D3D9D3DAD3DBD3DCD3DD'.             
374800     03  PIC X(16) VALUE X'D3DED3DFD3E0D3E1D3E2D3E3D3E4D3E5'.             
374900     03  PIC X(16) VALUE X'D3E6D3E7D3E8D3E9D3EAD3EBD3ECD3ED'.             
375000     03  PIC X(16) VALUE X'D3EED3EFD3F0D3F1D3F2D3F3D3F4D3F5'.             
375100     03  PIC X(16) VALUE X'D3F6D3F7D3F8D3F9D3FAD3FBD3FCD3FD'.             
375200     03  PIC X(16) VALUE X'D441D442D443D444D445D446D447D448'.             
375300     03  PIC X(16) VALUE X'D449D44AD44BD44CD44DD44ED44FD450'.             
375400     03  PIC X(16) VALUE X'D451D452D453D454D455D456D457D458'.             
375500     03  PIC X(16) VALUE X'D459D45AD45BD45CD45DD45ED45FD460'.             
375600     03  PIC X(16) VALUE X'D461D462D463D464D465D466D467D468'.             
375700     03  PIC X(16) VALUE X'D469D46AD46BD46CD46DD46ED46FD470'.             
375800     03  PIC X(16) VALUE X'D471D472D473D474D475D476D477D478'.             
375900     03  PIC X(16) VALUE X'D479D47AD47BD47CD47DD47ED47FD481'.             
376000     03  PIC X(16) VALUE X'D482D483D484D485D486D487D488D489'.             
376100     03  PIC X(16) VALUE X'D48AD48BD48CD48DD48ED48FD490D491'.             
376200     03  PIC X(16) VALUE X'D492D493D494D495D496D497D498D499'.             
376300     03  PIC X(16) VALUE X'D49AD49BD49CD49DD49ED49FD4A0D4A1'.             
376400     03  PIC X(16) VALUE X'D4A2D4A3D4A4D4A5D4A6D4A7D4A8D4A9'.             
376500     03  PIC X(16) VALUE X'D4AAD4ABD4ACD4ADD4AED4AFD4B0D4B1'.             
376600     03  PIC X(16) VALUE X'D4B2D4B3D4B4D4B5D4B6D4B7D4B8D4B9'.             
376700     03  PIC X(16) VALUE X'D4BAD4BBD4BCD4BDD4BED4BFD4C0D4C1'.             
376800     03  PIC X(16) VALUE X'D4C2D4C3D4C4D4C5D4C6D4C7D4C8D4C9'.             
376900     03  PIC X(16) VALUE X'D4CAD4CBD4CCD4CDD4CED4CFD4D0D4D1'.             
377000     03  PIC X(16) VALUE X'D4D2D4D3D4D4D4D5D4D6D4D7D4D8D4D9'.             
377100     03  PIC X(16) VALUE X'D4DAD4DBD4DCD4DDD4DED4DFD4E0D4E1'.             
377200     03  PIC X(16) VALUE X'D4E2D4E3D4E4D4E5D4E6D4E7D4E8D4E9'.             
377300     03  PIC X(16) VALUE X'D4EAD4EBD4ECD4EDD4EED4EFD4F0D4F1'.             
377400     03  PIC X(16) VALUE X'D4F2D4F3D4F4D4F5D4F6D4F7D4F8D4F9'.             
377500     03  PIC X(16) VALUE X'D4FAD4FBD4FCD4FDD541D542D543D544'.             
377600     03  PIC X(16) VALUE X'D545D546D547D548D549D54AD54BD54C'.             
377700*    -- TAB2-IND = 114 (X'72')                                            
377800     03  PIC X(16) VALUE X'D54DD54ED54FD550D551D552D553D554'.             
377900     03  PIC X(16) VALUE X'D555D556D557D558D559D55AD55BD55C'.             
378000     03  PIC X(16) VALUE X'D55DD55ED55FD560D561D562D563D564'.             
378100     03  PIC X(16) VALUE X'D565D566D567D568D569D56AD56BD56C'.             
378200     03  PIC X(16) VALUE X'D56DD56ED56FD570D571D572D573D574'.             
378300     03  PIC X(16) VALUE X'D575D576D577D578D579D57AD57BD57C'.             
378400     03  PIC X(16) VALUE X'D57DD57ED57FD581D582D583D584D585'.             
378500     03  PIC X(16) VALUE X'D586D587D588D589D58AD58BD58CD58D'.             
378600     03  PIC X(16) VALUE X'D58ED58FD590D591D592D593D594D595'.             
378700     03  PIC X(16) VALUE X'D596D597D598D599D59AD59BD59CD59D'.             
378800     03  PIC X(16) VALUE X'D59ED59FD5A0D5A1D5A2D5A3D5A4D5A5'.             
378900     03  PIC X(16) VALUE X'D5A6D5A7D5A8D5A9D5AAD5ABD5ACD5AD'.             
379000     03  PIC X(16) VALUE X'D5AED5AFD5B0D5B1D5B2D5B3D5B4D5B5'.             
379100     03  PIC X(16) VALUE X'D5B6D5B7D5B8D5B9D5BAD5BBD5BCD5BD'.             
379200     03  PIC X(16) VALUE X'D5BED5BFD5C0D5C1D5C2D5C3D5C4D5C5'.             
379300     03  PIC X(16) VALUE X'D5C6D5C7D5C8D5C9D5CAD5CBD5CCD5CD'.             
379400     03  PIC X(16) VALUE X'D5CED5CFD5D0D5D1D5D2D5D3D5D4D5D5'.             
379500     03  PIC X(16) VALUE X'D5D6D5D7D5D8D5D9D5DAD5DBD5DCD5DD'.             
379600     03  PIC X(16) VALUE X'D5DED5DFD5E0D5E1D5E2D5E3D5E4D5E5'.             
379700     03  PIC X(16) VALUE X'D5E6D5E7D5E8D5E9D5EAD5EBD5ECD5ED'.             
379800     03  PIC X(16) VALUE X'D5EED5EFD5F0D5F1D5F2D5F3D5F4D5F5'.             
379900     03  PIC X(16) VALUE X'D5F6D5F7D5F8D5F9D5FAD5FBD5FCD5FD'.             
380000     03  PIC X(16) VALUE X'D641D642D643D644D645D646D647D648'.             
380100     03  PIC X(16) VALUE X'D649D64AD64BD64CD64DD64ED64FD650'.             
380200     03  PIC X(16) VALUE X'D651D652D653D654D655D656D657D658'.             
380300     03  PIC X(16) VALUE X'D659D65AD65BD65CD65DD65ED65FD660'.             
380400     03  PIC X(16) VALUE X'D661D662D663D664D665D666D667D668'.             
380500     03  PIC X(16) VALUE X'D669D66AD66BD66CD66DD66ED66FD670'.             
380600     03  PIC X(16) VALUE X'D671D672D673D674D675D676D677D678'.             
380700     03  PIC X(16) VALUE X'D679D67AD67BD67CD67DD67ED67FD681'.             
380800     03  PIC X(16) VALUE X'D682D683D684D685D686D687D688D689'.             
380900     03  PIC X(16) VALUE X'D68AD68BD68CD68DD68ED68FD690D691'.             
381000*    -- TAB2-IND = 115 (X'73')                                            
381100     03  PIC X(16) VALUE X'D692D693D694D695D696D697D698D699'.             
381200     03  PIC X(16) VALUE X'D69AD69BD69CD69DD69ED69FD6A0D6A1'.             
381300     03  PIC X(16) VALUE X'D6A2D6A3D6A4D6A5D6A6D6A7D6A8D6A9'.             
381400     03  PIC X(16) VALUE X'D6AAD6ABD6ACD6ADD6AED6AFD6B0D6B1'.             
381500     03  PIC X(16) VALUE X'D6B2D6B3D6B4D6B5D6B6D6B7D6B8D6B9'.             
381600     03  PIC X(16) VALUE X'D6BAD6BBD6BCD6BDD6BED6BFD6C0D6C1'.             
381700     03  PIC X(16) VALUE X'D6C2D6C3D6C4D6C5D6C6D6C7D6C8D6C9'.             
381800     03  PIC X(16) VALUE X'D6CAD6CBD6CCD6CDD6CED6CFD6D0D6D1'.             
381900     03  PIC X(16) VALUE X'D6D2D6D3D6D4D6D5D6D6D6D7D6D8D6D9'.             
382000     03  PIC X(16) VALUE X'D6DAD6DBD6DCD6DDD6DED6DFD6E0D6E1'.             
382100     03  PIC X(16) VALUE X'D6E2D6E3D6E4D6E5D6E6D6E7D6E8D6E9'.             
382200     03  PIC X(16) VALUE X'D6EAD6EBD6ECD6EDD6EED6EFD6F0D6F1'.             
382300     03  PIC X(16) VALUE X'D6F2D6F3D6F4D6F5D6F6D6F7D6F8D6F9'.             
382400     03  PIC X(16) VALUE X'D6FAD6FBD6FCD6FDD741D742D743D744'.             
382500     03  PIC X(16) VALUE X'D745D746D747D748D749D74AD74BD74C'.             
382600     03  PIC X(16) VALUE X'D74DD74ED74FD750D751D752D753D754'.             
382700     03  PIC X(16) VALUE X'D755D756D757D758D759D75AD75BD75C'.             
382800     03  PIC X(16) VALUE X'D75DD75ED75FD760D761D762D763D764'.             
382900     03  PIC X(16) VALUE X'D765D766D767D768D769D76AD76BD76C'.             
383000     03  PIC X(16) VALUE X'D76DD76ED76FD770D771D772D773D774'.             
383100     03  PIC X(16) VALUE X'D775D776D777D778D779D77AD77BD77C'.             
383200     03  PIC X(16) VALUE X'D77DD77ED77FD781D782D783D784D785'.             
383300     03  PIC X(16) VALUE X'D786D787D788D789D78AD78BD78CD78D'.             
383400     03  PIC X(16) VALUE X'D78ED78FD790D791D792D793D794D795'.             
383500     03  PIC X(16) VALUE X'D796D797D798D799D79AD79BD79CD79D'.             
383600     03  PIC X(16) VALUE X'D79ED79FD7A0D7A1D7A2D7A3D7A4D7A5'.             
383700     03  PIC X(16) VALUE X'D7A6D7A7D7A8D7A9D7AAD7ABD7ACD7AD'.             
383800     03  PIC X(16) VALUE X'D7AED7AFD7B0D7B1D7B2D7B3D7B4D7B5'.             
383900     03  PIC X(16) VALUE X'D7B6D7B7D7B8D7B9D7BAD7BBD7BCD7BD'.             
384000     03  PIC X(16) VALUE X'D7BED7BFD7C0D7C1D7C2D7C3D7C4D7C5'.             
384100     03  PIC X(16) VALUE X'D7C6D7C7D7C8D7C9D7CAD7CBD7CCD7CD'.             
384200     03  PIC X(16) VALUE X'D7CED7CFD7D0D7D1D7D2D7D3D7D4D7D5'.             
384300*    -- TAB2-IND = 116 (X'74')                                            
384400     03  PIC X(16) VALUE X'D7D6D7D7D7D8D7D9D7DAD7DBD7DCD7DD'.             
384500     03  PIC X(16) VALUE X'D7DED7DFD7E0D7E1D7E2D7E3D7E4D7E5'.             
384600     03  PIC X(16) VALUE X'D7E6D7E7D7E8D7E9D7EAD7EBD7ECD7ED'.             
384700     03  PIC X(16) VALUE X'D7EED7EFD7F0D7F1D7F2D7F3D7F4D7F5'.             
384800     03  PIC X(16) VALUE X'D7F6D7F7D7F8D7F9D7FAD7FBD7FCD7FD'.             
384900     03  PIC X(16) VALUE X'D841D842D843D844D845D846D847D848'.             
385000     03  PIC X(16) VALUE X'D849D84AD84BD84CD84DD84ED84FD850'.             
385100     03  PIC X(16) VALUE X'D851D852D853D854D855D856D857D858'.             
385200     03  PIC X(16) VALUE X'D859D85AD85BD85CD85DD85ED85FD860'.             
385300     03  PIC X(16) VALUE X'D861D862D863D864D865D866D867D868'.             
385400     03  PIC X(16) VALUE X'D869D86AD86BD86CD86DD86ED86FD870'.             
385500     03  PIC X(16) VALUE X'D871D872D873D874D875D876D877D878'.             
385600     03  PIC X(16) VALUE X'D879D87AD87BD87CD87DD87ED87FD881'.             
385700     03  PIC X(16) VALUE X'D882D883D884D885D886D887D888D889'.             
385800     03  PIC X(16) VALUE X'D88AD88BD88CD88DD88ED88FD890D891'.             
385900     03  PIC X(16) VALUE X'D892D893D894D895D896D897D898D899'.             
386000     03  PIC X(16) VALUE X'D89AD89BD89CD89DD89ED89FD8A0D8A1'.             
386100     03  PIC X(16) VALUE X'D8A2D8A3D8A4D8A5D8A6D8A7D8A8D8A9'.             
386200     03  PIC X(16) VALUE X'D8AAD8ABD8ACD8ADD8AED8AFD8B0D8B1'.             
386300     03  PIC X(16) VALUE X'D8B2D8B3D8B4D8B5D8B6D8B7D8B8D8B9'.             
386400     03  PIC X(16) VALUE X'D8BAD8BBD8BCD8BDD8BED8BFD8C0D8C1'.             
386500     03  PIC X(16) VALUE X'D8C2D8C3D8C4D8C5D8C6D8C7D8C8D8C9'.             
386600     03  PIC X(16) VALUE X'D8CAD8CBD8CCD8CDD8CED8CFD8D0D8D1'.             
386700     03  PIC X(16) VALUE X'D8D2D8D3D8D4D8D5D8D6D8D7D8D8D8D9'.             
386800     03  PIC X(16) VALUE X'D8DAD8DBD8DCD8DDD8DED8DFD8E0D8E1'.             
386900     03  PIC X(16) VALUE X'D8E2D8E3D8E4D8E5D8E6D8E7D8E8D8E9'.             
387000     03  PIC X(16) VALUE X'D8EAD8EBD8ECD8EDD8EED8EFD8F0D8F1'.             
387100     03  PIC X(16) VALUE X'D8F2D8F3D8F4D8F5D8F6D8F7D8F8D8F9'.             
387200     03  PIC X(16) VALUE X'D8FAD8FBD8FCD8FDD941D942D943D944'.             
387300     03  PIC X(16) VALUE X'D945D946D947D948D949D94AD94BD94C'.             
387400     03  PIC X(16) VALUE X'D94DD94ED94FD950D951D952D953D954'.             
387500     03  PIC X(16) VALUE X'D955D956D957D958D959D95AD95BD95C'.             
387600*    -- TAB2-IND = 117 (X'75')                                            
387700     03  PIC X(16) VALUE X'D95DD95ED95FD960D961D962D963D964'.             
387800     03  PIC X(16) VALUE X'D965D966D967D968D969D96AD96BD96C'.             
387900     03  PIC X(16) VALUE X'D96DD96ED96FD970D971D972D973D974'.             
388000     03  PIC X(16) VALUE X'D975D976D977D978D979D97AD97BD97C'.             
388100     03  PIC X(16) VALUE X'D97DD97ED97FD981D982D983D984D985'.             
388200     03  PIC X(16) VALUE X'D986D987D988D989D98AD98BD98CD98D'.             
388300     03  PIC X(16) VALUE X'D98ED98FD990D991D992D993D994D995'.             
388400     03  PIC X(16) VALUE X'D996D997D998D999D99AD99BD99CD99D'.             
388500     03  PIC X(16) VALUE X'D99ED99FD9A0D9A1D9A2D9A3D9A4D9A5'.             
388600     03  PIC X(16) VALUE X'D9A6D9A7D9A8D9A9D9AAD9ABD9ACD9AD'.             
388700     03  PIC X(16) VALUE X'D9AED9AFD9B0D9B1D9B2D9B3D9B4D9B5'.             
388800     03  PIC X(16) VALUE X'D9B6D9B7D9B8D9B9D9BAD9BBD9BCD9BD'.             
388900     03  PIC X(16) VALUE X'D9BED9BFD9C0D9C1D9C2D9C3D9C4D9C5'.             
389000     03  PIC X(16) VALUE X'D9C6D9C7D9C8D9C9D9CAD9CBD9CCD9CD'.             
389100     03  PIC X(16) VALUE X'D9CED9CFD9D0D9D1D9D2D9D3D9D4D9D5'.             
389200     03  PIC X(16) VALUE X'D9D6D9D7D9D8D9D9D9DAD9DBD9DCD9DD'.             
389300     03  PIC X(16) VALUE X'D9DED9DFD9E0D9E1D9E2D9E3D9E4D9E5'.             
389400     03  PIC X(16) VALUE X'D9E6D9E7D9E8D9E9D9EAD9EBD9ECD9ED'.             
389500     03  PIC X(16) VALUE X'D9EED9EFD9F0D9F1D9F2D9F3D9F4D9F5'.             
389600     03  PIC X(16) VALUE X'D9F6D9F7D9F8D9F9D9FAD9FBD9FCD9FD'.             
389700     03  PIC X(16) VALUE X'DA41DA42DA43DA44DA45DA46DA47DA48'.             
389800     03  PIC X(16) VALUE X'DA49DA4ADA4BDA4CDA4DDA4EDA4FDA50'.             
389900     03  PIC X(16) VALUE X'DA51DA52DA53DA54DA55DA56DA57DA58'.             
390000     03  PIC X(16) VALUE X'DA59DA5ADA5BDA5CDA5DDA5EDA5FDA60'.             
390100     03  PIC X(16) VALUE X'DA61DA62DA63DA64DA65DA66DA67DA68'.             
390200     03  PIC X(16) VALUE X'DA69DA6ADA6BDA6CDA6DDA6EDA6FDA70'.             
390300     03  PIC X(16) VALUE X'DA71DA72DA73DA74DA75DA76DA77DA78'.             
390400     03  PIC X(16) VALUE X'DA79DA7ADA7BDA7CDA7DDA7EDA7FDA81'.             
390500     03  PIC X(16) VALUE X'DA82DA83DA84DA85DA86DA87DA88DA89'.             
390600     03  PIC X(16) VALUE X'DA8ADA8BDA8CDA8DDA8EDA8FDA90DA91'.             
390700     03  PIC X(16) VALUE X'DA92DA93DA94DA95DA96DA97DA98DA99'.             
390800     03  PIC X(16) VALUE X'DA9ADA9BDA9CDA9DDA9EDA9FDAA0DAA1'.             
390900*    -- TAB2-IND = 118 (X'76')                                            
391000     03  PIC X(16) VALUE X'DAA2DAA3DAA4DAA5DAA6DAA7DAA8DAA9'.             
391100     03  PIC X(16) VALUE X'DAAADAABDAACDAADDAAEDAAFDAB0DAB1'.             
391200     03  PIC X(16) VALUE X'DAB2DAB3DAB4DAB5DAB6DAB7DAB8DAB9'.             
391300     03  PIC X(16) VALUE X'DABADABBDABCDABDDABEDABFDAC0DAC1'.             
391400     03  PIC X(16) VALUE X'DAC2DAC3DAC4DAC5DAC6DAC7DAC8DAC9'.             
391500     03  PIC X(16) VALUE X'DACADACBDACCDACDDACEDACFDAD0DAD1'.             
391600     03  PIC X(16) VALUE X'DAD2DAD3DAD4DAD5DAD6DAD7DAD8DAD9'.             
391700     03  PIC X(16) VALUE X'DADADADBDADCDADDDADEDADFDAE0DAE1'.             
391800     03  PIC X(16) VALUE X'DAE2DAE3DAE4DAE5DAE6DAE7DAE8DAE9'.             
391900     03  PIC X(16) VALUE X'DAEADAEBDAECDAEDDAEEDAEFDAF0DAF1'.             
392000     03  PIC X(16) VALUE X'DAF2DAF3DAF4DAF5DAF6DAF7DAF8DAF9'.             
392100     03  PIC X(16) VALUE X'DAFADAFBDAFCDAFDDB41DB42DB43DB44'.             
392200     03  PIC X(16) VALUE X'DB45DB46DB47DB48DB49DB4ADB4BDB4C'.             
392300     03  PIC X(16) VALUE X'DB4DDB4EDB4FDB50DB51DB52DB53DB54'.             
392400     03  PIC X(16) VALUE X'DB55DB56DB57DB58DB59DB5ADB5BDB5C'.             
392500     03  PIC X(16) VALUE X'DB5DDB5EDB5FDB60DB61DB62DB63DB64'.             
392600     03  PIC X(16) VALUE X'DB65DB66DB67DB68DB69DB6ADB6BDB6C'.             
392700     03  PIC X(16) VALUE X'DB6DDB6EDB6FDB70DB71DB72DB73DB74'.             
392800     03  PIC X(16) VALUE X'DB75DB76DB77DB78DB79DB7ADB7BDB7C'.             
392900     03  PIC X(16) VALUE X'DB7DDB7EDB7FDB81DB82DB83DB84DB85'.             
393000     03  PIC X(16) VALUE X'DB86DB87DB88DB89DB8ADB8BDB8CDB8D'.             
393100     03  PIC X(16) VALUE X'DB8EDB8FDB90DB91DB92DB93DB94DB95'.             
393200     03  PIC X(16) VALUE X'DB96DB97DB98DB99DB9ADB9BDB9CDB9D'.             
393300     03  PIC X(16) VALUE X'DB9EDB9FDBA0DBA1DBA2DBA3DBA4DBA5'.             
393400     03  PIC X(16) VALUE X'DBA6DBA7DBA8DBA9DBAADBABDBACDBAD'.             
393500     03  PIC X(16) VALUE X'DBAEDBAFDBB0DBB1DBB2DBB3DBB4DBB5'.             
393600     03  PIC X(16) VALUE X'DBB6DBB7DBB8DBB9DBBADBBBDBBCDBBD'.             
393700     03  PIC X(16) VALUE X'DBBEDBBFDBC0DBC1DBC2DBC3DBC4DBC5'.             
393800     03  PIC X(16) VALUE X'DBC6DBC7DBC8DBC9DBCADBCBDBCCDBCD'.             
393900     03  PIC X(16) VALUE X'DBCEDBCFDBD0DBD1DBD2DBD3DBD4DBD5'.             
394000     03  PIC X(16) VALUE X'DBD6DBD7DBD8DBD9DBDADBDBDBDCDBDD'.             
394100     03  PIC X(16) VALUE X'DBDEDBDFDBE0DBE1DBE2DBE3DBE4DBE5'.             
394200*    -- TAB2-IND = 119 (X'77')                                            
394300     03  PIC X(16) VALUE X'DBE6DBE7DBE8DBE9DBEADBEBDBECDBED'.             
394400     03  PIC X(16) VALUE X'DBEEDBEFDBF0DBF1DBF2DBF3DBF4DBF5'.             
394500     03  PIC X(16) VALUE X'DBF6DBF7DBF8DBF9DBFADBFBDBFCDBFD'.             
394600     03  PIC X(16) VALUE X'DC41DC42DC43DC44DC45DC46DC47DC48'.             
394700     03  PIC X(16) VALUE X'DC49DC4ADC4BDC4CDC4DDC4EDC4FDC50'.             
394800     03  PIC X(16) VALUE X'DC51DC52DC53DC54DC55DC56DC57DC58'.             
394900     03  PIC X(16) VALUE X'DC59DC5ADC5BDC5CDC5DDC5EDC5FDC60'.             
395000     03  PIC X(16) VALUE X'DC61DC62DC63DC64DC65DC66DC67DC68'.             
395100     03  PIC X(16) VALUE X'DC69DC6ADC6BDC6CDC6DDC6EDC6FDC70'.             
395200     03  PIC X(16) VALUE X'DC71DC72DC73DC74DC75DC76DC77DC78'.             
395300     03  PIC X(16) VALUE X'DC79DC7ADC7BDC7CDC7DDC7EDC7FDC81'.             
395400     03  PIC X(16) VALUE X'DC82DC83DC84DC85DC86DC87DC88DC89'.             
395500     03  PIC X(16) VALUE X'DC8ADC8BDC8CDC8DDC8EDC8FDC90DC91'.             
395600     03  PIC X(16) VALUE X'DC92DC93DC94DC95DC96DC97DC98DC99'.             
395700     03  PIC X(16) VALUE X'DC9ADC9BDC9CDC9DDC9EDC9FDCA0DCA1'.             
395800     03  PIC X(16) VALUE X'DCA2DCA3DCA4DCA5DCA6DCA7DCA8DCA9'.             
395900     03  PIC X(16) VALUE X'DCAADCABDCACDCADDCAEDCAFDCB0DCB1'.             
396000     03  PIC X(16) VALUE X'DCB2DCB3DCB4DCB5DCB6DCB7DCB8DCB9'.             
396100     03  PIC X(16) VALUE X'DCBADCBBDCBCDCBDDCBEDCBFDCC0DCC1'.             
396200     03  PIC X(16) VALUE X'DCC2DCC3DCC4DCC5DCC6DCC7DCC8DCC9'.             
396300     03  PIC X(16) VALUE X'DCCADCCBDCCCDCCDDCCEDCCFDCD0DCD1'.             
396400     03  PIC X(16) VALUE X'DCD2DCD3DCD4DCD5DCD6DCD7DCD8DCD9'.             
396500     03  PIC X(16) VALUE X'DCDADCDBDCDCDCDDDCDEDCDFDCE0DCE1'.             
396600     03  PIC X(16) VALUE X'DCE2DCE3DCE4DCE5DCE6DCE7DCE8DCE9'.             
396700     03  PIC X(16) VALUE X'DCEADCEBDCECDCEDDCEEDCEFDCF0DCF1'.             
396800     03  PIC X(16) VALUE X'DCF2DCF3DCF4DCF5DCF6DCF7DCF8DCF9'.             
396900     03  PIC X(16) VALUE X'DCFADCFBDCFCDCFDDD41DD42DD43DD44'.             
397000     03  PIC X(16) VALUE X'DD45DD46DD47DD48DD49DD4ADD4BDD4C'.             
397100     03  PIC X(16) VALUE X'DD4DDD4EDD4FDD50DD51DD52DD53DD54'.             
397200     03  PIC X(16) VALUE X'DD55DD56DD57DD58DD59DD5ADD5BDD5C'.             
397300     03  PIC X(16) VALUE X'DD5DDD5EDD5FDD60DD61DD62DD63DD64'.             
397400     03  PIC X(16) VALUE X'DD65DD66DD67DD68DD69DD6ADD6BDD6C'.             
397500*    -- TAB2-IND = 120 (X'78')                                            
397600     03  PIC X(16) VALUE X'DD6DDD6EDD6FDD70DD71DD72DD73DD74'.             
397700     03  PIC X(16) VALUE X'DD75DD76DD77DD78DD79DD7ADD7BDD7C'.             
397800     03  PIC X(16) VALUE X'DD7DDD7EDD7FDD81DD82DD83DD84DD85'.             
397900     03  PIC X(16) VALUE X'DD86DD87DD88DD89DD8ADD8BDD8CDD8D'.             
398000     03  PIC X(16) VALUE X'DD8EDD8FDD90DD91DD92DD93DD94DD95'.             
398100     03  PIC X(16) VALUE X'DD96DD97DD98DD99DD9ADD9BDD9CDD9D'.             
398200     03  PIC X(16) VALUE X'DD9EDD9FDDA0DDA1DDA2DDA3DDA4DDA5'.             
398300     03  PIC X(16) VALUE X'DDA6DDA7DDA8DDA9DDAADDABDDACDDAD'.             
398400     03  PIC X(16) VALUE X'DDAEDDAFDDB0DDB1DDB2DDB3DDB4DDB5'.             
398500     03  PIC X(16) VALUE X'DDB6DDB7DDB8DDB9DDBADDBBDDBCDDBD'.             
398600     03  PIC X(16) VALUE X'DDBEDDBFDDC0DDC1DDC2DDC3DDC4DDC5'.             
398700     03  PIC X(16) VALUE X'DDC6DDC7DDC8DDC9DDCADDCBDDCCDDCD'.             
398800     03  PIC X(16) VALUE X'DDCEDDCFDDD0DDD1DDD2DDD3DDD4DDD5'.             
398900     03  PIC X(16) VALUE X'DDD6DDD7DDD8DDD9DDDADDDBDDDCDDDD'.             
399000     03  PIC X(16) VALUE X'DDDEDDDFDDE0DDE1DDE2DDE3DDE4DDE5'.             
399100     03  PIC X(16) VALUE X'DDE6DDE7DDE8DDE9DDEADDEBDDECDDED'.             
399200     03  PIC X(16) VALUE X'DDEEDDEFDDF0DDF1DDF2DDF3DDF4DDF5'.             
399300     03  PIC X(16) VALUE X'DDF6DDF7DDF8DDF9DDFADDFBDDFCDDFD'.             
399400     03  PIC X(16) VALUE X'DE41DE42DE43DE44DE45DE46DE47DE48'.             
399500     03  PIC X(16) VALUE X'DE49DE4ADE4BDE4CDE4DDE4EDE4FDE50'.             
399600     03  PIC X(16) VALUE X'DE51DE52DE53DE54DE55DE56DE57DE58'.             
399700     03  PIC X(16) VALUE X'DE59DE5ADE5BDE5CDE5DDE5EDE5FDE60'.             
399800     03  PIC X(16) VALUE X'DE61DE62DE63DE64DE65DE66DE67DE68'.             
399900     03  PIC X(16) VALUE X'DE69DE6ADE6BDE6CDE6DDE6EDE6FDE70'.             
400000     03  PIC X(16) VALUE X'DE71DE72DE73DE74DE75DE76DE77DE78'.             
400100     03  PIC X(16) VALUE X'DE79DE7ADE7BDE7CDE7DDE7EDE7FDE81'.             
400200     03  PIC X(16) VALUE X'DE82DE83DE84DE85DE86DE87DE88DE89'.             
400300     03  PIC X(16) VALUE X'DE8ADE8BDE8CDE8DDE8EDE8FDE90DE91'.             
400400     03  PIC X(16) VALUE X'DE92DE93DE94DE95DE96DE97DE98DE99'.             
400500     03  PIC X(16) VALUE X'DE9ADE9BDE9CDE9DDE9EDE9FDEA0DEA1'.             
400600     03  PIC X(16) VALUE X'DEA2DEA3DEA4DEA5DEA6DEA7DEA8DEA9'.             
400700     03  PIC X(16) VALUE X'DEAADEABDEACDEADDEAEDEAFDEB0DEB1'.             
400800*    -- TAB2-IND = 121 (X'79')                                            
400900     03  PIC X(16) VALUE X'DEB2DEB3DEB4DEB5DEB6DEB7DEB8DEB9'.             
401000     03  PIC X(16) VALUE X'DEBADEBBDEBCDEBDDEBEDEBFDEC0DEC1'.             
401100     03  PIC X(16) VALUE X'DEC2DEC3DEC4DEC5DEC6DEC7DEC8DEC9'.             
401200     03  PIC X(16) VALUE X'DECADECBDECCDECDDECEDECFDED0DED1'.             
401300     03  PIC X(16) VALUE X'DED2DED3DED4DED5DED6DED7DED8DED9'.             
401400     03  PIC X(16) VALUE X'DEDADEDBDEDCDEDDDEDEDEDFDEE0DEE1'.             
401500     03  PIC X(16) VALUE X'DEE2DEE3DEE4DEE5DEE6DEE7DEE8DEE9'.             
401600     03  PIC X(16) VALUE X'DEEADEEBDEECDEEDDEEEDEEFDEF0DEF1'.             
401700     03  PIC X(16) VALUE X'DEF2DEF3DEF4DEF5DEF6DEF7DEF8DEF9'.             
401800     03  PIC X(16) VALUE X'DEFADEFBDEFCDEFDDF41DF42DF43DF44'.             
401900     03  PIC X(16) VALUE X'DF45DF46DF47DF48DF49DF4ADF4BDF4C'.             
402000     03  PIC X(16) VALUE X'DF4DDF4EDF4FDF50DF51DF52DF53DF54'.             
402100     03  PIC X(16) VALUE X'DF55DF56DF57DF58DF59DF5ADF5BDF5C'.             
402200     03  PIC X(16) VALUE X'DF5DDF5EDF5FDF60DF61DF62DF63DF64'.             
402300     03  PIC X(16) VALUE X'DF65DF66DF67DF68DF69DF6ADF6BDF6C'.             
402400     03  PIC X(16) VALUE X'DF6DDF6EDF6FDF70DF71DF72DF73DF74'.             
402500     03  PIC X(16) VALUE X'DF75DF76DF77DF78DF79DF7ADF7BDF7C'.             
402600     03  PIC X(16) VALUE X'DF7DDF7EDF7FDF81DF82DF83DF84DF85'.             
402700     03  PIC X(16) VALUE X'DF86DF87DF88DF89DF8ADF8BDF8CDF8D'.             
402800     03  PIC X(16) VALUE X'DF8EDF8FDF90DF91DF92DF93DF94DF95'.             
402900     03  PIC X(16) VALUE X'DF96DF97DF98DF99DF9ADF9BDF9CDF9D'.             
403000     03  PIC X(16) VALUE X'DF9EDF9FDFA0DFA1DFA2DFA3DFA4DFA5'.             
403100     03  PIC X(16) VALUE X'DFA6DFA7DFA8DFA9DFAADFABDFACDFAD'.             
403200     03  PIC X(16) VALUE X'DFAEDFAFDFB0DFB1DFB2DFB3DFB4DFB5'.             
403300     03  PIC X(16) VALUE X'DFB6DFB7DFB8DFB9DFBADFBBDFBCDFBD'.             
403400     03  PIC X(16) VALUE X'DFBEDFBFDFC0DFC1DFC2DFC3DFC4DFC5'.             
403500     03  PIC X(16) VALUE X'DFC6DFC7DFC8DFC9DFCADFCBDFCCDFCD'.             
403600     03  PIC X(16) VALUE X'DFCEDFCFDFD0DFD1DFD2DFD3DFD4DFD5'.             
403700     03  PIC X(16) VALUE X'DFD6DFD7DFD8DFD9DFDADFDBDFDCDFDD'.             
403800     03  PIC X(16) VALUE X'DFDEDFDFDFE0DFE1DFE2DFE3DFE4DFE5'.             
403900     03  PIC X(16) VALUE X'DFE6DFE7DFE8DFE9DFEADFEBDFECDFED'.             
404000     03  PIC X(16) VALUE X'DFEEDFEFDFF0DFF1DFF2DFF3DFF4DFF5'.             
404100*    -- TAB2-IND = 122 (X'7A')                                            
404200     03  PIC X(16) VALUE X'DFF6DFF7DFF8DFF9DFFADFFBDFFCDFFD'.             
404300     03  PIC X(16) VALUE X'E041E042E043E044E045E046E047E048'.             
404400     03  PIC X(16) VALUE X'E049E04AE04BE04CE04DE04EE04FE050'.             
404500     03  PIC X(16) VALUE X'E051E052E053E054E055E056E057E058'.             
404600     03  PIC X(16) VALUE X'E059E05AE05BE05CE05DE05EE05FE060'.             
404700     03  PIC X(16) VALUE X'E061E062E063E064E065E066E067E068'.             
404800     03  PIC X(16) VALUE X'E069E06AE06BE06CE06DE06EE06FE070'.             
404900     03  PIC X(16) VALUE X'E071E072E073E074E075E076E077E078'.             
405000     03  PIC X(16) VALUE X'E079E07AE07BE07CE07DE07EE07FE081'.             
405100     03  PIC X(16) VALUE X'E082E083E084E085E086E087E088E089'.             
405200     03  PIC X(16) VALUE X'E08AE08BE08CE08DE08EE08FE090E091'.             
405300     03  PIC X(16) VALUE X'E092E093E094E095E096E097E098E099'.             
405400     03  PIC X(16) VALUE X'E09AE09BE09CE09DE09EE09FE0A0E0A1'.             
405500     03  PIC X(16) VALUE X'E0A2E0A3E0A4E0A5E0A6E0A7E0A8E0A9'.             
405600     03  PIC X(16) VALUE X'E0AAE0ABE0ACE0ADE0AEE0AFE0B0E0B1'.             
405700     03  PIC X(16) VALUE X'E0B2E0B3E0B4E0B5E0B6E0B7E0B8E0B9'.             
405800     03  PIC X(16) VALUE X'E0BAE0BBE0BCE0BDE0BEE0BFE0C0E0C1'.             
405900     03  PIC X(16) VALUE X'E0C2E0C3E0C4E0C5E0C6E0C7E0C8E0C9'.             
406000     03  PIC X(16) VALUE X'E0CAE0CBE0CCE0CDE0CEE0CFE0D0E0D1'.             
406100     03  PIC X(16) VALUE X'E0D2E0D3E0D4E0D5E0D6E0D7E0D8E0D9'.             
406200     03  PIC X(16) VALUE X'E0DAE0DBE0DCE0DDE0DEE0DFE0E0E0E1'.             
406300     03  PIC X(16) VALUE X'E0E2E0E3E0E4E0E5E0E6E0E7E0E8E0E9'.             
406400     03  PIC X(16) VALUE X'E0EAE0EBE0ECE0EDE0EEE0EFE0F0E0F1'.             
406500     03  PIC X(16) VALUE X'E0F2E0F3E0F4E0F5E0F6E0F7E0F8E0F9'.             
406600     03  PIC X(16) VALUE X'E0FAE0FBE0FCE0FDE141E142E143E144'.             
406700     03  PIC X(16) VALUE X'E145E146E147E148E149E14AE14BE14C'.             
406800     03  PIC X(16) VALUE X'E14DE14EE14FE150E151E152E153E154'.             
406900     03  PIC X(16) VALUE X'E155E156E157E158E159E15AE15BE15C'.             
407000     03  PIC X(16) VALUE X'E15DE15EE15FE160E161E162E163E164'.             
407100     03  PIC X(16) VALUE X'E165E166E167E168E169E16AE16BE16C'.             
407200     03  PIC X(16) VALUE X'E16DE16EE16FE170E171E172E173E174'.             
407300     03  PIC X(16) VALUE X'E175E176E177E178E179E17AE17BE17C'.             
407400*    -- TAB2-IND = 123 (X'7B')                                            
407500     03  PIC X(16) VALUE X'E17DE17EE17FE181E182E183E184E185'.             
407600     03  PIC X(16) VALUE X'E186E187E188E189E18AE18BE18CE18D'.             
407700     03  PIC X(16) VALUE X'E18EE18FE190E191E192E193E194E195'.             
407800     03  PIC X(16) VALUE X'E196E197E198E199E19AE19BE19CE19D'.             
407900     03  PIC X(16) VALUE X'E19EE19FE1A0E1A1E1A2E1A3E1A4E1A5'.             
408000     03  PIC X(16) VALUE X'E1A6E1A7E1A8E1A9E1AAE1ABE1ACE1AD'.             
408100     03  PIC X(16) VALUE X'E1AEE1AFE1B0E1B1E1B2E1B3E1B4E1B5'.             
408200     03  PIC X(16) VALUE X'E1B6E1B7E1B8E1B9E1BAE1BBE1BCE1BD'.             
408300     03  PIC X(16) VALUE X'E1BEE1BFE1C0E1C1E1C2E1C3E1C4E1C5'.             
408400     03  PIC X(16) VALUE X'E1C6E1C7E1C8E1C9E1CAE1CBE1CCE1CD'.             
408500     03  PIC X(16) VALUE X'E1CEE1CFE1D0E1D1E1D2E1D3E1D4E1D5'.             
408600     03  PIC X(16) VALUE X'E1D6E1D7E1D8E1D9E1DAE1DBE1DCE1DD'.             
408700     03  PIC X(16) VALUE X'E1DEE1DFE1E0E1E1E1E2E1E3E1E4E1E5'.             
408800     03  PIC X(16) VALUE X'E1E6E1E7E1E8E1E9E1EAE1EBE1ECE1ED'.             
408900     03  PIC X(16) VALUE X'E1EEE1EFE1F0E1F1E1F2E1F3E1F4E1F5'.             
409000     03  PIC X(16) VALUE X'E1F6E1F7E1F8E1F9E1FAE1FBE1FCE1FD'.             
409100     03  PIC X(16) VALUE X'E241E242E243E244E245E246E247E248'.             
409200     03  PIC X(16) VALUE X'E249E24AE24BE24CE24DE24EE24FE250'.             
409300     03  PIC X(16) VALUE X'E251E252E253E254E255E256E257E258'.             
409400     03  PIC X(16) VALUE X'E259E25AE25BE25CE25DE25EE25FE260'.             
409500     03  PIC X(16) VALUE X'E261E262E263E264E265E266E267E268'.             
409600     03  PIC X(16) VALUE X'E269E26AE26BE26CE26DE26EE26FE270'.             
409700     03  PIC X(16) VALUE X'E271E272E273E274E275E276E277E278'.             
409800     03  PIC X(16) VALUE X'E279E27AE27BE27CE27DE27EE27FE281'.             
409900     03  PIC X(16) VALUE X'E282E283E284E285E286E287E288E289'.             
410000     03  PIC X(16) VALUE X'E28AE28BE28CE28DE28EE28FE290E291'.             
410100     03  PIC X(16) VALUE X'E292E293E294E295E296E297E298E299'.             
410200     03  PIC X(16) VALUE X'E29AE29BE29CE29DE29EE29FE2A0E2A1'.             
410300     03  PIC X(16) VALUE X'E2A2E2A3E2A4E2A5E2A6E2A7E2A8E2A9'.             
410400     03  PIC X(16) VALUE X'E2AAE2ABE2ACE2ADE2AEE2AFE2B0E2B1'.             
410500     03  PIC X(16) VALUE X'E2B2E2B3E2B4E2B5E2B6E2B7E2B8E2B9'.             
410600     03  PIC X(16) VALUE X'E2BAE2BBE2BCE2BDE2BEE2BFE2C0E2C1'.             
410700*    -- TAB2-IND = 124 (X'7C')                                            
410800     03  PIC X(16) VALUE X'E2C2E2C3E2C4E2C5E2C6E2C7E2C8E2C9'.             
410900     03  PIC X(16) VALUE X'E2CAE2CBE2CCE2CDE2CEE2CFE2D0E2D1'.             
411000     03  PIC X(16) VALUE X'E2D2E2D3E2D4E2D5E2D6E2D7E2D8E2D9'.             
411100     03  PIC X(16) VALUE X'E2DAE2DBE2DCE2DDE2DEE2DFE2E0E2E1'.             
411200     03  PIC X(16) VALUE X'E2E2E2E3E2E4E2E5E2E6E2E7E2E8E2E9'.             
411300     03  PIC X(16) VALUE X'E2EAE2EBE2ECE2EDE2EEE2EFE2F0E2F1'.             
411400     03  PIC X(16) VALUE X'E2F2E2F3E2F4E2F5E2F6E2F7E2F8E2F9'.             
411500     03  PIC X(16) VALUE X'E2FAE2FBE2FCE2FDFEFEFEFE445C46A8'.             
411600     03  PIC X(16) VALUE X'46A946AA46ABFEFEFEFEFEFEFEFEFEFE'.             
411700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
411800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
411900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
412900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
413900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414000*    -- TAB2-IND = 125 (X'7D')                                            
414100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFE694B7AA4FEFEFEFE'.             
414300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
414900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
415900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
416900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417300*    -- TAB2-IND = 126 (X'7E')                                            
417400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
417900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
418000     03  PIC X(16) VALUE X'474146A7474946B646BC46AC46AD46AE'.             
418100     03  PIC X(16) VALUE X'46AF46B046B146A446A546B246B346B4'.             
418200     03  PIC X(16) VALUE X'46B546A046A146A246A3FEFEFEFEFEFE'.             
418300     03  PIC X(16) VALUE X'FEFE46BE46BF46C246C346C046C146BD'.             
418400     03  PIC X(16) VALUE X'474247434744FEFE4745474647474748'.             
418500     03  PIC X(16) VALUE X'474A474B474C474D474E474F47504753'.             
418600     03  PIC X(16) VALUE X'475446C447554756475747584759FEFE'.             
418700     03  PIC X(16) VALUE X'475A475B475C475DFEFEFEFEFEFEFEFE'.             
418800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
418900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
419900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
420600*    -- TAB2-IND = 127 (X'7F')                                            
420700     03  PIC X(16) VALUE X'FEFE425A427F427B42E0426C4250427D'.             
420800     03  PIC X(16) VALUE X'424D425D46B8424E426B4260424B4261'.             
420900     03  PIC X(16) VALUE X'42F042F142F242F342F442F542F642F7'.             
421000     03  PIC X(16) VALUE X'42F842F9427A425E424C427E426E426F'.             
421100     03  PIC X(16) VALUE X'427C42C142C242C342C442C542C642C7'.             
421200     03  PIC X(16) VALUE X'42C842C942D142D242D342D442D542D6'.             
421300     03  PIC X(16) VALUE X'42D742D842D942E242E342E442E542E6'.             
421400     03  PIC X(16) VALUE X'42E742E842E9444443E044454470426D'.             
421500     03  PIC X(16) VALUE X'FEFE4281428242834284428542864287'.             
421600     03  PIC X(16) VALUE X'42884289429142924293429442954296'.             
421700     03  PIC X(16) VALUE X'42974298429942A242A342A442A542A6'.             
421800     03  PIC X(16) VALUE X'42A742A842A942C0424F42D0FEFEFEFE'.             
421900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422500     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
422900     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423000     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423100     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423200     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423300     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423400     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423500     03  PIC X(16) VALUE X'434A424A425F4751426A425BFEFEFEFE'.             
423600     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423700     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423800     03  PIC X(16) VALUE X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE'.             
423900 01  FILLER  REDEFINES TAB2-UCS-TO-CP835.                                 
424000     03  FILLER                    OCCURS 127.                            
424100       05  UCS-TO-CP835-X          OCCURS 256.                            
424200         07  UCS-TO-CP835  PIC S9(4) COMP.                                
