000400     EJECT                                                                
000410*    ------ JAPANESE SINGLE BYTE CODE (KATAKANA) ----------               
000500*    -- CREATED BY REXX UNITAB.                                           
000600*    -- CONV FROM CCS-ID 290 (HEX 0122) TO UNICODE UCS-2                  
000700*    -- DATA FROM D:/MBTABS/UCSTAB/012234B0.U1D                           
000800*    -- SBCS -> DBCS TABLE. ELEMENT N POINTS TO UCS VALUE                 
000900*    -- (HEXADECIMAL) FOR BYTE VALUE N-1.                                 
001000*    -- INVALID VALUES -> 001A (SUB)                                      
001100 01  TAB-CP290-TO-UCS.                                                    
001200     03  PIC X(16) VALUE X'0000000100020003009C00090086007F'.             
001300     03  PIC X(16) VALUE X'0097008D008E000B000C000D000E000F'.             
001400     03  PIC X(16) VALUE X'0010001100120013009D008500080087'.             
001500     03  PIC X(16) VALUE X'001800190092008F001C001D001E001F'.             
001600     03  PIC X(16) VALUE X'00800081008200830084000A0017001B'.             
001700     03  PIC X(16) VALUE X'00880089008A008B008C000500060007'.             
001800     03  PIC X(16) VALUE X'00900091001600930094009500960004'.             
001900     03  PIC X(16) VALUE X'00980099009A009B00140015009E001A'.             
002000     03  PIC X(16) VALUE X'0020FF61FF62FF63FF64FF65FF66FF67'.             
002100     03  PIC X(16) VALUE X'FF68FF6900A3002E003C0028002B007C'.             
002200     03  PIC X(16) VALUE X'0026FF6AFF6BFF6CFF6DFF6EFF6F001A'.             
002300     03  PIC X(16) VALUE X'FF70001A002100A5002A0029003B00AC'.             
002400     03  PIC X(16) VALUE X'002D002F006100620063006400650066'.             
002500     03  PIC X(16) VALUE X'00670068001A002C0025005F003E003F'.             
002600     03  PIC X(16) VALUE X'005B0069006A006B006C006D006E006F'.             
002700     03  PIC X(16) VALUE X'00700060003A002300400027003D0022'.             
002800     03  PIC X(16) VALUE X'005DFF71FF72FF73FF74FF75FF76FF77'.             
002900     03  PIC X(16) VALUE X'FF78FF79FF7A0071FF7BFF7CFF7DFF7E'.             
003000     03  PIC X(16) VALUE X'FF7FFF80FF81FF82FF83FF84FF85FF86'.             
003100     03  PIC X(16) VALUE X'FF87FF88FF890072001AFF8AFF8BFF8C'.             
003200     03  PIC X(16) VALUE X'007E203EFF8DFF8EFF8FFF90FF91FF92'.             
003300     03  PIC X(16) VALUE X'FF93FF94FF950073FF96FF97FF98FF99'.             
003400     03  PIC X(16) VALUE X'005E00A2005C00740075007600770078'.             
003500     03  PIC X(16) VALUE X'0079007AFF9AFF9BFF9CFF9DFF9EFF9F'.             
003600     03  PIC X(16) VALUE X'007B0041004200430044004500460047'.             
003700     03  PIC X(16) VALUE X'00480049001A001A001A001A001A001A'.             
003800     03  PIC X(16) VALUE X'007D004A004B004C004D004E004F0050'.             
003900     03  PIC X(16) VALUE X'00510052001A001A001A001A001A001A'.             
004000     03  PIC X(16) VALUE X'0024001A005300540055005600570058'.             
004100     03  PIC X(16) VALUE X'0059005A001A001A001A001A001A001A'.             
004200     03  PIC X(16) VALUE X'00300031003200330034003500360037'.             
004300     03  PIC X(16) VALUE X'00380039001A001A001A001A001A009F'.             
004400 01  FILLER  REDEFINES TAB-CP290-TO-UCS.                                  
004500     03  CP290-TO-UCS-X     OCCURS 256.                                   
004600       05  CP290-TO-UCS     PIC S9(4) COMP.                               
