001000*** EDIT ALLOWED                                                          
010000*                            *************************************        
010100*                            *** ANVÄNDS FÖR ATT SKILJA                   
010200*                            *** RADIO-RENOVERINGS-OBJEKT                 
020004*                            *** FRÅN ÖVRIGA RENOVERINGS-OBJEKT           
020005*                            ***                                          
031004*                            *** INNEHÅLLER ENDAST OBJEKT                 
040000*                            *************************************        
050004 01  BYT20-IDARTNR           PIC 9(9)    COMP-3.                          
060000*                                                                         
070006       88  BYT20-BYTES       VALUE  5007000 THRU 5009999                  
080006                                    8117000 THRU 8119999                  
081008                                    8257000 THRU 8259999                  
090006                                    8607000 THRU 8609999                  
100007                                    9037000 THRU 9037999                  
100008                                   31246000 THRU 31249999                 
100009                                   36006000 THRU 36009999                 
100009                                   36016000 THRU 36019999                 
100009                                   36026000 THRU 36029999                 
100009                                   36056000 THRU 36059999                 
                                         36087000 THRU 36089999.                
060000*                                                                         
110004       88  BYT20-RADIO       VALUE  8104000 THRU 8104999                  
111004                                    9954000 THRU 9954999                  
111005                                   36101000 THRU 36101999.                
120005*** END COPY WWBYT20                                                      
