000100*** EDIT ALLOWED                                                          
000200*                            *************************************        
000300*                            *** ANVÄNDS VID TEST AV:                     
000400*                            ***  - MOTTAGANDE DC OCH SÄNDANDE            
000500*                            ***    DC FÖR ATT SÖKA FRAM DISTRIKT         
000600*                            ***                                          
000700*                            ***  - TABELL 2                              
000800*                            ***    DISTRIKT FÖR ATT SÖKA FRAM            
000900*                            ***    MOTTAGANDE OCH SÄNDANDE DC            
001000*                            ***                                          
001100*                            ***    ANVÄND SEARCH ALL FÖR ATT             
001200*                            ***    SÖKA I TABELLEN.                      
001300*                            *************************************        
001400*                                                                         
001500*   TABELL FÖR ATT SÖKA REFILL OCH TRANSFER DISTRIKT.                     
001600*                                                                         
001700 01  WWDC03-TABELL-VALUES.                                                
001800     03  FILLER             PIC X(9) VALUE '111A08700'.                   
001900     03  FILLER             PIC X(9) VALUE '111B08701'.                   
002000     03  FILLER             PIC X(9) VALUE '111C08702'.                   
003000     03  FILLER             PIC X(9) VALUE '111D08703'.                   
004000     03  FILLER             PIC X(9) VALUE '111E08704'.                   
005000     03  FILLER             PIC X(9) VALUE '111F08705'.                   
006000     03  FILLER             PIC X(9) VALUE '111G08706'.                   
007000     03  FILLER             PIC X(9) VALUE '111K08720'.                   
008000     03  FILLER             PIC X(9) VALUE '112C08802'.                   
009000     03  FILLER             PIC X(9) VALUE '112H08807'.                   
010000     03  FILLER             PIC X(9) VALUE '112I08808'.                   
020000     03  FILLER             PIC X(9) VALUE '112J08809'.                   
030000     03  FILLER             PIC X(9) VALUE '112L08811'.                   
040000     03  FILLER             PIC X(9) VALUE '112M08812'.                   
050000     03  FILLER             PIC X(9) VALUE '112N08813'.                   
051000     03  FILLER             PIC X(9) VALUE '112O08814'.                   
052000     03  FILLER             PIC X(9) VALUE '112108032'.                   
053000     03  FILLER             PIC X(9) VALUE '112408062'.                   
054000     03  FILLER             PIC X(9) VALUE '112508072'.                   
055000     03  FILLER             PIC X(9) VALUE '112608082'.                   
056000     03  FILLER             PIC X(9) VALUE '113A08092'.                   
057000     03  FILLER             PIC X(9) VALUE '113B08851'.                   
058000     03  FILLER             PIC X(9) VALUE '113C08852'.                   
059000     03  FILLER             PIC X(9) VALUE '113D08853'.                   
059100     03  FILLER             PIC X(9) VALUE '113E08854'.                   
059200     03  FILLER             PIC X(9) VALUE '113F08855'.                   
059300     03  FILLER             PIC X(9) VALUE '113G08856'.                   
059400     03  FILLER             PIC X(9) VALUE '113H08857'.                   
059500     03  FILLER             PIC X(9) VALUE '113J08859'.                   
059600     03  FILLER             PIC X(9) VALUE '113K08860'.                   
059700     03  FILLER             PIC X(9) VALUE '113L08861'.                   
059800     03  FILLER             PIC X(9) VALUE '113M08862'.                   
059900     03  FILLER             PIC X(9) VALUE '113N08863'.                   
060000     03  FILLER             PIC X(9) VALUE '113O08864'.                   
060100     03  FILLER             PIC X(9) VALUE '113P08865'.                   
060200     03  FILLER             PIC X(9) VALUE '113R08866'.                   
060300     03  FILLER             PIC X(9) VALUE '113S08867'.                   
060400     03  FILLER             PIC X(9) VALUE '113T08868'.                   
060500     03  FILLER             PIC X(9) VALUE '114108141'.                   
060600     03  FILLER             PIC X(9) VALUE '114308143'.                   
060700     03  FILLER             PIC X(9) VALUE '114408144'.                   
060800     03  FILLER             PIC X(9) VALUE '114508145'.                   
060900     03  FILLER             PIC X(9) VALUE '114608146'.                   
061000     03  FILLER             PIC X(9) VALUE '114708147'.                   
061100     03  FILLER             PIC X(9) VALUE '115108151'.                   
061200     03  FILLER             PIC X(9) VALUE '115208152'.                   
061300     03  FILLER             PIC X(9) VALUE '115308153'.                   
061400     03  FILLER             PIC X(9) VALUE '116A08500'.                   
061500     03  FILLER             PIC X(9) VALUE '116108161'.                   
061600     03  FILLER             PIC X(9) VALUE '116208162'.                   
061700     03  FILLER             PIC X(9) VALUE '116308163'.                   
061800     03  FILLER             PIC X(9) VALUE '116408164'.                   
061900     03  FILLER             PIC X(9) VALUE '116508165'.                   
062000     03  FILLER             PIC X(9) VALUE '116608166'.                   
062100     03  FILLER             PIC X(9) VALUE '116708167'.                   
062200     03  FILLER             PIC X(9) VALUE '117A08900'.                   
062300     03  FILLER             PIC X(9) VALUE '117B08901'.                   
062400     03  FILLER             PIC X(9) VALUE '117C08902'.                   
062500     03  FILLER             PIC X(9) VALUE '117D08903'.                   
062600     03  FILLER             PIC X(9) VALUE '117E08904'.                   
062700     03  FILLER             PIC X(9) VALUE '117F08905'.                   
062800     03  FILLER             PIC X(9) VALUE '117G08906'.                   
062900     03  FILLER             PIC X(9) VALUE '117H08907'.                   
063000     03  FILLER             PIC X(9) VALUE '117108171'.                   
063100     03  FILLER             PIC X(9) VALUE '117208172'.                   
063200     03  FILLER             PIC X(9) VALUE '117308173'.                   
063300     03  FILLER             PIC X(9) VALUE '117408174'.                   
063400     03  FILLER             PIC X(9) VALUE '118108181'.                   
063500     03  FILLER             PIC X(9) VALUE '118208182'.                   
063600     03  FILLER             PIC X(9) VALUE '118508185'.                   
063700     03  FILLER             PIC X(9) VALUE '118608186'.                   
063800     03  FILLER             PIC X(9) VALUE '118708187'.                   
063904     03  FILLER             PIC X(9) VALUE '119308193'.                   
064004     03  FILLER             PIC X(9) VALUE '411109211'.                   
064104     03  FILLER             PIC X(9) VALUE '414308333'.                   
064204     03  FILLER             PIC X(9) VALUE '414308343'.                   
064304     03  FILLER             PIC X(9) VALUE '414408334'.                   
064404     03  FILLER             PIC X(9) VALUE '414408344'.                   
064504     03  FILLER             PIC X(9) VALUE '414508335'.                   
064604     03  FILLER             PIC X(9) VALUE '414608336'.                   
064704     03  FILLER             PIC X(9) VALUE '414708337'.                   
064804     03  FILLER             PIC X(9) VALUE '415108330'.                   
064904     03  FILLER             PIC X(9) VALUE '415108751'.                   
065004     03  FILLER             PIC X(9) VALUE '416109261'.                   
065104     03  FILLER             PIC X(9) VALUE '416209262'.                   
065204     03  FILLER             PIC X(9) VALUE '416309263'.                   
065304     03  FILLER             PIC X(9) VALUE '416409264'.                   
065404     03  FILLER             PIC X(9) VALUE '416509265'.                   
065504     03  FILLER             PIC X(9) VALUE '416609266'.                   
065604     03  FILLER             PIC X(9) VALUE '416709267'.                   
065704     03  FILLER             PIC X(9) VALUE '417109271'.                   
065804     03  FILLER             PIC X(9) VALUE '417209272'.                   
065904     03  FILLER             PIC X(9) VALUE '417309273'.                   
066004     03  FILLER             PIC X(9) VALUE '417409274'.                   
066104     03  FILLER             PIC X(9) VALUE '418109281'.                   
066204     03  FILLER             PIC X(9) VALUE '418209282'.                   
066304     03  FILLER             PIC X(9) VALUE '418309283'.                   
066404     03  FILLER             PIC X(9) VALUE '418409284'.                   
066504     03  FILLER             PIC X(9) VALUE '418509285'.                   
066604     03  FILLER             PIC X(9) VALUE '418609286'.                   
066704     03  FILLER             PIC X(9) VALUE '418709287'.                   
066804     03  FILLER             PIC X(9) VALUE '431109211'.                   
066904     03  FILLER             PIC X(9) VALUE '434108331'.                   
067004     03  FILLER             PIC X(9) VALUE '434108341'.                   
067104     03  FILLER             PIC X(9) VALUE '434408334'.                   
067204     03  FILLER             PIC X(9) VALUE '434408344'.                   
067304     03  FILLER             PIC X(9) VALUE '434508335'.                   
067404     03  FILLER             PIC X(9) VALUE '434608336'.                   
067504     03  FILLER             PIC X(9) VALUE '434708337'.                   
067604     03  FILLER             PIC X(9) VALUE '435108330'.                   
067704     03  FILLER             PIC X(9) VALUE '435108751'.                   
067804     03  FILLER             PIC X(9) VALUE '436109261'.                   
067904     03  FILLER             PIC X(9) VALUE '436209262'.                   
068004     03  FILLER             PIC X(9) VALUE '436309263'.                   
068104     03  FILLER             PIC X(9) VALUE '436409264'.                   
068204     03  FILLER             PIC X(9) VALUE '436509265'.                   
068304     03  FILLER             PIC X(9) VALUE '436609266'.                   
068404     03  FILLER             PIC X(9) VALUE '436709267'.                   
068504     03  FILLER             PIC X(9) VALUE '437109271'.                   
068604     03  FILLER             PIC X(9) VALUE '437209272'.                   
068704     03  FILLER             PIC X(9) VALUE '437309273'.                   
068804     03  FILLER             PIC X(9) VALUE '437409274'.                   
068904     03  FILLER             PIC X(9) VALUE '438109281'.                   
069004     03  FILLER             PIC X(9) VALUE '438209282'.                   
069104     03  FILLER             PIC X(9) VALUE '438309283'.                   
069204     03  FILLER             PIC X(9) VALUE '438409284'.                   
069304     03  FILLER             PIC X(9) VALUE '438509285'.                   
069404     03  FILLER             PIC X(9) VALUE '438609286'.                   
069504     03  FILLER             PIC X(9) VALUE '438709287'.                   
069604     03  FILLER             PIC X(9) VALUE '441109211'.                   
069704     03  FILLER             PIC X(9) VALUE '444108331'.                   
069804     03  FILLER             PIC X(9) VALUE '444308333'.                   
069904     03  FILLER             PIC X(9) VALUE '444508335'.                   
070004     03  FILLER             PIC X(9) VALUE '444608336'.                   
070104     03  FILLER             PIC X(9) VALUE '444708337'.                   
070204     03  FILLER             PIC X(9) VALUE '445108330'.                   
070304     03  FILLER             PIC X(9) VALUE '446109261'.                   
070404     03  FILLER             PIC X(9) VALUE '446209262'.                   
070504     03  FILLER             PIC X(9) VALUE '446309263'.                   
070604     03  FILLER             PIC X(9) VALUE '446409264'.                   
070704     03  FILLER             PIC X(9) VALUE '446509265'.                   
070804     03  FILLER             PIC X(9) VALUE '446609266'.                   
070904     03  FILLER             PIC X(9) VALUE '446709267'.                   
071004     03  FILLER             PIC X(9) VALUE '447109271'.                   
071104     03  FILLER             PIC X(9) VALUE '447209272'.                   
071204     03  FILLER             PIC X(9) VALUE '447309273'.                   
071304     03  FILLER             PIC X(9) VALUE '447409274'.                   
071404     03  FILLER             PIC X(9) VALUE '448109281'.                   
071504     03  FILLER             PIC X(9) VALUE '448209282'.                   
071604     03  FILLER             PIC X(9) VALUE '448309283'.                   
071704     03  FILLER             PIC X(9) VALUE '448409284'.                   
071804     03  FILLER             PIC X(9) VALUE '448509285'.                   
071904     03  FILLER             PIC X(9) VALUE '448609286'.                   
072004     03  FILLER             PIC X(9) VALUE '448709287'.                   
072104     03  FILLER             PIC X(9) VALUE '451109211'.                   
072204     03  FILLER             PIC X(9) VALUE '454108331'.                   
072304     03  FILLER             PIC X(9) VALUE '454308333'.                   
072404     03  FILLER             PIC X(9) VALUE '454408334'.                   
072504     03  FILLER             PIC X(9) VALUE '454608336'.                   
072604     03  FILLER             PIC X(9) VALUE '454708337'.                   
072704     03  FILLER             PIC X(9) VALUE '455108330'.                   
072804     03  FILLER             PIC X(9) VALUE '456109261'.                   
072904     03  FILLER             PIC X(9) VALUE '456209262'.                   
073004     03  FILLER             PIC X(9) VALUE '456309263'.                   
073104     03  FILLER             PIC X(9) VALUE '456409264'.                   
073204     03  FILLER             PIC X(9) VALUE '456509265'.                   
073304     03  FILLER             PIC X(9) VALUE '456609266'.                   
073404     03  FILLER             PIC X(9) VALUE '456709267'.                   
073504     03  FILLER             PIC X(9) VALUE '457109271'.                   
073604     03  FILLER             PIC X(9) VALUE '457209272'.                   
073704     03  FILLER             PIC X(9) VALUE '457309273'.                   
073804     03  FILLER             PIC X(9) VALUE '457409274'.                   
073904     03  FILLER             PIC X(9) VALUE '458109281'.                   
074004     03  FILLER             PIC X(9) VALUE '458209282'.                   
074104     03  FILLER             PIC X(9) VALUE '458309283'.                   
074204     03  FILLER             PIC X(9) VALUE '458409284'.                   
074304     03  FILLER             PIC X(9) VALUE '458509285'.                   
074404     03  FILLER             PIC X(9) VALUE '458609286'.                   
074504     03  FILLER             PIC X(9) VALUE '458709287'.                   
074604     03  FILLER             PIC X(9) VALUE '461109211'.                   
074704     03  FILLER             PIC X(9) VALUE '464108331'.                   
074804     03  FILLER             PIC X(9) VALUE '464308333'.                   
074904     03  FILLER             PIC X(9) VALUE '464408334'.                   
075004     03  FILLER             PIC X(9) VALUE '464508335'.                   
075104     03  FILLER             PIC X(9) VALUE '464708337'.                   
075204     03  FILLER             PIC X(9) VALUE '465108330'.                   
075304     03  FILLER             PIC X(9) VALUE '466109261'.                   
075404     03  FILLER             PIC X(9) VALUE '466209262'.                   
075504     03  FILLER             PIC X(9) VALUE '466309263'.                   
075604     03  FILLER             PIC X(9) VALUE '466409264'.                   
075704     03  FILLER             PIC X(9) VALUE '466509265'.                   
075804     03  FILLER             PIC X(9) VALUE '466609266'.                   
075904     03  FILLER             PIC X(9) VALUE '466709267'.                   
076004     03  FILLER             PIC X(9) VALUE '467109271'.                   
076104     03  FILLER             PIC X(9) VALUE '467209272'.                   
076204     03  FILLER             PIC X(9) VALUE '467309273'.                   
076304     03  FILLER             PIC X(9) VALUE '467409274'.                   
076404     03  FILLER             PIC X(9) VALUE '468109281'.                   
076504     03  FILLER             PIC X(9) VALUE '468209282'.                   
076604     03  FILLER             PIC X(9) VALUE '468309283'.                   
076704     03  FILLER             PIC X(9) VALUE '468409284'.                   
076804     03  FILLER             PIC X(9) VALUE '468509285'.                   
076904     03  FILLER             PIC X(9) VALUE '468609286'.                   
077004     03  FILLER             PIC X(9) VALUE '468709287'.                   
077104     03  FILLER             PIC X(9) VALUE '471109211'.                   
077204     03  FILLER             PIC X(9) VALUE '474108331'.                   
077304     03  FILLER             PIC X(9) VALUE '474308333'.                   
077404     03  FILLER             PIC X(9) VALUE '474408334'.                   
077504     03  FILLER             PIC X(9) VALUE '474508335'.                   
077604     03  FILLER             PIC X(9) VALUE '474608336'.                   
077704     03  FILLER             PIC X(9) VALUE '475108330'.                   
077804     03  FILLER             PIC X(9) VALUE '476109261'.                   
077904     03  FILLER             PIC X(9) VALUE '476209262'.                   
078004     03  FILLER             PIC X(9) VALUE '476309263'.                   
078104     03  FILLER             PIC X(9) VALUE '476409264'.                   
078204     03  FILLER             PIC X(9) VALUE '476509265'.                   
078304     03  FILLER             PIC X(9) VALUE '476609266'.                   
078404     03  FILLER             PIC X(9) VALUE '476709267'.                   
078504     03  FILLER             PIC X(9) VALUE '477109271'.                   
078604     03  FILLER             PIC X(9) VALUE '477209272'.                   
078704     03  FILLER             PIC X(9) VALUE '477309273'.                   
078804     03  FILLER             PIC X(9) VALUE '477409274'.                   
078904     03  FILLER             PIC X(9) VALUE '478109281'.                   
079004     03  FILLER             PIC X(9) VALUE '478209282'.                   
079104     03  FILLER             PIC X(9) VALUE '478309283'.                   
079204     03  FILLER             PIC X(9) VALUE '478409284'.                   
079304     03  FILLER             PIC X(9) VALUE '478509285'.                   
079404     03  FILLER             PIC X(9) VALUE '478609286'.                   
079504     03  FILLER             PIC X(9) VALUE '478709287'.                   
079604     03  FILLER             PIC X(9) VALUE '514108731'.                   
079704     03  FILLER             PIC X(9) VALUE '514108741'.                   
079804     03  FILLER             PIC X(9) VALUE '514308733'.                   
079904     03  FILLER             PIC X(9) VALUE '514308743'.                   
080004     03  FILLER             PIC X(9) VALUE '514408734'.                   
080104     03  FILLER             PIC X(9) VALUE '514408744'.                   
080204     03  FILLER             PIC X(9) VALUE '514508735'.                   
080304     03  FILLER             PIC X(9) VALUE '514608736'.                   
080404     03  FILLER             PIC X(9) VALUE '514708737'.                   
080504     03  FILLER             PIC X(9) VALUE '616A08263'.                   
080604     03  FILLER             PIC X(9) VALUE '616208362'.                   
080704     03  FILLER             PIC X(9) VALUE '616509465'.                   
080804     03  FILLER             PIC X(9) VALUE '616608666'.                   
080904     03  FILLER             PIC X(9) VALUE '616709467'.                   
081004     03  FILLER             PIC X(9) VALUE '617109471'.                   
081104     03  FILLER             PIC X(9) VALUE '626108361'.                   
081204     03  FILLER             PIC X(9) VALUE '626608666'.                   
081400     03  FILLER             PIC X(9) VALUE '636109361'.                   
081401     03  FILLER             PIC X(9) VALUE '636209362'.                   
081410     03  FILLER             PIC X(9) VALUE '636408564'.                   
081420     03  FILLER             PIC X(9) VALUE '636409364'.                   
081430     03  FILLER             PIC X(9) VALUE '636509365'.                   
081500     03  FILLER             PIC X(9) VALUE '636608566'.                   
081600     03  FILLER             PIC X(9) VALUE '636609366'.                   
081700     03  FILLER             PIC X(9) VALUE '636709367'.                   
082004     03  FILLER             PIC X(9) VALUE '646308563'.                   
082104     03  FILLER             PIC X(9) VALUE '646608566'.                   
082404     03  FILLER             PIC X(9) VALUE '666108661'.                   
082504     03  FILLER             PIC X(9) VALUE '666208662'.                   
082604     03  FILLER             PIC X(9) VALUE '666308563'.                   
082704     03  FILLER             PIC X(9) VALUE '666408564'.                   
082804     03  FILLER             PIC X(9) VALUE '711109111'.                   
082904     03  FILLER             PIC X(9) VALUE '714109141'.                   
083004     03  FILLER             PIC X(9) VALUE '714309143'.                   
083104     03  FILLER             PIC X(9) VALUE '714409144'.                   
083204     03  FILLER             PIC X(9) VALUE '714509145'.                   
083304     03  FILLER             PIC X(9) VALUE '714609146'.                   
083404     03  FILLER             PIC X(9) VALUE '714709147'.                   
083405     03  FILLER             PIC X(9) VALUE '715309153'.                   
083504     03  FILLER             PIC X(9) VALUE '716109161'.                   
083604     03  FILLER             PIC X(9) VALUE '716209162'.                   
083704     03  FILLER             PIC X(9) VALUE '716309163'.                   
083804     03  FILLER             PIC X(9) VALUE '716409164'.                   
083904     03  FILLER             PIC X(9) VALUE '716509165'.                   
084004     03  FILLER             PIC X(9) VALUE '716609166'.                   
084104     03  FILLER             PIC X(9) VALUE '716709167'.                   
084204     03  FILLER             PIC X(9) VALUE '717208572'.                   
084304     03  FILLER             PIC X(9) VALUE '717308573'.                   
084404     03  FILLER             PIC X(9) VALUE '717408574'.                   
084504     03  FILLER             PIC X(9) VALUE '718109181'.                   
084604     03  FILLER             PIC X(9) VALUE '718209182'.                   
084704     03  FILLER             PIC X(9) VALUE '718309183'.                   
084804     03  FILLER             PIC X(9) VALUE '718409184'.                   
084904     03  FILLER             PIC X(9) VALUE '718509185'.                   
085004     03  FILLER             PIC X(9) VALUE '718609186'.                   
085104     03  FILLER             PIC X(9) VALUE '718709187'.                   
085204     03  FILLER             PIC X(9) VALUE '719309193'.                   
085304     03  FILLER             PIC X(9) VALUE '721109111'.                   
085404     03  FILLER             PIC X(9) VALUE '724109141'.                   
085504     03  FILLER             PIC X(9) VALUE '724309143'.                   
085604     03  FILLER             PIC X(9) VALUE '724409144'.                   
085704     03  FILLER             PIC X(9) VALUE '724509145'.                   
085804     03  FILLER             PIC X(9) VALUE '724609146'.                   
085904     03  FILLER             PIC X(9) VALUE '724709147'.                   
085905     03  FILLER             PIC X(9) VALUE '725309153'.                   
086004     03  FILLER             PIC X(9) VALUE '726109161'.                   
086104     03  FILLER             PIC X(9) VALUE '726209162'.                   
086204     03  FILLER             PIC X(9) VALUE '726309163'.                   
086304     03  FILLER             PIC X(9) VALUE '726409164'.                   
086404     03  FILLER             PIC X(9) VALUE '726509165'.                   
086504     03  FILLER             PIC X(9) VALUE '726609166'.                   
086604     03  FILLER             PIC X(9) VALUE '726709167'.                   
086704     03  FILLER             PIC X(9) VALUE '727108571'.                   
086804     03  FILLER             PIC X(9) VALUE '727308573'.                   
086904     03  FILLER             PIC X(9) VALUE '727408574'.                   
087004     03  FILLER             PIC X(9) VALUE '728109181'.                   
087104     03  FILLER             PIC X(9) VALUE '728209182'.                   
087204     03  FILLER             PIC X(9) VALUE '728309183'.                   
087304     03  FILLER             PIC X(9) VALUE '728409184'.                   
087404     03  FILLER             PIC X(9) VALUE '728509185'.                   
087504     03  FILLER             PIC X(9) VALUE '728609186'.                   
087604     03  FILLER             PIC X(9) VALUE '728709187'.                   
087704     03  FILLER             PIC X(9) VALUE '737108571'.                   
087804     03  FILLER             PIC X(9) VALUE '737208572'.                   
087904     03  FILLER             PIC X(9) VALUE '737408574'.                   
088004     03  FILLER             PIC X(9) VALUE '747108571'.                   
088104     03  FILLER             PIC X(9) VALUE '747208572'.                   
088204     03  FILLER             PIC X(9) VALUE '747308573'.                   
088504*                                                                         
088505* IF THE OCCURS MODIFIED PLEASE UPDATE MAX-IX-DC IN W5013300              
088506*                                                                         
088507*                                                                         
088508*                                                                         
088604 01  WWDC03-TAB REDEFINES WWDC03-TABELL-VALUES.                           
088705     03  WWDC03-IDDISTR OCCURS 317 TIMES                                  
088804                      ASCENDING KEY IS WWDC03-IDDC-SEND-REC               
088904                      INDEXED BY WWDC03-IX.                               
089004       05  WWDC03-IDDC-SEND-REC.                                          
089104           07  WWDC03-IDDC-SEND    PIC X(2).                              
089204           07  WWDC03-IDDC-REC     PIC X(2).                              
089304       05  WWDC03-SOK-IDDISTR      PIC 9(5).                              
089404*                                                                         
089504*                                                                         
089604*   TABELL FÖR ATT SÖKA MOTTAGANDE OCH SÄNDANDE DC                        
089704*                                                                         
089804 01  WWDC03-TABELL2-VALUES.                                               
089904     03  FILLER             PIC X(9) VALUE '080321121'.                   
090000     03  FILLER             PIC X(9) VALUE '080621124'.                   
100000     03  FILLER             PIC X(9) VALUE '080721125'.                   
110000     03  FILLER             PIC X(9) VALUE '080821126'.                   
120000     03  FILLER             PIC X(9) VALUE '08092113A'.                   
130000     03  FILLER             PIC X(9) VALUE '081411141'.                   
140000     03  FILLER             PIC X(9) VALUE '081431143'.                   
150000     03  FILLER             PIC X(9) VALUE '081441144'.                   
160000     03  FILLER             PIC X(9) VALUE '081451145'.                   
170000     03  FILLER             PIC X(9) VALUE '081461146'.                   
171000     03  FILLER             PIC X(9) VALUE '081471147'.                   
180000     03  FILLER             PIC X(9) VALUE '081511151'.                   
190000     03  FILLER             PIC X(9) VALUE '081521152'.                   
200000     03  FILLER             PIC X(9) VALUE '081531153'.                   
210000     03  FILLER             PIC X(9) VALUE '081611161'.                   
220000     03  FILLER             PIC X(9) VALUE '081621162'.                   
230000     03  FILLER             PIC X(9) VALUE '081631163'.                   
240000     03  FILLER             PIC X(9) VALUE '081641164'.                   
250000     03  FILLER             PIC X(9) VALUE '081651165'.                   
260000     03  FILLER             PIC X(9) VALUE '081661166'.                   
270000     03  FILLER             PIC X(9) VALUE '081671167'.                   
280000     03  FILLER             PIC X(9) VALUE '081711171'.                   
290000     03  FILLER             PIC X(9) VALUE '081721172'.                   
300000     03  FILLER             PIC X(9) VALUE '081731173'.                   
310000     03  FILLER             PIC X(9) VALUE '081741174'.                   
320000     03  FILLER             PIC X(9) VALUE '081811181'.                   
321000     03  FILLER             PIC X(9) VALUE '081851185'.                   
322000     03  FILLER             PIC X(9) VALUE '081861186'.                   
323000     03  FILLER             PIC X(9) VALUE '081871187'.                   
323104     03  FILLER             PIC X(9) VALUE '081931193'.                   
324000     03  FILLER             PIC X(9) VALUE '08263616A'.                   
325000     03  FILLER             PIC X(9) VALUE '082717271'.                   
326000     03  FILLER             PIC X(9) VALUE '082717371'.                   
327000     03  FILLER             PIC X(9) VALUE '082717471'.                   
328000     03  FILLER             PIC X(9) VALUE '082727172'.                   
329000     03  FILLER             PIC X(9) VALUE '082727372'.                   
329100     03  FILLER             PIC X(9) VALUE '082727472'.                   
329200     03  FILLER             PIC X(9) VALUE '082737173'.                   
329300     03  FILLER             PIC X(9) VALUE '082737273'.                   
329400     03  FILLER             PIC X(9) VALUE '082737473'.                   
329500     03  FILLER             PIC X(9) VALUE '082747174'.                   
329600     03  FILLER             PIC X(9) VALUE '082747274'.                   
329700     03  FILLER             PIC X(9) VALUE '082747374'.                   
329804     03  FILLER             PIC X(9) VALUE '082936393'.                   
329904     03  FILLER             PIC X(9) VALUE '083304151'.                   
330004     03  FILLER             PIC X(9) VALUE '083304351'.                   
330104     03  FILLER             PIC X(9) VALUE '083304451'.                   
330204     03  FILLER             PIC X(9) VALUE '083304551'.                   
330304     03  FILLER             PIC X(9) VALUE '083304651'.                   
330404     03  FILLER             PIC X(9) VALUE '083304751'.                   
330504     03  FILLER             PIC X(9) VALUE '083314341'.                   
330604     03  FILLER             PIC X(9) VALUE '083314441'.                   
330704     03  FILLER             PIC X(9) VALUE '083314541'.                   
330804     03  FILLER             PIC X(9) VALUE '083314641'.                   
330904     03  FILLER             PIC X(9) VALUE '083314741'.                   
331004     03  FILLER             PIC X(9) VALUE '083334143'.                   
331104     03  FILLER             PIC X(9) VALUE '083334443'.                   
331204     03  FILLER             PIC X(9) VALUE '083334543'.                   
331304     03  FILLER             PIC X(9) VALUE '083334643'.                   
331404     03  FILLER             PIC X(9) VALUE '083334743'.                   
331504     03  FILLER             PIC X(9) VALUE '083344144'.                   
331604     03  FILLER             PIC X(9) VALUE '083344344'.                   
331704     03  FILLER             PIC X(9) VALUE '083344544'.                   
331804     03  FILLER             PIC X(9) VALUE '083344644'.                   
331904     03  FILLER             PIC X(9) VALUE '083344744'.                   
332004     03  FILLER             PIC X(9) VALUE '083354145'.                   
332104     03  FILLER             PIC X(9) VALUE '083354345'.                   
332204     03  FILLER             PIC X(9) VALUE '083354445'.                   
332304     03  FILLER             PIC X(9) VALUE '083354645'.                   
332404     03  FILLER             PIC X(9) VALUE '083354745'.                   
332504     03  FILLER             PIC X(9) VALUE '083364146'.                   
332604     03  FILLER             PIC X(9) VALUE '083364346'.                   
332704     03  FILLER             PIC X(9) VALUE '083364446'.                   
332804     03  FILLER             PIC X(9) VALUE '083364546'.                   
332904     03  FILLER             PIC X(9) VALUE '083364746'.                   
333004     03  FILLER             PIC X(9) VALUE '083374147'.                   
333104     03  FILLER             PIC X(9) VALUE '083374347'.                   
333204     03  FILLER             PIC X(9) VALUE '083374447'.                   
333304     03  FILLER             PIC X(9) VALUE '083374547'.                   
333404     03  FILLER             PIC X(9) VALUE '083374647'.                   
333504     03  FILLER             PIC X(9) VALUE '083414341'.                   
333604     03  FILLER             PIC X(9) VALUE '083414441'.                   
333704     03  FILLER             PIC X(9) VALUE '083434143'.                   
333804     03  FILLER             PIC X(9) VALUE '083434443'.                   
333904     03  FILLER             PIC X(9) VALUE '083616261'.                   
334004     03  FILLER             PIC X(9) VALUE '083626162'.                   
334104     03  FILLER             PIC X(9) VALUE '08500116A'.                   
334204     03  FILLER             PIC X(9) VALUE '085636463'.                   
334304     03  FILLER             PIC X(9) VALUE '085636663'.                   
334404     03  FILLER             PIC X(9) VALUE '085646364'.                   
334504     03  FILLER             PIC X(9) VALUE '085646664'.                   
334604     03  FILLER             PIC X(9) VALUE '085666366'.                   
334704     03  FILLER             PIC X(9) VALUE '085666466'.                   
334804     03  FILLER             PIC X(9) VALUE '085717271'.                   
334904     03  FILLER             PIC X(9) VALUE '085717371'.                   
335004     03  FILLER             PIC X(9) VALUE '085717471'.                   
335104     03  FILLER             PIC X(9) VALUE '085727172'.                   
335204     03  FILLER             PIC X(9) VALUE '085727372'.                   
335304     03  FILLER             PIC X(9) VALUE '085727472'.                   
335404     03  FILLER             PIC X(9) VALUE '085737173'.                   
335504     03  FILLER             PIC X(9) VALUE '085737273'.                   
335604     03  FILLER             PIC X(9) VALUE '085737473'.                   
335704     03  FILLER             PIC X(9) VALUE '085747174'.                   
335804     03  FILLER             PIC X(9) VALUE '085747274'.                   
335904     03  FILLER             PIC X(9) VALUE '085747374'.                   
336004     03  FILLER             PIC X(9) VALUE '086616661'.                   
336104     03  FILLER             PIC X(9) VALUE '086626662'.                   
336204     03  FILLER             PIC X(9) VALUE '086666166'.                   
336304     03  FILLER             PIC X(9) VALUE '086666266'.                   
336404     03  FILLER             PIC X(9) VALUE '08700111A'.                   
336504     03  FILLER             PIC X(9) VALUE '08701111B'.                   
336604     03  FILLER             PIC X(9) VALUE '08702111C'.                   
336704     03  FILLER             PIC X(9) VALUE '08703111D'.                   
336804     03  FILLER             PIC X(9) VALUE '08704111E'.                   
336904     03  FILLER             PIC X(9) VALUE '08705111F'.                   
337004     03  FILLER             PIC X(9) VALUE '08706111G'.                   
337104     03  FILLER             PIC X(9) VALUE '08720111K'.                   
337204     03  FILLER             PIC X(9) VALUE '087315141'.                   
337304     03  FILLER             PIC X(9) VALUE '087335143'.                   
337404     03  FILLER             PIC X(9) VALUE '087345144'.                   
337504     03  FILLER             PIC X(9) VALUE '087355145'.                   
337604     03  FILLER             PIC X(9) VALUE '087365146'.                   
337704     03  FILLER             PIC X(9) VALUE '087375147'.                   
337804     03  FILLER             PIC X(9) VALUE '087415141'.                   
337904     03  FILLER             PIC X(9) VALUE '087435143'.                   
338004     03  FILLER             PIC X(9) VALUE '087445144'.                   
338104     03  FILLER             PIC X(9) VALUE '087514151'.                   
338204     03  FILLER             PIC X(9) VALUE '087514351'.                   
338304     03  FILLER             PIC X(9) VALUE '087514451'.                   
338404     03  FILLER             PIC X(9) VALUE '08802112C'.                   
338504     03  FILLER             PIC X(9) VALUE '08807112H'.                   
338604     03  FILLER             PIC X(9) VALUE '08808112I'.                   
338704     03  FILLER             PIC X(9) VALUE '08809112J'.                   
338804     03  FILLER             PIC X(9) VALUE '08811112L'.                   
338904     03  FILLER             PIC X(9) VALUE '08812112M'.                   
339004     03  FILLER             PIC X(9) VALUE '08813112N'.                   
339104     03  FILLER             PIC X(9) VALUE '08814112O'.                   
339204     03  FILLER             PIC X(9) VALUE '08851113B'.                   
339304     03  FILLER             PIC X(9) VALUE '08852113C'.                   
339404     03  FILLER             PIC X(9) VALUE '08853113D'.                   
339504     03  FILLER             PIC X(9) VALUE '08854113E'.                   
339604     03  FILLER             PIC X(9) VALUE '08855113F'.                   
339704     03  FILLER             PIC X(9) VALUE '08856113G'.                   
339804     03  FILLER             PIC X(9) VALUE '08857113H'.                   
339904     03  FILLER             PIC X(9) VALUE '08859113J'.                   
340004     03  FILLER             PIC X(9) VALUE '08860113K'.                   
340104     03  FILLER             PIC X(9) VALUE '08861113L'.                   
340204     03  FILLER             PIC X(9) VALUE '08862113M'.                   
340304     03  FILLER             PIC X(9) VALUE '08863113N'.                   
340404     03  FILLER             PIC X(9) VALUE '08864113O'.                   
340504     03  FILLER             PIC X(9) VALUE '08865113P'.                   
340604     03  FILLER             PIC X(9) VALUE '08866113R'.                   
340704     03  FILLER             PIC X(9) VALUE '08867113S'.                   
340804     03  FILLER             PIC X(9) VALUE '08868113T'.                   
340904     03  FILLER             PIC X(9) VALUE '08900117A'.                   
341004     03  FILLER             PIC X(9) VALUE '08901117B'.                   
341104     03  FILLER             PIC X(9) VALUE '08902117C'.                   
341204     03  FILLER             PIC X(9) VALUE '08903117D'.                   
341304     03  FILLER             PIC X(9) VALUE '08904117E'.                   
341404     03  FILLER             PIC X(9) VALUE '08905117F'.                   
341504     03  FILLER             PIC X(9) VALUE '08906117G'.                   
341604     03  FILLER             PIC X(9) VALUE '08907117H'.                   
341704     03  FILLER             PIC X(9) VALUE '08950717A'.                   
341804     03  FILLER             PIC X(9) VALUE '08950727A'.                   
341904     03  FILLER             PIC X(9) VALUE '08950737A'.                   
342004     03  FILLER             PIC X(9) VALUE '08950747A'.                   
342104     03  FILLER             PIC X(9) VALUE '08951717B'.                   
342204     03  FILLER             PIC X(9) VALUE '08951727B'.                   
342304     03  FILLER             PIC X(9) VALUE '08951737B'.                   
342404     03  FILLER             PIC X(9) VALUE '08951747B'.                   
342504     03  FILLER             PIC X(9) VALUE '08952717C'.                   
342604     03  FILLER             PIC X(9) VALUE '08952727C'.                   
342704     03  FILLER             PIC X(9) VALUE '08952737C'.                   
342804     03  FILLER             PIC X(9) VALUE '08952747C'.                   
342904     03  FILLER             PIC X(9) VALUE '08953717D'.                   
343004     03  FILLER             PIC X(9) VALUE '08953727D'.                   
343104     03  FILLER             PIC X(9) VALUE '08953737D'.                   
343204     03  FILLER             PIC X(9) VALUE '08953747D'.                   
343304     03  FILLER             PIC X(9) VALUE '08954717E'.                   
343404     03  FILLER             PIC X(9) VALUE '08954727E'.                   
343504     03  FILLER             PIC X(9) VALUE '08954737E'.                   
343604     03  FILLER             PIC X(9) VALUE '08954747E'.                   
343704     03  FILLER             PIC X(9) VALUE '08955717F'.                   
343804     03  FILLER             PIC X(9) VALUE '08955727F'.                   
343904     03  FILLER             PIC X(9) VALUE '08955737F'.                   
344004     03  FILLER             PIC X(9) VALUE '08955747F'.                   
344104     03  FILLER             PIC X(9) VALUE '08956717G'.                   
344204     03  FILLER             PIC X(9) VALUE '08956727G'.                   
344304     03  FILLER             PIC X(9) VALUE '08956737G'.                   
344404     03  FILLER             PIC X(9) VALUE '08956747G'.                   
344504     03  FILLER             PIC X(9) VALUE '08957717H'.                   
344604     03  FILLER             PIC X(9) VALUE '08957727H'.                   
344704     03  FILLER             PIC X(9) VALUE '08957737H'.                   
344804     03  FILLER             PIC X(9) VALUE '08957747H'.                   
344904     03  FILLER             PIC X(9) VALUE '091117111'.                   
345004     03  FILLER             PIC X(9) VALUE '091117211'.                   
345104     03  FILLER             PIC X(9) VALUE '091417141'.                   
345204     03  FILLER             PIC X(9) VALUE '091417241'.                   
345304     03  FILLER             PIC X(9) VALUE '091437143'.                   
345404     03  FILLER             PIC X(9) VALUE '091437243'.                   
345504     03  FILLER             PIC X(9) VALUE '091447144'.                   
345604     03  FILLER             PIC X(9) VALUE '091447244'.                   
345704     03  FILLER             PIC X(9) VALUE '091457145'.                   
345804     03  FILLER             PIC X(9) VALUE '091457245'.                   
345904     03  FILLER             PIC X(9) VALUE '091467146'.                   
346004     03  FILLER             PIC X(9) VALUE '091467246'.                   
346104     03  FILLER             PIC X(9) VALUE '091477147'.                   
346204     03  FILLER             PIC X(9) VALUE '091477247'.                   
346205     03  FILLER             PIC X(9) VALUE '091537153'.                   
346206     03  FILLER             PIC X(9) VALUE '091537253'.                   
346304     03  FILLER             PIC X(9) VALUE '091617161'.                   
346404     03  FILLER             PIC X(9) VALUE '091617261'.                   
346504     03  FILLER             PIC X(9) VALUE '091627162'.                   
346604     03  FILLER             PIC X(9) VALUE '091627262'.                   
346704     03  FILLER             PIC X(9) VALUE '091637163'.                   
346804     03  FILLER             PIC X(9) VALUE '091637263'.                   
346904     03  FILLER             PIC X(9) VALUE '091647164'.                   
347004     03  FILLER             PIC X(9) VALUE '091647264'.                   
347104     03  FILLER             PIC X(9) VALUE '091657165'.                   
347204     03  FILLER             PIC X(9) VALUE '091657265'.                   
347304     03  FILLER             PIC X(9) VALUE '091667166'.                   
347404     03  FILLER             PIC X(9) VALUE '091667266'.                   
347504     03  FILLER             PIC X(9) VALUE '091677167'.                   
347604     03  FILLER             PIC X(9) VALUE '091677267'.                   
347704     03  FILLER             PIC X(9) VALUE '091817181'.                   
347804     03  FILLER             PIC X(9) VALUE '091827182'.                   
347904     03  FILLER             PIC X(9) VALUE '091837183'.                   
348004     03  FILLER             PIC X(9) VALUE '091847184'.                   
348104     03  FILLER             PIC X(9) VALUE '091857185'.                   
348204     03  FILLER             PIC X(9) VALUE '091867186'.                   
348304     03  FILLER             PIC X(9) VALUE '091877187'.                   
348404     03  FILLER             PIC X(9) VALUE '091937193'.                   
348504     03  FILLER             PIC X(9) VALUE '092114111'.                   
348604     03  FILLER             PIC X(9) VALUE '092114311'.                   
348704     03  FILLER             PIC X(9) VALUE '092114411'.                   
348804     03  FILLER             PIC X(9) VALUE '092114511'.                   
348904     03  FILLER             PIC X(9) VALUE '092114611'.                   
349004     03  FILLER             PIC X(9) VALUE '092114711'.                   
349104     03  FILLER             PIC X(9) VALUE '092614161'.                   
349204     03  FILLER             PIC X(9) VALUE '092614361'.                   
349304     03  FILLER             PIC X(9) VALUE '092614461'.                   
349404     03  FILLER             PIC X(9) VALUE '092614561'.                   
349504     03  FILLER             PIC X(9) VALUE '092614661'.                   
349604     03  FILLER             PIC X(9) VALUE '092614761'.                   
349704     03  FILLER             PIC X(9) VALUE '092624162'.                   
349804     03  FILLER             PIC X(9) VALUE '092624362'.                   
349904     03  FILLER             PIC X(9) VALUE '092624462'.                   
350004     03  FILLER             PIC X(9) VALUE '092624562'.                   
350104     03  FILLER             PIC X(9) VALUE '092624662'.                   
350204     03  FILLER             PIC X(9) VALUE '092624762'.                   
350304     03  FILLER             PIC X(9) VALUE '092634163'.                   
350404     03  FILLER             PIC X(9) VALUE '092634363'.                   
350504     03  FILLER             PIC X(9) VALUE '092634463'.                   
350604     03  FILLER             PIC X(9) VALUE '092634563'.                   
350704     03  FILLER             PIC X(9) VALUE '092634663'.                   
350804     03  FILLER             PIC X(9) VALUE '092634763'.                   
350904     03  FILLER             PIC X(9) VALUE '092644164'.                   
351004     03  FILLER             PIC X(9) VALUE '092644364'.                   
351104     03  FILLER             PIC X(9) VALUE '092644464'.                   
351204     03  FILLER             PIC X(9) VALUE '092644564'.                   
351304     03  FILLER             PIC X(9) VALUE '092644664'.                   
351404     03  FILLER             PIC X(9) VALUE '092644764'.                   
351504     03  FILLER             PIC X(9) VALUE '092654165'.                   
351604     03  FILLER             PIC X(9) VALUE '092654365'.                   
351704     03  FILLER             PIC X(9) VALUE '092654465'.                   
351804     03  FILLER             PIC X(9) VALUE '092654565'.                   
351904     03  FILLER             PIC X(9) VALUE '092654665'.                   
352004     03  FILLER             PIC X(9) VALUE '092654765'.                   
352104     03  FILLER             PIC X(9) VALUE '092664166'.                   
352204     03  FILLER             PIC X(9) VALUE '092664366'.                   
352304     03  FILLER             PIC X(9) VALUE '092664466'.                   
352404     03  FILLER             PIC X(9) VALUE '092664566'.                   
352504     03  FILLER             PIC X(9) VALUE '092664666'.                   
352604     03  FILLER             PIC X(9) VALUE '092664766'.                   
352704     03  FILLER             PIC X(9) VALUE '092674167'.                   
352804     03  FILLER             PIC X(9) VALUE '092674367'.                   
352904     03  FILLER             PIC X(9) VALUE '092674467'.                   
353004     03  FILLER             PIC X(9) VALUE '092674567'.                   
353104     03  FILLER             PIC X(9) VALUE '092674667'.                   
353204     03  FILLER             PIC X(9) VALUE '092674767'.                   
353304     03  FILLER             PIC X(9) VALUE '092714171'.                   
353404     03  FILLER             PIC X(9) VALUE '092714371'.                   
353504     03  FILLER             PIC X(9) VALUE '092714471'.                   
353604     03  FILLER             PIC X(9) VALUE '092714571'.                   
353704     03  FILLER             PIC X(9) VALUE '092714671'.                   
353804     03  FILLER             PIC X(9) VALUE '092714771'.                   
353904     03  FILLER             PIC X(9) VALUE '092724172'.                   
354004     03  FILLER             PIC X(9) VALUE '092724372'.                   
354104     03  FILLER             PIC X(9) VALUE '092724472'.                   
354204     03  FILLER             PIC X(9) VALUE '092724572'.                   
354304     03  FILLER             PIC X(9) VALUE '092724672'.                   
354404     03  FILLER             PIC X(9) VALUE '092724772'.                   
354504     03  FILLER             PIC X(9) VALUE '092734173'.                   
354604     03  FILLER             PIC X(9) VALUE '092734373'.                   
354704     03  FILLER             PIC X(9) VALUE '092734473'.                   
354804     03  FILLER             PIC X(9) VALUE '092734573'.                   
354904     03  FILLER             PIC X(9) VALUE '092734673'.                   
355004     03  FILLER             PIC X(9) VALUE '092734773'.                   
355104     03  FILLER             PIC X(9) VALUE '092744174'.                   
355204     03  FILLER             PIC X(9) VALUE '092744374'.                   
355304     03  FILLER             PIC X(9) VALUE '092744474'.                   
355404     03  FILLER             PIC X(9) VALUE '092744574'.                   
355504     03  FILLER             PIC X(9) VALUE '092744674'.                   
355604     03  FILLER             PIC X(9) VALUE '092744774'.                   
355704     03  FILLER             PIC X(9) VALUE '092814181'.                   
355804     03  FILLER             PIC X(9) VALUE '092814381'.                   
355904     03  FILLER             PIC X(9) VALUE '092814481'.                   
356004     03  FILLER             PIC X(9) VALUE '092814581'.                   
356104     03  FILLER             PIC X(9) VALUE '092814681'.                   
356204     03  FILLER             PIC X(9) VALUE '092814781'.                   
356304     03  FILLER             PIC X(9) VALUE '092824182'.                   
356404     03  FILLER             PIC X(9) VALUE '092824382'.                   
356504     03  FILLER             PIC X(9) VALUE '092824482'.                   
356604     03  FILLER             PIC X(9) VALUE '092824582'.                   
356704     03  FILLER             PIC X(9) VALUE '092824682'.                   
356804     03  FILLER             PIC X(9) VALUE '092824782'.                   
356904     03  FILLER             PIC X(9) VALUE '092834183'.                   
357004     03  FILLER             PIC X(9) VALUE '092834383'.                   
357104     03  FILLER             PIC X(9) VALUE '092834483'.                   
357204     03  FILLER             PIC X(9) VALUE '092834583'.                   
357304     03  FILLER             PIC X(9) VALUE '092834683'.                   
357404     03  FILLER             PIC X(9) VALUE '092834783'.                   
357504     03  FILLER             PIC X(9) VALUE '092844184'.                   
357604     03  FILLER             PIC X(9) VALUE '092844384'.                   
357704     03  FILLER             PIC X(9) VALUE '092844484'.                   
357804     03  FILLER             PIC X(9) VALUE '092844584'.                   
357904     03  FILLER             PIC X(9) VALUE '092844684'.                   
358004     03  FILLER             PIC X(9) VALUE '092844784'.                   
358104     03  FILLER             PIC X(9) VALUE '092854185'.                   
358204     03  FILLER             PIC X(9) VALUE '092854385'.                   
358304     03  FILLER             PIC X(9) VALUE '092854485'.                   
358404     03  FILLER             PIC X(9) VALUE '092854585'.                   
358504     03  FILLER             PIC X(9) VALUE '092854685'.                   
358604     03  FILLER             PIC X(9) VALUE '092854785'.                   
358704     03  FILLER             PIC X(9) VALUE '092864186'.                   
358804     03  FILLER             PIC X(9) VALUE '092864386'.                   
358904     03  FILLER             PIC X(9) VALUE '092864486'.                   
359004     03  FILLER             PIC X(9) VALUE '092864586'.                   
359104     03  FILLER             PIC X(9) VALUE '092864686'.                   
359204     03  FILLER             PIC X(9) VALUE '092864786'.                   
359304     03  FILLER             PIC X(9) VALUE '092874187'.                   
359404     03  FILLER             PIC X(9) VALUE '092874387'.                   
359504     03  FILLER             PIC X(9) VALUE '092874487'.                   
359604     03  FILLER             PIC X(9) VALUE '092874587'.                   
359704     03  FILLER             PIC X(9) VALUE '092874687'.                   
359804     03  FILLER             PIC X(9) VALUE '092874787'.                   
359904     03  FILLER             PIC X(9) VALUE '093616361'.                   
360004     03  FILLER             PIC X(9) VALUE '093626362'.                   
360005     03  FILLER             PIC X(9) VALUE '093646364'.                   
360006     03  FILLER             PIC X(9) VALUE '093656365'.                   
360106     03  FILLER             PIC X(9) VALUE '093666366'.                   
360206     03  FILLER             PIC X(9) VALUE '093676367'.                   
360304     03  FILLER             PIC X(9) VALUE '094656165'.                   
360404     03  FILLER             PIC X(9) VALUE '094676167'.                   
360504     03  FILLER             PIC X(9) VALUE '094716171'.                   
360700*                                                                         
360800 01  WWDC03-TAB2 REDEFINES WWDC03-TABELL2-VALUES.                         
360905     03  WWDC03-IDDC OCCURS 353 TIMES                                     
361000                    ASCENDING KEY IS WWDC03-SOK-IDDISTR-TAB2              
361100                    INDEXED BY WWDC03-IX2.                                
361200       05  WWDC03-SOK-IDDISTR-TAB2     PIC 9(5).                          
361300       05  WWDC03-SOK-IDDC.                                               
362000           07  WWDC03-SOK-IDDC-SEND    PIC X(2).                          
370000           07  WWDC03-SOK-IDDC-REC     PIC X(2).                          
