000010*** EDIT ALLOWED                                                          
000100*                            *************************************        
000200*                            *** ANVÄNDS VID TEST AV:                     
000300*                            ***    NDC DISTRIKT                          
000400*                            ***                                          
000500*                            ***    ANVÄNDS ENDAST I EPLUS.-              
000700*                            ***                                          
000800*                            *************************************        
000900*                                                                         
001000*   SE W.PROD.EPLUSCPY(WWDIST62)                                          
001100*                                                                         
