000010*** EDIT ALLOWED                                                          
000020*                            *************************************        
000030*                            *** ANVÄNDS FÖR ATT TA REDA PÅ VILKA         
000040*                            *** NDC-KUNDER SOM ÄR SKROTKUNDER            
000050*                            *************************************        
000051                                                                          
000052 01  KUND16-IDKUNDNR         PIC 9(7)    COMP-3.                          
000053*                                                                         
000054     88  KUND16-NDC-SKROT    VALUE 000041                                 
000055                                   000042                                 
000056                                   000043                                 
000057                                   000044                                 
000058                                   000045                                 
000059                                   000046                                 
000060                                   000047                                 
000061                                   000051.                                
000070                                                                          
000080*** END COPY WWKUND16    LENGTH=0                                         
