//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  ASSEMBLER H - VERSION 2      IEV90                                         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ASMH    PROC                                                                  
//*                                                                             
//ASM     EXEC PGM=IEV90,                                                       
//             PARM='OBJECT,NODECK,LINECOUNT(42),XREF(SHORT)'                   
//SYSLIB   DD  DSN=F1ST00.MACLIB,DISP=SHR                                       
//         DD  DSN=F1IMV1.PROD.MACLIB,DISP=SHR                                  
//         DD  DSN=SYS1.MACLIB,DISP=SHR                                         
//         DD  DSN=SYS1.AMODGEN,DISP=SHR                                        
//SYSUT1   DD  SPACE=(CYL,(8,8))                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSPUNCH DD  DUMMY                                                            
//SYSLIN   DD  DSN=&&OBJECT,DISP=(,PASS),DCB=BLKSIZE=3200,                      
//             SPACE=(CYL,(1,1))                                                
//SYSIN    DD  DSN=&&SYSLIN,DISP=(OLD,PASS)                                     
//*                                                                             
