//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  MONITOR STEP, GIVES SOURCE INFO AS COMMENT FIRST IN ASMBLER LIST           
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//        PROC SOURLIB='VDUMMY.SOURPDS',                                        
//             COPYLIB='VDUMMY.SOURPDS',                                        
//             CSYSLIB='VDUMMY.SOURPDS'                                         
//*                                                                             
//MON     EXEC PGM=V12356                                                       
//STEPLIB  DD  DSN=SYS2.F1TS00.LOAD,DISP=SHR                                    
//SOURCE   DD  DSN=&SOURLIB,DISP=SHR                                            
//COPY     DD  DSN=&COPYLIB,DISP=SHR                                            
//CSYSLIB  DD  DSN=&CSYSLIB,DISP=SHR                                            
//*                                                                             
//CSYSIN   DD  DSN=&&SYSLIN,DISP=(,PASS),                                       
//             SPACE=(80,(2000,250))                                            
