//********************************************************************          
//**           BESTÄLLNINGSKÖRNING                                              
//***          FIX-PROCEDURE                                                    
//***          UNDERHÅLLS AV STÖD       (RICHARD)                               
//***                                                                           
//********************************************************************          
//RDSFIX   PROC DSIN=DUMMY,DSOUT=DUMMY,                                         
//             INDABE=W.TEST,                                                   
//             STPLIB=W.PROD.LOAD                                               
//GO      EXEC PGM=DSFIX                                                        
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//ABNLTERM DD  DSN=&INDABE..AIDDUMP,DISP=SHR                                    
//IDIHIST  DD  DSN=&INDABE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IN       DD  DSN=&DSIN,DISP=SHR                                               
//UT       DD  DSN=&DSOUT,DISP=(NEW,CATLG,DELETE),                              
//**           DCB=(RECFM=&RECFM,LRECL=&LRECL,BLKSIZE=&BLKSIZE),                
//             MGMTCLAS=NOBACKUP,                                               
//             DATACLAS=PSEN                                                    
