//********************************************************************          
//*  COPYRIGHT   : 2010 VOLVO AB                                     *          
//*  NAME        : SORT001G                                          *          
//*  FUNCTION    : PREALLOCATION OF SORTING AREAS.                   *          
//*                6 X 300 CYLS (3380)                               *          
//*                MANAGES MORE THAN 800 MEGABYTES ?                 *          
//*  CLASS       : A                                                 *          
//*  RESPONSIBLE : VOLVO DATA DEPT 9532                              *          
//********************************************************************          
//ALLOK01G EXEC PGM=IEFBR14,REGION=8K                                           
//DD1      DD  DSN=&AREA1,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//DD2      DD  DSN=&AREA2,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//DD3      DD  DSN=&AREA3,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//DD4      DD  DSN=&AREA4,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//DD5      DD  DSN=&AREA5,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//DD6      DD  DSN=&AREA6,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
