//*********************************************************************         
//*          PREALLOCATION OF SORTING AREAS                           *         
//*       6 X 165 CYLS (3380)                                         *         
//*       MANAGES APPROXIMATELY 700 MEGABYTES                         *         
//*                                           RESPONSIBLE DEPT. 9231  *         
//*********************************************************************         
//ALLOK700 EXEC PGM=IEFBR14                                                     
//DD1      DD  DSN=&AREA1,DISP=(NEW,PASS),UNIT=WD,                     *        
//             SPACE=(CYL,220)                                                  
//DD2      DD  DSN=&AREA2,DISP=(NEW,PASS),UNIT=(WD,SEP=DD1),           *        
//             SPACE=(CYL,220)                                                  
//DD3      DD  DSN=&AREA3,DISP=(NEW,PASS),UNIT=(WD,SEP=(DD1,DD2)),     *        
//             SPACE=(CYL,220)                                                  
//DD4      DD  DSN=&AREA4,DISP=(NEW,PASS),                                      
//             UNIT=(WD,SEP=(DD1,DD2,DD3)),                            *        
//             SPACE=(CYL,165)                                                  
//DD5      DD  DSN=&AREA5,DISP=(NEW,PASS),                                      
//             UNIT=(WD,SEP=(DD1,DD2,DD3,DD4)),                        *        
//             SPACE=(CYL,165)                                                  
//DD6      DD  DSN=&AREA6,DISP=(NEW,PASS),                                      
//             UNIT=(WD,SEP=(DD1,DD2,DD3,DD4,DD5)),                    *        
//             SPACE=(CYL,165)                                                  
