//V168P002 PROC DSIN=                                                           
//*                                                                   *         
//*********************************************************************         
//*                                                                   *         
//*      SELECTION AND EDITED LISTING OF THE OUTPUT-FILE              *         
//*      FROM PROCEDURE V168P001                                      *         
//*                                                                   *         
//*      DON'T FORGET TO GIVE NAME OF INPUT FILE IN THE               *         
//*      SYMBOLIC PARAMETER 'DSIN'.                                   *         
//*                                                                   *         
//*      HOW TO DO SELECTION OF THE OUTPUTFILE  SEE :                 *         
//*         SYSTEM HANDBOOK  VOLVO-DATA                               *         
//*                                                                   *         
//*      UPDATED   77/12/30        CREATED  77/09/13                  *         
//*                                MAINTAINED BY DEPT. 2530           *         
//*      COPIED    94/01/21        THE PROCEDURE AND THE PROGRAM      *         
//*                                WAS COPIED FROM VD LIBRARIES       *         
//*                                BECAUSE THEY ARE NO LONGER         *         
//*                                MAINTAINED BY VOLVO DATA.          *         
//*********************************************************************         
//*                                                                   *         
//V16802  EXEC PGM=V16802                                                       
//STEPLIB  DD  DSN=W.PROD.LOAD,DISP=SHR                                         
//V16802D1 DD  DDNAME=SYSIN                                                     
//V16802D2 DD  DSN=&DSIN,DISP=SHR                                               
//V16802D3 DD  SYSOUT=*,DCB=(RECFM=VBA,LRECL=125,BLKSIZE=6200)                  
//SORTWK01 DD  UNIT=WD,SPACE=(CYL,(20),,CONTIG)                                 
//SORTWK02 DD  UNIT=WD,SPACE=(CYL,(20),,CONTIG)                                 
//SORTWK03 DD  UNIT=WD,SPACE=(CYL,(20),,CONTIG)                                 
//*******   *********************************                                   
//SORTMSG   DD  SYSOUT=*                                                        
//SYSOUT    DD  SYSOUT=*                                                        
//SYSUDUMP  DD  SYSOUT=*                                                        
//FULLDUMP  DD  DUMMY                                                           
