//V168P003 PROC DSOUT='F1STXX.V168.V16801(+1)',UNOUT=PP,VOLOUT=,SPACE=,         
//             PARMS=,PDS='SYS1.F1PUXX.PROCLIB'                                 
//*                                                                   *         
//*********************************************************************         
//*                                                                   *         
//*      THIS PROCEDURE IS USED TO CREATE A SUBSET OF PROCEDURES      *         
//*      FROM PROCEDURE-LIBRARY SYS3.F1PUV1.PROCLIB.                  *         
//*      THE OUTPUT-DATASET CONTAINS :                                *         
//*                                                                   *         
//*            PROCEDURE NAME  ---  8 CHAR.                           *         
//*            PROGRAM NAME   ----  8 CHAR.                           *         
//*            DDNAME  -----------  8 CHAR.                           *         
//*            DSNAME  ----------- 44 CHAR.                           *         
//*            DISP    -----------  3 CHAR.                           *         
//*            RECFM   -----------  3 CHAR.                           *         
//*            LRECL   -----------  5 CHAR. (NUM. RIGHT-JUST.)        *         
//*            BLKSIZE   ---------  5 CHAR. (NUM. RIGHT-JUST.)        *         
//*            UNIT   ------------  6 CHAR.                           *         
//*            VOLUME (SER OR REF) 20 CHAR.                           *         
//*            RETPD  ------------  4 CHAR. (NUM.RIGHT-JUST.)         *         
//*            SPACE  -----------  21 CHAR.                           *         
//*                                                                   *         
//*                                                                   *         
//*   E.G.     PARMS=Q123 GIVES AN OUTPUTFILE CONTAINING ONLY         *         
//*      Q123-PROCEDURES.                                             *         
//*                                                                   *         
//*   E.G.     PARMS=Q    GIVES AN OUTPUTFILE CONTAINING ALL          *         
//*         Q-PROCEDURES.                                             *         
//*                                                                   *         
//*      USE PROCEDURE V168P002 FOR SELECTION AND EDITED LISTING      *         
//*      OF THE OUTPUTFILE                                            *         
//*                                                                   *         
//*      CREATED   78/09/08        UPDATED    /  /                    *         
//*                                MAINTAINED BY DEPT. 2530     EK    *         
//*      COPIED    94/01/21        THE PROCEDURE AND THE PROGRAM      *         
//*                                WAS COPIED FROM VD LIBRARIES       *         
//*                                BECAUSE THEY ARE NO LONGER         *         
//*                                MAINTAINED BY VOLVO DATA.          *         
//*********************************************************************         
//*                                                                   *         
//V16801  EXEC PGM=V16801,PARM='&PARMS'                                         
//STEPLIB  DD  DSN=W.PROD.LOAD,DISP=SHR                                         
//SYSPRINT DD  DUMMY                                                            
//SYSUT1   DD  DSN=&PDS,DISP=SHR                                                
//V16801D1 DD  DSN=&DSOUT,DISP=(,CATLG,DELETE),                                 
//             SPACE=&SPACE,DCB=(MODEL,BLKSIZE=6210),                           
//             UNIT=&UNOUT,VOL=&VOLOUT                                          
//*      LRECL=135  ;  RECFM=FB                                                 
//SYSUDUMP DD  SYSOUT=*                                                         
//FULLDUMP DD  DUMMY                                                            
