//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  "GET" A MVS FILE FROM UNIX HFS                                             
//*                                                                             
//*  MODE = TEXT OR BINARY                                                      
//*                                                                             
//*  CONV = NO (NO CONVERSION) OR                                               
//*         BPXFX311 (CONVERT FROM ASCII/ISO8859-1)                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W001HFSC PROC MODE=TEXT,CONV=NO,                                              
//             DSOUT=NULLFILE,                                                  
//             RECFM=VB,LRECL=256,                                              
//             PATHIN=/DEV/NULL                                                 
//*                                                                             
//TSO     EXEC PGM=IKJEFT01,DYNAMNBR=20,                                        
// PARM='OCOPY INDD(INDD) OUTDD(OUTDD) &MODE CONVERT(&CONV) TO1047'             
//SYSHELP  DD  DUMMY                                                            
//SYSEXEC  DD  DSN=&W..ISPF.EXEC,DISP=SHR                                       
//         DD  DSN=&INDGRND..EXEC,DISP=SHR                                      
//SYSPROC  DD  DSN=&W..ISPF.CLIST,DISP=SHR                                      
//         DD  DSN=&INDGRND..CLIST,DISP=SHR                                     
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=*                         -- LE ABENDS                    
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSTSIN  DD  DUMMY                        -- NO TSO COMMANDS THIS WAY         
//SYSTSPRT DD  SYSOUT=*                     -- TSO MESSAGES                     
//SYSPRINT DD  SYSOUT=*,RECFM=FB,LRECL=132  -- REROUTED STDOUT OUTPUT           
//SYSERROR DD  SYSOUT=*,RECFM=FB,LRECL=132  -- REROUTED STDERR MESSAGES         
//*                                                                             
//INDD     DD  PATH='&PATHIN',PATHDISP=(KEEP,KEEP),                             
//             PATHOPTS=(ORDONLY),                                              
//             PATHMODE=(SIRWXU,SIRWXG,SIROTH,SIXOTH)   - 775                   
//OUTDD    DD  DSN=&DSOUT,DISP=(NEW,CATLG,DELETE),                              
//             RECFM=&RECFM,LRECL=&LRECL,                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND   EXEC PGM=ABEND,COND=(4,GE,TSO),PARM='1234567890123456'                
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
