//********************************************************************          
//***          BESTÄLLNINGSKÖRNING                                 ***          
//***          ETIKETTER SKRIVS UT MED DUBBEL BREDD OCH HÖJD       ***          
//***          UNDERHÅLLS AV STÖD 30500                            ***          
//***                                                              ***          
//********************************************************************          
//W009P001 PROC DSIN=DUMMY,DEST=DUMMY,                                          
//             STPLIB=&INDRTE..LOAD                                             
//W00901  EXEC PGM=W00901                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SYSPRINT DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=C,HOLD=YES                                                
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W00901D1 DD  DSN=&DSIN,DISP=OLD                                               
//W00901D2 DD  SYSOUT=A,DEST=&DEST                                              
