//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGAR                                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W100V1                                         
//*                                                                             
//*  RESTART:      W01103      NORMAL                                           
//*                          NORMAL                                             
//*                READS        WDD7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P003 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W011..&RTEGRP.                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01103   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01103,WDD7BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD7     INCLUDE MEMBER=WDD7                                                  
//W01103D1 DD  DSN=&&W01103,DISP=(NEW,PASS,DELETE),                             
//************ ERSÄTTNINGAR                                                     
//             DATACLAS=PSEN                                                    
//*                                                                             
//W01103D2 DD  DUMMY                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD03),DISP=SHR                         
//SORTIN   DD  DSN=&&W01103,DISP=(OLD,DELETE,DELETE)                            
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W01103(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ERSÄTTNINGAR                                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
