//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDK7 MED SB, SKRIVER SAMTLIGA ITEM FRÅN                              
//*  WDK711 PÅ FILER, EN FÖR VART DC                                            
//*                                                                             
//*  FILE - W011.LDC.W01184                                                     
//*  LDC 1A, 1B, 1C, 1K,                                                        
//*      2A, 2B, 2C, 2D, 2E, 2F,                                                
//*      2G, 2H, 2I, 2J, 2K, 2L,                                                
//*      2M, 2N, 2O, 3A,3B, 3C, 3D,                                             
//*      3E, 3F, 3G, 3H, 3I                                                     
//*                                                                             
//*  FILE - W011.SDC.W01184                                                     
//*  SDC 21, 23, 24, 25, 26                                                     
//*                                                                             
//*  FILE - W011.NDC.W01184                                                     
//*  NDC 4*, 51, 61, 62, 7*                                                     
//*                                                                             
//*  FILE - W011.NDC.W01183                                                     
//*  NDC 4*, 51, 61, 62, 7*                                                     
//*                                                                             
//*  FILE - W011.NDC.W01185                                                     
//*  NDC 4*, 51, 61, 62, 7*                                                     
//*                                                                             
//*  FILE - W011.NDC.W01182                                                     
//*  NDC 4*, 51, 61, 62, 7* -WDK722                                             
//*                                                                             
//*  FREKVENS:     DAG    RTN W011D2, W100V1, W011V1                            
//*                                                                             
//*  ÅTERSTART:    W01184      NORMAL                                           
//*                LÄSER  WDK7                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P084 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT1=&W011..LDC,                                               
//             INDUT2=&W011..SDC,                                               
//             INDUT3=&W011..NDC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01184   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01184,W01184,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W01184D1 DD  DSN=&&K7LDC,DISP=(NEW,PASS,DELETE),                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = LDC                     
//         DATACLAS=PSEB                                                        
//*                                                                             
//W01184D2 DD  DSN=&&K7SDC,DISP=(NEW,PASS,DELETE),                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = SDC                     
//         DATACLAS=PSEB                                                        
//*                                                                             
//W01184D3 DD  DSN=&&K7NDC,DISP=(NEW,PASS,DELETE),                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = NDC                     
//         DATACLAS=PSEB                                                        
//*                                                                             
//W01184D4 DD  DSN=&&K723,DISP=(NEW,PASS,DELETE),                               
//************ SAMTLIGA DATAELEMENT FRÅN WDK723, IDDC = NDC                     
//         DATACLAS=PSEN                                                        
//*                                                                             
//W01184D5 DD  DSN=&&K724,DISP=(NEW,PASS,DELETE),                               
//************ SAMTLIGA DATAELEMENT FRÅN WDK724, IDDC = NDC                     
//         DATACLAS=PSEN                                                        
//*                                                                             
//W01184D6 DD  DSN=&&K728,DISP=(NEW,PASS,DELETE),                               
//************ SAMTLIGA DATAELEMENT FRÅN WDK728, IDDC = 87(JUST NU)             
//         DATACLAS=PSEN                                                        
//*                                                                             
//W01184D7 DD  DSN=&&K722,DISP=(NEW,PASS,DELETE),                               
//************ SAMTLIGA DATAELEMENT FRÅN WDK722, IDDC = NDC                     
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//* LDC                                                                         
//*                                                                             
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K7LDC,DISP=(OLD,DELETE,DELETE)                             
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = LDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT1..W01184(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC =LDC, SORT; IDART         
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* SDC                                                                         
//*                                                                             
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K7SDC,DISP=(OLD,DELETE,DELETE)                             
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = SDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT2..W01184(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC =SDC, SORT; IDART         
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* NDC                                                                         
//*                                                                             
//SORT03   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K7NDC,DISP=(OLD,DELETE,DELETE)                             
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC = NDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT3..W01184(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, IDDC =NDC, SORT; IDART         
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* NDC WDK723                                                                  
//*                                                                             
//SORT04   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K723,DISP=(OLD,DELETE,DELETE)                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK723, IDDC = NDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT3..W01183(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK723, IDDC =NDC, SORT; IDART         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* NDC WDK724                                                                  
//*                                                                             
//SORT05   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K724,DISP=(OLD,DELETE,DELETE)                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK724, IDDC = NDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT3..W01185(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK724, IDDC =NDC, SORT; IDART         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* NDC WDK728                                                                  
//*                                                                             
//SORT06   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K728,DISP=(OLD,DELETE,DELETE)                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK728, IDDC = 87(IDAG)                
//*                                                                             
//SORTOUT   DD DSN=&INDUT3..W01188(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK728, IDDC =NDC, SORT; IDART         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* NDC WDK722                                                                  
//*                                                                             
//SORT07   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&K722,DISP=(OLD,DELETE,DELETE)                              
//************ SAMTLIGA DATAELEMENT FRÅN WDK722, IDDC = NDC                     
//*                                                                             
//SORTOUT   DD DSN=&INDUT3..W01182(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SAMTLIGA DATAELEMENT FRÅN WDK722, IDDC =NDC, SORT; IDART         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
