//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGAR                                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W011D1                                         
//*                                                                             
//*  RESTART:      W01103      NORMAL                                           
//*                          NORMAL                                             
//*                READS        WDD7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P103 PROC STPLIB=&INDRTE..LOAD                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01103   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01103,WDD7BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD7     INCLUDE MEMBER=WDD7                                                  
//W01103D1 DD  DUMMY                                                            
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//W01103D2 DD  DSN=&&W01103X,DISP=(NEW,PASS,DELETE),                            
//************ ERSÄTTNINGAR TILL AZURE DATALAKE                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
