//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SLÅ IHOP ALLA EV GENERATIONER AV R05:OR FRÅN TRATTEN                       
//*  TILL EN FIL.                                                               
//*                                                                             
//*  FREKVENS:     DAG       RTN W011D3                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P001 PROC INDIN2=&W092..W011D3,                                           
//             INDUT=&W011..W011D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN2..W09279,DISP=SHR                                     
//************ R05:OR FRÅN TRATTEN                                              
//         DD  DSN=&INDIN2..W09277(+0),DISP=SHR                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W01114(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ IHOPSLAGNA R05:OR                                                
//             SPACE=(80,(500,5000),RLSE),AVGREC=K,                             
//             MGMTCLAS=&NOBACKUP                                               
