//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE A TAB-SEPARATED EXTRACT OF FILE W01182                              
//*  TO SEND TO THE DATALAKE                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W011D6                                         
//*                                                                             
//*  RESTART:      W01182EX  NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P08A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDC                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W0118A   EXEC PGM=V16459,PARM='W0118A/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//INFIL01  DD  DSN=&INDIN..W01182(+0),DISP=SHR                                  
//************ INPUT FILE FROM W01184 -WDK722                                   
//*                                                                             
//UTFIL01  DD  DSN=&&W01182EX,DISP=(NEW,PASS,DELETE),                           
//************ TAB-SEPARATED EXTRACT FILE WITHOUT COLUMN-HEADERS                
//             DATACLAS=PSEB                                                    
//*                                                                             
