//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR DAGLAGERBAND TILL VECKOLAGERBAND                                  
//*                                                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W100V1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P077 PROC INDIN=&W011,                                                    
//             INDUT=&W011                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W01172(+0),DISP=SHR                                  
//************ DAGLAGERBAND                                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W01177(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ VECKOLAGERBAND                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
