//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE A TAB-SEPARATED EXTRACT OF FILE W01160                              
//*  TO SEND TO THE DATALAKE                                                    
//*                                                                             
//*  FREQUENCE:    DAILY EXCEPT SAT  RTN W011D6                                 
//*                                                                             
//*  RESTART:      W0116A    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P06B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDUT=&W011..W011D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W0116B   EXEC PGM=V16459,PARM='W0116B/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//INFIL01  DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ WDK601 AND WDK611 DATA                                           
//*                                                                             
//UTFIL01  DD  DSN=&INDUT..W01160EY(+1),                                        
//             DISP=(NEW,CATLG,DELETE),                                         
//************ TAB-SEPARATED EXTRACT FILE WITHOUT COLUMN-HEADERS                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
