//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  WDK723 EXTRACT TO AZURE DATALAKE IN DISPLAY FORMAT                         
//*                                                                             
//*  FREQUENCE:    DAILY EXCEPT SAT   RTN W011D6                                
//*                                                                             
//*  RESTART:      W01183    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDC                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01183   EXEC PGM=W01183                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W01183D1 DD  DSN=&INDIN..W01183(+0),DISP=SHR                                  
//************ INPUT FILE FROM W01184 -WDK723                                   
//*                                                                             
//W01183D2 DD  DSN=&&W01183X,DISP=(NEW,PASS,DELETE),                            
//************ WDK723 INFO TO AZURE DATALAKE                                    
//             DATACLAS=PSEB                                                    
//*                                                                             
