//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE A TAB-SEPARATED EXTRACT OF FILE W01184                              
//*  TO SEND TO THE DATALAKE                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W011D6                                         
//*                                                                             
//*  RESTART:      W01184TB  NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P08B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..LDC,                                               
//             INDIN2=&W011..SDC,                                               
//             INDIN3=&W011..NDC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W0118B   EXEC PGM=W0118B                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W0118BD1 DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ W01184 FILE                                                      
//*                                                                             
//W0118BD2 DD  DSN=&&W01184L,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//W0118BD3 DD  DSN=&&W01184S,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//W0118BD4 DD  DSN=&&W01184N,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
