//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR VECKOLAGERBAND TILL PERIODLAGERBAND                               
//*  VID REDOVISNINGSPERIODSKIFTE                                               
//*                                                                             
//*  FREKVENS:    REDOVISNINGSPERIOD   RTN W100V1                               
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P075 PROC INDIN=&W011,                                                    
//             INDUT=&W011                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W01177(+0),DISP=SHR                                  
//************ VECKOLAGERBAND                                                   
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W01175(+1),DISP=(NEW,CATLG,DELETE), -LIM(13)         
//************ REDOVISNINGSPERIODLAGERBAND                                      
//             SPACE=(439,(200,25),RLSE),AVGREC=K,                              
//             MGMTCLAS=LOW                                                     
