//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDD2 MED SB, SKRIVER UTVALDA DATAELEMENT FRÅN                        
//*  WDD201 PÅ FILEN W01166, SORT;IDARTNR                                       
//*                                                                             
//*  FREKVENS      DAG    RTN W011D1                                            
//*                VECKA  RTN W100V1                                            
//*                                                                             
//*  ÅTERSTART:    W01166      NORMAL                                           
//*                                                                             
//*                LÄSER  WDD2                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P066 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W011..&RTEGRP.,                                           
//             INDUT2=&W011..W011D1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01166   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01166,W01166,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD2     INCLUDE MEMBER=WDD2                                                  
//W01166D1 DD  DSN=&&W01166,DISP=(NEW,PASS,DELETE),                             
//************ UTVALDA DATAELEMENT FRÅN WDD201                                  
//         DATACLAS=PSEB                                                        
//*********SPACE=(75,(150,25),RLSE),AVGREC=K                                    
//*                                                                             
//W01166D2 DD  DSN=&INDUT2..W0116602(+1),                      -LIM(12)         
//************ UTVALDA DATAELEMENT FRÅN WDD201 TILL CPAM                        
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD66),DISP=SHR                         
//SORTIN   DD  DSN=&&W01166,DISP=(OLD,DELETE,DELETE)                            
//************ UTVALDA DATAELEMENT FRÅN WDD201                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W01166(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTVALDA DATAELEMENT FRÅN WDD201, SORT IDARTNR                    
//*************SPACE=(75,(150,25),RLSE),AVGREC=K,                               
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEB                                  
