//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE WDQ1 DELTA FILE TO SEND TO DATALAKE                                 
//*                                                                             
//*  FREQUENCE:    DAILY   RTN W011D6                                           
//*                                                                             
//*  RESTART:      W01189    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W011P089 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..W011D6,                                             
//             INDUT=&W011..W011D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01189   EXEC PGM=V16459,PARM='W01189/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W01189D1 DD  DSN=&INDIN..W01188(+0),DISP=SHR                                  
//************ WDQ1 EXTRACT TODAY                                               
//*                                                                             
//W01189D2 DD  DSN=&INDIN..W01188(-1),DISP=SHR                                  
//************ WDQ1 EXTRACT YESTERDAY                                           
//*                                                                             
//W01189D3 DD  DSN=&INDUT..W01189(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ WDQ1 DELTA                                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
