//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDA DATABAS MED SEGMENT FRÅN FIL                                         
//*                                                                             
//*  FREKVENS:     BESTÄLLNING                                                  
//*                                                                             
//*  ÅTERSTART:    W01566   NORMAL                                              
//*                         UPPDATERAR EN DATABAS                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P066 PROC STPLIB=&INDRTE..LOAD,                                           
//             PSB=SAKNAS,                                                      
//             DBB=DLI,                                                         
//             DSIN=DUMMY,DBRC=Y                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01566   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01566,&PSB,,00,,,,,,,,,&DBRC')                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//*EFRDER  DD  DSN=&INDPLOG..&PSB,                                              
//*            DISP=(NEW,CATLG,CATLG),                                          
//*            DCB=BUFNO=5,                                                     
//*            SPACE=(CYL,(20,20),RLSE),                                        
//*            MGMTCLAS=&EMID70                                                 
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFUPPD),DISP=SHR                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W01566D1 DD  DSN=&DSIN,DISP=SHR                                               
//************ LADDPOSTER                                                       
//*                                                                             
