//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOLLAR E9 => E8                                                            
//*                                                                             
//*  FREKVENS:     VID BEHOV                                                    
//*                                                                             
//*  ÅTERSTART:    W01594      NORMAL                                           
//*                LÄSER  WDE8 WDE9                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             DBB=DLI,                                                         
//             INDUT=&W..W015XX                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01594   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01594,WDE9BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDE8     INCLUDE MEMBER=WDE8                                                  
//WDE9     INCLUDE MEMBER=WDE9                                                  
//W01594D2 DD  DSN=&W..TN.WDE8UT,DISP=SHR                                       
//W01594D1 DD  DSN=&INDUT..W01594(+1),DISP=(NEW,CATLG,CATLG),   -LIM(3)         
//************ IDORDER PÅ E9 SAKNAS PÅ E8                                       
//             MGMTCLAS=&BACKUPC,SPACE=(122,(1,1),RLSE),AVGREC=K                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
