//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROGRAM FÖR ATT KOLLA ATT SAMTLIGA TRANSAR PÅ DISPATCHER                   
//*  TRANSGRUPP SOM FINNS I INFILEN ÄR KÖRDA.                                   
//*                                                                             
//*  FREKVENS:     BESTÄLLNING                                                  
//*                                                                             
//*  ÅTERSTART:    W01521   NORMAL (BMP)                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             DSIN=DUMMY                                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01521   EXEC PGM=DFSRRC00,                                                   
//         PARM=('BMP,W01521,W01521,,,N00,,,,,&CPU,,,&IMS')                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W01521D1 DD  DSN=&DSIN,DISP=SHR                                               
//************ STYRPOSTER                                                       
//*                                                                             
