//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSNING AV TRANSAR FRÅN WDR6 (WLFILA)                                     
//*                                                                             
//*   DSIN = NAMN PÅ FIL MED DE TRANSAR SOM SKA RENSAS                          
//*          (COPYTEXT WDR601)                                                  
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG       OLIKA RUTINER                                      
//*                                                                             
//*  ÅTERSTART:    W01536    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             DSIN=NULLFILE                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01536   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W01536,WDR6UP,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W01536D1 DD  DSN=&DSIN,DISP=SHR                                               
//************ LOGG-FIL MED TRANSAR ATT RENSA                                   
//*                                                                             
