//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES DOCUMENT WEB LOG DATA                                              
//*                                                                             
//*  FREQUENCE:    ONCE A DAY              RTN W015D2                           
//*                                                                             
//*  RESTART:      W01527                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P027 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WXTR..W015D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W01527D1 DD  DSN=&INDUT..W01527A(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)        
//************ WEB LOG DATA DAY                                                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W01527D2 DD  DSN=&INDUT..W01527B(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)        
//************ WEB LOG DATA TOT                                                 
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W01527D3 DD  DSN=&INDUT..W01527C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WEB LOG DATA                                                     
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W01527D4 DD  DSN=&INDUT..W01527D(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WEB LOG DATA TOT                                                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
