//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROCEDUR FÖR ATT KÖRA FIX-BMP                                              
//*                                                                             
//*  FREQUENCE:    FIX                                                          
//*                                                                             
//*  RESTART:      MBR       NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015PBMP PROC STPLIB=&INDRTE..LOAD,                                           
//             MBR=SAKNAS,PSB=SAKNAS,CPU=1,                                     
//             DSIN=NULLFILE                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015BMP  EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,&MBR,&PSB,,,N00,,,,,&CPU,,,&IMS')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W015BMD1 DD  DSN=&DSIN,DISP=SHR                                               
//************ FIX-POSTER ATT UPPDATERA                                         
//*                                                                             
