//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GENERELLT JOB FÖR SKAPANDET AV LADDFILER TILL LOADPGM                      
//*                                                                             
//*  ÅTERSTART:    W01585   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P085 PROC STPLIB=&INDRTE..LOAD,                                           
//             PSB=SAKNAS,                                                      
//             DSOUT=&W..UNLO.DBLADD(+1),                                       
//             MGMTCLAS=NOBACKUP                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01585  EXEC PGM=DFSRRC00,                                                    
//             PARM=('DLI,W01585,&PSB,,00')                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=*                                                         
//IDIHIST  DD  DSN=&W..IGRT.FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W01585D1 DD  DSN=&DSOUT,DISP=(NEW,CATLG,DELETE),                              
//*            SPACE=(27998,(3000,500),RLSE),                                   
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&MGMTCLAS                                               
