//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDAR DATABAS MED SEGMENT FRÅN EN FIL.                                    
//*                                                                             
//*  FREKVENS:     SEKUND                                                       
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015PB65 PROC STPLIB=&INDRTE..LOAD,                                           
//             PSB=SAKNAS,MBR=W01565,                                           
//             CPU=1,                                                           
//             DSIN=DUMMY                                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01565   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,&MBR,&PSB,,,N00,,,,,&CPU,,,&IMS')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W01565D1 DD  DSN=&DSIN,DISP=SHR                                               
