//********************************************************************          
//***                                                              ***          
//***     DENNA PROCEDURE ÄGS AV WDB2. VID PROBLEM RING 92100      ***          
//***                                                              ***          
//***          TVÅ TYPER AV STYRKORT FINNS                         ***          
//***          TYP1 HAR 3 OLIKA PARAMETRAR                         ***          
//***                                                              ***          
//***          1.   TYP = TOTAL                                    ***          
//***                     GER EN UPPRÄKNING OCH SUMMERING          ***          
//***                     AV ALLA TRANSAKTIONER                    ***          
//***                                                              ***          
//***          2.   TYP = SUMMA                                    ***          
//***                     SAMMA SOM TYP1                           ***          
//***                     MEN GER DESSUTOM EN FÖRDELNING           ***          
//***                     PER TERMINAL                             ***          
//***                                                              ***          
//***          3.   TYP = DIAGRAM                                  ***          
//***                     SAMMA SOM TYP2                           ***          
//***                     MEN GER DESSUTOM ETT DIAGRAM             ***          
//***                     MED TRANSAKTIONERNAS FÖRDELNING          ***          
//***                     UNDER DAGEN                              ***          
//***                                                              ***          
//***               VECKANS DAGAR SLÅS IHOP PER TERMINAL           ***          
//***               OM VECKA ÄR MARKERAD                           ***          
//***               EX. TYP = SUMMA  ,VECKA                        ***          
//***                   TYP = DIAGRAM,VECKA                        ***          
//***                                                              ***          
//***          KORTTYP 2 KAN FÖREKOMMA 1 - 10 GÅNGER               ***          
//***          ÖNSKADE NODER SELEKTERAS                            ***          
//***          NODE-NAMN 8 POS                                     ***          
//***          1 - 10 PER KORT                                     ***          
//***                                                              ***          
//********************************************************************          
//W015P092 PROC DSIN=NULLFILE,                                                  
//             STPLIB=&INDRTE..LOAD                                             
//W01592  EXEC PGM=W01592                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=*                                                         
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W01592D1 DD  DSN=&DSIN,DISP=OLD                                               
//W01592D2 DD  SYSOUT=*,DCB=BLKSIZE=121                                         
//SYSIN    DD  DDNAME=SYSIN                                                     
