//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR TEKRFEL FÖR ATT SKAPA W6H714 SEGM I 12PGM'T                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W015S2                                           
//*                                                                             
//*  ÅTERSTART:    W01510      NORMAL                                           
//*                LÄSER        W6H7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W015..W015X1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01510   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W01510,W6H7BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6H7     INCLUDE MEMBER=W6H7                                                  
//W01510D1 DD  DSN=&INDUT..W01510(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FIL MED INFO FÖR ATT SKAPA W6H714 SEGMENT                        
//             SPACE=(137,(100,50),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
