//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSNING AV TRANSAR FRÅN WDR3 (WLFILC)                                     
//*                                                                             
//*   DSIN = NAMN PÅ FIL MED DE TRANSAR SOM SKA RENSAS                          
//*          (COPYTEXT WDR301)                                                  
//*   PSB =  UPPDATERINGS-PSB FÖR AKTUELL BAS (WDR3UP)                          
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG         OLIKA RUTINER                                    
//*                                                                             
//*  ÅTERSTART:    W01533    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W015P033 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             DSIN=NULLFILE,PSB=WDR3UP                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01533   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W01533,&PSB,,,N00,,,,,&CPU,,,&IMS')                   
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W01533D1 DD  DSN=&DSIN,DISP=SHR                                               
//************ LOGG-FIL MED TRANSAR ATT RENSA                                   
//*                                                                             
