//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VCOM RECEIVE FILE TO PULS                                                  
//*  THE FILE NAME IS CONTROLLED BY SENDERTAG AND SYSIN INPUT                   
//*                                                                             
//*  FREQUENCY:    N/A                                                          
//*                                                                             
//*  RESTART:      W01615    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W016P015 PROC STPLIB=&INDRTE..LOAD,INDABE=&INDRTE                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W01615   EXEC PGM=W01615                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSPRINT DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDABE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W01615D1 DD  DDNAME=SYSIN                                                     
//*            --  INPUT CONTROL:                                               
//*            --  LINE 1: EXPEDITER NAME (NORMALLY &VCOM)                      
//*            --  LINE 2: FILE PATTERN WITH * THAT WILL BE                     
//*            --          SUBSTITUTED BY THE SENDERTAG VALUE                   
//*            --          IN VCOM TRANSACTION                                  
//*                                                                             
//W01615D2 DD  DSN=&&SOPPARM,DISP=(NEW,PASS,DELETE),DATACLAS=PSEN               
//*            --  SYMBOLIC PARM FOR SOP ORDER - VCOM(SENDERTAG)                
//*            --  OBSERVE THAT PROGRAM W01615 HAS CHANGED THE VALUE            
//*            --  OF EXPEDITOR USED IN W01615D1 DD LINE 1 >>                   
//*            --  TO VALUE OF SENDERTAG!!!                                     
