//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STEG 1 HTRS RSREDO                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W020V1                                          
//*                                                                             
//*  ÅTERSTART:    W02010   NORMAL                                              
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W020P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W479..W020V1,                                            
//             INDUT=&W020..W020V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W02010   EXEC PGM=V16459,PARM='W02010/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR               -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W02010D1 DD  DSN=&INDIN2..W47962,DISP=SHR                                     
//************ HISTORIK SLUTLEV. KOLLI GENOMLOPPSTIDER                          
//*                                                                             
//W02010D2 DD  DSN=&INDUT..W02010(+1),DISP=(NEW,CATLG,DELETE), -LIM(52)         
//************ HTRS STEG 1                                                      
//*            DCB=(RECFM=FB,LRECL=165,BLKSIZE=6105),                           
//             MGMTCLAS=&BACKUPC,SPACE=(6194,(500,200),RLSE)                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
