//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROGRAMMET I DENNA PROCEDUR LÄSER NER WDB5                                 
//*  MHA SB.                                                                    
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W020V1                                          
//*                                                                             
//*  RESTART:      W02004      NORMAL                                           
//*                LÄSER  WDB5                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W020P004 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W020..W020V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W02004   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W02004,W02004,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB5     INCLUDE MEMBER=WDB5                                                  
//W02004D1 DD  DSN=&&W02007,DISP=(NEW,PASS,DELETE),                             
//************ FILEN INNEHÅLLER - FRÅN WDB501 DISTRIKT                          
//************                  -      WDB511 IDKUNDNR                          
//************                  -      WDB511 IDDC-DAY(1)                       
//             SPACE=(9,(5,9),RLSE),AVGREC=K                                    
//W02004D2 DD  DSN=&INDUT..W02013(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LDC INFO                                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT07   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W020PD04),DISP=SHR                         
//SORTIN   DD  DSN=&&W02007,DISP=(OLD,DELETE,DELETE)                            
//************ FILEN SORTERAS PÅ DISTRIKT KUND                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W02007(+1),DISP=(NEW,CATLG,DELETE),  -LIM(6)         
//             SPACE=(9,(5,9),RLSE),AVGREC=K,                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
