//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STEG 2 HTRS RSREDO                                                         
//*  SUMMERAR PÅ MARKNAD SKAPAR FIL TILL RSREDO                                 
//*                                                                             
//*  FREKVENS:     VECKA    RTN W020V1                                          
//*                                                                             
//*  ÅTERSTART:    W02012   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W020P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W020..W020V1,                                             
//             INDUT=&W020..W020V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W02012   EXEC PGM=V16459,PARM='W02012/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(2000,500))                                          
//SORTMSG  DD  SYSOUT=*                                                         
//W02012D1 DD  DSN=&INDIN..W02010,DISP=SHR                                      
//*********** FIL FRÅN W020P010 SUMMERAD PER DISTRIKT ALLA GENERATIONER         
//*                                                                             
//W02012D2 DD  DSN=&INDRTE..CONSTANT(W020PD01),DISP=SHR                         
//************ MARKNADSTABELL  ÖVERSÄTTNING DISTRIKT->MARKNAD                   
//*                                                                             
//W02012D3 DD  DSN=&INDUT..W02012(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ FIL TILL RSREDO                                                  
//             DCB=(RECFM=FB,LRECL=162,BLKSIZE=6156),                           
//             MGMTCLAS=&BACKUPC,SPACE=(6156,(500,166),RLSE)                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
