//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SETS SYMBOLIC PARAMTERS IN SOP (YYWW YYAA YYP YY)                          
//*                                                                             
//*  FREQUENCE:    WEEK1     RTN W030V1                                         
//*                                                                             
//*  RESTART:      W03020    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W030P020 PROC STPLIB=&INDRTE..LOAD,                                           
//             SYMB=YYXX,                                                       
//             SOPREG=&INDRTE..SOP                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W03020   EXEC PGM=W03020,PARM='&SYMB./'                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WSOPDD1  DD  DSN=&SOPREG,DISP=SHR                -- SOP DATA BASE             
//WPDSDD1  DD  DUMMY                               -- TEMP PDS JOB LIB          
//WPDSDD2  DD  DUMMY                               -- PDS JOB LIB               
