//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GENERERING AV 6-DAGARS-DATUMKORTET 000001.                                 
//*                                                                             
//*  FREKVENS:     ALLA DAGAR.   RTN W030D2                                     
//*                                                                             
//*  ÅTERSTART:    W03015   NORMAL                                              
//*                DFUP     NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W030P015 PROC STPLIB=&INDRTE..LOAD,DATUM=,                                    
//             INDUT=&W030..W030D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W03015   EXEC PGM=W03015,PARM='&DATUM'                                        
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//W03015D2 DD  DSN=&INDUT..W03015(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ STANDARD-DATUMKORT                                               
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(80,(1))                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
