//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERING AV DATUMKORTSFIL TILL EN VERSION SOM                             
//*  LIGGER KVAR EN VECKA                                                       
//*                                                                             
//*  FREKVENS:     VECKA  RTN W030D2                                            
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W030P016 PROC INDIN=&INDRTE.,                                                 
//             INDUT=&INDRTE.                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..DATUM(+0),DISP=SHR                                   
//************ DATUMKORTSFIL                                                    
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..DATWEEK(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VECKOVERSION                                                     
//             MGMTCLAS=&BACKUP7,SPACE=(23440,(1,1),RLSE)                       
