//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR TRANSAR TILL KDP I TIDSORDNING.                                   
//*  MINSKAR RECORDLÄNGD PÅ FILEN W092ZU(KDP).                                  
//*                                                                             
//*  FREKVENS:     DAG    RTN W092D6                                            
//*                                                                             
//*  ÅTERSTART:    SORT       NORMAL                                            
//*                FILFIX     NORMAL                                            
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W092P110 PROC INDIN=&W092..W092D6,                                            
//             INDUT=&WUT..W092D6                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W092KDP),DISP=SHR                          
//SORTIN   DD  DSN=&INDIN..W092ZU(+0),DISP=SHR                                  
//************ INFIL FRÅN W09208, TRANSAR TILL KDP                              
//*                                                                             
//SORTOUT  DD  DSN=&&W092ZU,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE TRANSAR I TIDSORDNING TILL KDP                         
//           DCB=(RECFM=FB,LRECL=17,BLKSIZE=6222),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//FILFIX   EXEC PGM=V16459,PARM='V164D0/3/'                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//IN       DD  DSN=&&W092ZU,DISP=(OLD,DELETE,DELETE)                            
//************ TRANSAR TILL KDP, MED SORTERINGSBEGREPP TID                      
//*                                                                             
//UT       DD  DSN=&INDUT..W092ZU(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ UTFIL , NU OMGJORD TILL RECORDLÄNG 9, DVS UTAN SORTFÄLT          
//             DCB=(RECFM=FB,LRECL=09,BLKSIZE=23472),                           
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
