//*---------------------  PROCEDUR  W092P042 --------------------               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDG901 FÖRDELAR OCH SKRIVER ANSKAFFNINGSTRANSAR                      
//*  PÅ OLIKA FILER, SKRIVER SAMTLIGA PÅ KONTROLLFIL                            
//*                                                                             
//*  FREKVENS:     DAG    RTN W092D5                                            
//*                                                                             
//*  ÅTERSTART:    W092D5    NORMAL  (BMP)                                      
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W092P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W092..W092D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W09242   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W09242,W09242,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W09242D2 DD  DSN=&INDUT..W0924A(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ POSTER MED R01-TRANSAR                                           
//             MGMTCLAS=&NOBACKUP,SPACE=(6210,(12,90),RLSE)                     
//*                                                                             
//W09242D3 DD  DSN=&INDUT..W0924B(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ POSTER MED R02- OCH R17-TRANSAR                                  
//             MGMTCLAS=&NOBACKUP,SPACE=(6233,(12,90),RLSE)                     
//*                                                                             
//W09242D4 DD  DSN=&INDUT..W0924C(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ POSTER MED R22- OCH R23-TRANSAR                                  
//             MGMTCLAS=&NOBACKUP,SPACE=(6204,(10,30),RLSE)                     
//*                                                                             
//W09242D6 DD  DSN=&INDUT..W0924E(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ POSTER MED R05-TRANSAR                                           
//*            DCB=(RECFM=VB,LRECL=16,BLKSIZE=23476),                           
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(1,1),RLSE)                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TOMDEL  EXEC WEMPDEL,DSIN=&INDUT..W0924E(+1)                                  
