//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DSASDSA                                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W011D3                                         
//*                                                                             
//*  RESTART:      W09276    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W092P076 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..QASE,                                              
//             INDIN3=&W092..W011D3,                                            
//             INDUT=&W092..W011D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W09276   EXEC PGM=V16459,PARM='W09276/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(1000,1000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W09276D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//W09276D2 DD  DSN=&INDIN3..TIURPROD,DISP=SHR                                   
//************ FIL FRÅN KDP                                                     
//*                                                                             
//W09276D3 DD  DSN=&INDUT..W09277(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL FRÅN PGM W09276 TILL W01102                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
