//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BEREDNING  LISTA ÖVER KOMMANDE ARTIKLAR                                    
//*                                                                             
//*  FREKVENS:     MÅNADSSLUT                                                   
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P086 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011,                                                    
//             INDIN2=&W011..&RTEGRP.,                                          
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11186   EXEC PGM=V16459,PARM='W11186/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W11186D1 DD  DSN=&INDIN1..W01172(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND                                                
//*                                                                             
//W11186D2 DD  DSN=&INDIN2..W01162(+0),DISP=SHR                                 
//************ NOTERINGAR                                                       
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W11186D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W11186-001  KOMMANDE ARTILAR                                     
//*                                                                             
