//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GEMENSAMMA ARTIKLAR                                                        
//*                                                                             
//*  MATCHAR EN FIL MED GÄLLANDE ARTIKLAR FRÅN EGNA BOLAGET (PV)                
//*  MED EN FEL MED GÄLLANDE ARTIKLAR FRÅN ANDRA BOLAGET (LV)                   
//*                                                                             
//*  SKRIVER FIL MED ARTIKLAR DÄR FLGEMART SKALL UPPDATERAS                     
//*                                                                             
//*                                                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W111V2                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                W11112    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W111..W111V2,                                             
//             INDREG=&WIN..R111,                                               
//             INDUT=&W111..W111V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W111PD12),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W11111(+0),DISP=SHR                                  
//************ GÄLLANDE ARTIKLAR EGNA BOLAGET (PV)                              
//*                                                                             
//SORTOUT  DD  DSN=&&W11111,DISP=(NEW,PASS,DELETE),                             
//************ GÄLLANDE ARTIKLAR EGNA BOLAGET (PV) SORT IDARTNR                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W111PD12),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG..R11111(+0),DISP=SHR                                 
//************ GÄLLANDE ARTIKLAR ANDRA BOLAGET (LV)                             
//*                                                                             
//SORTOUT  DD  DSN=&&R11111,DISP=(NEW,PASS,DELETE),                             
//************ GÄLLANDE ARTIKLAR ANDRA BOLAGET (LV) SORT IDARTNR                
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11112   EXEC PGM=W11112                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11112D1 DD  DSN=&&W11111,DISP=(OLD,DELETE,DELETE)                            
//************ GÄLLANDE ARTIKLAR EGNA BOLAGET (PV) SORT IDARTNR                 
//*                                                                             
//W11112D2 DD  DSN=&&R11111,DISP=(OLD,DELETE,DELETE)                            
//************ GÄLLANDE ARTIKLAR ANDRA BOLAGET (LV) SORT IDARTNR                
//*                                                                             
//W11112D3 DD  DSN=&INDUT..W11113(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR DÄR FLGEMART SKALL UPPDATERAS (PV)                      
//             SPACE=(6,(100,33),RLSE),AVGREC=K,                                
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
