//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL W22428 OCH SKAPAR 2 LISTOR                                       
//*  MED INFO ARTIKLAR FARLIGT GODS                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W100V1                                          
//*                                                                             
//*  ÅTERSTART:    W11182    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W224..W100V1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11182   EXEC PGM=V16459,PARM='W11182/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W11182D1 DD  DSN=&INDIN..W22428(+0),DISP=SHR                                  
//************ NYREG/ERSATTA ARTIKLAR FARLIGT GODS                              
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W11182D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W11182-001  NYREGISTRADE ARTIKLAR FARLIGT GODS                   
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W11182D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W11182-002  ERSATTA ARTIKLAR FARLIGT GODS                        
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
