//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGSBEVAKNING - UPPDATERING AV ARTIKEL- OCH                         
//*                         ERSÄTTNINGS-BASERNA                                 
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W111D1                                          
//*                                                                             
//*  RESTART:      W11119    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W111..W111D1,                                             
//             INDUT=&W111..W111D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11119   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W11119,W11119,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11119D1 DD  DSN=&INDIN..W11119(+0),DISP=SHR                                  
//************ UPPDATERINGSTRANSAR                                              
//*                                                                             
//W11119D2 DD  DSN=&INDUT..W11119(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ OBEHANDLADE UPPDATERINGSTRANSAR                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
