//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GEMENSAMMA ARTIKLAR                                                        
//*                                                                             
//*  SAMLAR ARTIKLAR MED KDERS-UTG = 0, FRÅN W91042                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W111V1                                          
//*                                                                             
//*  ÅTERSTART:    W11110    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W910,                                                    
//             INDUT=&W111..W111V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11110   EXEC PGM=W11110                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11110D1 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ARTIKELFIL                                                       
//*                                                                             
//W11110D2 DD  DSN=&INDUT..W11111(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ARTIKLAR MED KDERS-UTG = 0, EGNA FÖRETAGET (PV)                  
//             SPACE=(6,(100,33),RLSE),AVGREC=K,                                
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
