//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BORTTAG AV 9101 HÄNDELSER                                                  
//*                                                                             
//*  FREKVENS:     DAG    RTN W111D1                                            
//*                                                                             
//*  ÅTERSTART:    W11174    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W111..W111D1,                                             
//             INDUT=&W111..W111D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11174   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W11174,W11174,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11174D1 DD  DSN=&INDIN..W11174(+0),DISP=SHR                                  
//************ UPPDATERINGSPOSTER                                               
//*                                                                             
//W11174D2 DD  DSN=&INDUT..W11174(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ UPPDATERINGSPOSTER                                               
//             SPACE=(20,(1,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
