//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGSTRANSAR TILL STICS                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W111D1                                            
//*                                                                             
//*  ÅTERSTART:    W11177    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W111..W111D1,                                             
//             INDUT=&WUT..W111D1                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11177   EXEC PGM=W11177                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11177D1 DD  DSN=&INDIN..W11170(+0),DISP=SHR                                  
//************ ERSÄTTNINGSTRANSAR PT 701 702                                    
//*                                                                             
//W11177D2 DD  DSN=&INDUT..W11177(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ ERS TRANSAR TILL STICS                                           
//             SPACE=(72,(1,3),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
