//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W01177(0) / (-1)                                                   
//*  SKAPAR FIL ARTIKELFÖRÄNDRING KDFARLIG                                      
//*                                                                             
//*  FREKVENS:     VECKA   RTN W100V1                                           
//*                                                                             
//*  ÅTERSTART:    W11194    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011,                                                    
//             INDUT=&W111..W100V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11194   EXEC PGM=W11194                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11194D1 DD  DSN=&INDIN2..W01177(0),DISP=SHR                                  
//************ VECKOLAGERBAND DENNA VECKA                                       
//*                                                                             
//W11194D2 DD  DSN=&INDIN2..W01177(-1),DISP=SHR                                 
//************ VECKOLAGERBAND FÖRRA VECKAN                                      
//*                                                                             
//W11194D3 DD  DSN=&INDUT..W11194(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELFÖRÄNDRING                                                
//             SPACE=(80,(100,66),RLSE),AVGREC=U,                               
//             MGMTCLAS=&BACKUPC                                                
