//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  JUSTERING AV KDERS PÅ FIL TILL VR                                          
//*                                                                             
//*  FREKVENS:     DAG     RTN W111D3                                           
//*                                                                             
//*  ÅTERSTART:    W11161    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDC,                                                
//             INDREG=&W910,                                                    
//             INDUT=&W111..W111D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//************ NDC LAGERBAND                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ NDC LAGERBAND SORTERAD ARTIKELNUMMER DC                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11161   EXEC PGM=W11161                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W11161D1 DD  DSN=&INDREG..W91045(+0),DISP=SHR                                 
//************ ERSÄTTNINGS FIL                                                  
//*                                                                             
//W11161D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ NDC LAGERBAND SORTERAD ARTIKELNUMMER DC                          
//*                                                                             
//W11161D3 DD  DSN=&INDUT..W11161(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ VR ERSÄTTNINGSFIL                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
