//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER ERSÄTTNINGSTRANSAR HTR 9101 FRÅN FIL ELLER WLXXID                    
//*                                                                             
//*  FREKVENS:     DAG    RTN W111D1                                            
//*                                                                             
//*  ÅTERSTART:    W11170                                                       
//*                                                                             
//*                LÄSER  WDD7 WDK6 WDD3 WDG3                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W111..W111D1,                                             
//             INDUT=&W111..W111D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11170   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11170,W11170,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDG3     INCLUDE MEMBER=WDG3                                                  
//*                                                                             
//W11170D1 DD  DSN=&INDIN..W11116(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W11123(+0),DISP=SHR                                  
//*                                                                             
//W11170D2 DD  DSN=&INDUT..W11170(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ERSÄTTNINGSTRANSAR  POSTTYP 701 702                              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11170D3 DD  DSN=&INDUT..W11174(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ UPPDATERINGSPOSTER HTYP 9101                                     
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
