//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W11170-FILEN TILL W1117N FÖR NEVIS BASELINE                       
//*  OPACKADE FÄLT OCH MED IDBENNR                                              
//*                                                                             
//*  FREKVENS:     DAG     RTN W111D1                                           
//*                                                                             
//*  ÅTERSTART:    W1117N      NORMAL                                           
//*                LÄSER        WDD3 (BSEQ)                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P07N PROC STPLIB=&INDRTE..LOAD,                                           
//             DBB=DLI,                                                         
//             INDIN=&W111..W111D1,                                             
//             INDUT=&WUT..W111D1                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1117N   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W1117N,W1117N,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM1K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W1117ND1 DD  DSN=&INDIN..W11170(+0),DISP=SHR                                  
//************ DAGLIG ERSÄTTNINGSFIL                                            
//*                                                                             
//W1117ND2 DD  DSN=&INDUT..W1117N(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ DAGLIG ERSÄTTNINGSFIL TILL NEVIS BASELINE                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
