//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL FRÅN VOLVO TRANSPORT OCH SKAPAR                                  
//*  W1T111X-TRANS TILL DISPATCHEN.                                             
//*                                                                             
//*  FREKVENS:     BESTÄLLNING W111B1                                           
//*                                                                             
//*  ÅTERSTART:    W11134    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W111..W111B1,                                             
//             INDUT=&W111..W111B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11134   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W11134,W11134,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11134D1 DD  DSN=&INDIN..W11138,DISP=SHR                                      
//************ STATNUMMER, URSPRUNG FRÅN LOGENT                                 
//*                                                                             
//W11134D2 DD  DSN=&INDUT..W11135(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ STATNR, URSPRUNG FRÅN LOGENT                                     
//             SPACE=(17,(2,4),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
