//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR LAGERBAND FÖR ATT FINNA DE                                         
//*  ARTIKLAR SOM FÅTT KDERS = 9 SISTA VECKAN                                   
//*                                                                             
//*  FREKVENS:                  RTN W100V1                                      
//*                                                                             
//*  ÅTERSTART:    W11190    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W111P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011,                                                    
//             INDUT=&W111..W100V1                                              
//**           DEST1=&QUS05891                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11190   EXEC PGM=V16459,PARM='W11190/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W11190D1 DD  DSN=&INDIN2..W01177(+0),DISP=SHR                                 
//************ LAGERBAND DENNA VECKA                                            
//*                                                                             
//W11190D2 DD  DSN=&INDIN2..W01177(-1),DISP=SHR                                 
//************ LAGERBAND FÖRRA VECKAN                                           
//*                                                                             
//*A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                   
//*                                                                             
//W11190D3 DD  DSN=&INDUT..W11190(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ W11190-001  LISTA KDERS = 9 SOM FIL TILL D&P                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
