//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SATSER                                                                     
//*  HÄNDELSETYP 2301 (LEVERATÖRNUMMER) OCH                                     
//*  HÄNDELSETYP 2303 (ERSÄTTNING), ÅTGÄRDAS                                    
//*                                                                             
//*  FREKVENS:     DAG    RTN W200D1                                            
//*                                                                             
//*  ÅTERSTART:    W11210    NORMAL  (BMP)                                      
//*                                                                             
//* DISPLAYER SKRIVS PÅ FILEN W11211                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W112P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=2,                                                           
//             INDUT=&W112..W200D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11210   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W11210,W11210,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//SYSOUT   DD  DSN=&INDUT..W11211(+1),DISP=(NEW,CATLG,CATLG),   -LIM(1)         
//************ FEL-MEDDELANDEN VIA DISPLAY                                      
//             SPACE=(121,(2,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
