//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR OCH GÖR IDARTNR NUMERISKT                                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W114D3                                           
//*                                                                             
//*  ÅTERSTART:    W11409    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W114..W114D3,                                             
//             INDUT=&W114..W114D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11409   EXEC PGM=W11409                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11409D1 DD  DSN=&INDIN..W11410(+0),DISP=SHR                                  
//************ INFIL FRÅN MPNR                                                  
//*                                                                             
//W11409D2 DD  DSN=&INDUT..W11410S(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ SORTERAD OCH FIXAD FIL                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
