//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER IGENOM HELA NYPONBASEN. DE ARTIKLAR SOM UPP-                         
//*  FYLLER KRAV FÖR BEVAKNING, SKRIVS PÅ UTFIL                                 
//*                                                                             
//*  FREKVENS:     VECKA    RTN W114V1                                          
//*                                                                             
//*  ÅTERSTART:    W11405   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P005 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W114..W114V1                                              
//W11405   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11405,W11405,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDD2     INCLUDE MEMBER=WDD2                                                  
//W11405D1 DD  DSN=&INDUT..W11406(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ ARTIKLAR FRÅN NYPON SOM UPPFYLLT BEVAKNINGSVILLKOR               
//*            FIL BLIR INPUT TILL W114P006                                     
//             DCB=(RECFM=FB,LRECL=5,BLKSIZE=6230),                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(6230,(1000,0),RLSE)                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
