//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDAR DATABAS WDF7                                                        
//*                                                                             
//*  FREKVENS:     DAGLIGEN  RTN W114D3                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W11410      BACKOUT (VIA SOP)                                
//*                UPPDATERAR   WDF7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W114..W114D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11410   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11410,W11410,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSURWF1 DD  DSN=&&DFSURWF1,DISP=(NEW,PASS,DELETE),                           
//             SPACE=(4096,(1260,180),RLSE),                                    
//             DCB=(BLKSIZE=27930,BUFNO=5)                                      
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//BMCPRINT DD  SYSOUT=*                                     -- DISPLAY          
//BMCMSG   DD  SYSOUT=*                                     -- DISPLAY          
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//*WDF7     INCLUDE MEMBER=WDF7  ( DET FINNS INGEN WDF7 MEMBER)                 
//WDF7V    DD   DSN=&INDBAS..WDF7V,DISP=SHR                                     
//WDF7AK   DD   DSN=&INDBAS..WDF7AK,DISP=SHR                                    
//*                                                                             
//W11410D1 DD  DSN=&INDIN..W11410S(+0),DISP=SHR                                 
//************ SORTED MPNR FILE FROM KDP                                        
//************ FIXED IN W11409 REGARDING UNNUMERIC IDARTNR.                     
//*                                                                             
