//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDA ARTIKLAR PÅ NYPONBASEN                                               
//*                                                                             
//*  FREKVENS:     DAG     RTN W114XX                                           
//*                                                                             
//*  ÅTERSTART:    W11412    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=2,                                                           
//             INDIN=&W114..W114X1SE                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11412   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W11412,W11412,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11412D1 DD  DSN=&INDIN..W11412(+0),DISP=SHR                                  
//************ XX                                                               
//*                                                                             
