//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER KVITTERINGAR FRÅN SI+                                                
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W114S7                             
//*                                                                             
//*  ÅTERSTART:    W11461    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P060 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN2=&W114..W114S7,                                            
//             INDUT=&W114..W114S7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11461   EXEC PGM=W11461                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11461D1 DD  DSN=&INDIN2..W11460(+0),DISP=SHR                                 
//************ KVITTERINGAR FRÅN SI+ SVERIGE (T335R309)                         
//*                                                                             
//W11461D2 DD  DSN=&INDUT..W1146A(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=BLANK OCH 00                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D3 DD  DSN=&INDUT..W1146B(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=02                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D4 DD  DSN=&INDUT..W1146C(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=04                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D5 DD  DSN=&INDUT..W1146D(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=08                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D6 DD  DSN=&INDUT..W1146E(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=10                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D7 DD  DSN=&INDUT..W1146F(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=05 OCH 12                                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11461D8 DD  DSN=&INDUT..W1146G(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RK=20                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
