//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BMP SOM LÄSER FIL FRÅN W114P005 MED ARTIKLAR SOM                           
//*  UPPFYLLER BEVAKNINGSVILLKOR OCH SKALL DÄRMED UPP PÅ                        
//*  BEREDARENS KÖ.                                                             
//*                                                                             
//*  FREKVENS:     1 GÅNG PER VECKA     RTN W114V1                              
//*                                                                             
//*  ÅTERSTART:    W11406   NORMAL                                              
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W114..W114V1,                                             
//             INDUT=&W114..W114V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11406   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W11406,W11406,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11406D1 DD  DSN=&INDIN..W11406(+0),DISP=SHR                                  
//************ INFIL FRÅN PROC W114P005 +EV OMSTART FRÅN W11406                 
//*                                                                             
//W11406D2 DD  DSN=&INDUT..W11406(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL SOM TAS IN SOM INFIL VID OMSTART VIA PGM                   
//             MGMTCLAS=&DEL2BKPC,SPACE=(6230,(1000,100),RLSE)                  
//*                                                                             
//SOPDD1   DD  DSN=&INDRTE..SOP,DISP=SHR                                        
//*********    DD-KORT FÖR SOPSUB,         (OMSTART AV PGM)                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TOMDEL  EXEC WEMPDEL,DSIN=&INDUT..W11406(+1)                                  
