//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TÖMNING NYPON TILL INKÖP PV  (SIPLUS)  BMP                                 
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W114S2                                      
//*                                                                             
//*  ÅTERSTART:    W11450   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  980910                                                                     
//*  LAGT TILL DD-KORT, PDSDD1 OCH PDSDD2 FÖR SOP  /CONNY                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&WUT..W114S2                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11450   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W11450,W11450,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//W11450D2 DD  DSN=&INDUT..W11450(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TRANSAR TILL INKÖP PV = SIPLUS                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//SOPDD1   DD  DSN=&INDRTE..SOP,DISP=SHR                                        
//PDSDD1   DD  DSN=&INDRTE.TMP.JCL,DISP=SHR                                     
//PDSDD2   DD  DSN=&INDRTE..JCL,DISP=SHR                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
