//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SPLIT OF RECIEPTS FROM SI+ BETWEEN SE AND CN                               
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W114S7                           
//*                                                                             
//*  RESTART:      W11465    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W114P065 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W114..W114S7,                                            
//             INDUT=&W114..W114S7,                                             
//             INDUT2=&WXTR..SIPLUS                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11465   EXEC PGM=W11465                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11465D1 DD  DSN=&INDIN2..T335R309(+0),DISP=SHR                               
//************ RECIEPTS FROM SI+                                                
//*                                                                             
//W11465D2 DD  DSN=&INDUT..W11460(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ RECIEPTS FROM SI+ SE                                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W11465D3 DD  DSN=&INDUT..W11465(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RECIEPTS FROM SI+ CN                                             
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY1    EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W11460(+1),DISP=SHR                                  
//************ RECIEPTS FROM SI+ SE                                             
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..W11460C(+1),                       -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ COPY W11460 - RECIEPTS FROM SI+ SE                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY2    EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W11465(+1),DISP=SHR                                  
//************ RECIEPTS FROM SI+ CN                                             
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..W11465C(+1),                       -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ COPY W11465 - RECIEPTS FROM SI+ CN                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
