//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER VCOM TRANS OCH STARTAR RUTIN I SOP                                   
//*                                                                             
//*  FREKVENS:     DAG     RTN W116XX                                           
//*                                                                             
//*  ÅTERSTART:    W11680    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P080 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116X1XX,                                           
//             SOPREG=&INDRTE..SOP,                                             
//             PDSLIB=&INDRTE..JCL,                                             
//             PDSTEMP=&INDRTE.TMP.JCL                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11680   EXEC PGM=W11680                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W11680D1 DD  DUMMY                                                            
//************ VCOM-ID                                                          
//*                                                                             
//W11680D2 DD  DSN=&INDIN..W11601(+1),DISP=SHR                                  
//************ FIL FRÅN VCOM                                                    
//*                                                                             
//SOPDD1   DD  DSN=&SOPREG,DISP=SHR            -- SOP DATA BASE                 
//PDSDD1   DD  DSN=&PDSTEMP,DISP=SHR           -- TEMP PDS JOB LIB              
//PDSDD2   DD  DSN=&PDSLIB,DISP=SHR            -- PDS JOB LIB                   
