//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BUY BACK NOT ALLOWED                                                       
//*  RTN W116V1                                                                 
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W116V1                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                W11601    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P001 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W116..W116V1,                                             
//             INDIN2=&W233..W233V1,                                            
//             INDIN3=&W011,                                                    
//             INDUT=&W116                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W11607(+0),DISP=SHR                                  
//************ W11607 INFILE FOR SORT                                           
//*                                                                             
//SORTOUT  DD  DSN=&&W11607,DISP=(NEW,PASS,DELETE),                             
//************ W11607 INFILE SORTED                                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD04),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W23321(+0),DISP=SHR                                 
//************ W23321 AVROPSFIL                                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W23321,DISP=(NEW,PASS,DELETE),                             
//************ W23321 AVROPSFIL SORTERAD                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11601   EXEC PGM=W11601                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W11601D1 DD  DSN=&&W11607,DISP=(OLD,DELETE,DELETE)                            
//************ W11607 INFIL SORTERAD                                            
//*                                                                             
//W11601D2 DD  DSN=&&W23321,DISP=(OLD,DELETE,DELETE)                            
//************ W23321 AVROPSFIL SORTERAD                                        
//*                                                                             
//W11601D3 DD  DSN=&INDIN3..W01172(+0),DISP=SHR                                 
//************ W01172 LAGERBAND DAILY PARTS FILE                                
//*                                                                             
//W11601D4 DD  DSN=&INDUT..W11604(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTFILE W11604                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
