//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR 2 FILER LÄGGER TILL KINESISK BENÄMNING FRÅN W01178                 
//*                                                                             
//*  FREKVENS:     DAG (DAILY)                                                  
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P027 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D4,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W116..W116D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11627   EXEC PGM=V16459,PARM='W11627/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W11627D1 DD  DSN=&INDIN..W11621(+0),DISP=SHR                                  
//************ FIL FRÅN W11690                                                  
//*                                                                             
//W11627D2 DD  DSN=&INDIN2..W01178(+0),DISP=SHR                                 
//************ KINESISK BENÄMNING                                               
//*                                                                             
//W11627D3 DD  DSN=&INDUT..W11627(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTFIL TILL W11691 MED KINESISK BENÄMNING TILLAGD                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
