//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR ERSÄTTNINGSMEDDELANDEN TILL VIPS.                                  
//*                                                                             
//*  FREKVENS:     DAG         RTN W116D3                                       
//*                                                                             
//*  ÅTERSTART:    W11644      NORMAL                                           
//*                LÄSER        WDK6 WDD7 WDL6                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D3,                                             
//             INDREG=&W116.,                                                   
//             INDUT=&W116..W116D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11644   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11644,W11644,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDL6     INCLUDE MEMBER=WDL6                                                  
//W11644D1 DD  DSN=&INDIN..W11641A(+0),DISP=SHR                                 
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//W11644D2 DD  DSN=&INDREG..W11645(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ ERSÄTTNINGAR TILL KOMMANDE BEVAKNINGAR                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11644D3 DD  DSN=&INDUT..W11647(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ ERSÄTTNINGSINFO TILL VIPS PREL ERS                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
