//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGSINFO TOTALFIL FÖR ETT LAND ÄR BESTÄLLD.                         
//*  RUTIN: W116SF. BESTÄLLS OCH SKICKAS VIA VCOM.                              
//*                                                                             
//*  FREKVENS:     ORDERED                                                      
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P088 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W116,                                                    
//             INDREG2=&W116..W116D2,                                           
//             INDUT=&W116..W116SF,                                             
//             INDIN=&W116..W116SF                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT RECORDS FOR THE CONCERNED COUNTRY                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSIN    DD  DUMMY                                                            
//* SORT.SYSIN OVERWRITTEN FROM JCL                                             
//SORTIN   DD  DSN=&INDREG..W11679(+0),DISP=SHR                                 
//         DD  DSN=&INDREG2..W11679(+0),DISP=SHR                                
//*                                                                             
//SORTOUT  DD  DSN=&&W11679,DISP=(NEW,PASS,DELETE),                             
//************ SAMTLIGA ARTIKLAR SORT IDARTNR                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11688   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11688,W11688,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//*                                                                             
//W11688D1 DD  DSN=&&W11679,DISP=(OLD,DELETE,DELETE)                            
//************ ERSÄTTNINGAR FOR CONCERNED COUNTRY                               
//*                                                                             
//W11688D2 DD  DSN=&INDIN..W1168A(+0),DISP=SHR                                  
//************ PARTS FOR CONCERNED COUNTRY                                      
//*                                                                             
//W11688D3 DD  DSN=&INDUT..W11688(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ERSÄTTNINGSINFO TILL BERÖRT LAND                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* TO REPLACE ¤MQMPROP HEADERS BY ¤DAP HEADERS                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2   EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDUT..W11688(+1),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W11688,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD88),DISP=SHR                         
//*                                                                             
