//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*                                                                             
//*  SKRIVER ARTIKELFIL FÖR VIPSÖVERFÖRINGARNA                                  
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W011..&RTEGRP.,                                          
//             INDUT=&W116..W116D1,                                             
//             INDIN=&W116..W116V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11609   EXEC PGM=V16459,PARM='W11609/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(150000,10000))                                      
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W11609D1 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ ARTIKELDATA                                                      
//*                                                                             
//W11609D2 DD  DSN=&INDREG..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGAR                                                      
//*                                                                             
//W11609D3 DD  DSN=&INDUT..W11609(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELUPPGIFTER                                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11609D4 DD  DSN=&INDIN..W11686(+0),DISP=SHR                                  
//************ NEDLÄST WDF5                                                     
//*                                                                             
//TEMPFIL1 DD  DATACLAS=PSEB                                                    
//************                                                                  
//*                                                                             
//TEMPFIL2 DD  DATACLAS=PSEB                                                    
//************                                                                  
//*                                                                             
//W11609D5 DD  DSN=&INDREG..W01169(+0),DISP=SHR                                 
//************ NEDLÄST WDF7                                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
