//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BEVAKAR ERSÄTTNINGAR TILL VIPS                                             
//*                                                                             
//*  FREKVENS:     DAG         RTN W116D3                                       
//*                                                                             
//*  ÅTERSTART:    W1164000  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D3,                                             
//             INDREG=&W116,                                                    
//             INDUT=&W116..W116D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11640   EXEC PGM=V16459,PARM='W11640/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W11640D1 DD  DSN=&INDIN..W11643(0),DISP=SHR                                   
//************ FILE FROM W11642                                                 
//*                                                                             
//W11640D2 DD  DSN=&INDREG..W11645(+0),DISP=SHR                                 
//************ INPUT FIL                                                        
//*                                                                             
//W11640D3 DD  DSN=&INDUT..W11641(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ POSTER TILL VIPS                                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11640D4 DD  DSN=&&TEMPFIL,DISP=(NEW,PASS,DELETE),                            
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
