//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELINFO TOTALFIL TILL VIPS.                                            
//*  BESTÄLLS OCH SKICKAS VIA DISTRIBUTION PRINT.                               
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W116S3                           
//*                                                                             
//*  RESTART:      W11663    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W116..W116D1,                                            
//             INDIN2=&W116..W116D4,                                            
//             INDUT=&W116..W116S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11663   EXEC PGM=W11663                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//SYSINPUT DD  DUMMY                                        -- POSTSUM          
//W11663D1 DD  DUMMY                                                            
//************ VCOM ID                                                          
//W11663D2 DD  DSN=&INDIN1..W11690(+0),DISP=SHR                                 
//         DD  DSN=&INDIN2..W11690(+0),DISP=SHR                                 
//************ PART INFORMATION REGISTER FROM W116D1 AND W116D4                 
//*                                                                             
//W11663D3 DD  DSN=&INDUT..W11663(+1),DISP=(NEW,CATLG,DELETE), -LIM(03)         
//************ PART INFORMATION VIPS                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
