//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGAR TILL AUSTRALIEN, JAPAN OCH INDIEN.                            
//*  UPPDATERAR TIERSDAT-VIPS.                                                  
//*                                                                             
//*  FREKVENS:     DAG     RTN W116D4                                           
//*                                                                             
//*  ÅTERSTART:    W1167D    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P27D PROC STPLIB=&INDRTE..LOAD,                                           
//*                                                                             
//             INDIN=&W116..W116D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1167D   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W1167D,W1167D,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W1167DD1 DD  DSN=&INDIN..W1166B(+0),DISP=SHR                                  
//************ ERSATTA ARTIKLAR AU/JP/IN, TIERSDAT-VIPS                         
//*                                                                             
