//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELINFO TILL IMPORTÖR TOTALFIL BESTÄLLD.                               
//*  RUTIN: W116S2. BESTÄLLS OCH SKICKAS VIA VCOM.                              
//*                                                                             
//*  FREKVENS:     ORDERED                                                      
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D6,                                             
//             INDIN2=&W011..W011S1,                                            
//             INDUT=&W116..W116S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT    EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDRTE..CONSTANT(W1162401),DISP=SHR                         
//         DD  DSN=&INDRTE..CONSTANT(W1162402),DISP=SHR                         
//         DD  DSN=&INDRTE..CONSTANT(W1162403),DISP=SHR                         
//SORTOUT  DD  DSN=&&W11626,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEB                                                    
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD26),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11626   EXEC PGM=V16459,PARM='W11626/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//SYSINPUT DD  DUMMY                                                            
//W11626D1 DD  DSN=&&W11626,DISP=(OLD,DELETE,DELETE)                            
//************ ART-INFO TOTALFIL FRÅN SENASTE KÖRNING                           
//*                                                                             
//W11626D2 DD  DSN=&INDIN..W11615(+0),DISP=SHR                                  
//************ ART-INFO TOTALFIL FRÅN SENASTE KÖRNING                           
//*                                                                             
//W11626D3 DD  DSN=&INDIN2..W01178(+0),DISP=SHR                                 
//************ ART-INFO TURKISK BEART                                           
//*                                                                             
//W11626D4 DD  DSN=&INDUT..W11626(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SAMMA TOTFIL BEARBETAD FÖR BESTÄLLANDE LAND                      
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEB                                  
//*                                                                             
