//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W11610 OCH W11612                                                  
//*  OCH SKAPAR UTFIL W11612                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W116D1                                         
//*                                                                             
//*  RESTART:      W11619    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D1,                                             
//             INDUT=&W116..W116D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11619   EXEC PGM=V16459,PARM='W11619/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W11619D1 DD  DSN=&INDIN..W11610(+0),DISP=SHR                                  
//************ FIL FRÅN W11610                                                  
//*                                                                             
//W11619D2 DD  DSN=&INDIN..W11612(+0),DISP=SHR                                  
//************ FIL FRÅN W11612                                                  
//*                                                                             
//W11619D3 DD  DSN=&INDUT..W11612(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ W11612 OUT                                                       
//************ SAMMA SOM D2 MED UTBYTT KDSTANAUTG OCH FLOVRLAG                  
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
