//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE VSIM REGISTER FILE CONTAINING PART INFO                             
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W116D7                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W1166D    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P06D PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..QASE,                                              
//             INDIN2=&W011..NDC,                                               
//             INDUT=&W116..W116D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD6D),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01103(+0),DISP=SHR                                 
//************ SUPERSESSIONS                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W01103C,DISP=(NEW,PASS,DELETE),                            
//************ SUPERSESSIONS: ONLY FLTXEXT = 'N' AND UNIQUE COMBOS              
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT02   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PE6D),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ PARTS AT NDC                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ PARTS AT LDC, NDC OR SDC COMBINED AND SORTED                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1166D   EXEC PGM=V16459,PARM='W1166D/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W1166DD1 DD  DSN=&INDIN1..W01160(+0),DISP=SHR                                 
//************ PART INFO FROM WDK6                                              
//*                                                                             
//W1166DD2 DD  DSN=&INDIN1..W01166(+0),DISP=SHR                                 
//************ PART INFO FROM WDD2                                              
//*                                                                             
//W1166DD3 DD  DSN=&INDIN1..W01174(+0),DISP=SHR                                 
//************ PART INFO FROM WDD3                                              
//*                                                                             
//W1166DD4 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ PART INFO FROM WDK7                                              
//*                                                                             
//W1166DD5 DD  DSN=&&W01103C,DISP=(OLD,DELETE,DELETE)                           
//************ UNIQUE COMBOS SUPERSEDING PARTS -> SUPERSEDED PARTS              
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMPFIL1,DISP=(NEW,PASS,DELETE),                           
//************ PART INFO BASED ON WDK6, WDD2 AND WDD3                           
//             DATACLAS=PSEB                                                    
//**166DD6 DD  DSN=&INDUT..W1166DA(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//W1166DD6 DD  DSN=&&W1166DA,DISP=(NEW,PASS,DELETE),                            
//************ PART INFO BASED ON WDK6, WDD2 AND WDD3 PLUS WDD7                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMPFIL2,DISP=(NEW,PASS,DELETE),                           
//************ PART INFO BASED ON WDK7, WDK6, WDD2 AND WDD3                     
//             DATACLAS=PSEB                                                    
//*1166DD7 DD  DSN=&INDUT..W1166DB(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//W1166DD7 DD  DSN=&&W1166DB,DISP=(NEW,PASS,DELETE),                            
//************ PART INFO BASED ON WDK7, WDK6, WDD2 AND WDD3 PLUS WDD7           
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT03   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PF6D),DISP=SHR                         
//SORTIN   DD  DSN=&&W1166DA,DISP=(OLD,DELETE,DELETE)                           
//************ PARTS PROCURED AT CDC 11                                         
//         DD  DSN=&&W1166DB,DISP=(OLD,DELETE,DELETE)                           
//************ PARTS PROCURED AT CDC 41 OR 71                                   
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W1166D(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ PART INFO BASED ON WDK6, WDK7, WDD2, WDD3 AND WDD7               
//************ PARTS PROCURED AT CDC 11, 41 OR 71                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
