//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER PRISER TILL MARKNADSBOLAGSVALUTA                                     
//*  SJÄLVKOST MED BESTÄLLNINGSPRIS(SEK)/SJÄLVKOST SOM ÄR                       
//*  OMRÄKNAR MED MÅNADSVALUTA.                                                 
//*                                                                             
//*  FREKVENS:     DAG     RTN W116S3                                           
//*                                                                             
//*  ÅTERSTART:    W11681      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W116..W116S3,                                            
//             INDUT=&W116..W116S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11681   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11681,W11681,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDB1BK   DD   DSN=&INDBAS..WDB1BK,DISP=SHR                                    
//*                                                                             
//W11681D1 DD  DSN=&INDIN1..W11663(+0),DISP=SHR                                 
//************ FIL FRÅN W116P068                                                
//*                                                                             
//W11681D2 DD  DSN=&INDUT..W11681(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* TO REPLACE ¤MQMPROP HEADERS BY ¤DAP HEADERS                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2   EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDUT..W11681(+1),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W11681,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PE82),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
