//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR ART-FILER/ W11604                                                  
//*  SKAPAR UTFIL W11614                                                        
//*  SOM LIGGER TILL GRUND FÖR ÄNDRINGSKONTROLLEN I PGM: W11624                 
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116,                                                     
//             INDREG=&W011..&RTEGRP.,                                          
//             INDUT=&W116..W116D6,                                             
//             INDIN1=&W116..W116V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11608   EXEC PGM=V16459,PARM='W11608/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(150000,10000))                                      
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W11608D1 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ ARTIKELDATA                                                      
//*                                                                             
//W11608D2 DD  DSN=&INDREG..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGAR                                                      
//*                                                                             
//W11608D3 DD  DSN=&INDIN..W11604(+0),DISP=SHR                                  
//************ BUY-BACK FIL FRÅN W116J004 W116V1                                
//*                                                                             
//W11608D4 DD  DSN=&INDUT..W11614(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELINFO TILL VIPS (BUYBACK-KOD MM)                           
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11608D5 DD  DSN=&INDIN1..W11686(+0),DISP=SHR                                 
//************ CROSSFIL FRÅN W116V1                                             
//*                                                                             
//*                                                                             
//W11608D6 DD  DSN=&INDREG..W01169(+0),DISP=SHR                                 
//************ GEMENSAM ART INFO VCC-KDP OCH FORD                               
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,PASS,DELETE),                               
//************ ARTIKELUPPGIFTER MELLANFIL                                       
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,PASS,DELETE),                               
//************ ARTIKELUPPGIFTER MELLANFIL                                       
//             DATACLAS=PSEB                                                    
//*                                                                             
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP,DISP=(NEW,PASS,DELETE),                               
//************ ARTIKELUPPGIFTER MELLANFIL                                       
//             DATACLAS=PSEB                                                    
//*                                                                             
