//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BEVAKAR ERSÄTTNINGAR TILL VIPS                                             
//*                                                                             
//*  FREKVENS:     DAG         RTN W116D2                                       
//*                                                                             
//*  ÅTERSTART:    W1163000  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W116..W116D2,                                            
//             INDREG=&W116,                                                    
//             INDUT=&W116..W116D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1163000 EXEC PGM=V16459,PARM='W11630/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W11630D1 DD  DSN=&INDIN2..W11633(0),DISP=SHR                                  
//************ FIL FROM W11632                                                  
//*                                                                             
//W11630D2 DD  DSN=&INDREG..W11635(0),DISP=SHR                                  
//************ INPUT FIL                                                        
//*                                                                             
//W11630D3 DD  DSN=&INDUT..W11631(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ POSTER TILL VIPS                                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11630D4 DD  DSN=&&TEMPFIL,DISP=(NEW,PASS,DELETE),                            
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
