//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGSINFO TILL CANADA TOTALFIL BESTÄLLD.                             
//*  RUTIN: W116S8. BESTÄLLS OCH SKICKAS VIA VCOM.                              
//*                                                                             
//*  FREKVENS:     ORDERED                                                      
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W116,                                                    
//             INDIN=&W011..NDC,                                                
//             INDUT=&W116..W116S8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT ONLY DC51 RECORDS FROM NDC FILE                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01  EXEC PGM=SORT                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD74),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11674   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11674,W11674,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//*                                                                             
//W11674D1 DD  DSN=&INDREG..W11635(+0),DISP=SHR                                 
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//W11674D2 DD  DSN=&INDUT..W11674(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ERSÄTTNINGSINFO TILL CANADA                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W11674D3 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ CANADA ARTIKLAR                                                  
//*                                                                             
