//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W01184, ARTFIL, W11604                                               
//*  OCH SKAPAR UTFIL W11610                                                    
//*  SOM LIGGER TILL GRUND FÖR ÄNDRINGSKONTROLLEN I PGM: W11620                 
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W116,                                                    
//             INDIN=&W116..W116D1,                                             
//             INDREG2=&W011..NDC,                                              
//             INDUT=&W116..W116D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD22),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG2..W01184(+0),DISP=SHR                                
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11610   EXEC PGM=V16459,PARM='W11610/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(150000,10000))                                      
//SORTMSG  DD  SYSOUT=*                                                         
//W11610D1 DD  DSN=&INDIN1..W11603(+0),DISP=SHR                                 
//************ BUY-BACK FIL FRÅN W116V1                                         
//*                                                                             
//W11610D2 DD  DSN=&INDIN..W11609(+0),DISP=SHR                                  
//************ ARTIKELINFO FRÅN WDK6 OCH WDK7                                   
//*                                                                             
//W11610D3 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKELINFO FRÅN  NDC                                            
//*                                                                             
//TEMPFIL1 DD  DATACLAS=PSEB                                                    
//************                                                                  
//*                                                                             
//NDCFIL   DD  DATACLAS=PSEB                                                    
//************                                                                  
//*                                                                             
//W11610D4 DD  DSN=&INDUT..W11610(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELINFO TILL VIPS (BUYBACK-KOD MM)                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
