//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W01160(0) OCH W116.W11642(0)                                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W116D3                                           
//*                                                                             
//*  ÅTERSTART:    W11642    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDREG=&W116.,                                                   
//             INDUT=&W116..W116D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11642   EXEC PGM=V16459,PARM='W11642/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W11642D1 DD  DSN=&INDIN..W01160(0),DISP=SHR                                   
//************ ARTIKELDATA                                                      
//*                                                                             
//W11642D2 DD  DSN=&INDREG..W11642(0),DISP=SHR                                  
//************ REGISTER-IN ARTNR/KDERS                                          
//*                                                                             
//W11642D3 DD  DSN=&INDREG..W11642(+1),                         -LIM(3)         
//************ REGISTER-UT ARTNR/KDERS                                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11642D4 DD  DSN=&INDUT..W11643(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELDATA FÖRÄNDRAD KDERS                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
