//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE FILE CONTAINING PART INFO DELTA TO SEND TO VSIM                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W116D7                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W1166F    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P06F PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W116..W116D7,                                             
//             INDUT=&W116..W116D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1166F   EXEC PGM=V16459,PARM='W1166F/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W1166FD1 DD  DSN=&INDIN..W1166E(+0),DISP=SHR                                  
//************ PART INFO FROM TODAY                                             
//*                                                                             
//W1166FD2 DD  DSN=&INDIN..W1166E(-1),DISP=SHR                                  
//************ PART INFO FROM YESTERDAY                                         
//*                                                                             
//W1166FD3 DD  DSN=&INDUT..W1166F(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ PART INFO DELTA TO SEND TO VSIM                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
