//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE VSIM INITIAL FILE WITH PACKAGING INFO (1 TIME JOB)                  
//*                                                                             
//*  FREQUENCE:    1 TIME    RTN W116D7                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W1166G    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W116P06G PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W116..W116D7,                                            
//             INDIN2=&W116..W116D7,                                            
//             INDUT=&W116..W116D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PD6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..DL1PR.WDK6,DISP=SHR                                 
//************ DL1PR OF WDK6                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&WDK611,DISP=(NEW,PASS,DELETE),                             
//************ WDK611 SEGMENTS, PACKAGING PARTS (IDARTNR-EMBQ0/1/2)             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT02   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PE6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..DL1PR.WDK6,DISP=SHR                                 
//************ DL1PR OF WDK6                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&WDK613,DISP=(NEW,PASS,DELETE),                             
//************ WDK613 SEGMENTS, EXTRA PACKAGING PARTS (IDARTNR-EMBX)            
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT03   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PF6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..DL1PR.WDK7,DISP=SHR                                 
//************ DL1PR OF WDK7                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&WDK712,DISP=(NEW,PASS,DELETE),                             
//************ WDK712 SEGMENTS, PACKAGING PARTS (IDARTNR-EMBQ0/1/2)             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT04   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PG6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..DL1PR.WDK7,DISP=SHR                                 
//************ DL1PR OF WDK7                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&WDK726,DISP=(NEW,PASS,DELETE),                             
//************ WDK726 SEGMENTS, EXTRA PACKAGING PARTS (IDARTNR-EMBX)            
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT05   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PH6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..DL1PR.WDB6,DISP=SHR                                 
//************ DL1PR OF WDB6                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&WDB601,DISP=(NEW,PASS,DELETE),                             
//************ WDB601 SEGMENT, IDDC-IDLANDX2-IDLEVNR-EMB CROSSREF               
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT06   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PI6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W1166D(+0),DISP=SHR                                 
//************ PART INFO BASED ON WDK6, WDK7, WDD2, WDD3 AND WDD7               
//************ PARTS PROCURED AT 11, 41 OR 71                                   
//*                                                                             
//SORTOUT  DD  DSN=&&W1166D,DISP=(NEW,PASS,DELETE),                             
//************ PART INFO BASED ON WDK6, WDK7, WDD2, WDD3 AND WDD7               
//************ PARTS PROCURED AT 41 OR 71  (DC 11 HAS BEEN OMITTED)             
//************ SORTED BY IDDC                                                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W1166G   EXEC PGM=V16459,PARM='W1166G/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W1166GD1 DD  DSN=&&WDK611,DISP=(OLD,DELETE,DELETE)                            
//************ WDK611 SEGMENTS, PACKAGING PARTS (IDARTNR-EMBQ0/1/2)             
//*                                                                             
//W1166GD2 DD  DSN=&&WDK613,DISP=(OLD,DELETE,DELETE)                            
//************ WDK613 SEGMENTS, EXTRA PACKAGING PARTS (IDARTNR-EMBX)            
//*                                                                             
//W1166GD3 DD  DSN=&INDUT..W1166G.WDK6(+1),                    -LIM(3)          
//************ VSIM PART, PARTNER COMBINATIONS WITH PACKAGING PARTS             
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W1166GD4 DD  DSN=&&WDK712,DISP=(OLD,DELETE,DELETE)                            
//************ WDK712 SEGMENTS, PACKAGING PARTS (IDARTNR-EMBQ0/1/2)             
//*                                                                             
//W1166GD5 DD  DSN=&&WDK726,DISP=(OLD,DELETE,DELETE)                            
//************ WDK726 SEGMENTS, EXTRA PACKAGING PARTS (IDARTNR-EMBX)            
//*                                                                             
//W1166GDF DD  DSN=&&WDK7T,DISP=(NEW,PASS,DELETE),                              
//************ WDK7 PARTS BEFORE POSSIBLE ADDITION OF K6 Q0/1/2                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//W1166GD6 DD  DSN=&INDUT..W1166G.WDK7.TEMP(+1),               -LIM(3)          
//************ VSIM PART, PARTNER COMBINATIONS WITH PACKAGING PARTS             
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W1166GD7 DD  DSN=&&WDB601,DISP=(OLD,DELETE,DELETE)                            
//************ WDB601 SEGMENT, IDDC-IDLANDX2-IDLEVNR-EMB CROSSREF               
//*                                                                             
//W1166GD8 DD  DSN=&&W1166D,DISP=(OLD,DELETE,DELETE)                            
//************ PART INFO BASED ON WDK6, WDK7, WDD2, WDD3 AND WDD7               
//************ PARTS PROCURED AT 41 OR 71  (DC 11 HAS BEEN OMITTED)             
//************ SORTED BY IDDC                                                   
//*                                                                             
//W1166GD9 DD  DSN=&INDUT..W1166G.W1166D.TEMP(+1),             -LIM(3)          
//************ PART INFO AT NDC WITH IDLANDX2 AND IDLEVNR-EMB ADDED             
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W1166GDA DD  DSN=&INDUT..W1166G.WDK7(+1),                    -LIM(3)          
//************ VSIM PART, PARTNER COMBINATIONS WITH PACKAGING PARTS             
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT07   EXEC PGM=SORT,REGION=8M                                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W116PJ6G),DISP=SHR                         
//SORTIN   DD  DSN=&INDUT..W1166G.WDK6(+1),DISP=(OLD,KEEP,KEEP)                 
//         DD  DSN=&INDUT..W1166G.WDK7(+1),DISP=(OLD,KEEP,KEEP)                 
//************ PART INFO BASED ON WDK6, WDK7, WDD2, WDD3 AND WDD7               
//************ PARTS PROCURED AT 11, 41 OR 71                                   
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W1166G(+1),                         -LIM(3)          
//************ VSIM PART, PARTNER COMBINATIONS WITH PACKAGING PARTS             
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
