//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VALIDATE PRINS/TC-PLM PART INPUT                                           
//*                                                                             
//*  FREKVENS:     DAILY               RTN W118D1                               
//*                                                                             
//*  ÅTERSTART:    W11811   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W118P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             DBB=DLI,                                                         
//             INDIN=&W118..W118D1,                                             
//             INDUT=&W118..W118D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W11811   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W11811,W11811,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDJ1     INCLUDE MEMBER=WDJ1                                                  
//WDF5     INCLUDE MEMBER=WDF5                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W11811D1 DD  DSN=&INDIN..W11810(0),DISP=SHR                                   
//************ FILE FROM PRINS/TCPLM                                            
//*                                                                             
//W11811D2 DD  DSN=&INDUT..W11811(+1),DISP=(NEW,CATLG,DELETE),  -LIM( )         
//*************FILE TO BE PROCESSED BY DISPATCHER FOR PARTS CREATION            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W11811D3 DD  DSN=&INDUT..W11814(+1),DISP=(NEW,CATLG,DELETE),  -LIM( )         
//************ ERROR FILE TO PARTS PLANNER                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
