//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA RS-BENÄMNINGAR                                                       
//*                                                                             
//*  FREKVENS:     PV-PERIOD           RTN W121PV                               
//*                                                                             
//*  ÅTERSTART:    W12108      NORMAL                                           
//*                LÄSER        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W121P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W121..W121PV,                                             
//             INDUT=&W121..W121PV                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W12108   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W12108,W12108,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W12108D1 DD  DSN=&INDIN..W12103(+0),DISP=SHR                                  
//************ FIL MED RS-UNIKA BENÄMNINGAR ,RENSADE                            
//************ BENÄMNINGAR OCH FELFLAGGADE ARTIKLAR                             
//*                                                                             
//W12108D2 DD  DSN=&INDUT..W12108(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ W12108-001  LISTA MED RS-UNIKA BENÄMNINGAR                       
//************ SOM FIL TILL D&P                                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
