//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR WDD3                                                            
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W121Q1                                      
//*                                                                             
//*  ÅTERSTART:    NORMAL BMP                                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W121P014 PROC CPU=1,                                                          
//             STPLIB=&INDRTE..LOAD,                                            
//             INDIN=&W121..W121Q1,                                             
//             INDUT=&W121..W121Q1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W12114   EXEC PGM=DFSRRC00,                                                   
// PARM=('BMP,W12114,W12114,,,N00,,,,,&CPU,,,&IMS')                             
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W12114D1 DD  DSN=&INDIN..W12113(+0),DISP=SHR                                  
//************ BENÄMNINGAR UTAN ARTIKLAR SOM SKA TAS BORT                       
//*                                                                             
//W12114D2 DD  DSN=&INDUT..W12114(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ BENÄMNINGAR SOM DEFACTO HAR TAGITS BORT                          
//************ INFO TILL NEVIS I W159D2                                         
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
//*                                                                             
