//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER INFIL UPPDATERAR WDN6                                                
//*                                                                             
//*  FREKVENS:     BESTÄLLNING  RTN W122B1                                      
//*                                                                             
//*  ÅTERSTART:    W12240    BACKOUT VIA SOP                                    
//*                         UPPDATERAR WDN6                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W122P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W122..W122B1                                              
//W12240   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W12240,W12240,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DSN=&INDPLOG..W122P040(+1),                                      
//             DISP=(NEW,CATLG,CATLG),                                          
//             DCB=(RECFM=VB,LRECL=6229,BLKSIZE=27998,BUFNO=5),                 
//             SPACE=(CYL,(10,10),RLSE),                                        
//             MGMTCLAS=&EMID70                                                 
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDN6     INCLUDE MEMBER=WDN6                                                  
//*                                                                             
//W12240D1 DD  DSN=&INDIN..W12225(+0),DISP=SHR                                  
//************ **** INFIL ******                                                
//*                                                                             
