//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR KATALOG-LEXIKON-DATABASERNA WDN2,WDN3,WDN4                      
//*  MED NYA ÖVERSATTA TEXTER. SAMT BENREG WDD3 OCH KTRL-REG WL120511           
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W152B1                                     
//*                                                                             
//*  ÅTERSTART:    W15212    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W152P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W152..W152B1,                                             
//             GEN='(+0)',                                                      
//             INDUT=&W152..W152B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W15212   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W15212,W15212,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W15212D1 DD  DSN=&INDIN..W15210&GEN.,DISP=SHR                                 
//************ UPPDATERINGSPOSTER                                               
//*                                                                             
//W15212D2 DD  DSN=&INDUT..W15212(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FEL-POSTER                                                       
//             SPACE=(80,(5,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W15212D3 DD  DSN=&INDUT..W15214(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMOFIL                                                          
//             SPACE=(80,(5,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W15212D4 DD  DSN=&INDUT..W15215(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FELINFO TILL ÖVERSÄTTNINGSBYRÅN SPS                              
//************ RÖRANDE TRUNKERADE RUBRIKER OCH FOTNOTER                         
//             SPACE=(80,(5,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
