//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NEW PARTS UNIQUE DESCRIPTIONS LIST                                         
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W152V1                                         
//*                                                                             
//*  RESTART:      W15230    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W152P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..PARTINFO,                                           
//             INDIN2=&W152..W152V1,                                            
//             INDUT=&W152..W152V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W15230   EXEC PGM=V16459,PARM='W15230/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W15230D1 DD  DSN=&INDIN..WCDCDAY(+0),DISP=SHR                                 
//************ DAILY PART NUMBER REGISTRY FILE EXTRACT                          
//*                                                                             
//W15230D2 DD  DSN=&INDIN2..WDD3XTR(+0),DISP=SHR                                
//************ WDD3 EXTRACT DL1PR CREATED IN PREVIOUS JOB                       
//*                                                                             
//W15230D3 DD  DSN=&INDIN2..W15230DA(+0),DISP=SHR                               
//************ RUN DATE FILE (PREVIOUS RUN)                                     
//*                                                                             
//W15230D4 DD  DSN=&INDIN2..W15230DA(+1),DISP=(NEW,CATLG,DELETE), -LIM(9        
//************ RUN DATE FILE (THIS RUN)                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W15230D5 DD  DSN=&INDUT..W15230(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ OUTPUT FILE WITH ALL NEW DESCRIPTION                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
