//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EN URVALSFIL MED ARTIKELDATA TILL NEVIS                             
//*                                                                             
//*  FREKVENS:     DAG     RTN W159D1                                           
//*                                                                             
//*  ÅTERSTART:    W15901      NORMAL                                           
//*                LÄSER        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W159PX01 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W159..W159D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W15901   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W15901,W15901,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W15901D1 DD  DSN=&INDIN2..W01160(0),DISP=SHR                                  
//************ DAGLIGT ARTIKELLAGERBAND                                         
//*                                                                             
//W15901D2 DD  DSN=&INDUT..W15901(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ EXTRAKT AV ARTIKLAR UR DAGLAGERBAND TILL NEVIS                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
