//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      UPPDATERING BESTÄLLNINGAR OCH AVTAL (FAST INTE HÄR)          *         
//*                                                                   *         
//*      PERIODICITET: DAG                                            *         
//*                                                                   *         
//*      ÅTERSTART:    W21202 NORMAL                                  *         
//*                           LÄSER WDK6 WDD9 OCH WDF1                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W212P002 PROC INDIN2=&W092..W200D1,                                           
//             INDUT=&W212..W200D1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21202  EXEC PGM=DFSRRC00,                                                    
//             PARM='&DBB,W21202,W21202,,00'                                    
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//*                                                                             
//W21202D1 DD  DSN=&INDIN2..W09222,DISP=SHR                                     
//************** R22 OCH R23 FRÅN TRATT                                         
//*                                                                             
//         DD  DSN=&INDIN2..W0924C,DISP=SHR                                     
//************** R22 OCH R23 FRÅN STANSBILD                                     
//*                                                                             
//W21202D3 DD  DSN=&INDUT..W21205(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************** FELPOSTER TILL UTTRATTEN                                       
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//W21202D4 DD  DSN=&INDUT..W21211(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************** R22:OR TILL NYPON (W114)                                       
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//W21202D5 DD  DSN=&INDUT..W21203(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** DATABASUPPDATERINGAR TILL W21203                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W21202D6 DD  DSN=&INDUT..W21231(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** HTYP 2222 TILL W213                                            
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W21202D7 DD  DSN=&INDUT..W21232(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** HTYP 2213 OCH 2204 TILL BMP FÖR UPPLÄGG                        
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
