//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NER LEVERANTÖRDATA                                                   
//*  TILL UTFILER                                                               
//*                                                                             
//*  FREKVENS:     DAG     RTN W213D1                                           
//*                                                                             
//*  ÅTERSTART:    W21318      NORMAL                                           
//*                LÄSER        WDF1                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W213P018 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W213..W213D1,                                             
//             INDUT2=&WXTR..W213D1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21318   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W21318,W21318,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDF1     INCLUDE MEMBER=WDF1                                                  
//W21318D1 DD  DSN=&INDUT..W21319(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LEVERANTÖRDATA                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W21318D2 DD  DSN=&INDUT2..W21320(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ LEVERANTÖRDATA WXTR                                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W21318D3 DD  DSN=&&W21320X,DISP=(NEW,PASS,DELETE),                            
//************ LEVERANTÖRDATA AZURE                                             
//             DATACLAS=PSEN                                                    
