//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FIL  LISTA LEVERANTÖRER VCC                                                
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD     RTN W213P1                              
//*                                                                             
//*  ÅTERSTART:    W21323    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W213P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W213..W213P1,                                             
//             INDIN=&W213..W213P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21323   EXEC PGM=W21323                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W21323D1 DD  DSN=&INDIN..W21323(+0),DISP=SHR                                  
//************ NEDLÄST WDF1                                                     
//W21323D2 DD  DSN=&INDUT..W21324(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ LISTA LEVERANTÖRER                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//*                                                                             
