//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONKATENERING AV HÄNDELSEFILER                                             
//*                                                                             
//*  FREKVENS:     DAG    RTN W200D1                                            
//*                                                                             
//*  ÅTERSTART:    ICEGENER  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W213P035 PROC INDIN=&W212..W200D1,                                            
//             INDIN2=&W217..W200D1,                                            
//             INDIN3=&W213..W200D1,                                            
//             INDIN4=&W213..W200D1,                                            
//             INDUT=&W213..W200D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W21232(+0),DISP=SHR                                  
//************ HÄNDELSER FRÅN W212P002                                          
//*                                                                             
//         DD  DSN=&INDIN2..W21732(+0),DISP=SHR                                 
//************ HÄNDELSER FRÅN W217P002                                          
//*                                                                             
//         DD  DSN=&INDIN3..W21312(+0),DISP=SHR                                 
//************ HÄNDELSER FRÅN W213P012                                          
//*                                                                             
//         DD  DSN=&INDIN4..W21332(+0),DISP=SHR                                 
//************ HÄNDELSER FÅPN W213P032                                          
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W21336(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ HÄNDELSER KONKATENERADE PÅ EN FIL                                
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
