//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TÖMMER HÄNDELSE 2222 (OBS DÅ PGMET KAN OMSTARTAS                           
//*  SKRIVS UTFIL EV. I FLERA GENERATIONER)                                     
//*                                                                             
//*  FREKVENS:     DAG    RTN W200D1                                            
//*                                                                             
//*  ÅTERSTART:    W21330    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W213P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W213..W200D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21330   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W21330,W21330,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W21330D1 DD  DSN=&INDUT..W21331(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ NEDLÄSTA HÄNDELSE 2222                                           
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W21330D2 DD  DSN=&INDUT..W21330(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ HJÄLP-FIL FÖR OMSTART (NORMALT TOM)                              
//             SPACE=(10,(1),RLSE),AVGREC=U,                                    
//             MGMTCLAS=DEL2                                                    
