//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ADJUST KDP FILE TO PULS STD                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W215D1                                         
//*                                                                             
//*  RESTART:      W21509    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W215P009 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//             INDIN=&W215..W215D1,                                             
//             INDUT=&W215..W215D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21509   EXEC PGM=V16459,PARM='W21509/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W21509D1 DD  DSN=&INDIN..W21501(+0),DISP=SHR                                  
//************ INFIL W21501 FROM KDP                                            
//*                                                                             
//W21509D2 DD  DSN=&INDUT..W21509(+1),DISP=(NEW,CATLG,DELETE), -LIM(            
//************ OUTFILE W21509                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
