//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W215D1                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W21510    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W215P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W215..W215D1,                                             
//             INDUT=&W215..W215D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT         EXEC PGM=SORT                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W215PD10),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W21509(+0),DISP=SHR                                  
//************ W21501+0                                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W21503,DISP=(NEW,PASS,DELETE),                             
//************ SORTOUT1                                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2        EXEC PGM=SORT                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W215PD10),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W21509(-1),DISP=SHR                                  
//************ W21501-1                                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W21504,DISP=(NEW,PASS,DELETE),                             
//************ SORTOUT2                                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21510   EXEC PGM=W21510                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W21510D1 DD  DSN=&&W21503,DISP=(OLD,DELETE,DELETE)                            
//************ SORTOUT1                                                         
//*                                                                             
//W21510D2 DD  DSN=&&W21504,DISP=(OLD,DELETE,DELETE)                            
//************ SORTOUT2                                                         
//*                                                                             
//W21510D3 DD  DSN=&INDUT..W21505(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ MERGED OUTFILE                                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
