//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CLASSIC                                                                    
//*                                                                             
//*  FREKVENS:     DAG       RTN W216V1                                         
//*                                                                             
//*  ÅTERSTART:    W21641    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W216P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W216..W216V1,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDIN3=&W910,                                                    
//             INDIN4=&W335..W216V1,                                            
//             INDUT=&W216..W216V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21641   EXEC PGM=V16459,PARM='W21641/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(2000,1000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W21641D1 DD  DSN=&INDIN..W21637,DISP=SHR                                      
//************ FIL FRÅN W216P032  SKROT UNDER VECKAN                            
//*                                                                             
//W21641D2 DD  DSN=&INDIN2..W01162(+0),DISP=SHR                                 
//************ FIL FRÅN W011  MED NOTERINGAR                                    
//*                                                                             
//W21641D3 DD  DSN=&INDIN3..W91042(+0),DISP=SHR                                 
//************ FIL FRÅN W910  MED ARTIKELDATA                                   
//*                                                                             
//W21641D4 DD  DSN=&INDIN4..W3350F(+0),DISP=SHR                                 
//************ FIL FRÅN W335  MED BRUTTOPRISER                                  
//*                                                                             
//W21641D5 DD  DSN=&INDIN3..W91028(+0),DISP=SHR                                 
//************ FIL FRÅN W910  MED KATALOG-EMBLEM                                
//*                                                                             
//W21641D6 DD  DSN=&INDUT..W21641(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL FÖR MEMO VIA PGM W21642                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
