//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CLASSIC NEDLÄSNING WDR3                                                    
//*                                                                             
//*  FREKVENS:     DAG         RTN W216D2                                       
//*                                                                             
//*  ÅTERSTART:    W21632      NORMAL                                           
//*                LÄSER       WDR3 WDD3                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W216P032 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W216..W216D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21632   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W21632,W21632,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR3     INCLUDE MEMBER=WDR3                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDJ1     INCLUDE MEMBER=WDJ1                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDL8     INCLUDE MEMBER=WDL8                                                  
//WDN6     INCLUDE MEMBER=WDN6                                                  
//*                                                                             
//W21632D1 DD  DSN=&INDUT..W21631(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ CLASSIC                                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W21632D2 DD  DSN=&INDUT..W21633(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ BORTTAG                                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W21632D3 DD  DSN=&INDUT..W21637(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOPIA AV W21631 TILL VECKORUTIN                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W21632D4 DD  DSN=&INDUT..W21634(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ CANCELATION TILL W114D5                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
