//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PART DATA FILE COMPLETED WITH ORDER INGÅNG                                 
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W217S6                           
//*                                                                             
//*  RESTART:      W21713    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W217P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W217..W217S6,                                            
//             INDIN2=&W217..W217R1,                                            
//             INDUT=&W217..W217S6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21713   EXEC PGM=V16459,PARM='W21713/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W21713D1 DD  DSN=&INDIN1..W2171101(+0),DISP=SHR                               
//************ PART DATA                                                        
//*                                                                             
//W21713D2 DD  DSN=&INDIN2..W2171201(+0),DISP=SHR                               
//************ ORDER INGÅNG                                                     
//*                                                                             
//W21713D3 DD  DSN=&INDUT..W2171301(+1),DISP=(NEW,CATLG,DELETE),                
//************ PART DATA WITH ORDER INGÅNG                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
