//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GFDH                                                                       
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W217S2                             
//*                                                                             
//*  ÅTERSTART:    W21799      NORMAL                                           
//*                LÄSER        WDR2 WDF5 WDDP                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W217P999 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W217..W217S2,                                             
//             DEST1=&CPRINT,                                                   
//             INDUT=&W217..W217S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDF5     INCLUDE MEMBER=WDF5                                                  
//WDDP     INCLUDE MEMBER=WDDP                                                  
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W21799D1 DD  DSN=&INDIN..W21709(+0),DISP=SHR                                  
//************ JGFJ                                                             
//*                                                                             
//W21799D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W21710-001  GJDF                                                 
//*                                                                             
//W21799D3 DD  DSN=&INDUT..W21710-002(+1),                      -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FDSY                                                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
