//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT TO LIST ALL CAMPAIGNS WITH RESERVED                                 
//*  CAMPAIGN MATERIAL                                                          
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W219S2                           
//*                                                                             
//*  RESTART:      W21917      NORMAL                                           
//*                READS        WDK6 WDK6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W219P017 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W219..W219S2,                                             
//             INDUT=&W219..W219S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21917   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W21917,W21917,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W21917D1 DD  DSN=&INDIN..W21901(+0),DISP=SHR                                  
//************ PARTS FROM CAMPAIGN DATABASE WDM211                              
//*                                                                             
//W21917D2 DD  DSN=&INDUT..W21917(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ CAMPAIGNS WITH RESERVED CAMPAIGN MATERIAL                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
