//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REMOVE CAMPAIGN (WDM2)                                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W219V1                                         
//*                                                                             
//*  RESTART:      W21907      NORMAL                                           
//*                READS        WDM2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W219P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W219..W219V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21907   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W21907,W21907,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDM2     INCLUDE MEMBER=WDM2                                                  
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDE4     INCLUDE MEMBER=WDE4                                                  
//W21907D1 DD  DSN=&INDUT..W21907(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ REMOVE CAMPAIGN (WDM2)                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
