//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NEDLÄSNING AV WDM211                                                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W219D1                                            
//*                                                                             
//*  ÅTERSTART:    W21901     BACKOUT VIA SOP                                   
//*                LÄSER  WDM2                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W219P101 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W219..W440V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21901   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W21901,W21901,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDM2     INCLUDE MEMBER=WDM2                                                  
//W21901D1 DD  DSN=&&W21901,DISP=(NEW,PASS,DELETE),                             
//************ TEMP-FIL ARTIKLAR PÅ KAMPANJREGISTRET WDM2                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W219PD01),DISP=SHR                         
//SORTIN   DD  DSN=&&W21901,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDM2 INFO                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W21901(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD FIL MED WDM2                                            
//             MGMTCLAS=&DEL2BKPC,                                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
