//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  XXX                                                                        
//*                                                                             
//*  FREKVENS:     RTN W219S1                                                   
//*                                                                             
//*  ÅTERSTART:    W21912    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W219P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W219..W219S1,                                             
//             INDUT=&W219..W219S1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W21912   EXEC PGM=W21912                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                    -- ABEND         
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W21912D1 DD  DSN=&INDIN..W21910(+0),DISP=SHR                                  
//************ +0                                                               
//*                                                                             
//W21912D2 DD  DSN=&INDIN..W21910(-1),DISP=SHR                                  
//************ -1                                                               
//*                                                                             
//W21912D3 DD  DSN=&INDUT..W21912(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
