//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSAR LARM 200 O 210                                                      
//*  OM DE EJ LÄNGRE GÄLLER                                                     
//*                                                                             
//*  FREKVENS:     DAGLIGEN             RTN W221S2                              
//*                                                                             
//*  ÅTERSTART:    W22104    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P004 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W221..W221S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22104   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W22104,W22104,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//*                                                                             
//W22104D1 DD  DSN=&INDUT..W22104A(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)        
//************ LOG FILE FOR ALARMS DELETED FROM WDGX2224                        
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
