//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE SUPERCEEDED PART NUMBERS                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W221V3                                         
//*                                                                             
//*  RESTART:      W22178    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P078 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//*                                                                             
//             INDIN=&W221..W221V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22178   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W22178,W22178,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22178D1 DD  DSN=&INDIN..W22177(+0),DISP=SHR                                  
//************ INPUT FROM W2217700                                              
//*                                                                             
