//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EN FIL AV KORT FRÅN STANDARD-SUBMITBILD                             
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W221S1                              
//*                                                                             
//*  ÅTERSTART:    W22134   NORMAL                                              
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P034 PROC INDUT=&W221..W200V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22134   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DDNAME=KORTIN                                                    
//************ KORT SOM LIGGER PÅ HÄNDELSEBAS I STAND.SUBMITPKT                 
//*                                                                             
//SYSUT2   DD  DSN=&&W22135,DISP=(NEW,PASS,DELETE),                             
//************ FIL MED ANSKAFFARE SOM EJ SKALL HA LEV.PLANER                    
//             SPACE=(6160,(5,1),RLSE)                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22135  EXEC PGM=SORT                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221PD35),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTIN   DD  DSN=&&W22135,DISP=(OLD,PASS,DELETE)                              
//**************                                                    ***         
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W22135(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//**************                                                    ***         
//             SPACE=(6160,(5,1),RLSE),                                         
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
