//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BMP FÖR UPPDATERING AV AUTOMATISKA MAIL FÖR 220-LARM                       
//*  PÅ WDD4 OCH WDD925 --KINA--                                                
//*                                                                             
//*  FREKVENS:     DAG     RTN W221D7                                           
//*                                                                             
//*  ÅTERSTART:    W2212F    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P12F PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W221D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221PD2F),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W2212F(+0),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W2212F,DISP=(NEW,PASS,DELETE),                             
//************ KINA ARTIKLAR SORTERAT LEV-DC-ART UTAN DUBLETTER                 
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2212F   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W2212F,W2212F,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W2212FD1 DD  DSN=&&W2212F,DISP=(OLD,DELETE,DELETE)                            
//************ UPPDATERINGSPOSTER FRÅN PGM W2212E00                             
//*                                                                             
