//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÄNDRAR ÖVERSÄTTNINGSTABELL FÖR ANSK-LARM SAMT                              
//*  FLYTTAR LARMEN TILL RÄTT (NY) 'LARMANSKAFFARE'.                            
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W221B1                                      
//*                                                                             
//*  ÅTERSTART:    SORT      NORMAL                                             
//*                W22102    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W221B1,                                             
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22102(+0),DISP=SHR                                  
//************ MANUELLT EDITERAD FIL                                            
//************ MED ANSKAFFARE SAMT 'LARMANSKAFFARE'                             
//*                                                                             
//SORTOUT  DD  DSN=&&W22102,DISP=(NEW,PASS,DELETE),                             
//************ FIL SORTERAD PÅ ANSKAFFARE                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22102   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W22102,W22102,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W22102D1 DD  DSN=&&W22102,DISP=(OLD,DELETE,DELETE)                            
//************ FIL SORTERAD PÅ ANSKAFFARE                                       
//*                                                                             
