//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      RS ANSKAFFNING                                               *         
//*      UTSKRIFT BRISTLISTA FÖR BYTESDETALJER                        *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                    W22176 LÄSER WDD3                              *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W221P032 PROC INDIN=&W221..W200V1,                                            
//             STPLIB=&INDRTE..LOAD,DEST2=&CPRINT                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22176  EXEC PGM=DFSRRC00,                                                    
//             PARM='&DBB,W22176,W22176,,00'                                    
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VBS,LRECL=1400,BLKSIZE=1408,BUFNO=1)            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*       UTSKRIFT AV RÄKNEVERK (POSTSUM)                   
//*                                                                             
//W22176D1 DD  DSN=&INDIN..W22144(+0),DISP=SHR                                  
//**************                                                    ***         
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22176D2 DD  SYSOUT=(E,,3803),OUTPUT=(*.A4LF),                                
//**************      LISTA W22176-001 BRISTLISTA BYTES             ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121),                           
//             DEST=&DEST2                                                      
//*                                                                             
//WDD3     INCLUDE MEMBER=WDD3                                                  
