//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ALERT TO DELETE                                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W221D6                                         
//*                                                                             
//*  RESTART:      W22197    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P097 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDIN=&W221..W221D6,                                             
//             INDUT=&W221..W221D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22197   EXEC PGM=V16459,PARM='W22197/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W22197D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ PART DATA FROM WDK6                                              
//*                                                                             
//W22197D2 DD  DSN=&INDIN..W2219401(+0),DISP=SHR                                
//************ INSERTED ALERT FROM LAST UPDATE                                  
//*                                                                             
//W22197D3 DD  DSN=&INDUT..W22197(+1),DISP=(NEW,CATLG,DELETE),   -LIM(1)        
//************ ALERT TO BE DELETED                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
