//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA LEVERANSPLANER DIREKTÖVERFÖRING LOCAL PURCHASE ORDERS                
//*                                                                             
//*  FREKVENS:     DAG    RTN W221D8                                            
//*                                                                             
//*  ÅTERSTART:    W2216A    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P06A PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W221..W221D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2216A   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W2216A,W2216A,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W2216AD1 DD  DUMMY                                                            
//************ PARAMETER  DAG/PERIOD                                            
//W2216AD2 DD  DSN=&INDUT..W2216A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TILL ODETTE                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W2216AD3 DD  DSN=&INDUT..W2216B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DELETE WDGX2218                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
