//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERING TILL RVS-FIL                                                     
//*                                                                             
//*  RVS-FIL SKAPAS SOM GENERATIONSDATASET EFTER NY RELEASE AV RVS              
//*  FR.O.M 881019                                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W221D2                                            
//*                                                                             
//*  ÅTERSTART:    GENER   NORMAL                                               
//*                DFUP    NORMAL                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221GENR PROC DSIN=&W221..W221D2.W221XX(+0),                                  
//             STATION=XXX,LEVNR=00000                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER    EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&DSIN,DISP=SHR                                               
//************ LEVERANSPLANER                                                   
//*                                                                             
//SYSUT2   DD  DSN=RLK.RVD&STATION..L&LEVNR(+1),                                
//************ RVS-FIL                                                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             DCB=(RECFM=FB,LRECL=128,BLKSIZE=6144),                           
//             MGMTCLAS=&BACKUPC,SPACE=(6144,(100,30),RLSE)                     
//*                                                                             
