//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA ARTIKLAR SOM HAR FÅTT FÖRSLAG AUT GODK                               
//*                                                                             
//*  FREKVENS:     VECKA    RTN W221V1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W22123    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P123 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W221V1,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221PD23),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22154(+0),DISP=SHR                                  
//************ ARTIKLAR                                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W22154,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE ART                                                    
//         SPACE=(19,(1,3),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22123   EXEC PGM=W22123                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W22123D1 DD  DSN=&&W22154,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADE ART                                                    
//*                                                                             
//W22123D2 DD  DSN=&INDIN2..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGSREG                                                    
//*                                                                             
//W22123D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W22123-001  LISTA                                                
//*                                                                             
