//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LEVERANSPLANER TILL EDI, LOCAL PURCHASE KINA-NDC'R                         
//*                                                                             
//*  FREKVENS:     WEEK   RTN W224V2                                            
//*                                                                             
//*  ÅTERSTART:    SORT      NORMAL                                             
//*                W2216C    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P16C PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W224..W224V2,                                             
//             INDIN2=&W221..W221D3,                                            
//             CPU=1,                                                           
//             INDUT=&W224..W224V2,                                             
//             INDUT2=&W221..W221D3                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221PD6C),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22463(+0),DISP=SHR                                  
//************ INPUT TILL LEVERANSPLANER VIA ODETTE                             
//*                                                                             
//SORTOUT  DD  DSN=&&W22463,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD INPUT TILL ODETTE                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2216C   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W2216C,W2216C,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W2216CD1 DD  DSN=&&W22463,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD INPUT TILL ODETTE                                       
//*                                                                             
//W2216CD2 DD  DSN=&INDIN2..W2216E(+0),DISP=SHR                                 
//************ REGISTER IN                                                      
//*                                                                             
//W2216CD3 DD DSN=&INDUT2..W2216E(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ REGISTER UT                                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W2216CD4 DD  DSN=&INDUT..W2216C(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL TILL EDI, LOCAL PURCHASE KINA NDC                            
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
