//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDD9 SKAPAR FIL FÖR UPPDATERING AV WDG3 /                            
//*  2203/04                                                                    
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W221S3                             
//*                                                                             
//*  ÅTERSTART:    W2212A      NORMAL                                           
//*                LÄSER        WDD9 WDK6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P02A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W221..W221S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2212A   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W2212A,W2212A,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W2212AD1 DD  DUMMY                                                            
//************ PARMETER FILE                                                    
//W2212AD2 DD  DSN=&INDUT..W2212A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UPPDATERINGSPOSTER FÖR WDG3 2203/04                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
