//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ALERT TO DELETE                                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W221D6                                         
//*                                                                             
//*  RESTART:      W22191    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P091 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W221D7,                                             
//             INDUT=&W221..W221D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22191   EXEC PGM=V16459,PARM='W22191/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W22191D1 DD  DSN=&INDIN..W22418(+0),DISP=SHR                                  
//************ PART DATA FROM W01184 AND W01160                                 
//*                                                                             
//W22191D2 DD  DSN=&INDIN..W2219B01(+0),DISP=SHR                                
//************ INSERTED ALERT FROM LAST UPDATE                                  
//*                                                                             
//W22191D3 DD  DSN=&INDUT..W22191(+1),DISP=(NEW,CATLG,DELETE),   -LIM(1)        
//************ ALERT TO BE DELETED                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
