//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE ALERT - WDGX2223/24                                                 
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W221D6                                         
//*                                                                             
//*  RESTART:      W22196    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P096 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W221D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22196   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W22196,W22196,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22196D1 DD  DSN=&INDIN..W2219401(+0),DISP=SHR                                
//************ INDIN TO INSERT/REPLACE WDGX2223/24                              
//*                                                                             
//W22196D2 DD  DSN=&INDIN..W2219402(+0),DISP=SHR                                
//************ INDIN TO DELETE WDGX2223/24                                      
//*                                                                             
