//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE ALERT TO SCREEN 2171                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W221D6                                         
//*                                                                             
//*  RESTART:      W22194      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDIN2=&W221..W221D6,                                            
//             INDUT=&W221..W221D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22194   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22194,W22194,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDL2     INCLUDE MEMBER=WDL2                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//W22194D1 DD  DSN=&INDIN2..W22197(+0),DISP=SHR                                 
//************ FILE TO DELETE ALERT ON WDGX2223/24                              
//*                                                                             
//W22194D2 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ UTDRAG UR WDK601 OCH OCH WDK611                                  
//*                                                                             
//W22194D3 DD  DSN=&INDUT..W2219401(+1),                        -LIM(1)         
//************ FILE TO UPDATE ALERT ON WDGX2223/24                              
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22194D4 DD  DSN=&INDUT..W2219402(+1),                        -LIM(1)         
//************ FILE TO DELETE ALERT ON WDGX2223/24                              
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W22194D5 DD  DSN=&INDUT..W2219403(+1),                        -LIM(1)         
//************ KONTROLL FILE INTERNT                                            
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
