//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      SKAPAR LEVERANSPLANEKONCEPT                                  *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                    W22146 LÄSER WDF5, WDK6, WDD9,                 *         
//*                     WDD3, WDK9, WDK7, WDB6, WDR2                  *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W221P027 PROC INDIN=&W221..W200V1,                                            
//             INDUT=&WUT..W200V1,                                              
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT    EXEC PGM=SORT                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W221TD46),DISP=SHR                         
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTIN   DD  DSN=&INDIN..W22151(+0),DISP=SHR                                  
//***************  LI51 - BEGÄRAN LEVERANSPLANEKONCEPT              ***         
//*                                                                             
//SORTOUT  DD  DSN=&&W22151,DISP=(NEW,PASS,DELETE),                             
//**************   SORTERADE LEVERANSPLANEKONCEPT                   ***         
//             SPACE=(6232,(10,20),RLSE),                                       
//             VOL=(,,,2)                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//**************   TAR BORT DEN FÖRRA EXCEL-FILEN TILL SPX (EUROPE) GMBH        
//*               SAS8 KLARAR INTE GENERATIONSFILER                             
//DEL532 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W22153SP),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22146  EXEC PGM=DFSRRC00,                                                    
//             PARM='&DBB,W22146,W22146,,00'                                    
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//IEFRDER  DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//OUT1      OUTPUT FORMDEF=145BVD,PAGEDEF=145BVD                                
//W22146D1 DD  DSN=&&W22151,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//W22146D2 DD  DSN=&INDUT..W22153SP,DISP=(NEW,CATLG,DELETE),                    
//**************  EXCEL-FIL FÖR SPX (EUROPE) GMBH, LEV.PL.KONCEPT               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDF5     INCLUDE MEMBER=WDF5                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
