//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MEDDELANDE OM DFü-SÄNDNING TILL OPERATÖR                                   
//*                                                                             
//*  FREKVENS:     DAG    RTN W221D1                                            
//*                                                                             
//*  ÅTERSTART:    WTOR   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221WTOR PROC STATION=XXX,LEVNR=00000,DATEX=                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WTOR     EXEC PGM=V16451,                                                     
//  PARM=('SÄND FIL RLK.RVD&STATION..L&LEVNR (&DATEX, SE INSTR)',               
//        ' SVARA OK.')                                                         
