//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BEGÄR OMSPEC FÖR LEVERANTÖRS ARTIKLAR                                      
//*  VID ÄNDRING AV AVSÄNDNINGSVECKODAGAR                                       
//*                                                                             
//*  FREKVENS:     VECKA     RTN W200V1                                         
//*                                                                             
//*  ÅTERSTART:    W22138      NORMAL                                           
//*                LÄSER        WDR3 WDD9                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W221..W200V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22138   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22138,W22138,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                    -- ABEND         
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR3     INCLUDE MEMBER=WDR3                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//W22138D1 DD  DSN=&INDUT..W22138(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR FÖR OMSPEC                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W22138D2 DD  DSN=&INDUT..W22139(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TAG BORT HÄNDELSER                                               
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
