//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UNDERHÅLLER ERSATTA LOKALA ARTIKLAR I KINA OCH USA                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W224V1                                           
//*                                                                             
//*  ÅTERSTART:    W22142    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W224..W224V1,                                             
//             INDIN2=&W011..NDC,                                               
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDUT=&W224..W224V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ NDC:ERS  LAGERBAND SORTERAT ARTIKELNR, DC                        
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22142   EXEC PGM=V16459,PARM='W22142/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W22142D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ UTDRAG UR WDK711,K712 OCH K722 (ARTIKELORDNING)                  
//*                                                                             
//W22142D2 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ UTDRAG UR WDK601 OCH OCH WDK611                                  
//*                                                                             
//W22142D3 DD  DSN=&INDIN..W22140(+0),DISP=SHR                                  
//************ ARTIKELREGISTER KINA                                             
//*                                                                             
//W22142D4 DD  DSN=&INDUT..W22140(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ ARTIKELREGISTER KINA                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22142D5 DD  DSN=&INDUT..W2214B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ NYA ERSÄTTNINGAR NDC-CN, NDC-US                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
