//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT PART UPDATED WITH STOP DATE FOR ALARM 223                           
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W221S4                           
//*                                                                             
//*  RESTART:      W22165    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P065 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W221..W221S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22165   EXEC PGM=V16459,PARM='W22165/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W22165D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ PART DATA FROM WDK6                                              
//*                                                                             
//W22165D2 DD  DSN=&INDUT..W22165(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ REPORT PART UPDATED WITH STOP DATE FOR ALARM 223                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
