//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATES WDK601 WITH PROC.SEGMENTATION(KDANSKSEG)                           
//*                                                                             
//*  FREKVENS:     VECKA     RTN W221V4                                         
//*                                                                             
//*  ÅTERSTART:    W22169    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P069 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=2,                                                           
//             INDIN=&W221..W221V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22169   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W22169,W22169,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22169D1 DD  DSN=&INDIN..W22168(+0),DISP=SHR                                  
//************ BUYERKOD SAMT REFILLKÖPTABELL                                    
//*                                                                             
