//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LARM, HÖG ELLER LÅG ORDERINGÅNG SISTA 4 VECKORNA                           
//*                                                                             
//*  SKRIVER UT PÅ MEMO                                                         
//*                                                                             
//*  FREKVENS:     VECKA     RTN W222V1                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W22241      NORMAL                                           
//*                LÄSER        WDP3                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             INDUT=&W222..W222V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W222PD41),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22235(+0),DISP=SHR                                  
//************ LARM HÖG ELLER LÅG ORDERINGÅNG SISTA 4 VECKORNA                  
//*                                                                             
//SORTOUT  DD  DSN=&&W22235S,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD INFIL                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22241   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22241,W22241,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDP3     INCLUDE MEMBER=WDP3                                                  
//W22241D1  DD DSN=&&W22235S,DISP=(OLD,DELETE,DELETE)                           
//************ FIL MED LARM HÖG ELLER LÅG OI 4 VECKOR, SORTERAD                 
//*                                                                             
//W22241D2 DD  DSN=&INDUT..W22241(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LARM UT PÅ MEMO                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W22241D3 DD  DSN=&INDUT..W22241A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)        
//************ LARM UT PÅ DAP, NÄR MAIL ADRESS SAKNAS PÅ BAS                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
