//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      UPPDATERING PERIODBEHOV-SATSFÖRBRUKNING (PB-SATS)            *         
//*                                                                   *         
//*      PERIODICITET: DAG (SAMMA PGM GÅR VECKOVIS I ANNAN PROC)      *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL (BMP)                                   *         
//*                                                                   *         
//*                    W22217 UPPDATERAR WDK6                         *         
//*                           LÄSER WDJ1 OCH WDK7                     *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W222P017 PROC INDIN=NULLFILE,                                                 
//             CPU=1,                                                           
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22217  EXEC PGM=DFSRRC00,                                                    
//        PARM=('BMP,W22217,W22217,,,N00,,,,,&CPU,,,&IMS')                      
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                     -- SORT             
//IGZSRTCD DD  DSN=&INDRTE..CONSTANT(W222PD16),DISP=SHR     -- SORT             
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W22217D1 DD  DSN=&INDIN..W22203,DISP=SHR                                      
//**************   HÄNDELSE 2233, PB ÄNDRAT PÅ SATSARTIKEL FRÅN P014            
//*                ALLA GEN TAS IN PGA EV P014 KÖRD FLERA GÅNGER                
//*                                                                             
