//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA EMBALAGEBEHOV                                                        
//*  SORTERAR LISTPOSTER, SKRIVER LISTA                                         
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W222V1                                          
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W22262    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W222PD62),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22261(+0),DISP=SHR                                  
//************ LISTPOSTER; EMBALAGE,OSORTERADE                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W22261,DISP=(NEW,PASS,DELETE),                             
//************ LISTPOSTER; ENBALAGE SORTERADE PÅ "IDARTNR-EMBQ"                 
//         SPACE=(22,(50,16),RLSE),AVGREC=K                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22262   EXEC PGM=V16459,PARM='W22262/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W22262D1 DD  DSN=&&W22261,DISP=(OLD,DELETE,DELETE)                            
//************ LISTPOSTER; EMBALAGE, SORTERADE "IDARTNR-EMBQ"                   
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22262D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W22162-001  LISTA, EMBALAGEBEHOV                                 
//*                                                                             
