//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  W22207                                                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W200V1                                         
//*                                                                             
//*  RESTART:      W22207      NORMAL                                           
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P007 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W011..&RTEGRP.,                                           
//             INDUT=&W222..W200V1,                                             
//             INDUT2=&WXTR..PARTINFO                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22207   EXEC PGM=W22207                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22207D1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ W01160                                                           
//*                                                                             
//W22207D2 DD  DSN=&INDUT..W22207(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//*22207D2 DD  DSN=&&W22207,DISP=(NEW,PASS,DELETE),                             
//************ W22207                                                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY     EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W22207(+1),DISP=SHR                                  
//************                                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WREQACC(+1),                      -LIM(2)           
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA AV W22207/WXTR.PARTINFO.WREQWEEK,                          
//************ SPARAR 2 GENERATION                                              
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
