//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CALCULATION OF ASSETS IN CDC                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W222D1                                         
//*                                                                             
//*  RESTART:      W22232      NORMAL                                           
//*                READS        WDK7 WDL2 WDB6 WDD9                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P032 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDUT=&W222..W222D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22232   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22232,W22232,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDL2     INCLUDE MEMBER=WDL2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//W22232D1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ PART FILE WDK6                                                   
//*                                                                             
//W22232D2 DD  DSN=&INDUT..W22232(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTPUT FILE TO UPDATE WDK611                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
