//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATING REPORT FOR LOCALLY SOURCED PARTS                                  
//*  AND  REFILL PARTS FOR CDC                                                  
//*  FOR PARTS WITH UNNORMAL CHANGE OF FORECAST (KVPB-SEP)                      
//*                                                                             
//*                                                                             
//*  FREKVENS:     WEEK     RTN W222V1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             INDUT=&W222..W222V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22263   EXEC PGM=V16459,PARM='W22263/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W22263D1  DD DSN=&INDIN..W22221E(+0),DISP=SHR                                 
//************ PARTS WITH ONORMAL CHANGE OF FORECAST                            
//*                                                                             
//W22263D2 DD  DSN=&INDUT..W22263A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//********** W22263-001 REPORT FILE                                             
//             SPACE=(70,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W22263D3 DD  DSN=&INDUT..W22263B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//********** W22263-002 REPORT FILE                                             
//             SPACE=(70,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
