//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE A TAB-SEPARATED EXTRACT OF FILE W22229L                             
//*  TO SEND TO THE DATALAKE                                                    
//*                                                                             
//*  FREQUENCE:    PERIOD    RTN W200V1 (ONLY WHEN W222J029 RUNS)               
//*                                                                             
//*  RESTART:      W22267    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P066 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W200V1,                                             
//             INDUT=&W222..W200V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22267   EXEC PGM=V16459,PARM='W22267/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//INFIL01  DD  DSN=&INDIN..W22229L(+0),DISP=SHR                                 
//************ LOG-FILE FROM PROGRAM W22229                                     
//*                                                                             
//UTFIL01  DD  DSN=&&W22267,DISP=(NEW,PASS,DELETE),                             
//************ TAB-SEPARATED EXTRACT FILE WITHOUT COLUMN-HEADERS                
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W22267.HEADERS,DISP=SHR                              
//         DD  DSN=&&W22267,DISP=(OLD,PASS,DELETE)                              
//************ TAB-SEPARATED EXTRACT FILE                                       
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W22267(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ TAB-SEPARATED EXTRACT FILE WITH COLUMN-HEADERS                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
