//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MASK. PB-JUSTERINGAR M.H.A. REGISTER                                       
//*                                                                             
//*  FREKVENS:     VECKA     RTN W222V1                                         
//*                                                                             
//*  ÅTERSTART:    W22256      NORMAL                                           
//*                LÄSER        WDK6 WDK7                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W222..W222V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22256   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22256,W22256,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W22256D1 DD  DSN=&INDIN..W22255(+0),DISP=SHR                                  
//************ REGISTER MASKINELLA PB-JUSTERINGAR                               
//*                                                                             
//W22256D2 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//W22256D3 DD  DSN=&INDUT..W22255(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ REGISTER MASK. PB-JUSTERINGAR                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W22256D4 DD  DSN=&INDUT..W22257(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ POSTER FÖR UPPDAT AV WDK6                                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
