//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÄRVA SÄSONG                                                                
//*                                                                             
//*  FREKVENS:     VECKA     RTN W222V1                                         
//*                                                                             
//*  ÅTERSTART:    W22247    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P047 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..PARTINFO,                                           
//             INDUT=&W222..W222V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22247   EXEC PGM=W22247                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22247D1 DD  DSN=&INDIN..WCDCWEEK(-1),DISP=SHR                                
//************ LAGERBAND                                                        
//*                                                                             
//W22247D2 DD  DSN=&INDIN..WCDCWEEK(+0),DISP=SHR                                
//************ LAGERBAND                                                        
//*                                                                             
//W22247D3 DD  DSN=&INDUT..W22247(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ÄRVA SÄSONG                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
