//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA MED MANUELLT SATTA SÄSONGER SOM KOMMER ATT                           
//*  UPPHÖRA INOM TRE VECKOR                                                    
//*                                                                             
//*  FREKVENS:     VECKA   RTN W222V1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W22261    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W222PD61),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22260(+0),DISP=SHR                                  
//************ SÄSONGER SOM KOMMER ATT UPPHÖRA INOM TVÅ VECKOR                  
//*                                                                             
//SORTOUT  DD  DSN=&&W22261,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD UTFIL                                                   
//         SPACE=(48,(500,666),RLSE),AVGREC=U                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22261   EXEC PGM=W22261                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W22261D1 DD  DSN=&&W22261,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD UTFIL                                                   
//*                                                                             
//W22261D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W22261  MANUELLA SÄSONGER                                        
//*                                                                             
