//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      BERÄKNING AV MASKINELL PROGNOS  OCH MAD.                     *         
//*      KONTROLL AV PROGNOSFEL M.M. PERIOD BEARBETNING               *         
//*                                                                   *         
//*      PERIODICITET: VECKA  RTH W200V1                              *         
//*                                                                   *         
//*      ÅTERSTART:    W22229 NORMAL                                  *         
//*                                                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W222P029 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W200V1,                                             
//             INDUT=&W222..W200V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22229   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22229,W22229,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//*                                                                             
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//W22229D1 DD  DSN=&INDIN..W22230(+0),DISP=SHR                                  
//**************   ORDERINGÅNGSREG-POSTER                           ***         
//*                                                                             
//W22229D2 DD  DSN=&INDUT..W22229(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** RECORDS TO UPDATE WDK611                           ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22229D3 DD  DSN=&INDUT..W22229L(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************** LOG RECORDS WITH PARAMETERS                        ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
