//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CALCULATE FORECAST                                                         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W222V2                                         
//*                                                                             
//*  RESTART:      W22237      NORMAL                                           
//*                READS        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P037 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W222..W222V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22237   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22237,W22237,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//W22237D1 DD  DSN=&INDUT..W2223701(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ FILE TO UPDATE WDK629                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W22237D2 DD  DSN=&INDUT..W2223702(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ FILE TO UPDATE WDK611                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
