//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LARM, PROGNOSER                                                            
//*                                                                             
//*  SKRIVER UT PÅ MEMO                                                         
//*                                                                             
//*  FREKVENS:     VECKA     RTN W222V1                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W22246      NORMAL                                           
//*                LÄSER        WDP3                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P046 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W222..W222V1,                                             
//             INDUT=&W222..W222V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W222PD46),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W22221B(+0),DISP=SHR                                 
//************ LARM, PROGNOSER                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W22221B,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD INFIL                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22246   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22246,W22246,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDP3     INCLUDE MEMBER=WDP3                                                  
//W22246D1  DD DSN=&&W22221B,DISP=(OLD,DELETE,DELETE)                           
//************ FIL MED LARM PROGNOSER                                           
//*                                                                             
//W22246D2 DD  DSN=&INDUT..W22246(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LARM UT PÅ MEMO                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22246D3 DD  DSN=&INDUT..W22246A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)        
//************ LARM UT PÅ DAP                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
