//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ORDERINGÅNG SORTERAD EFTER RANDOMNYCKEL.                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W200V1                                         
//*                                                                             
//*  RESTART:      W22230    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W222P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W232..W200V1,                                             
//             INDUT=&W222..W200V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22230  EXEC PGM=W22230                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22230D1 DD  DSN=&INDIN..W23265(+0),DISP=SHR                                  
//**************   ORDERINGÅNGSREG-POSTER                           ***         
//*                                                                             
//W22230D2 DD  DSN=&INDUT..W22230(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//**************   ORDERINGÅNG SORTERAD EFTER RANDOMNYCKEL - PT 289 ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
