//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE KVVECKOR-LT ON WDK7                                                 
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W224S2                                         
//*                                                                             
//*  RESTART:      W22472    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W224P072 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W224..W224S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22472   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W22472,W22472,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W22472D1 DD  DSN=&INDIN..W22474(+0),DISP=SHR                                  
//************ PART + SUPPLIER-SHIP - TO BE UPDATED ON WDK7                     
//*                                                                             
