//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CLEAR STOP DATE FOR ALARM 223 ON WDK711                                    
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W100V1                           
//*                                                                             
//*  RESTART:      W22475    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W221P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDC                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22475   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W22475,W22475,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22475D1 DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//************ PART DATA FROM WDK7                                              
//*                                                                             
