//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATRIALFÖRSÖRJNING LOKAL ANSKAFFNING KINA                                  
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W224V1                                         
//*                                                                             
//*  RESTART:      W22410      NORMAL                                           
//*                READS        WDG3                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W224P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W224..W224V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22410   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22410,W22410,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDG3     INCLUDE MEMBER=WDG3                                                  
//W22410D1 DD  DSN=&INDUT..W22410(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ 2204 RECORDS TO W22412                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W22410D2 DD  DSN=&INDUT..W22411(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ 2203 RECORDS TO W22411 - DELETE RECORDS                          
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
