//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT PART UPDATED WITH STOP DATE FOR ALARM 223                           
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W224S4                           
//*                                                                             
//*  RESTART:      W22476    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W224P076 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDC,                                                
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W224..W224S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W224PD76),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ NDC:ERS  LAGERBAND SORTERAT ARTIKELNR, NDC-CN                    
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22476   EXEC PGM=V16459,PARM='W22476/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W22476D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ PART DATA FROM WDK7                                              
//*                                                                             
//W22476D2 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ PART DATA FROM WDK6                                              
//*                                                                             
//W22476D3 DD  DSN=&INDUT..W2247601(+1),                        -LIM(1)         
//************ REPORT PART UPDATED WITH STOP DATE FOR ALARM 223 CHINA           
//             DISP=(NEW,CATLG,DELETE),  -LIM(1)                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22476D4 DD  DSN=&INDUT..W2247602(+1),                        -LIM(1)         
//************ REPORT PART UPDATED WITH STOP DATE FOR ALARM 223 USA             
//             DISP=(NEW,CATLG,DELETE),  -LIM(1)                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
