//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LEVERANSPLANER FÖR EDI-SÄNDNING TILL NDC-KINA                       
//*  LEVERANTÖRER.                                                              
//*                                                                             
//*  FREKVENS:     VECKA     RTN W224V2                                         
//*                                                                             
//*  ÅTERSTART:    W22463      NORMAL                                           
//*                LÄSER        WDR2 WDR5                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W224P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W224..W224V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22463   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22463,W22463,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR               -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDR5     INCLUDE MEMBER=WDR5                                                  
//*                                                                             
//W22463D1 DD  DUMMY                                                            
//************ PARAMETER IN VIA JOB-JCL VECKA/PERIOD + DC-FOM - DC-TOM          
//*                                                                             
//W22463D2 DD  DSN=&INDUT..W22463(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ LEVERANSPLANER EDI KINA                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22463D3 DD  DSN=&INDUT..W22464(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DELETE WDGX2248, REPLACE WDGX2206                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
