//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            LISTNING AV NY GK LEV                                  *         
//*                                                                   *         
//*            PERIODICITET: VECKA                                    *         
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W224P004 PROC INDUT=&W224..W100V1,INDREG=&W011,                               
//             STPLIB=&INDRTE..LOAD,DEST2=&CPRINT                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22420  EXEC PGM=W22420                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//W22420D1 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//**************      AKTUELLT 'VECKO'-LAGERBAND                    ***         
//*                                                                             
//W22420D2 DD  DSN=&INDREG..W01177(-1),DISP=SHR                                 
//**************      FÖRRA VECKANS 'VECKO'-LAGERBAND               ***         
//*                                                                             
//W22420D4 DD  DSN=&INDUT..W22421(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************      NYREG OCH ERSATTA ARTIKLAR.                   ***         
//             MGMTCLAS=&NOBACKUP,                                              
//             SPACE=(6232,(9,20),RLSE)                                         
//*                                                                             
//W22420D5 DD  DSN=&INDUT..W22424(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************      KONTO-ÄNDRINGAR PV                            ***         
//             MGMTCLAS=&BACKUPC,                                               
//             SPACE=(6228,(15,15),RLSE)                                        
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22420D6 DD  SYSOUT=(E,,3803),DEST=&DEST2,OUTPUT=(*.A4LF),                    
//             DCB=(RECFM=VBA,LRECL=125,BLKSIZE=129)                            
//**************      LISTA W22420-002 ÄNDRING LEV                  ***         
//*                                                                             
//W22420D7 DD  DSN=&INDUT..W22425(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************                                                    ***         
//             MGMTCLAS=&BACKUPC,                                               
//             SPACE=(6226,(9,20),RLSE)                                         
//*                                                                             
//W22420D8 DD  DSN=&INDUT..W22428(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************                                                    ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W22420D9 DD  DSN=&INDUT..W22429(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************                                                    ***         
//             MGMTCLAS=&BACKUPC,                                               
//             SPACE=(6200,(9,20),RLSE)                                         
//*                                                                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
