//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL MED NYREGISTRERINGAR/LEVBYTEN OCH KOMPLETTERAR                   
//*                                                                             
//*  FREKVENS:     VECKA                                                        
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W224P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W224..W100V1,                                             
//             INDIN2=&W910,                                                    
//             INDUT=&W224..W100V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22434   EXEC PGM=V16459,PARM='W22434/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W22434D1 DD  DSN=&INDIN..W22429(+0),DISP=SHR                                  
//************ FIL FRÅN W22420                                                  
//*                                                                             
//W22434D2 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ARTIKELFIL                                                       
//*                                                                             
//W22434D3 DD  DSN=&INDUT..W22435(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERAD INFIL                                               
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
