//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ASSIGNS NEW PROCURMENT IDREFTAB, IF NECESSARY                              
//*                                                                             
//*  FREKVENS:     VECKA     RTN W224V5                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W22470      NORMAL                                           
//*                LÄSER        WDB6                                            
//*                             WDL7                                            
//*                             WDL8                                            
//*                             WDD5                                            
//*                             WDK7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P079 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W221..W224V5,                                             
//             INDIN2=&W271..W224V5,                                            
//             INDUT=&W224..W224V5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT78   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W27178(+0),DISP=SHR                                 
//************ WDK7-DATA                                                        
//*                                                                             
//SORTOUT  DD  DSN=&&W27178,DISP=(NEW,PASS,DELETE),                             
//************ WDK7-DATA SORTED BY IDARTNR AND IDDC                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//W22470   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22470,W22470,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDL8     INCLUDE MEMBER=WDL8                                                  
//WDD5     INCLUDE MEMBER=WDD5                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W22470D1 DD  DSN=&INDIN..W22168(+0),DISP=SHR                                  
//************ WDK6 IDARTNR AND KDANSKSEG SORTED BY IDARTNR                     
//*                                                                             
//W22470D2 DD  DSN=&&W27178,DISP=(OLD,DELETE,DELETE)                            
//************ WDK7-DATA SORTED BY IDARTNR AND IDDC                             
//*                                                                             
//W22470D3 DD  DSN=&INDUT..W27179(+1),DISP=(NEW,CATLG,DELETE), -LIM(6)          
//************ POSSIBLE UPDATE OF IDREFTAB PER IDARTNR                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
