//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR URVALEN MOT WDA5                                                   
//*                                                                             
//*  FREKVENS:     DAG    RTN W225D1                                            
//*                                                                             
//*  ÅTERSTART:    W22532                                                       
//*                LÄSER  WDK6                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W225P032 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W225..W225D1,                                             
//             INDUT=&W225..W225D1,                                             
//             INDIN2=&W440                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22532   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22532,W22532,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W22532D1 DD  DSN=&INDIN..W22530(+0),DISP=SHR                                  
//************ FIL MED URVAL                                                    
//*                                                                             
//W22532D2 DD  DSN=&INDIN2..W44061(+0),DISP=SHR                                 
//************ FIL MED RO/TPO FRÅN WDA5                                         
//*                                                                             
//W22532D3 DD  DSN=&INDUT..W22532(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED MATCHADE RADER                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
