//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTOR MED TPO-INFORMATION. E+                                      
//*  TAR IN TVÅ FILER, EN MED TPO 1-6 OCH EN MED TPO 3.                         
//*  SPLITTAR OCH SORTERAR ENLIGT VALD SORTERING.                               
//*                                                                             
//*  FREKVENS:     DAG    RTN W225D1                                            
//*                                                                             
//*  ÅTERSTART:    W22536    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W225P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W225..W225D1,DEST1=&CPRINT                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22536   EXEC PGM=V16459,PARM='W22536/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W22536D1 DD  DSN=&INDIN..W22532(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W22534(+0),DISP=SHR                                  
//************ FILER MED URVAL OCH INFORMATION                                  
//*                                                                             
//SORTFIL  DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL    DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP5,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL4   DD  DSN=&&TEMP6,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL5   DD  DSN=&&TEMP7,DISP=(NEW,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//TPFIL6   DD  DSN=&&TEMP8,DISP=(MOD,DELETE,DELETE),                            
//             DCB=(RECFM=FB,LRECL=585,BLKSIZE=23400),                          
//             SPACE=(23400,(20,10),RLSE)                                       
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22536D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W22536  LISTA MED TPO-INFORMATION                                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
