//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BMP SOM LÄSER NER WDM4 OCH SKAPAR FILER MED URVAL                          
//*  W22530: TPO 1-6                                                            
//*  W22531: TPO 3                                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W225D1                                            
//*                                                                             
//*  ÅTERSTART:    W22530    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W225P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W225..W225D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22530   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W22530,W22530,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22530D1 DD  DSN=&INDUT..W22530(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED URVAL FRÅN WDM4, TPO 1-6                                 
//             MGMTCLAS=&DEL2BKPC,SPACE=(23306,(23,7),RLSE)                     
//*                                                                             
//W22530D2 DD  DSN=&INDUT..W22531(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED URVAL FRÅN WDM4, TPO 3                                   
//             MGMTCLAS=&DEL2BKPC,SPACE=(22932,(23,7),RLSE)                     
//*                                                                             
