//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SAMLAR ARTIKLAR MED RESTORDER                                              
//*                                                                             
//*  FREKVENS:     JÄMN VECKA    RTN W225V2                                     
//*                                                                             
//*  ÅTERSTART:    W22540    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W225P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W910,                                                    
//             INDUT=&W225..W225V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22540   EXEC PGM=W22540                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W22540D1 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ARTIKELUPPGIFTER                                                 
//*                                                                             
//W22540D2 DD  DSN=&INDUT..W22541(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR MED RESTORDER                                           
//             SPACE=(19,(10,13),RLSE),AVGREC=K,                                
//             MGMTCLAS=&DEL2BKPC                                               
