//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR GRUND TILL SRS INFORMATION                                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W225D2                                            
//*                                                                             
//*  ÅTERSTART:    W22502    NORMAL                                             
//*                READS     WDK6                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W020P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W092..W225D2,                                             
//             INDIN2=&W414..W225D2,                                            
//             INDUT=&W225..W225D2,                                             
//             INDUT2=&W225..W810D2,                                            
//             INDUT3=&W020..W020D1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22502   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W22502,W22502,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W22502D1 DD  DSN=&INDIN..W092S1,DISP=SHR                                      
//************ FIL FRÅN W092P108 (WDG6)                                         
//*                                                                             
//W22502D2 DD  DSN=&INDIN2..W4140I,DISP=SHR                                     
//************ FIL FRÅN W414D1, VOR'ER FRÅN O/E (WDR6)                          
//*                                                                             
//W22502D3 DD  DSN=&INDIN2..W4140D,DISP=SHR                                     
//************ FIL FRÅN W414D1, ANNULLERADE VOR'ER FRÅN 4224 (WDR4)             
//*                                                                             
//W22502D4 DD  DSN=&INDUT..W22508(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FIL SOM MOTSVARAR W092S1 - EJ SORTAD  TILL W020P006              
//             SPACE=(30,(125,41),RLSE),AVGREC=K                                
//*                                                                             
//W22502D5 DD  DSN=&INDUT..W22503(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FIL SOM MOTSVARAR W092Z1 - EJ SORTAD  TILL W225P002              
//             SPACE=(20,(125,41),RLSE),AVGREC=K                                
//*                                                                             
//W22502D6 DD  DSN=&INDUT..W22502(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FIL TILL TORSTEN         - EJ SORTAD  TILL W092P109              
//             SPACE=(30,(125,41),RLSE),AVGREC=K                                
//*                                                                             
//W22502D7 DD  DSN=&INDRTE..CONSTANT(W020PD05),DISP=SHR                         
//************ KONSTANTMEDLEM MED TABELL DISTRIKT-MARKNADSKOD                   
//*                                                                             
//W22502D8 DD  DSN=&INDUT..W22504(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ FIL W225P080                                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//GENER   EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W22502,DISP=SHR                                      
//SYSUT2   DD  DSN=&INDUT2..W22502A(+1),DISP=(NEW,CATLG,DELETE),                
//************** INLEVERANSFIL W61110A COPY FOR BRISTLISTA     -LIM(3)          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
//GENER2  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W22508(+1),DISP=SHR                                  
//SYSUT2   DD  DSN=&INDUT3..W22508(+1),DISP=(NEW,CATLG,DELETE),                 
//********COPY OF LATEST FILE TO W22508 FOR DAILY ROUTINE      -LIM(3)          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
