//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            SERVICEGRAD PER LÄTTA/TUNGA FORDON                     *         
//*                                                                   *         
//*            PERIODICITET: VECKA                                    *         
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W225P007 PROC INDIN=&W225..W225V1,INDREG=&W225,                               
//             STPLIB=&INDRTE..LOAD,DEST2=&CPRINT,                              
//             SOUT2='(E,,3803)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22520  EXEC PGM=W22520                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//W22520D1 DD  DSN=&INDREG..W22503(+0),DISP=SHR                                 
//**************                                                    ***         
//*                                                                             
//W22520D2 DD  DSN=&INDIN..W22519(+0),DISP=SHR                                  
//**************                                                    ***         
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22520D3 DD  SYSOUT=&SOUT2,OUTPUT=(*.A4LF),                                   
//             DEST=&DEST2                                                      
//**************                                                    ***         
//*                                                                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*       UTSKRIFT AV RÄKNEVERK (POSTSUM)                   
