//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA, ANTAL ARTIKLAR PER ANSKAFFARE MED RESTORDER,                        
//*  TÄCKTA/EJ TÄCKTA RESTORDER                                                 
//*                                                                             
//*  FREKVENS:     JÄMN VECKA   RTN W225V2                                      
//*                                                                             
//*  ÅTERSTART:    W22544    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W225P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W225..W225V2,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22544   EXEC PGM=V16459,PARM='W22544/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W22544D1 DD  DSN=&INDIN..W22543(+0),DISP=SHR                                  
//************ LISTFIL ANTAL ARTIKLAR M TÄCKTA/EJ TÄCKTA RO P ANS               
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22544D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W22544-001  LISTA TÄCKTA/EJ TÄCKTA RESTORDER PER ANSKAFFA        
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
