//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*SPLIT                                                              *         
//*            RANKING RESTORDER                                      *         
//*                                                                   *         
//*            PERIODICITET: VECKA                                    *         
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W225P005 PROC INDIN=&W225..W225V1,                                            
//             STPLIB=&INDRTE..LOAD,DEST2=&CPRINT                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W22514  EXEC PGM=W22514                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//W22514D1 DD  DSN=&INDIN..W22515(+0),DISP=SHR                                  
//**************                                                    ***         
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W22514D2 DD  SYSOUT=(E,,3803),OUTPUT=(*.A4LF),                                
//             DEST=&DEST2                                                      
//**************                                                    ***         
//*                                                                             
//W22514D3 DD  DSN=&&W22521,DISP=(NEW,DELETE,DELETE),                           
//**************     ARBETSFIL                                      ***         
//             SPACE=(6222,(3,3),RLSE)                                          
//*                                                                             
//*                                                                             
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
