//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER LISTA REFILL UPPFÖLJNING                                           
//*                                                                             
//*  FREKVENS:     ORDERED W231S2                                               
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P07B PROC INDIN=&W231..W231S2,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2317B   EXEC PGM=IEBGENER                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//OUT1     OUTPUT FORMDEF=SLS09F,PAGEDEF=SLS09F                                 
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W2317B(+0),DISP=SHR                                  
//************ LISTPOSTER                                                       
//*                                                                             
//SYSUT2   DD  SYSOUT=(A,,3803),OUTPUT=(*.OUT1),                                
//             DEST=&DEST1                                                      
//************ W23172-001  LISTA REFILL UPPFÖLJNING                             
//*                                                                             
