//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AK INFO                                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W231V1                                         
//*                                                                             
//*  RESTART:      W23152      NORMAL                                           
//*                READS        WDL2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P052 PROC STPLIB=&INDRTE..LOAD,                                           
//             DBB=DBB,                                                         
//             INDIN2=&W011,                                                    
//             INDUT=&W231..W231V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23152   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23152,W23152,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSABOUT DD  SYSOUT=*                                     -- ABEND            
//SYSDBOUT DD  SYSOUT=*                                     -- ABEND            
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                -- ABEND             
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL2     INCLUDE MEMBER=WDL2                                                  
//W23152D1 DD  DSN=&INDIN2..W01177(+0),DISP=SHR                                 
//************ INFIL                                                            
//*                                                                             
//W23152D2 DD  DSN=&INDUT..W23152(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL                                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
