//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER ANALYS-LISTA MED URVAL FRÅN BILD 2324                              
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P18A PROC INDIN=&W231..W231S1,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2318A   EXEC PGM=IEBGENER                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//OUT1     OUTPUT FORMDEF=SLS08C,PAGEDEF=SLS08C                                 
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W2318B(+0),DISP=SHR                                  
//************ LISTPOSTER                                                       
//*                                                                             
//SYSUT2   DD  SYSOUT=(A,,3827),OUTPUT=(*.OUT1),                                
//             DEST=&DEST1                                                      
//************ W23181-001  ANALYSLISTA URVAL                                    
//*                                                                             
