//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA SORTIMENT-ANALYS SAMTLIGA ARTIKLAR                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN W231V1                                          
//*                                                                             
//*  ÅTERSTART:    W23181    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P081 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W231..W231V1,                                             
//             INDUT=&W231..W231V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23181   EXEC PGM=W23181                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//W23181D1 DD  DSN=&INDIN..W23178(+0),DISP=SHR                                  
//************ GRUNDFIL ANALYSLISTOR                                            
//*                                                                             
//W23181D2 DD  DSN=&INDUT..W2318A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W23181-001  ANALYSLISTA                                          
//             SPACE=(177,(300,80),RLSE),AVGREC=K,                              
//             MGMTCLAS=NOBACKUP                                                
//W23181D3 DD  DUMMY                                                            
//************ PARAMETRAR FRÅ BILD (OVERRIDE I JCL)                             
//*                                                                             
