//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA REFILL UPPFÖLJNING                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W231V2                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W23171      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W231..W231V2,                                             
//             INDUT=&W231..W231V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23170(+0),DISP=SHR                                  
//************ ALL DC RECORD FROM W23170                                        
//*                                                                             
//SORTOUT  DD  DSN=&&W23170,DISP=(NEW,PASS,DELETE),                             
//************ RECORDS SORTED ON IDDC                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23171   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23171,W23171,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W23171D1 DD  DSN=&&W23170,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKELUPPGIFTER REFILL UPPFÖLJNING                              
//*                                                                             
//W23171D3 DD  DSN=&INDUT..W2317A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ W2317A-00X LISTA                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
