//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA REFILL UPPFÖLJNING NDC OCH LDC KINA TOT                       
//*  CREATES FOLLOW-UP REFILL REPORT FOR NDC AND LDC CHINA TOT                  
//*                                                                             
//*  FREKVENS :    VECKA    RTN W231V3                                          
//*  FREQUENCY:    WEEKLY   RTN W231V3                                          
//*                                                                             
//*  ÅTERSTART:    W23199    NORMAL                                             
//*  RESTART  :    W23199    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P099 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W231..W231V3,                                            
//             INDUT=&W231..W231V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* SORT W23195 ON IDDC/IDARTNR                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W23195(+0),DISP=SHR                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W23195,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23199   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23199,W23199,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W23199D1 DD  DSN=&&W23195,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKELUPPGIFTER REFILL UPPFÖLJNING CHINA DC                     
//*                                                                             
//W23199D2 DD  DSN=&INDUT..W2319C(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W23199-001 LISTA                                                 
//             SPACE=(165,(300,80),RLSE),AVGREC=K,                              
//             MGMTCLAS=NOBACKUP                                                
