//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      SKAPAR 'ARBETSFILER' FÖR VCC-ARTIKLAR                        *         
//*                               RENAULT-ARTIKLAR                    *         
//*                                                                   *         
//*      PERIODICITET: PLANERINGSPERIOD                               *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W231P050 PROC INDIN=&W231..W231P1,INDUT=&W231..W231P1,                        
//             INDREG=&W225,                                                    
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2315S  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W23131(+0),DISP=SHR                                  
//**************                                                    ***         
//*                                                                             
//SORTOUT  DD  DSN=&&W23151,DISP=(NEW,PASS,DELETE),                             
//**************   ARTIKELREGISTERPOSTER                            ***         
//             DATACLAS=PSEB,                                                   
//             VOL=(,,,2)                                                       
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD50),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23150  EXEC PGM=W23150                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*       UTSKRIFT AV RÄKNEVERK (POSTSUM)                   
//W23150D1 DD  DSN=&&W23151,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//W23150D2 DD  DSN=&INDIN..W23123(+0),DISP=SHR                                  
//**************   ORDERINGÅNGSREGISTERPOSTER                       ***         
//*                                                                             
//W23150D3 DD  DSN=&INDIN..W23136(+0),DISP=SHR                                  
//**************   INSAMLAT FRÅN ANDRA SYSTEM                       ***         
//*                                                                             
//W23150D4 DD  DSN=&INDIN..W23141(+0),DISP=SHR                                  
//**************   RO-INFORMATION                                   ***         
//*                                                                             
//W23150D5 DD  DSN=&INDREG..W22509(+0),DISP=SHR                                 
//**************   AVBOKADE RADER                                   ***         
//*                                                                             
//W23150D9 DD  DSN=&INDIN..W23125(+0),DISP=SHR                                  
//**************   OKS-INFORMATION                                  ***         
//*                                                                             
//W23150D6 DD  DSN=&INDUT..W23152(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//***************  'ARBETSFIL' FÖR VCC-ARTIKLAR TILL W231P062                   
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
