//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL FÖR REFILL UPPFÖLJNING NDC OCH LDC KINA                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W231V3                                          
//*                                                                             
//*  ÅTERSTART:    W23192    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P092 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W271..W271V1,                                            
//             INDIN3=&W011..NDC,                                               
//             INDIN4=&W011..LDC,                                               
//             INDUT=&W231..W231V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD92),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W27120(+0),DISP=SHR                                 
//************ SDC ARTIKLAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W27120,DISP=(NEW,PASS,DELETE),                             
//************ SORT ON ARTNR AND IDDC                                           
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD92),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDIN4..W01184(+0),DISP=SHR                                 
//************ SDC ARTIKLAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ NDC OCH LDC SORT ON ARTNR AND IDDC                               
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD92),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN3..W01186(+0),DISP=SHR                                 
//         DD  DSN=&INDIN4..W01186(+0),DISP=SHR                                 
//************ SDC ARTIKLAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01186,DISP=(NEW,PASS,DELETE),                             
//************ NDC OCH LDC SORT ON ARTNR AND IDDC                               
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23192   EXEC PGM=V16459,PARM='W23192/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23192D1 DD  DSN=&&W27120,DISP=(OLD,DELETE,DELETE)                            
//************ SDC/NDC OCH LDC ARTIKLAR                                         
//*                                                                             
//W23192D3 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ NEDLÄST WDK7                                                     
//*                                                                             
//W23192D4 DD  DSN=&&W01186,DISP=(OLD,DELETE,DELETE)                            
//************ NEDLÄST WDL7                                                     
//*                                                                             
//SDC      DD  DSN=&&SDC,DISP=(NEW,PASS,DELETE),                                
//************ SDC FILE                                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//ARTFIL   DD  DSN=&&ARTFIL,DISP=(NEW,PASS,DELETE),                             
//************ ART FILE                                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23192D5 DD  DSN=&INDUT..W23192(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL REFILL UPPF NDC OCH LDC                                      
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
