//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA REFILL PPFÖLJNIN NDC                                          
//*                                                                             
//*  FREQUENCE:    VECKA     RTN W231V3                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W23196      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P096 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W231..W231V3,                                             
//             INDUT=&W231..W231V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* SORT W23195 FILE ON IDDC SO THAT ALL THE RECORDS IN THE FILE                
//* ARE ARRANGED IN THE IDDC ORDER                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23195(+0),DISP=SHR                                  
//************ ALL DC RECORDS FROM W23195                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W23195,DISP=(NEW,PASS,DELETE),                             
//************ RECORDS SORTED ON IDDC                                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23196   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23196,W23196,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W23196D1 DD  DSN=&&W23195,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKELUPPGIFTER REFILL UPPFÖLJNING                              
//*                                                                             
//W23196D3 DD  DSN=&INDUT..W2319A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ W23196-00X LISTA                                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
