//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NER SRS-INFO SKAPAR FIL FÖR REFILL UPPF NDC                          
//*                                                                             
//*  FREKVENS:     VECKA     RTN W231V3                                         
//*                                                                             
//*  ÅTERSTART:    W23194    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W020..W020V1,                                            
//             INDUT=&W231..W231V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W231PD94),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W02009(+0),DISP=SHR                                 
//************ SRS-POSTER OK                                                    
//*                                                                             
//         DD  DSN=&INDIN2..W02031(+0),DISP=SHR                                 
//************ SRS-POSTER KOMPLETTERADE                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W02009,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE SRS-POSTER                                             
//             SPACE=(26,(100,66),RLSE),AVGREC=K                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23194   EXEC PGM=W23194                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23194D1 DD  DSN=&&W02009,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADR SRS-POSTER                                             
//*                                                                             
//W23194D2 DD  DSN=&INDUT..W23194(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SRS-INFO NDC                                                     
//             SPACE=(43,(10,30),RLSE),AVGREC=K,                                
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W23194D4 DD  DSN=&INDRTE..CONSTANT(W020PD01),DISP=SHR                         
//************ GPDKÄNDA DISTRIKT                                                
//*                                                                             
