//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO COUNT SRS FOR NDC-CN                                                    
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W231V3                                         
//*                                                                             
//*  RESTART:      W2319A    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P09A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W231..W231V3,                                             
//             INDUT=&W231                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2319A   EXEC PGM=V16459,PARM='W2319A/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W2319AD1 DD  DSN=&INDIN..W23194(+0),DISP=SHR                                  
//************ FILE FROM W23194                                                 
//*                                                                             
//W2319AD2 DD  DSN=&INDUT..W23190(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FILE WITH SRS COUNTED FOE NDC-CN                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
