//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR FIL REFILL UPPF NDC                                           
//*                                                                             
//*  FREKVENS:     VECKA     RTN W231V3                                         
//*                                                                             
//*  ÅTERSTART:    W23193    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W231P093 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDIN=&W231..W231V3,                                             
//             INDUT=&W231..W231V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23193   EXEC PGM=V16459,PARM='W23193/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23193D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ NEDLÄST WDK6                                                     
//*                                                                             
//W23193D2 DD  DSN=&INDIN..W23192(+0),DISP=SHR                                  
//************ REFILL UPPF NDC                                                  
//*                                                                             
//W23193D3 DD  DSN=&INDUT..W23193(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOMPLETTERAD FIL REFILL UPPF NDC                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
