//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE EXTRACT FIL FROM HERCULES                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W233V1                                         
//*                                                                             
//*  RESTART:      W23328    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W233P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W233..W233V1,                                             
//             INDUT=&W233..W233V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W233PD28),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23327A(+0),DISP=SHR                                 
//************ HERCULES INFO - START RECORD                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W23327A,DISP=(NEW,PASS,DELETE),                            
//************ HERCULES INFO - START RECORD - SORTED SEQ.NO                     
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23328   EXEC PGM=W23328                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23328D1 DD  DSN=&&W23327A,DISP=(OLD,DELETE,DELETE)                           
//************ HERCULES INFO - START RECORD                                     
//*                                                                             
//W23328D2 DD  DSN=&INDIN..W23327B(+0),DISP=SHR                                 
//************ HERCULES INFO                                                    
//*                                                                             
//W23328D3 DD  DSN=&INDUT..W23328A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ EXTRACT FILE HERCULES INFO                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
//W23328D4 DD  DSN=&INDUT..W23328B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ ERROR FILE                                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
