//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL TILL CARPAC MED EMBLEM PER ARTIKEL                              
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W233B1                                      
//*                                                                             
//*  ÅTERSTART:    W23366    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W233P066 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W910,                                                    
//             INDUT=&WUT..W233B1                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W233PD66),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W91028(+0),DISP=SHR                                 
//************ MASTERFIL                                                        
//*                                                                             
//SORTOUT  DD  DSN=&&W91028,DISP=(NEW,PASS,DELETE),                             
//************ MASTERFIL SORTERAD PÅ ARTIKELNR                                  
//         SPACE=(15,(2000,10),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23366   EXEC PGM=W23366                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23366D1 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ARTIKELFIL                                                       
//*                                                                             
//W23366D2 DD  DSN=&&W91028,DISP=SHR                                            
//************ FIL MED ARTIKELNR OCH EMBLEM                                     
//*                                                                             
//W23366D3 DD  DSN=&INDUT..W23367(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ EMBLEM PER ARTIKELNUMMER                                         
//             SPACE=(96,(40,13),RLSE),AVGREC=K,                                
//             MGMTCLAS=&BACKUPC                                                
