//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROGRAM THAT SUM CALL OFFS FOR NDC CN AND NDC NA-USA                       
//*                                                                             
//*  FREQUENCE:    PLANNING PERIOD     RTN W233PV                               
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W2334600    NORMAL                                           
//*                READS        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W233P046 PROC STPLIB=&INDRTE..LOAD,                                           
//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//             INDIN=&W233..W233PV,                                             
//             INDUT=&W233..W233PV                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W233PD46),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23344(+0),DISP=SHR                                  
//************ CALL OFFS NDC CN                                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W23345,DISP=(NEW,PASS,DELETE),                             
//************ CALL OFFS NDC CN, SORTED DC, SUPPLIER, PARTNO                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2334600 EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23346,W23346,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W23346D1 DD  DSN=&&W23345,DISP=(OLD,DELETE,DELETE)                            
//************ CALL OFFS NDC, SORTED DC, SUPPLIER, PARTNO                       
//*                                                                             
//W23346D2 DD  DSN=&INDUT..W23346(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS DC 71                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D3 DD  DSN=&INDUT..W23347(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS DC72                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D4 DD  DSN=&INDUT..W23348(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC73                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D5 DD  DSN=&INDUT..W23349(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC11                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D6 DD  DSN=&INDUT..W23350(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC41                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D7 DD  DSN=&INDUT..W23351(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC43                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D8 DD  DSN=&INDUT..W23352(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC44                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346D9 DD  DSN=&INDUT..W23353(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC45                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346DA DD  DSN=&INDUT..W23354(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC46                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346DB DD  DSN=&INDUT..W23355(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMED CALL OFFS, DC47                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23346DC DD  DSN=&INDUT..W23346.S4HANA(+1),                  -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SUMMED CALL OFFS FOR ALL PLANTS TO S4HANA                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
