//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            PLANERADE AVROP                                        *         
//*            KOPIERING AV PV-FIL TILL EASYTRIEV-FIL                 *         
//*                                                                   *         
//*            PERIODICITET: VECKA                                              
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W233P090 PROC INDUT=&W020,                                                    
//             INDIN=&W233..W233V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W233SS   EXEC PGM=SORT                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSIN    DD   DSN=&INDRTE..CONSTANT(W233PD90),DISP=SHR                        
//SORTIN   DD   DSN=&INDIN..W23320(+0),DISP=SHR                                 
//**************                                                    ***         
//SORTOUT  DD DSN=&INDUT..PLAVROP(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//**************                                                    ***         
//*            SPACE=(6216,(400,90),RLSE),                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
