//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  WRITE CALL OFF LIST TO EXCEL FROM SCREEN 2423                              
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W235B3                                         
//*                                                                             
//*  RESTART:      W23513    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W235P013 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W235..W235B3,                                             
//             INDUT=&W235..W235B3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W235PD13),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W2351102(+0),DISP=SHR                                
//SORTOUT  DD  DSN=&&W2351102,DISP=(NEW,PASS,DELETE),                           
//************ INFIL WITH CALL OFF                                              
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23513   EXEC PGM=W23513                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23513D1 DD  DSN=&&W2351102,DISP=(OLD,DELETE,DELETE)                          
//************ SORTED CALL OFF LIST                                             
//*                                                                             
//W23513D2 DD  DSN=&INDUT..W2351301(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ OUTPUT FILE WITH CALL OFF LIST VIA MAIL                          
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
