//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DELIVERY PROMISES LIST TO EXCEL FROM SCREEN 2423                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W235B3                                         
//*                                                                             
//*  RESTART:      W23512    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W235P012 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W235..W235B3,                                             
//             INDUT=&W235..W235B3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W235PD12),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W2351101(+0),DISP=SHR                                
//SORTOUT  DD  DSN=&&W2351101,DISP=(NEW,PASS,DELETE),                           
//************ INFIL WITH DELIVERY PROMISES                                     
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23512   EXEC PGM=W23512                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23512D1 DD  DSN=&&W2351101,DISP=(OLD,DELETE,DELETE)                          
//************ SORTED INFILE WITH DELIVERY PROMISES                             
//*                                                                             
//W23512D2 DD  DSN=&INDUT..W2351201(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ OUTPUT FILE WITH DELICERY PROMISES VIA MAIL                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
