//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERING AV LEVERANDBEDÖMNINGSDATA                                        
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD    RTN W200P1                               
//*                                                                             
//*  ÅTERSTART:    W23506    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W235P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W235..W200P1,                                             
//             INDUT=&W235..W200P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23506   EXEC PGM=W23506                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23506D1 DD  DSN=&INDIN..W23501(+0),DISP=SHR                                  
//************ INFO FRÅN LEVERANSBEDÖMNINGSREGISTRET                            
//*                                                                             
//W23506D2 DD  DSN=&INDUT..W23503(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SORTERAD LEVERANSBEDÖMNINGSDATA                                  
//             MGMTCLAS=&BACKUPC,SPACE=(23439,(23,3),RLSE)                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
