//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SELECTION SUPPLIER INFORMATION FROM SCREN 2423                             
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W235B3                                         
//*                                                                             
//*  RESTART:      W23511      NORMAL                                           
//*                READS        WDK7 WDB6 WDK6 WDD9 W6D1 WDF5                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W235P011 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W235..W235B3,                                             
//             INDUT=&W235..W235B3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23511   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23511,W23511,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//W6D1     INCLUDE MEMBER=W6D1                                                  
//WDF5     INCLUDE MEMBER=WDF5                                                  
//W23511D1 DD  DSN=&INDIN..W235PARM(+0),DISP=SHR                                
//************ PARAMETER FILE FROM SCREEN 2423                                  
//*                                                                             
//W23511D2 DD  DSN=&INDUT..W2351101(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ DELIVERY PROMISES                                                
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23511D3 DD  DSN=&INDUT..W2351102(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ CALL OFF                                                         
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
