//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER AVROPSLISTA TILL EXCEL                                             
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W235B2                                         
//*                                                                             
//*  RESTART:      W23509    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W235P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W235..W235B2,                                             
//             INDUT=&W235..W235B2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23509   EXEC PGM=W23509                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W23509D1 DD  DSN=&INDIN..W23509(+0),DISP=SHR                                  
//************ INFIL MED AVROP                                                  
//*                                                                             
//W23509D2 DD  DSN=&INDUT..W23510(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ UTFIL MED AVROP FÖR SÄNDING VIA MAIL                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
