//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA W23662-001, LEVERANSFÖRSENADE ARTIKLAR                        
//*                                                                             
//*  FREKVENS:     VECKA     RTN W200V2                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W236..W200V2,                                             
//             DEST1=&CPRINT,                                                   
//             INDUT=&W236..W200V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23660(+0),DISP=SHR                                  
//************ LEVERANSFÖRSENADE ARTIKLAR, OSORTERAD                            
//*                                                                             
//SORTOUT  DD  DSN=&&W2366A,DISP=(NEW,PASS,DELETE),                             
//************ LEVERANSFÖRSENADE ARTIKLAR, SORTERAD                             
//             SPACE=(23408,(200,100),RLSE)                                     
//**           DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD61),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23661(+0),DISP=SHR                                  
//************ FIL MED INFO FRÅN WDD924 (LEVBESK), OSORTERAD                    
//*                                                                             
//SORTOUT  DD  DSN=&&W2366B,DISP=(NEW,PASS,DELETE),                             
//************ FIL MED INFO FRÅN WDD924 (LEVBESK), SORTERAD                     
//             SPACE=(23472,(200,100),RLSE)                                     
//**           DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23662   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23662,W23662,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDP3     INCLUDE MEMBER=WDP3                                                  
//*                                                                             
//OUT1 OUTPUT FORMDEF=SLS09F,PAGEDEF=SLS09F                                     
//*                                                                             
//W23662D1  DD DSN=&&W2366A,DISP=(OLD,DELETE,DELETE)                            
//************ FIL MED INFO FRÅN WDD924 (LEVBESK), SORTERAD                     
//*                                                                             
//W23662D2  DD DSN=&&W2366B,DISP=(OLD,DELETE,DELETE)                            
//************ FIL MED INFO FRÅN WDD924 (LEVBESK), SORTERAD                     
//*                                                                             
//W23662D3  DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.OUT1),                   
//************ W23662-001, LISTA LEVERANSFÖRSENADE ARTIKLAR                     
//             DCB=(RECFM=FBA,LRECL=165,BLKSIZE=165)                            
//*                                                                             
//W23662D4  DD DSN=&INDUT..W23663(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED LISTA LEVERANSFÖRSENADE ARTIKLAR TILL MEMO               
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
