//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SPFU NEDLÄSNING WDR3                                                       
//*                                                                             
//*  FREKVENS:     DAG         RTN W236D2                                       
//*                                                                             
//*  ÅTERSTART:    W23686      NORMAL                                           
//*                LÄSER       WDR3                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P086 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W236..W236D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23686   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23686,W23686,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR3     INCLUDE MEMBER=WDR3                                                  
//W23686D1 DD  DSN=&&TEMPFIL,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W23686D2 DD  DSN=&INDUT..W23687(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ BORTTAG                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD84),DISP=SHR                         
//SORTIN   DD  DSN=&&TEMPFIL,DISP=SHR                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W23686(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SPFU                                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
