//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTPOSTER, INLEVERANS R31 UTAN MOTSVARANDE                         
//*  LEVERANSPLAN                                                               
//*                                                                             
//*  FREKVENS:     DAG    RTN W236D1                                            
//*                                                                             
//*  ÅTERSTART:    W23652                                                       
//*                UPPDATERAR  WDG3                                             
//*                LÄSER  WDK6                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P052 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W236..W236D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23652   EXEC PGM=DFSRRC00,                                                   
//         PARM=('BMP,W23652,W23652,,,N00,,,,,&CPU,,,&IMS')                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W23652D1 DD  DSN=&INDUT..W23653(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LISTPOSTER, INLEVERANS UTAN MOTSVARANDE LEVERANSPLAN             
//             MGMTCLAS=&NOBACKUP,                                              
//             SPACE=(24,(100,500),RLSE),AVGREC=U                               
//*                                                                             
//W23652D2 DD  DSN=&INDUT..W23652(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ POST OM OMSTART SKA SKE                                          
//             SPACE=(1,(1,1),RLSE),AVGREC=U,                                   
//             MGMTCLAS=DEL2                                                    
//*                                                                             
