//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RÄKNAR FRAM HIGH/LOW FREQUENCY (KDOTFREK) PER ARTIKEL                      
//*  WXTR-FIL.                                                                  
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W236R1                            
//*                                                                             
//*  ÅTERSTART:    W23658    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P058 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W236..W236R1,                                            
//             INDIN2=&W011..QASE,                                              
//             INDUT=&W236..W236R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//**********************************************************************        
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD58),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01103(+0),DISP=SHR                                 
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01103C,DISP=(NEW,PASS,DELETE),                            
//************ SUPERSESSIONS: ONLY FLTXEXT = 'N' AND UNIQUE COMBOS              
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PT58),DISP=SHR                         
//SORTIN   DD  DSN=&&W01103C,DISP=SHR                                           
//************ SUPERSESSIONS: ONLY FLTXEXT = 'N' AND UNIQUE COMBOS              
//*                                                                             
//SORTOUT  DD  DSN=&&W01103T,DISP=(NEW,PASS,DELETE),                            
//************ ONLY UNIQUE SUPERSEDING (TILLKOMMANDE) PARTS                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//SORT03   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PE58),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01103(+0),DISP=SHR                                 
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01103E,DISP=(NEW,PASS,DELETE),                            
//************ ONLY UNIQUE SUPERSEDED (ERSATTA) PARTS                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//W23658   EXEC PGM=V16459,PARM='W23658/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W23658D0 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ WDK6-INFO                                                        
//*                                                                             
//W23658D1 DD  DSN=&INDIN1..W23657(+0),DISP=SHR                                 
//************ WDL8-INFO                                                        
//*                                                                             
//W23658D2 DD  DSN=&&W01103T,DISP=SHR                                           
//************ UNIQUE SUPERSEDING PARTS                                         
//*                                                                             
//W23658D3 DD  DSN=&&W236581,DISP=(NEW,PASS,DELETE),                            
//************ HIGH FREQUENCY (DIRECTLY QUALIFYING)                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMPFIL1,DISP=(NEW,PASS,DELETE),                           
//************ CHECK IF PARTS ARE SUPERSEDING PARTS                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23658D4 DD  DSN=&&W236582,DISP=(NEW,PASS,DELETE),                            
//************ LOW FREQUENCY (NOT SUPERSEEDING IN ANY SUPERS.)                  
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMPFIL2,DISP=(NEW,PASS,DELETE),                           
//************ CHECK PRECEDING PART VOLUMES IN SUPERSESSION CHAINS              
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23658D5 DD  DSN=&&W01103E,DISP=SHR                                           
//************ UNIQUE SUPERSEDED PARTS                                          
//*                                                                             
//TEMPFIL3 DD  DSN=&&TEMPFIL3,DISP=(NEW,PASS,DELETE),                           
//************ ORDER HITS ON SUPERSEDED PARTS                                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//SUPDTABL DD  DSN=&&SUPDTABL,DISP=(NEW,PASS,DELETE),                           
//************ ORDER HITS ON SUPERSEDED PARTS IN LOOK-UP TABLE                  
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23658D6 DD  DSN=&&W01103C,DISP=SHR                                           
//************ UNIQUE COMBOS SUPERSEDING PARTS -> SUPERSEDED PARTS              
//*                                                                             
//TEMPFIL4 DD  DSN=&&TEMPFIL4,DISP=(NEW,PASS,DELETE),                           
//************ UNIQUE COMBOS SUPERSEDING PARTS -> SUPERSEDED PARTS XREF         
//             DATACLAS=PSEB                                                    
//*                                                                             
//SUPXREF  DD  DSN=&&SUPXREF,DISP=(NEW,PASS,DELETE),                            
//************ UNIQUE COMBOS SUPERSEDING PARTS -> SUPERSEDED PARTS XREF         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W23658D7 DD  DSN=&&W236583,DISP=(NEW,PASS,DELETE),                            
//************ HIGH/LOW AFTER CHECKING ORDER HITS FOR PRECEDING PARTS           
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGEN1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&W236581,DISP=SHR                                           
//         DD  DSN=&&W236582,DISP=SHR                                           
//         DD  DSN=&&W236583,DISP=SHR                                           
//************ OVANSTÅENDE FILER TILL KOPIERING                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W23658(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ CONSOLIDATED HIGH/LOW FREQUENCY FOR ALL CURRENT PARTS            
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
