//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL TILL SPFU SAMT REGISTER                                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W236D2                                           
//*                                                                             
//*  ÅTERSTART:    W23699    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P099 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W236..W236D2,                                             
//             INDUT=&W236..W236D2,                                             
//             INREG=&W236..W236D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD99),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W23688(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W23686(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W23688,DISP=(NEW,PASS,DELETE),                             
//************ TRANSAR SPFU SORTERADE                                           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23699   EXEC PGM=V16459,PARM='W23699/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W23699D1 DD  DSN=&&W23688,DISP=(OLD,DELETE,DELETE)                            
//************ FIL TILL SPFU                                                    
//*                                                                             
//W23699D2 DD  DSN=&INREG..W23689(+0),DISP=SHR                                  
//************ REGISTER-IN                                                      
//*                                                                             
//W23699D3 DD  DSN=&INDUT..W23690(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ KOLLAD FIL TILL SPFU                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W23699D4 DD  DSN=&&TEMPFIL,DISP=(NEW,PASS,DELETE),                            
//************ REGISTER-UT                                                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W236PD84),DISP=SHR                         
//SORTIN   DD  DSN=&&TEMPFIL,DISP=SHR                                           
//*                                                                             
//SORTOUT  DD  DSN=&INREG..W23689(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ REGISTER-UT                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
