//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPL VECKANS INLEV MED WDD9                                               
//*                                                                             
//*  FREKVENS:     VECKA     RTN W236V2                                         
//*                                                                             
//*  ÅTERSTART:    W23634      NORMAL                                           
//*                LÄSER        WDD9                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P134 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W236..W236V2,                                             
//             INDUT=&W236..W236V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23634   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23634,W23634,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD9     INCLUDE MEMBER=WDD9                                                  
//W23634D1 DD  DSN=&INDIN..W23634(+0),DISP=SHR                                  
//************ INLEV GÅGNA VECKAN                                               
//*                                                                             
//W23634D2 DD  DSN=&INDUT..W23638(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INLEV + WDD9                                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
