//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INPUT FILE IS AN EXTRACT OF WDD9 DB USING DL1PR                            
//*  CREATE A TAB-SEPARATED EXTRACT OF WDD925 FILE                              
//*  TO SEND TO THE DATALAKE                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W236D5                                         
//*                                                                             
//*  RESTART:      W2361G    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P01G PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W236..W236D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2361G   EXEC PGM=V16459,PARM='W2361G/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//INFIL01  DD  DSN=&INDIN..WDD925(+0),DISP=SHR                                  
//************                                                                  
//*                                                                             
//UTFIL01  DD  DSN=&&W2361GX,DISP=(NEW,PASS,DELETE),                            
//************ TAB-SEPARATED EXTRACT FILE OF WDD925                             
//             DATACLAS=PSEB                                                    
//*                                                                             
