//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER UT KVOI OCH KVOT RULLANDE FRÅN WDL7                                  
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W236R1                            
//*                                                                             
//*  ÅTERSTART:    W23656      NORMAL                                           
//*                LÄSER        WDL7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W236P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W236..W236R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W23656   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W23656,W23656,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL7     INCLUDE MEMBER=WDL7                                                  
//W23656D1 DD  DSN=&INDUT..W23656(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ KVOT OCH KVOI FÖR SENASTE 12 RP                                  
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
