//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PART INFORMATION                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W252D1                                         
//*                                                                             
//*  RESTART:      W25211    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W252P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W252..W252D1,                                            
//             INDIN2=&W011..&RTEGRP,                                           
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDIN4=&W011..NDC,                                               
//             INDIN5=&W236..W252D1,                                            
//             INDIN6=&W612..W252D1,                                            
//             INDUT=&W252..W252D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W252PD09),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN4..W01183(+0),DISP=SHR                                 
//************ WDK723 - AVTALSINFORMATION                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W01183,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W252PD09),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN4..W01185(+0),DISP=SHR                                 
//************ WDK724 - BESTÄLLNINGS PRIS                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W01185,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT3    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W252PD11),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN5..W23683(+0),DISP=SHR                                 
//         DD  DSN=&INDIN6..W6125B(+0),DISP=SHR                                 
//************ WDL221/WDL611 - REC.DATE AND GIT ETA                             
//*                                                                             
//SORTOUT  DD  DSN=&&W23683,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W25211   EXEC PGM=V16459,PARM='W25211/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W25211D1 DD  DSN=&INDIN1..W25209(+0),DISP=SHR                                 
//************ PART INFORMATION - WDK7                                          
//*                                                                             
//W25211D2 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ WDK601 AND WDK611 - PART INFORMATION                             
//*                                                                             
//W25211D3 DD  DSN=&INDIN3..W01161(+0),DISP=SHR                                 
//************ WDK621 - BESTÄLLNINGS PRIS                                       
//*                                                                             
//W25211D4 DD  DSN=&INDIN3..W01163(+0),DISP=SHR                                 
//************ WDK623 - AVTALSINFORMATION                                       
//*                                                                             
//W25211D5 DD  DSN=&&W01183,DISP=SHR                                            
//************ WDK723 - AVTALSINFORMATION                                       
//*                                                                             
//W25211D6 DD  DSN=&&W01185,DISP=SHR                                            
//************ WDK724 - BESTÄLLNINGS PRIS                                       
//*                                                                             
//W25211D7 DD  DSN=&INDIN2..W01174(+0),DISP=SHR                                 
//************ WDD3 - PART DESCRIPTION                                          
//*                                                                             
//W25211D8 DD  DSN=&&W23683,DISP=SHR                                            
//************ WDL221/WDL611 - REC.DATE AND GIT ETA                             
//*                                                                             
//W25211D9 DD  DSN=&INDUT..W25211(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
