//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PART INFORMATION - PROCURMENT                                              
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W252D1                                         
//*                                                                             
//*  RESTART:      W25214    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W252J014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W252..W252D1,                                             
//             INDUT=&W252..W252D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W25214   EXEC PGM=W25214                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W25214D1 DD  DSN=&INDIN..W25213(+0),DISP=SHR                                  
//************ PART INFORMATION - PROCURMENT                                    
//*                                                                             
//W25214D2 DD  DSN=&INDUT..W25214(+1),DISP=(NEW,CATLG,DELETE),   -LIM(1)        
//************ PART INFORMATION - PROCURMENT - EXCEL FILE                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
