//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÄT TOT LISTA                                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W252D1                                         
//*                                                                             
//*  RESTART:      W25212      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W252P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W252..W252D1,                                             
//             INDUT=&W252..W252D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W25212   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W25212,W25212,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDD2     INCLUDE MEMBER=WDD2                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDP3     INCLUDE MEMBER=WDP3                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//W6G1     INCLUDE MEMBER=W6G1                                                  
//*                                                                             
//W25212D1 DD  DSN=&INDIN..W25211(+0),DISP=SHR                                  
//************ ÄT TOTLISTA                                                      
//*                                                                             
//W25212D2 DD  DSN=&INDUT..W25212(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ ÄT TOT LIST COMPLETED WITH INFO FROM DATABASES                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
