//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKROTUNDERLAG                                                              
//*                                                                             
//*  FREKVENS:     VECKA         RTN W261V4                                     
//*                                                                             
//*  ÅTERSTART:    W26174    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26174   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W26174,W26174,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26174D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELREGISTER/LAGERBAND                                        
//*                                                                             
