//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLL + BENÄMNING                                                       
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W261V2                                         
//*                                                                             
//*  RESTART:      W26192    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P092 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W261..W261V2,                                             
//             INDIN2=&W261..W261X1P0,                                          
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDUT=&W261..W261V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26192   EXEC PGM=W26192                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26192D1 DD  DSN=&INDIN..W26191(+0),DISP=SHR                                  
//************ ARTIKLAR TIURPROD                                                
//*                                                                             
//W26192D2 DD  DSN=&INDIN2..W26164(+0),DISP=SHR                                 
//************ FÖRSÄLJNINGS INFO                                                
//*                                                                             
//W26192D3 DD  DSN=&INDIN3..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGAR                                                      
//*                                                                             
//W26192D4 DD  DSN=&INDUT..W26192(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKLAR TILL SKAPA SKROTUNDERLAG (AUT)                          
//             SPACE=(88,(3000,666),RLSE),AVGREC=U,                             
//             MGMTCLAS=&BACKUPC                                                
