//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PLOCKAR FRAM TIURPROD ARTIKLAR                                             
//*                                                                             
//*  FREKVENS:     VECKA         RTN W261V2                                     
//*                                                                             
//*  ÅTERSTART:    W26161    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P261 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDUT=&W261..W261V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26161   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W26161,W26161,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDG2     INCLUDE MEMBER=WDG2                                                  
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26161D1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ ARTIKELINFORMATION                                               
//*                                                                             
//W26161D2 DD  DSN=&INDUT..W26162(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKLAR MED TIURPROD INFORMATION                                
//             SPACE=(46,(8,2),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
