//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKROTUNDERLAG RENSNING WLC                                                 
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W261B5                                     
//*                                                                             
//*  ÅTERSTART:    W26147    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P047 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W261..W261B5,                                             
//             INDIN2=&W261..W261B5                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26147   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W26147,W26147,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26147D1 DD  DSN=&INDIN..W26146(+0),DISP=SHR                                  
//************ ARTIKLAR SKROTBEVAKNING 2 ÅR  NY                                 
//*                                                                             
//W26147D2 DD  DSN=&INDIN2..W26146(-1),DISP=SHR                                 
//************ ARTIKLAR SKROTBEVAKNING 2 ÅR  GAMMAL                             
//*                                                                             
