//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKROTUNDERLAG WLC                                                          
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W261B5                                     
//*                                                                             
//*  ÅTERSTART:    W26145    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W261..W261B5,                                             
//             INDUT=&W261..W261B5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26145   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W26145,W26145,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26145D1 DD  DSN=&INDIN..W26144(+0),DISP=SHR                                  
//************ SKROTUNDERLAG BEVAKNING                                          
//*                                                                             
//W26145D2 DD  DSN=&INDUT..W26146(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ ARTIKLAR BEVAKNING SKROT INOM 2 ÅR                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
