//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NEDLÄSNING AV FUNKTIONSGRUPPER                                             
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W261B3                                     
//*                                                                             
//*  ÅTERSTART:    W26160    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P060 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W261..W261B3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26160   EXEC PGM=W26160                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26160D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELINFORMATION                                               
//*                                                                             
//W26160D2 DD  DSN=&INDUT..W26161(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ VIKTIGA FUNKTIONSGRUPPER                                         
//             SPACE=(5,(2,1),RLSE),AVGREC=K,                                   
//             MGMTCLAS=&BACKUPC                                                
