//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKROTUNDERLAG   AUTOMATISKT GODKÄNNANDE                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W261V2                                     
//*                                                                             
//*  ÅTERSTART:    W26169    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P269 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W261..W261V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261SR  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W26169(+0),DISP=SHR                                  
//*                SKROTUNDERLAG FÖR GODKÄNNANDE                                
//*                                                                             
//SORTOUT  DD  DSN=&&W26169,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W261PD69),DISP=SHR                         
//SORTMSG  DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26169   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W26169,W26169,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W26169D1 DD  DSN=&&W26169,DISP=(OLD,DELETE,DELETE)                            
//************ SKROTUNDERLAG FÖR GODKÄNNANDE                                    
//*                                                                             
