//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LTK-UPPFÖLJNING OCH LAGERBALANSERING                                       
//*  MITT I PLANERINGSPERIOD                                                    
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD    RTN W261P1                               
//*                                                                             
//*  ÅTERSTART:    W26114   NORMAL                                              
//*                                                                             
//*                W26116   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             DBB=DLI,                                                         
//             INDUT=&W261..W261P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26114   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W26114,W26114,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W26114D1 DD  DSN=&&W26115,DISP=(NEW,PASS,DELETE),                             
//************ ARTINFO FÖR LTK-UPPFÖLJNING OCH LAGERBALANSERING                 
//             SPACE=(6224,(1200,200),RLSE)                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26116   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W261PD16),DISP=SHR                         
//SORTIN   DD  DSN=&&W26115,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W26117(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTINFO FÖR LTK-UPPFÖLJNING OCH LAGERBALANSERING                 
//             MGMTCLAS=&BACKUPC,SPACE=(6224,(1200,200),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
