//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*        SKAPAR LAGERBALANSLISTA                                    *         
//*                                                                   *         
//*        PERIODICITET: MITT I PLANERINGSPERIOD 1 OCH 5              *         
//*                      (PERIOD + 3 VECKOR OM DET ÄR FEB,            *         
//*                       MAR ELLER SEP.)                             *         
//*                                                                   *         
//*        ÅTERSTART:    NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W261P005 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W261..W261B1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26150   EXEC PGM=V16459,PARM='W26150/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W26150D1 DD  DSN=&INDIN..W26137(+0),DISP=SHR                                  
//************ LISTPOSTER LAGERBALANSERING FRÅN W261P003                        
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W26150D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W26150-001  LAGERBALANSERING PER ANSKAFFARE                      
//*                                                                             
