//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR EFR-RAD-FIL MED IDANSK OCH GRUPP FÖR                          
//*  ALLA RADER MED DISTR=81 KUND=11 OCH 111                                    
//*                                                                             
//*  FREKVENS:     VECKA     RTN W261V1                                         
//*                                                                             
//*  ÅTERSTART:    W26156      NORMAL                                           
//*                LÄSER        WDK6                                            
//**************************************************************                
//*   OBS   PROCEDUR W483P207                                         *         
//*   KOPIERAR  W479.W483V1.W47953(+0)                                *         
//*       TILL  W479.W483V1.EFRRAD(+1) ...                            *         
//*   Som sen renamas in i W261V1 för att skapa information om vilka  *         
//*   skrotbeordrade artiklar som ligger på EFR                       *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W261P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W479..W261V1,                                            
//             INDUT=&W261..W261V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W26156   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W26156,WDK6BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//*                                                                             
//W26156D1 DD  DSN=&INDIN2..EFRRAD,DISP=SHR                                     
//************ ALLA EFR-RADER FRÅN RUTIN V483V1                                 
//*                                                                             
//W26156D2 DD  DSN=&INDUT..W26156(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ALLA EFR-RADER FRÅN DISTR=81 KUND=11 OCH 111                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
