//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REFILL - LISTA, AKTIVA ARTIKLAR MED ÖVERLAGER                              
//*           LISTA, PASSIVA ARTIKLAR MED LAGER                                 
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W271R3                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                W27151    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P051 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDIN3=&W011..LDC,                                               
//             INDIN4=&W011..SDC,                                               
//             INDIN5=&W011..NDC,                                               
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD51),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ SAMTLIGA DATAELEMENT FRÅN WDK711, LDC                            
//*                                                                             
//         DD  DSN=&INDIN4..W01184(+0),DISP=SHR                                 
//*            SAMTLIGA DATAELEMENT FRÅN WDK711, SDC                            
//*                                                                             
//         DD  DSN=&INDIN5..W01184(+0),DISP=SHR                                 
//*            SAMTLIGA DATAELEMENT FRÅN WDK711, NDC                            
//*                                                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SAMTLIGA DATAELEMENT FRÅN WDK711 - SAMTLIGA SDC                  
//         DATACLAS=PSEB                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD51),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN3..W01186(+0),DISP=SHR                                 
//************ SAMTLIGA DATAELEMENT FRÅN WDL711, LDC                            
//*                                                                             
//         DD  DSN=&INDIN4..W01186(+0),DISP=SHR                                 
//*          * SAMTLIGA DATAELEMENT FRÅN WDL711, SDC                            
//*                                                                             
//         DD  DSN=&INDIN5..W01186(+0),DISP=SHR                                 
//*          * SAMTLIGA DATAELEMENT FRÅN WDL711, NDC                            
//*                                                                             
//SORTOUT  DD  DSN=&&W01186,DISP=(NEW,PASS,DELETE),                             
//************ SAMTLIGA DATAELEMENT FRÅN WDL711 - SAMTLIGA SDC                  
//         DATACLAS=PSEB                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27151   EXEC PGM=V16459,PARM='W27151/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(3000,500))                                          
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W27151D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ SAMTLIGA DATAELEMENT FRÅN WDK711 - SAMTLIGA DC                   
//*                                                                             
//W27151D2 DD  DSN=&&W01186,DISP=(OLD,DELETE,DELETE)                            
//************ SAMTLIGA DATAELEMENT FRÅN WDL711 - SAMTLIGA DC                   
//*                                                                             
//W27151D3 DD  DSN=&INDIN2..W01168(+0),DISP=SHR                                 
//************ SAMTLIGA DATAELEMENT FRÅN WDD901                                 
//*                                                                             
//W27151D4 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ SAMTLIGA DATAELEMENT FRÅN WDK601-WDK611                          
//*                                                                             
//W27151D5 DD  DSN=&INDIN2..W01174(+0),DISP=SHR                                 
//************ BENÄMNING WDE3                                                   
//*                                                                             
//W27151DX DD  DSN=&&W271511,DISP=(NEW,PASS,DELETE),                            
//         DATACLAS=PSEB                                                        
//************ TEMPFIL, ARTIKELINFO PER DC                                      
//*                                                                             
//W27151DY DD  DSN=&&W271512,DISP=(NEW,PASS,DELETE),                            
//         DATACLAS=PSEB                                                        
//************ TEMPFIL, ARTIKELINFO CDC                                         
//*                                                                             
//W27151DZ DD  DSN=&&W271513,DISP=(NEW,PASS,DELETE),                            
//         DATACLAS=PSEB                                                        
//************ TEMPFIL, ARTIKELINFO CDC MED BENÄMNING                           
//*                                                                             
//************ TEMPFIL, ARTIKELINFO CDC MED BENÄMNING                           
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W27151D7 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-110  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             SDC SAMTLIGA BUYERS                                  
//*                                                                             
//W27151D8 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-120  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             NDC SAMTLIGA BUYERS                                  
//*                                                                             
//W27151D9 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-121  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             NDC BUYER 80 - 99                                    
//*                                                                             
//W27151DA DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-210  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             SDC SAMTLIGA BUYERS                                  
//*                                                                             
//W27151DB DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-220  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             NDC SAMTLIGA BUYERS                                  
//*                                                                             
//W27151DC DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-221  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             NDC BUYER 80 - 99                                    
//*                                                                             
//W27151DD DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-122  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             NDC JAPAN                                            
//*                                                                             
//W27151DE DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-222  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             NDC JAPAN                                            
//*                                                                             
//W27151DF DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-123  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             NDC AUSTRALIEN                                       
//*                                                                             
//W27151DG DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-223  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             NDC AUSTRALIEN                                       
//*                                                                             
//W27151DH DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-310  REFILL - PASSIVA ARTIKLAR MED LAGER                  
//************             LDC ENKÖPING                                         
//*                                                                             
//W27151DI DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27151-320  REFILL - AKTIVA ARTIKLAR MED ÖVERLAGER               
//************             LDC ENKÖPING                                         
//*                                                                             
