//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  HÄMTAR BENÄMNING TILL PROGNOSLARM                                          
//*                                                                             
//*  FREKVENS:     DAGLIG    RTN W271D9                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27138    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D9,                                             
//             INDUT=&W271..W271D9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27138   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27138,W27138,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W27138D1 DD  DSN=&INDIN..W27138V1,DISP=SHR                                    
//************ PROGNOSLARM                                                      
//*                                                                             
//W27138D2 DD  DSN=&INDUT..W27139(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PROGNOSLARM                                                      
//             SPACE=(47,(2,6),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
