//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BEDÖMMER SENASTE DYGNETS ORDERINGÅNG, SKAPAR MEMO                          
//*  ELLER REFILLFÖRSLAG VID HÖG OI, 1A OI SAMT 1A OI PÅ                        
//*  ETT ÅR                                                                     
//*                                                                             
//*  FREKVENS:     DAG         RTN W271D8                                       
//*                                                                             
//*  ÅTERSTART:    W27102      NORMAL                                           
//*                LÄSER        WDK6 WDK7                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D8,                                             
//             INDUT=&W271..W271D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27102   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27102,W27102,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W27102D1 DD  DSN=&INDIN..W27101(+0),DISP=SHR                                  
//************ ORDERINGÅNG SENASTE DYGNET                                       
//*                                                                             
//W27102D2 DD  DSN=&INDUT..W27102(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ REFILLFÖRSLAG, NDC                                               
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W27102D3 DD  DSN=&INDUT..W27103(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMOPOSTER VID HÖG OI ELLER 1A OI, SDC                           
//             SPACE=(21,(1000,166),RLSE),AVGREC=U,                             
//             MGMTCLAS=&DEL2BKPC                                               
//W27102D4 DD  DSN=&INDUT..W27104(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMOPOSTER VID HÖG OI, NDC                                       
//             SPACE=(25,(1000,166),RLSE),AVGREC=U,                             
//             MGMTCLAS=&DEL2BKPC                                               
