//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DIV UPPDATERING AV REFILLARTIKLAR                                          
//*  ARTIKEL                                                                    
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D2                                            
//*                       RTN W271DB                                            
//*                VECKA  RTN W271V2                                            
//*                                                                             
//*  ÅTERSTART:    W27136    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=SAKNAS,                                                    
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27136   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27136,W27136,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27136D1 DD  DSN=&INDIN..W27136(+0),DISP=SHR                                  
//************ ARTIKLAR FÖR UPPDATERING I PGM W27136                            
//*                                                                             
//W27136D2 DD  DSN=&&W27137,DISP=(NEW,PASS,DELETE),                             
//************ TILLKOMMANDE ARTIKEL REDAN RENSAD ELLER ERSATT                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W27136D3  DD DSN=&INDUT..W27135(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SÄSONG KOMMER INTE ATT ÄRVAS                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD37),DISP=SHR                         
//SORTIN   DD  DSN=&&W27137,DISP=(OLD,DELETE,DELETE)                            
//************ TILLKOMMANDE ARTIKEL REDAN RENSAD ELLER ERSATT                   
//*            SORT DC, IDARNR                                                  
//*                                                                             
//SORTOUT   DD DSN=&INDUT..W27137(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TILLKOMMANDE ARTIKEL REDAN RENSAD ELLER ERSATT                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
