//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR FIL MED GÅRDAGENS NEDLÄSNING AV L7 MED                             
//*  DAGENS. SKAPAR FIL MED SENASTE DYGNETS ORDERINGÅNG                         
//*                                                                             
//*  FREKVENS:     DAG         RTN W271D8                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                W27101    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P001 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..LDC,                                               
//             INDIN2=&W011..SDC,                                               
//             INDIN3=&W011..NDC,                                               
//             INDUT=&W271..W271D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01186(-1),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG, FÖREGÅENDE DYGN, DC LDC                     
//*                                                                             
//         DD  DSN=&INDIN2..W01186(-1),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG, FÖREGÅENDE DYGN, DC SDC                     
//*                                                                             
//         DD  DSN=&INDIN3..W01186(-1),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG, FÖREGÅENDE DYGN, DC NDC                     
//*                                                                             
//SORTOUT  DD  DSN=&&W27186O,DISP=(NEW,PASS,DELETE),                            
//************ NEDLÄST ORDERINGÅNG, FÖREGÅENDE DYGN,                            
//************ DC 1A-62 SORT ART/DC                                             
//         DATACLAS=PSEB                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01186(+0),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG SENASTE DYGNET, DC LDC                       
//*                                                                             
//         DD  DSN=&INDIN2..W01186(+0),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG SENASTE DYGNET, DC SDC                       
//*                                                                             
//         DD  DSN=&INDIN3..W01186(+0),DISP=SHR                                 
//************ NEDLÄST ORDERINGÅNG SENASTE DYGNET, DC NDC                       
//*                                                                             
//SORTOUT  DD  DSN=&&W27186N,DISP=(NEW,PASS,DELETE),                            
//************ NEDLÄST ORDERINGÅNG, SENASTE DYGNET,                             
//************ DC 1A-62 SORT ART/DC                                             
//         DATACLAS=PSEB                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27101   EXEC PGM=V16459,PARM='W27101/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W27101D1 DD  DSN=&&W27186O,DISP=(OLD,DELETE,DELETE)                           
//************ NEDLÄST ORDERINGÅNG, FÖREGÅENDE DYGN,                            
//************ DC 21-62 SORT ART/DC                                             
//W27101D2 DD  DSN=&&W27186N,DISP=(OLD,DELETE,DELETE)                           
//************ NEDLÄST ORDERINGÅNG, SENASTE DYGNET,                             
//************ DC 21-62 SORT ART/DC                                             
//*                                                                             
//*                                                                             
//W27101D3 DD  DSN=&INDUT..W27101(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR MED ORDERINGÅNG SENASTE DYGNET, SAMTLIGA DC             
//             SPACE=(19,(100,16),RLSE),AVGREC=K,                               
//             MGMTCLAS=&DEL2BKPC                                               
