//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE DATE FROM W271F1 FILE TO WDK7.                                      
//*  THIS IS FOR DELAY IN REF ORDER.                                            
//*                                                                             
//*  FREQUENCE:    DAILY  WEEKLY  RTN W271D2, W271DB, W271V2                    
//*                                                                             
//*  RESTART:      W271F1    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P0F1 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271F1   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W271F1,W271F1,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W271F1D1 DD  DSN=&INDIN..W271F1(+0),DISP=SHR                                  
//************ INPUT FROM W271F1 PROGRAM.                                       
//*                                                                             
