//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SAMLAR AKTIVA ARTIKLAR FRÅN WDK7                                           
//*  LÄSER GRUNDFILEN    W011.QASE.W01160                                       
//*  SAMT EN ELLER FLERA                                                        
//*  AV GRUNDFILERNA                                                            
//*                                                                             
//*         W271V1 ANVÄNDER ;                                                   
//*                                                                             
//*                      W271.LDC.W27147                                        
//*                      W271.SDC.W27147                                        
//*                      W271.NDC.W27147                                        
//*                      W271.CHN.W27147                                        
//*                                                                             
//*         W271D1 OCH W271DA ANVÄNDER ;                                        
//*                                                                             
//*                      W271.LDC.W27148                                        
//*                      W271.SDC.W27148                                        
//*                      W271.NDC.W27148                                        
//*                      W271.CHN.W27148                                        
//*                                                                             
//*  PROCEDUREN KÖRS I FLERA RUTINER, INDUT ANGES I RESP JCL                    
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D1                                            
//*                       RTN W271DA                                            
//*                VECKA  RTN W271V1                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27121    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=DUMMY                                                        
//*                                                                             
//SORTOUT  DD  DSN=&&W27147,DISP=(NEW,PASS,DELETE),                             
//************ ARTIKLAR FRÅN WDK7, SAMTLIGA LAGER                               
//         DATACLAS=PSEB                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27121   EXEC PGM=V16459,PARM='W27121/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W27121D1 DD  DSN=&&W27147,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKLAR FRÅN WDK7, SAMTLIGA LAGER                               
//*                                                                             
//W27121D2 DD  DSN=&INDIN1..W01160(+0),DISP=SHR                                 
//************ GRUNDFIL WDK6                                                    
//*                                                                             
//W27121D3 DD  DSN=&INDUT..W27121(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ AKTIVA ARTIKLAR SAMTLIGA SDC                                     
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
