//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR LOKALA LOKALA KÖP MED LEDTIDEN                                
//*                                                                             
//*  FREKVENS:     DAG       RTN W271DB                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27123    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=SAKNAS,                                                    
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27123   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27123,W27123,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W27123D1 DD  DSN=&INDIN..W27115(+0),DISP=SHR                                  
//************ LOKALA KÖP                                                       
//*                                                                             
//W27123D2 DD  DSN=&INDUT..W27123(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LOKALA KÖP                                                       
//             SPACE=(16,(2,6),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
