//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UNDERLAG TILL RESTORDERLISTA                                        
//*  TOTALT NDC PER LAND/DC                                                     
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V7                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27162    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V7,                                             
//             INDUT=&W271..W271V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27162   EXEC PGM=W27162                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W27162D1 DD  DSN=&INDIN..W27161(+0),DISP=SHR                                  
//************ RESTORDERPOSTER, NDC                                             
//*                                                                             
//W27162D2 DD  DSN=&&W27162,DISP=(NEW,PASS,DELETE),                             
//************ RESTORDERPOSTER PER LAND / DC                                    
//             SPACE=(80,(2,6),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD63),DISP=SHR                         
//SORTIN   DD  DSN=&&W27162,DISP=(OLD,DELETE,DELETE)                            
//************ RESTORDERPOSTER, NDC                                             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W27162(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//********** SORTERADE RESTORDERPOSTER                                          
//         SPACE=(80,(2,6),RLSE),AVGREC=K                                       
//*                                                                             
