//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RÄKNAR FRAM BRUTTOVOLYMEN FÖR FLYG FÖR AKTUELL VECKA                       
//*  GÄLLER FÖR NDC                                                             
//*                                                                             
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V4                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27187    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P087 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V2,                                             
//             INDUT=&W271..W271V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD87),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47960X(+0),DISP=SHR                                 
//************ FAKTURERADE KOLLIN                                               
//*                                                                             
//SORTOUT  DD  DSN=&&W47960X,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEN                                                    
//W27187   EXEC PGM=W27187                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27187D1 DD  DSN=&&W47960X,DISP=(OLD,DELETE,DELETE)                           
//************ SORTERADE FAKTURERADE KOLLIN                                     
//*                                                                             
//W27187D2 DD  DSN=&INDUT..W27187(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SUMMA BRUTTOVOLYM FÖR FLYG                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
