//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UNDERLAG TILL RESTORDERLISTA                                        
//*  TOTALT NDC                                                                 
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V7                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                W27164    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V7,                                             
//             INDUT=&W271..W271V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27164   EXEC PGM=W27164                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W27164D1 DD  DSN=&INDIN..W27161(+0),DISP=SHR                                  
//************ SORTERADE RESTORDERPOSTER I LAND, ARTNR                          
//*                                                                             
//W27164D2 DD  DSN=&&W27164,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE RESTORDERPOSTER I LAND, ARTNR                          
//         SPACE=(80,(2,6),RLSE),AVGREC=K                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD65),DISP=SHR                         
//SORTIN   DD  DSN=&&W27164,DISP=(OLD,DELETE,DELETE)                            
//************ RESTORDERPOSTER, NDC                                             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W27164(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RESTORDERPOSTER PER LAND, ARTNR                                  
//             SPACE=(80,(2,6),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
