//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSA REFILLORDRAR SAMT UPPDATERA WDK7                                     
//*                                                                             
//*  KÖRS I FLERA RUTINER, INDIN ANGES I RESP JCL                               
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D2                                            
//*                       RTN W271DB                                            
//*                VECKA  RTN W271V2                                            
//*                ORDER  RTN W271B1                                            
//*                       RTN W271S2                                            
//*                                                                             
//*  ÅTERSTART:    W27113    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27113   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27113,W27113,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//SYSIN    DD  DSN=NULLFILE                                                     
//W27113D1 DD  DSN=&INDIN..W27113(+0),DISP=SHR                                  
//************ INFIL MED RENSPOSTER                                             
//*                                                                             
