//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROGNOSBERÄKNING REFILLARTIKLAR                                            
//*                                                                             
//*    - PROCEDUREN ANROPAS AV TRE JOBB. W271J030, W271J130                     
//*      OCH W271J230. VAR OCH EN AV JCL'ERNA ANROPAR EN                        
//*      CONSTANTMEDLEM SOM ANGER VILKEN TYP AV KÖRNING                         
//*      DET ÄR FRÅGA OM; DAG-, VECKO- ELLER ACCOUNT-PERIOD.                    
//*                                                                             
//*    - VID DAGKÖRNING OCH VANLIG VECKOKÖRNING BERÄKNAS                        
//*    - PROGNOS PÅ NYAKTIVERADE ARTIKLAR                                       
//*                                                                             
//*    - VID ACCOUNT-PERIODSLUT BERÄKNAS PROGNOS PÅ SAMTLIGA                    
//*      AKTIVA ARTIKLAR                                                        
//*                                                                             
//*                                                                             
//*  FREQUENCE:    DAG     RTN W271D1 W271DA W271V1                             
//*                                                                             
//*  RESTART:      W27130      NORMAL                                           
//*                READS  WDK6 WDK7 WDL7                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             TYP=SAKNAS,REFILL=SAKNAS,                                        
//             INDIN=&INDRTE,                                                   
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27130   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27130,W27130,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSPRINT DD  SYSOUT=*                                     -- DISPLAY          
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W27130D1 DD  DSN=&INDIN..CONSTANT(W271&TYP),DISP=SHR                          
//************ TYP AV KÖRNING; DAG, VECKA, ACCOUNT                              
//*                                                                             
//W27110D2 DD  DSN=&INDIN..CONSTANT(W271&REFILL),DISP=SHR                       
//************ AKTUELLT LAGER                                                   
//*                                                                             
//W27130D3 DD  DSN=&INDUT..W27130(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR VARS PROGNOS SKA ÄNDRAS                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W27130D4 DD  DSN=&INDUT..W27138(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR VARS PROGNOS SKA ÄNDRAS                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//W27130D5 DD  DSN=&INDUT..W2713F(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SLOW MOVING PARTS - CNTRL FC RE-CALC                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
