//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ORDERRELEASE - LÄSER SAMTLIGA RADER PÅ WDE3                                
//*                                                                             
//*                                                                             
//*  KÖRS FRÅN FLERA RUTINER, INDUT2 ANGES I JCL                                
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D2                                            
//*                       RTN W271DB                                            
//*                VECKA  RTN W271V2                                            
//*                ORDER  RTN W271B1                                            
//*                ORDER  RTN W271B2                                            
//*                ORDER  RTN W271B3                                            
//*                ORDER  RTN W271B4                                            
//*                ORDER  RTN W271B5                                            
//*                ORDER  RTN W271B6                                            
//*                ORDER  RTN W271B7                                            
//*                                                                             
//*  ÅTERSTART:    W27112    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P012 PROC STPLIB=&INDRTE..LOAD,REFILL=SAKNAS,                             
//             INDUT=&W271..W271XX,                                             
//             INDUT1=&W412..IN,                                                
//             INDUT2=SAKNAS                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27112   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27112,W27112,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W27112D1 DD  DSN=&INDUT1..W41210(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)         
//************ UTFIL MED REFILLORDRAR OCH REFILLFÖRSLAG                         
//             SPACE=(27998,(5,9),RLSE),AVGREC=K,                               
//             MGMTCLAS=&BACKUPC                                                
//W27112D2 DD  DSN=&INDUT2..W27113(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)         
//************ UTFIL MED RENS-POSTER                                            
//             SPACE=(14,(5,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//W27112D3 DD  DSN=&INDUT2..W27115(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)         
//************ UTFIL MED POSTER FÖR LOKALA ARTIKLAR                             
//             SPACE=(14,(5,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//W27112D4 DD  DSN=&INDRTE..CONSTANT(W271&REFILL),DISP=SHR                      
//************ LAGER ATT REFILLA I DENNA RUTIN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGEN1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT1..W41210(+1),DISP=SHR                                 
//************ OVANSTÅENDE FIL TILL KOPIERING                                   
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W27112(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FILE TO SYSTEM W611                                              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
