//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO MATCH W01160 AND RGISTER FILE ON PART NUMBER AND TO                     
//*  IDENTIFY FAST SUPERSESSIONS                                                
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W271V6                                         
//*                                                                             
//*  RESTART:      W2712A    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P08D PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V6,                                             
//             INDUT=&W271..W271V6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2712A   EXEC PGM=V16459,PARM='W2712A/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W2712AD1 DD  DSN=&INDIN..W2712E(+0),DISP=SHR                                  
//************ WDK6                                                             
//*                                                                             
//W2712AD2 DD  DSN=&INDUT..W2712A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ PB MOVE 3 WEEKS BEFORE SUPERSESSION                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
