//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  WRITE FILE WITH ARTICLE FOR WHICH ERS CODE HAS BE UPDATED TO ZERO          
//*  FROM THE DAY BEFORE.                                                       
//*                                                                             
//*  FREKVENS:     DAG         RTN W271D8                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W271A8    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..NDC,                                               
//             INDIN3=&W011..LDC,                                               
//             INDIN4=&W011..SDC,                                               
//             INDIN=&W271..W271D8,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W271..W271D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//************ ARTIKELUPPGIFTER, NDC                                            
//*                                                                             
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ ARTIKELUPPGIFTER, LDC SORTERAR UT LDC-CN MED CONSTANT            
//*                                                                             
//         DD  DSN=&INDIN4..W01184(+0),DISP=SHR                                 
//************ ARTIKELUPPGIFTER, SDC SORTERAR UT SDC MED CONSTANT               
//*                                                                             
//SORTOUT  DD  DSN=&&W27184,DISP=(NEW,PASS,DELETE),                             
//************ ARTIKELUPPGIFTER, SAMTLIGA ALL DC                                
//         SPACE=(210,(300,66),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271A8   EXEC PGM=V16459,PARM='W271A8/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W271A8D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELFIL, CDC                                                  
//*                                                                             
//W271A8D2 DD  DSN=&INDIN..W27108(+0),DISP=SHR                                  
//************ GÅRDAGENS ERSKOD                                                 
//*                                                                             
//W271A8D3 DD  DSN=&&W27184,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKLAR, SAMTLIGA ALL DC                                        
//*                                                                             
//W271A8D4 DD  DSN=&INDUT..W27109A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ ARTIKLAR SOM FÅTT ERSKOD 00                                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
