//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KÖRNING FÖR AKTIVERA FLREFBEO                                              
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V1                                         
//*                                                                             
//*  ÅTERSTART:    W27181      NORMAL                                           
//*                LÄSER        WDK7 WDK6 WDL7                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P081 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27181   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27181,W27181,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDL4     INCLUDE MEMBER=WDL4                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WL2501   INCLUDE MEMBER=WDR2                                                  
//W27181D1 DD  DSN=&INDUT..W27181(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR SOM FLREFBEO SKA AKTIVERAS                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
