//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATING REPORT FOR PURCHASE PLANNER FOR LOCALLY SOURCED PARTS             
//*  WITH UNNORMAL CHANGE OF FORECAST (KVPB-REF)                                
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG      RTN W271D9                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P03D PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D9,                                             
//             INDUT=&W271..W271D9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT ALL LOCALLY PROCURED PARTS                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD3D),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27139(+0),DISP=SHR                                  
//************ PROGNOSLARM                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W27139A,DISP=(NEW,PASS,DELETE),                            
//********     PROGNOSLARM - FOR LOCALLY SOURCED PARTS                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2713D   EXEC PGM=V16459,PARM='W2713D/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W2713DD1  DD DSN=&&W27139A,DISP=(OLD,DELETE,DELETE)                           
//************ PROGNOSLARM - FOR LOCALLY SOURCED PARTS                          
//*                                                                             
//W2713DD2 DD  DSN=&INDUT..W2713D(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//********** W2713D-001 REPORT FILE                                             
//*                                                                             
//             SPACE=(70,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
