//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ATT FÅ FRAM VILKA MANUELLT SATTA SÄSONGER SOM KOMMER                       
//*  ATT UPPHÖRA INNANNÄSTA SÄSONGSBERÄKNING                                    
//*                                                                             
//*  FREKVENS:     VECKA   RTN W271V7                                           
//*                                                                             
//*  ÅTERSTART:    W27173      NORMAL                                           
//*                LÄSER        WDK7 WDK6 WDD3                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P073 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27173   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27173,W27173,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W27173D1 DD  DSN=&INDUT..W27173(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MANUELLT SATTA SÄSONGER SOM KOMMER ATT UPPHÖRA                   
//             SPACE=(48,(500,666),RLSE),AVGREC=U,                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
