//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FÖR PASSIVA ARTKLAR TRANSFER ELLER RETUR ELLER SKROT                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W271D4                                           
//*                                                                             
//*  ÅTERSTART:    W2712C      NORMAL                                           
//*                LÄSER        WDB6 WDK6 WDK7 ARTS WDL7 WDD9 ARTC WDD7         
//*                             WDQ4B WDL6                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P02C PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2712C   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,DSNMTV01,W2712C,,00')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//DDITV02  DD  DSN=&W..&RTEGRP..CONSTANT(W2712CI1),DISP=SHR                     
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//WDL6     INCLUDE MEMBER=WDL6                                                  
//W2712CD1 DD  DSN=&INDUT..W2712C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL MED PASSIV TRANSF/RETUR TILL PGM W27111                    
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W2712CD2 DD  DSN=&INDUT..W2712D(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL MED PASSIV SKROT TILL PGM W2712D00                         
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
