//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SÄNDER MEMO TILL LAGERANSVARIG VID ONORMAL                                 
//*  PROGNOSFÖRÄNDRING                                                          
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG      RTN W271D9                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P039 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D9,                                             
//             INDUT=&W271..W271D9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT ALL REFILL PARTS                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD39),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27139(+0),DISP=SHR                                  
//************ PROGNOSLARM                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W27139,DISP=(NEW,PASS,DELETE),                             
//********     PROGNOSLARM - FOR REFILL PARTS                                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27139   EXEC PGM=W27139                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27139D1  DD DSN=&&W27139,DISP=(OLD,DELETE,DELETE)                            
//************ PROGNOSLARM - REFILL PARTS                                       
//*                                                                             
//W27139D2 DD  DSN=&INDUT..W271391(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//********** W27139-001 DETTA ÄR RAPPORTEN (RAPPORTFILEN) SOM                   
//********** SKALL BLI MEMO                                                     
//             SPACE=(70,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
