//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TAR BORT DUBLETTER I FIL W27105                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271V4                                         
//*                                                                             
//*  RESTART:      W27107    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V4,                                             
//             INDUT=&W271..W271V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27107   EXEC PGM=W27107                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27107D1 DD  DSN=&INDIN..W27103A(+0),DISP=SHR                                 
//************ INFIL 27103A                                                     
//*                                                                             
//W27107D2 DD  DSN=&INDUT..W27107(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL DÄR DUBLETTER ÄR BORTA                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
