//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UNDERLAG TILL RESTORDERLISTA                                        
//*  TAR FRAM POSTER FÖR SAMTLIGA NDC                                           
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V7                                         
//*                                                                             
//*  ÅTERSTART:    W27161      NORMAL                                           
//*                LÄSER        WDA5 WDK6 WDK7 WDD3                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27161   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27161,W27161,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA5     INCLUDE MEMBER=WDA5                                                  
//*                                                                             
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//W27161D1 DD  DSN=&&W27161,DISP=(NEW,PASS,DELETE),                             
//************ UNDERLAG TILL RESTORDERLISTA, NDC                                
//         SPACE=(76,(2,6),RLSE),AVGREC=K                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD62),DISP=SHR                         
//SORTIN   DD  DSN=&&W27161,DISP=(OLD,DELETE,DELETE)                            
//************ RESTORDERPOSTER, NDC                                             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W27161(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERADE RESTORDERPOSTER                                        
//             SPACE=(76,(2,6),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
