//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REFILL, BRISSTRETUR                                                        
//*  SKAPAR LISTPOSTER, ARTIKLAR MED BRIST I CDC SOM                            
//*  KAN AVHJÄLPAS GENOM BRISTRETUR FRÅN ETT ELLER FLERA SDC                    
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D3                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27154      NORMAL                                           
//*                LÄSER  WDK6 WDK7 WDK9 WDD3                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P054 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D3,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W271..W271D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD54),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27154,DISP=SHR                                      
//************ ARTIKLAR PÅ BRISTRETURLISTA DE SENASTE 5 DAGARNA                 
//*                                                                             
//SORTOUT  DD  DSN=&&W27154,DISP=(NEW,PASS,DELETE),                             
//************ ARTIKLAR FRÅN DE SENASTE 5 BRISTRETURLISTOR                      
//         SPACE=(9,(5,15),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27154   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27154,W27154,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W27154D1 DD  DSN=&INDIN2..W01168(+0),DISP=SHR                                 
//************ CDC-UPPGIFTER, GRUNDFIL FRÅN WDK9                                
//*                                                                             
//W27154D2 DD  DSN=&&W27154,DISP=(OLD,DELETE,DELETE)                            
//************ ARTIKLAR FRÅN DE SENASTE 5 BRISTRETURLISTOR                      
//*                                                                             
//W27154D3 DD  DSN=&INDUT..W27154(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ ARTIKLAR MED BRISTRETUR PÅ DAGENS LISTA                          
//             SPACE=(9,(1,3),RLSE),AVGREC=K,                                   
//             MGMTCLAS=&BACKUPC                                                
//W27154D4 DD  DSN=&INDUT..W27155(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LISTPOSTER, ARTIKLAR MED BRISTRETUR                              
//             SPACE=(73,(1,3),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
