//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BACKORDER REFILL LISTA                                                     
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W271V4                                         
//*                                                                             
//*  RESTART:      W27105      NORMAL.                                          
//*                READS        WDA5 WDK6 WDK7                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271T005 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27105   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27105,W27105,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR               -- ABEND              
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//************ UTFIL FOR ALL DC                                                 
//W27105D1 DD  DSN=&&TEMPFIL,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD05),DISP=SHR                         
//SORTIN   DD  DSN=&&TEMPFIL,DISP=(OLD,DELETE,DELETE)                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W27105(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTFIL FRÅN PGM W27105                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
