//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BACKORDERS OLDER 6 WEEK                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271V4                                         
//*                                                                             
//*  RESTART:      W27103    NORMAL.                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P003 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W440,                                                    
//             INDIN=&W271..W271V4,                                             
//             INDUT=&W271..W271V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PDA3),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W44061(+0),DISP=SHR                                 
//************ NEDLÄST WDA5                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W44061,DISP=(NEW,PASS,DELETE),                             
//************ NEDLÄST WDA5 SORTERAD                                            
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27103   EXEC PGM=W27103                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27103D1 DD  DSN=&&W44061,DISP=SHR                                            
//************ INFIL EXTRAKT AV WDA5                                            
//*                                                                             
//W27103D2 DD  DSN=&INDIN..W27105(+0),DISP=SHR                                  
//************ INFIL MED BACKORDERS ÄLDRE ÄN 6 VECKOR                           
//*                                                                             
//W27103D3 DD  DSN=&INDUT..W27103A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UTFIL                                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
