//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR ARTIKELFIL                                                    
//*                                                                             
//*  FREKVENS:     DAG     RTN W271DX                                           
//*                                                                             
//*  ÅTERSTART:    W27127      NORMAL                                           
//*                LÄSER        WDF1 WDR2                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P027 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271DX,                                             
//             INDUT=&W271..W271DX                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27127   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27127,W27127,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDN6     INCLUDE MEMBER=WDN6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W27127D1 DD  DSN=&INDIN..W27126(+0),DISP=SHR                                  
//************ ARTIKELFIL                                                       
//*                                                                             
//W27127D2 DD  DSN=&INDUT..W27127(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERAD ARTIKELFIL                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
