//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SÄNDER MEMO TILL LAGERANSVARIG VID ONORMAL                                 
//*  REFILL PROGNOSFÖRÄNDRING                                                   
//*                                                                             
//*                                                                             
//*  FREKVENS:     DAG      RTN W271D9                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P03B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D9,                                             
//             INDUT=&W271..W271D9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT ALL REFILL PARTS                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD3B),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W2713B(+0),DISP=SHR                                  
//************ PROGNOSLARM                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W2713B,DISP=(NEW,PASS,DELETE),                             
//********     PROGNOSLARM - FOR REFILL PARTS                                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2713B   EXEC PGM=V16459,PARM='W2713B/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W2713BD1  DD DSN=&&W2713B,DISP=(OLD,DELETE,DELETE)                            
//************ PROGNOSLARM - FOR REFILL PARTS                                   
//*                                                                             
//W2713BD3 DD  DSN=&INDUT..W2713B1(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//********** W27139-002 DETTA ÄR RAPPORTEN (RAPPORTFILEN) SOM                   
//********** SKALL BLI MEMO                                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
