//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT DATA FROM WDE3 ACCORDING TO SELECTION CRITERIA                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271S2                                         
//*                                                                             
//*  RESTART:      W2711G      NORMAL                                           
//*                READS        WDE3 WDR2                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P01G PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W271..W271S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2711G   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W2711G,W2711G,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDE3     INCLUDE MEMBER=WDE3                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//SYSIN    DD  DSN=NULLFILE                                                     
//W2711GD1 DD  DSN=&INDUT..W2711G(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ EXTRACT FILE FOR EMAIL                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W2711GD2 DD  DSN=&INDUT..W27113(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ KEYS OF SEGMENTS TO BE DELETED                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
