//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATES RECALCULATED PRE PLANNED FACTOR                                    
//*                                                                             
//*  FREKVENS:     WEEK     RTN W271V1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W2711F    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P01F PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V1,                                             
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W2711E(+0),DISP=SHR                                  
//************ PROGNOS SOM SKA UPPDATERAS                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W2711E,DISP=(NEW,PASS,DELETE),                             
//**************                                                    ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2711F   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W2711F,W2711F,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W2711FD1 DD  DSN=&&W2711E,DISP=(OLD,DELETE,DELETE)                            
//************ PPF TO BE UPDATED                                                
//*                                                                             
