//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR URVAL FRÅN 2348 MOT ARTIKELFIL                                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W271B2                                     
//*                                                                             
//*  ÅTERSTART:    W27128    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271DX,                                             
//             INDUT=&W271..W271B2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27128   EXEC PGM=W27128                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27128D1 DD  DUMMY                                                            
//************ PARAMETRAR FRÅN BILD 2348                                        
//*                                                                             
//W27128D2 DD  DSN=&INDIN..W27127(+0),DISP=SHR                                  
//************ ARTIKELFIL                                                       
//*                                                                             
//W27128D3 DD  DSN=&INDUT..W27128(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ URVAL AV ARTIKLAR                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
