//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RESTORDERLISTA TOPP 100 I ORDERRADSORDNING                                 
//*  NDC TOTALT                                                                 
//*                                                                             
//*  FREKVENS:     VECKA     RTN W271V7                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27168    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V7,                                             
//             INDUT=&W271..W271V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD68),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27164(+0),DISP=SHR                                  
//************ RESTORDERPOSTER                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W27164,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE RESTORDERPOSTER  LAND, ORDERRAD OCH ARTNR              
//         SPACE=(80,(2,6),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27168   EXEC PGM=W27168                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W27168D1 DD  DSN=&&W27164,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADE RESTORDERPOSTER I ARTNR                                
//*                                                                             
//W27168D2 DD  DSN=&INDUT..W27168(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ RAPPORTER TILL DAP W27168                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
