//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REFILL                                                                     
//*  SKRIVER LISTA BRISTRETUR                                                   
//*                                                                             
//*  FREKVENS:     DAG    RTN W271D3                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27155    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P055 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D3,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD55),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27155(+0),DISP=SHR                                  
//************ LISTPOSTER, BRISTRETURER                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W27155,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE LISTPOSTER BRISTRETUR, SORT - IDARTNR                  
//         SPACE=(73,(1,3),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27155   EXEC PGM=V16459,PARM='W27155/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W27155D1 DD  DSN=&&W27155,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADE LISTPOSTER BRISTRETUR, SORT - IDARTNR                  
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W27155D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W27155-001  LISTA BRISTRETUR                                     
//*                                                                             
