//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR SNABBA ERSÄTTNINGAR MED INFO FRÅN WDK7                        
//*                                                                             
//*  FREKVENS:     WEEKLY    RTN W271V6                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W2712B    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P02B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V6,                                             
//             CPU=1,                                                           
//             INDUT=&W271..W271V6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W2712B   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W2712B,W2712B,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W2712BD1 DD  DSN=&INDIN..W2712A(+0),DISP=SHR                                  
//************ SNABBA ERSÄTTNINGAR IN                                           
//*                                                                             
//W2712BD2 DD  DSN=&INDUT..W2712B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SNABBA ERSÄTTNINGAR UT                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
