//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR NY ELLER OMRÄKNAD PROGNOS                                       
//*                                                                             
//*  FREKVENS:     DAG      RTN W271D1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27131    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P031 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=SAKNAS,                                                    
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27130(+0),DISP=SHR                                  
//************ PROGNOS SOM SKA UPPDATERAS                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W27130,DISP=(NEW,PASS,DELETE),                             
//**************                                                    ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27131   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27131,W27131,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W27131D1 DD  DSN=&&W27130,DISP=(OLD,DELETE,DELETE)                            
//************ PROGNOS SOM SKA UPPDATERAS                                       
//*                                                                             
