//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER UT LISTA, LOKAL LEVERANSPLAN JAPAN                                 
//*                                                                             
//*  FREKVENS:     DAG         RTN W271D2                                       
//*                                W271V2                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P018 PROC INDIN=SAKNAS,                                                   
//             DEST1=&QJP20020                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W271181(+0),DISP=SHR                                 
//************ LISTFIL                                                          
//*                                                                             
//OUT1 OUTPUT FORMDEF=W27102,PAGEDEF=W27102,                                    
//            USERLIB=(&INDPSF..PSF),                                           
//            PRMODE=SOSI1                                                      
//SYSUT2   DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.OUT1)                      
//************ W27118-001  LISTA PURCHASE ORDER, JAPAN                          
//*                                                                             
