//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AKTIVERAR ELLER LÄGGER UPP ARTIKLAR PÅ WDK7.                               
//*                                                                             
//*                                                                             
//*  PROCEDUREN KÖRS I FLERA RUTINER, INDIN ANGES I RESP JCL                    
//*                                                                             
//*  FREKVENS:     DAG      RTN W271D1                                          
//*                DAG      RTN W271DA                                          
//*                VECKA    RTN W271V1                                          
//*                                                                             
//*  ÅTERSTART:    W27141    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=2,                                                           
//             INDIN=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27140(+0),DISP=SHR                                  
//************ ARTILAR FÖR AKTIVERING ELLE UPPLÄGG PÅ WDK7                      
//*                                                                             
//SORTOUT  DD  DSN=&&W27140,DISP=(NEW,PASS,DELETE),                             
//************ ARTILAR FÖR AKTIVERING ELLE UPPLÄGG PÅ WDK7, SORTERADE           
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27141   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27141,W27141,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W27141D1 DD  DSN=&&W27140,DISP=SHR                                            
//************ ARTIKLAR SOM SKALL SKAPAS ELLER AKTIVERAS PÅ WDK7                
//*                                                                             
