//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR FILER MED FÖRSLAG, LÄGGER UPP DESSA PÅ                            
//*  WDE3                                                                       
//*                                                                             
//*  FREKVENS:     DAG         RTN W271D8                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W27111    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W271P811 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271D8,                                             
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W271PD11),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W27102(+0),DISP=SHR                                  
//************ REFILLFÖRSLAG, ORDERINGÅNG                                       
//*                                                                             
//         DD  DSN=&INDIN..W27109(+0),DISP=SHR                                  
//************ REFILLFÖRSLAG, ERS-KOD FÖRÄNDRINGAR                              
//*                                                                             
//         DD  DSN=&INDIN..W27109A(+0),DISP=SHR                                 
//************ REFILLFÖRSLAG, ERS-KOD CHANGED TO ZERO                           
//*                                                                             
//         DD  DSN=&INDIN..W27209(+0),DISP=SHR                                  
//************ REFILLFÖRSLAG, ERS-KOD FÖRÄNDRINGAR FÖR CDC                      
//*                                                                             
//         DD  DSN=&INDIN..W272G102(+0),DISP=SHR                                
//************ REFILLFÖRSLAG CREATED IN A BOAT QUEUE                            
//*                                                                             
//SORTOUT  DD  DSN=&&W27102,DISP=(NEW,PASS,DELETE),                             
//************ REFILLFÖRSLAG,SORTERADE                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27111   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W27111,W27111,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W27111D1 DD  DSN=&&W27102,DISP=(OLD,DELETE,DELETE)                            
//************ REFILLFÖRSLAG,SORTERADE                                          
//*                                                                             
