//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES REFILL ORDERS AND PROPOSALS                                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271D2                                         
//*                WEEKLY        W271V2                                         
//*                                                                             
//*  RESTART:      W27210      NORMAL                                           
//*                READS        WDK6 WDK9 WDE3 WDD7 WDD9 WDK7 WDL6 WDA5         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W272P010 PROC STPLIB=&INDRTE..LOAD,REFILL=SAKNAS,                             
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27210   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,DSNMTV01,W27210,,00')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//DDITV02  DD  DSN=&W..&RTEGRP..CONSTANT(W27210I1),DISP=SHR                     
//*                                                                             
//W27210D1 DD  DSN=&INDRTE..CONSTANT(W271&REFILL),DISP=SHR                      
//************ AKTUELLT LAGER                                                   
//*                                                                             
//W27210D2 DD  DSN=&INDUT..W27210(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ ORDERS AND PROPOSALS FOR UPDATE WDE3                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
