//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RULES FOR SETTING BUYER AND IDREFTAB                                       
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271V3                                         
//*                                                                             
//*  RESTART:      W27279    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W272P079 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W271..W271V3,                                             
//             INDUT=&W271..W271V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27279   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W27279,W27279,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDL7     INCLUDE MEMBER=WDL7                                                  
//WDL8     INCLUDE MEMBER=WDL8                                                  
//W27279D1 DD  DSN=&INDIN..W27277(+0),DISP=SHR                                  
//************ INFIL FRÅN W27177                                                
//*                                                                             
//W27279D2 DD  DSN=&INDUT..W27279(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL FÖR UPDATERING I W27280                                    
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
