//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO ADD TREND TO MANUAL SET KVPB-PLAN, CREATE FILE TO                       
//*  W2729900 FOR UPDATE OF WDK6                                                
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W271V1                                         
//*                                                                             
//*  RESTART:      W27288    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W272P088 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDUT=&W272..W271V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W27288   EXEC PGM=V16459,PARM='W27288/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W27288D1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ WDK6                                                             
//*                                                                             
//W27288D2 DD  DSN=&INDUT..W27288(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ NEW MANUAL KVPB-PLAN FOR UPDATING                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
