//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REFILL ORDERS ACCEPTED BUT NOT RELEASED TO ORDER - DELETE                  
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W271D8                                         
//*                                                                             
//*  RESTART:      W272G1      NORMAL                                           
//*                READS        WDK6 WDK7 WDB6                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W272P0G1 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDUT=&W271..W271D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W272G1   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W272G1,W272G1,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W272G1D1 DD  DSN=&INDUT..W272G101(+1),                        -LIM(1)         
//************ DELETE - REFILL ORDERS ACCEPT BUT NOT RELEASED TO ORDER          
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W272G1D2 DD  DSN=&INDUT..W272G102(+1),                       -LIM(99)         
//************ REFILL ORDERS CREATED IN A BOAT QUEUE                            
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
