//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR REGISTER VID PERIODSKIFTE                                         
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W330R1                             
//*                                                                             
//*  ÅTERSTART:  NORMAL                                                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P1IC PROC INDIN=&W330..W330R1,                                            
//             INDUT=&WXTR..W330R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330IC1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33023(+0),DISP=SHR                                  
//************ FSG-STATISTIK ARTIKEL/KONCERNNIVÅ                                
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTR4B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOPIA AV W33023 SOM ANVÄNDS I EXTRAKT-MILJÖN                     
//             MGMTCLAS=&BACKUPC,SPACE=(27918,(2500,800),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
