//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W33096(+0) OCH W3309A(+0) OCH                                        
//*  SKAPAR UTFIL MED FÖRSÄLJNINGS INFO (1987-NNNN).                            
//*                                                                             
//*  FREKVENS:     ÅRSKÖRNING     RTN W330Y1                                    
//*                                                                             
//*  ÅTERSTART:    W3309A    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P09A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W330..W330Y1,                                            
//             INDUT=&W330..W330Y1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3309A   EXEC PGM=V16459,PARM='W3309A/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W3309AD1 DD  DSN=&INDIN2..W33096(+0),DISP=SHR                                 
//************ FÖREGÅENDE ÅRS FÖRSÄLJNINGS STATISTIK                            
//*                                                                             
//W3309AD2 DD  DSN=&INDIN2..W3309A(+0),DISP=SHR                                 
//************ FÖRSÄLJNINGS STATISTIK (1987-NNNN)                               
//*                                                                             
//W3309AD3 DD  DSN=&INDUT..W3309A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FÖRSÄLJNINGS STATISTIK (1987-NNNN)                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
