//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  HÄMTAR KREDITNOTOR FRÅN DISTRIBUTION                                       
//*                                                                             
//*  FREKVENS:     VECKA    RTN W330V1                                          
//*                                                                             
//*  ÅTERSTART:    W33006   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W418..W330V1,                                            
//             INDUT=&W330..W330V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33006   EXEC PGM=W33006                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33006D1 DD  DSN=&INDIN2..W41839,DISP=SHR                                     
//************ KREDITERINGAR FRÅN DISTRIBUTION                                  
//*                                                                             
//W33006D2 DD  DSN=&INDUT..W33007(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ KREDITERINGAR FRÅN DISTRIBUTION MED KONV. DATUM                  
//             MGMTCLAS=DEL2,SPACE=(23461,(200,266),RLSE)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
