//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELSTATISTIK                                                           
//*                                                                             
//*  SKRIVER UT LISTORNA : W33076-001  VA1                                      
//*                        W33080-001  VA2                                      
//*                        W33084-001  VP1  NIVÅ 4                              
//*                        W33086-001  VP1  NIVÅ 2                              
//*                        W33088-001  VP1  NIVÅ 0                              
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B2                                      
//*                                                                             
//*  ÅTERSTART:    W33080   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P180 PROC INDIN=&W330..W330B2,                                            
//             DEST1=&CPRINT,                                                   
//             SOUT1='(A,,3803)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33080   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33076(+0),DISP=SHR                                  
//************ LISTA VA1                                                        
//*                                                                             
//         DD  DSN=&INDIN..W33080(+0),DISP=SHR                                  
//************ LISTA VA2                                                        
//*                                                                             
//         DD  DSN=&INDIN..W33084(+0),DISP=SHR                                  
//************ LISTA VP1 NIVÅ 4                                                 
//*                                                                             
//         DD  DSN=&INDIN..W33086(+0),DISP=SHR                                  
//************ LISTA VP1 NIVÅ 2                                                 
//*                                                                             
//         DD  DSN=&INDIN..W33088(+0),DISP=SHR                                  
//************ LISTA VP1 NIVÅ 0                                                 
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1,OUTPUT=(*.A4LF)                        
//************ W33080-001  LISTA TILL EXPRESS DELIVERY                          
//**           DCB=(RECFM=FBA,LRECL=122,BLKSIZE=6222)                           
//*                                                                             
