//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELSTATISTIK                                                           
//*                                                                             
//*  SKAPAR LISTA P1,PPV OCH PLV W33046-001                                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B1                                      
//*                                                                             
//*  ÅTERSTART:    W330146  NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P146 PROC INDIN=&W330..W330B1,                                            
//             DEST1=&CPRINT,                                                   
//             SOUT1='(A,,7DUB)',                                               
//             SOUT2='(A,,7991)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330146  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33046(+0),DISP=SHR                                  
//************ LISTFIL FÖR LISTA P1                                             
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W33046-001  LISTA P1                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330148  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33048(+0),DISP=SHR                                  
//************ LISTFIL FÖR LISTA PLV-PPV-LISTA                                  
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT2,DEST=&DEST1                                        
//************ W33048-001  LISTA LV-PV                                          
//*                                                                             
