//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL INEHÅLLANDE ARTIKELINFO TILL MB                                  
//*  DENNA FIL SKAPAS "LAGOM STOR" UTFIL SOM SKALL SKICKAS                      
//*  VIA VCOM. EV. RESTERANDE POSTER SKRIVS SOM NY GENERATION                   
//*  AV INFILEN.                                                                
//*    OM RESTERANDE POSTER FINNS LÄMNAS RETURKOD 8 FRÅN PGM.                   
//*  RETURKODEN TESTAS SEDAN I JCL OCH OM DEN ÄR 8 BESTÄLLS                     
//*  JOBBET IGEN OCH DEN NYA GENERATIONEN TAS IN FÖR ATT KUNNA                  
//*  SKICKA RESTERANDE POSTER OSV.                                              
//*                                                                             
//*  FREKVENS:     VECKA    RTN W330R1                                          
//*                                                                             
//*  ÅTERSTART:    W3303C    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P03C PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=,                                                          
//             INDUT=                                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3303C   EXEC PGM=W3303C                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W3303CD1 DD DUMMY                                                             
//************ VCOMID. OVERRIDE FRÅN JCL                                        
//*                                                                             
//W3303CD2 DD  DSN=&INDIN..W3303C(+0),DISP=SHR                                  
//************ FIL MED ARTSTAT TILL MB                                          
//************ POSTER ATT SÄNDA TILL MB                                         
//*                                                                             
//W3303CD3 DD  DSN=&INDUT..W3303C(+1),DISP=(NEW,CATLG,DELETE),                  
//************ FIL MED ARTSTAT TILL MB                                          
//************ EV. POSTER KVAR ATT SÄNDA EFTER DENNA SÄNDNING.                  
//             SPACE=(35,(16,50),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W3303CD4 DD  DSN=&&W3303CV,DISP=(NEW,PASS,DELETE),                            
//************ FIL MED ARTSTAT TILL MB                                          
//************ 'DEL-FIL' ATT SÄNDA VIA VCOM                                     
//         SPACE=(38,(100,50),RLSE),AVGREC=K                                    
//*                                                                             
//W3303CD5 DD  DSN=&INDIN..W3304C(+0),DISP=SHR                                  
//************ FIL MED EN POST = VISAR FIL 3C:S ANTAL POSTER                    
//*                                                                             
