//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR WRREGISTER VID PERIODSKIFTE                                       
//*  KOPIERAR INFO-FIL VID PERIODSKIFTE                                         
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W330R1                             
//*                                                                             
//*  ÅTERSTART:    FILER KATALOGISERAS I ALLA STEGEN                            
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P1IC PROC INDIN=&W330..W330R1,                                            
//             INDUT=&WXTR..W330R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330IC1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33021(+0),DISP=SHR                                  
//************ ARTIKEL WORLD-WIDE FRÅN RUTIN W330R1                             
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTR3B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOPIA AV W33021 SOM ANVÄNDS I EXTRAKT-MILJÖN                     
//             MGMTCLAS=&BACKUPC,SPACE=(23352,(2500,800),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330IC2  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33019(+0),DISP=SHR                                  
//************ INFO-FIL FRÅN RUTIN W330R1                                       
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTR3A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOPIA AV W33019  SOM ANVÄNDS I EXTRAKT-MILJÖN                    
//             MGMTCLAS=&BACKUPC,SPACE=(23355,(2500,833),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
