//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W01103(+0) OCH SKAPAR EN UTFIL MED ERSÄTTNINGS INFO.                 
//*                                                                             
//*  FREKVENS:     ÅRSKÖRNING     RTN W330Y1                                    
//*                                                                             
//*  ÅTERSTART:    W33098    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P098 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..QASE,                                               
//             INDIN2=&W910,                                                    
//             INDUT=&W330..W330Y1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33098   EXEC PGM=V16459,PARM='W33098/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W33098D1 DD  DSN=&INDIN..W01103(+0),DISP=SHR                                  
//************ ERSÄTTNINGS INFO FRÅN WDD7                                       
//*                                                                             
//W33098D2 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ARTIKELFIL, CDC- OCH SUMMERADE SDC-UPPGIFTER                     
//*                                                                             
//W33098D3 DD  DSN=&INDUT..W33098(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ ERSÄTTNINGSFIL                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
