//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR INFORMATION OM DE ARTIKLAR SOM                                      
//*  FINNS PÅ PRIMÄRREGISTRET (ARTIKELSTATISTIK)                                
//*                                                                             
//*  FREKVENS:     VECKA    RTN W330V1                                          
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                SORT17   NORMAL                                              
//*                .                                                            
//*                W33019   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330V1,INDIN2=&W330..W330V1,                        
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDUT=&W330..W330V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT17   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W330PD17),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33017(+0),DISP=SHR                                  
//************ FIL FRÅN WDD3 ARTBEN PÅ SVE OCH ENG                              
//*                                                                             
//SORTOUT  DD  DSN=&&SRTU17,DISP=(NEW,PASS,DELETE),                             
//************ FIL FRÅN WDD3 ARTBEN PÅ SVE OCH ENG                              
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33019   EXEC PGM=W33019                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33019D1 DD  DSN=&INDIN..W33013(+0),DISP=SHR                                  
//************ FIL FRÅN PRIMÄRREGISTRET                                         
//*                                                                             
//W33019D3 DD  DSN=&&SRTU17,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//W33019D4 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ FIL FRÅN WDK6 LEVNR,IDANSK,VOLVÄRDE,LAGERKONTO                   
//*                                                                             
//W33019D5 DD  DSN=&INDIN2..W33099(+0),DISP=SHR                                 
//************ FIL MED FUNKTIONSGRUPPSBENÄMNINGAR                               
//*                                                                             
//W33019D6 DD  DSN=&INDUT..W33019(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ INFORMATION OM ARTIKLARNA PÅ PRIMÄRREG                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
