//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR RAPPORTFIL (XLS FORMAT) MED FÖRSÄLJNINGS INFO.                      
//*  RAPPORTEN SKALL SKICKAS SOM ETT MAIL ATTACHMENT TILL DEN                   
//*  ANVÄNDAREN SOM BESTÄLLDE DEN PÅ 3221-BILDEN.                               
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W330S1                             
//*                                                                             
//*  ÅTERSTART:    W3309B    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P09B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330Y1,                                             
//             INDUT=&W330..W330S1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3309B   EXEC PGM=V16459,PARM='W3309B/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W3309BD1 DD  DUMMY                                                            
//************ URVALSFIL SKAPAD AV BILD 3221                                    
//W3309BD2 DD  DSN=&INDIN..W33097(+0),DISP=SHR                                  
//************ ARTIKEL FIL                                                      
//*                                                                             
//W3309BD3 DD  DSN=&INDIN..W33098(+0),DISP=SHR                                  
//************ ERSÄTTNINGS FIL                                                  
//*                                                                             
//W3309BD4 DD  DSN=&INDIN..W3309A(+0),DISP=SHR                                  
//************ FÖRSÄLJNINGS STATISTIK (1987-NNNN)                               
//*                                                                             
//W3309BD5 DD  DSN=&INDUT..W3309B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ RAPPORT FIL (XLS FORMAT) MED FÖRSÄLJNINGS INFO                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
