//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SEKUNDÄRT REGISTER ÖVER AF-OMFATTNINGAR MED                         
//*  SAMMANSLAGNINGAR AV ETT ANTAL MARKNADER. OLIKA                             
//*  SAMMANSLAGNINGAR BEROENDE PÅ OM ARTIKELN ÄR LV ELLER PV.                   
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W330R1                             
//*                                                                             
//*  ÅTERSTART:    W33015    NORMAL                                             
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P015 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330R1,                                             
//             INDUT=&W330..W330R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33015   EXEC PGM=W33015                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33015D1 DD  DSN=&INDIN..W33015(+0),DISP=SHR                                  
//************ AF-REGISTRET                                                     
//*                                                                             
//W33015D2 DD  DSN=&INDIN..W33019(+0),DISP=SHR                                  
//************ INFO-FIL                                                         
//*                                                                             
//W33015D3 DD  DSN=&INDUT..W33022(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ AF-REGISTER MED SAMMANSLAGNA MARKNADER                           
//             MGMTCLAS=&BACKUPC,VOL=(,,,2),                                    
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
