//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR SEKUNDÄRREGISTER VID PERIODSKIFTE                                 
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W330R1                             
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P119 PROC INDIN=&W330..W330V1,                                            
//             INDUT=&W330..W330R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33019   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33019(+0),DISP=SHR                                  
//************ SEKUNDÄWREGISTER FRÅN VECKORUTINEN W330V1                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33019(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ SEKUNDÄRREGISTER SOM MATCHAS MED W33015 (AF-OMF)                 
//             DCB=(RECFM=FB,LRECL=137,BLKSIZE=27948),                          
//             MGMTCLAS=&BACKUPC,SPACE=(27948,(2500,833),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
