//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SPARAR ÅRSSTATISTIK                                                        
//*                                                                             
//*  FREKVENS:     ÅRSKÖRNING    RTN W330Y1   (FÖRSTA VECKAN EFTER              
//*                                            ÅRSSKIFTE)                       
//*  ÅTERSTART:    W33096   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P096 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330V1,                                             
//             INDUT=&W330..W330Y1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33096   EXEC PGM=W33096                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33096D1 DD  DSN=&INDIN..W33013(+0),DISP=SHR                                  
//************ PRIMÄRREGISTRET                                                  
//*                                                                             
//W33096D2 DD  DSN=&INDUT..W33096(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FÖREGÅENDE ÅRS STATISTIK HÄMTAT FRÅN PRIMÄRREGISTRET             
//             SPACE=(82,(800,100),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
