//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR URVAL TILL MARKNADSBOLAGEN M0 = F = TEMPORÄR CARPAC                 
//*                                    M1 = A = SVERIGE                         
//*                                    M2 = B = VCEM                            
//*                                    M3=                                      
//*                                    M4 = D = VCUK                            
//*                                    M5 = E = VCNA                            
//*                                    M6 = G = VCI                             
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W330R1                             
//*                                                                             
//*  ÅTERSTART:    W33035      NORMAL                                           
//*                LÄSER  WDB1 WDB3                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P035 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W330..W330R1,                                            
//             INDINA=&W330..W330X1M1,                                          
//             INDINB=&W330..W330X1M2,                                          
//             INDINC=&W330..W330X1M3,                                          
//             INDIND=&W330..W330X1M4,                                          
//             INDINE=&W330..W330X1M5,                                          
//             INDINF=&W330..W330X1M0,                                          
//             INDING=&W330..W330X1M6,                                          
//             INDUT=&W330..W330R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33035   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33035,W33035,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//W33035D1 DD  DSN=&INDIN2..W33015(+0),DISP=SHR                                 
//************ STATISTIK                                                        
//*                                                                             
//W33035D2 DD  DSN=&INDINA..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDINB..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDINC..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDIND..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDINE..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDINF..W33036(+0),DISP=SHR                                 
//         DD  DSN=&INDING..W33036(+0),DISP=SHR                                 
//************ STATISTIK VAL FRÅN MB                                            
//*                                                                             
//W33035D3 DD  DSN=&INDUT..W33038(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ URVAL TILL MB                                                    
//             SPACE=(167,(200,13),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
