//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELSTATISTIK                                                           
//*                                                                             
//*  SKAPAR LISTFIL VP1 NIVÅ 2                                                  
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B2                                      
//*                                                                             
//*  ÅTERSTART:    W33086   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .        .        .        .                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P086 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330B2,                                             
//             INDUT=&W330..W330B2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33086   EXEC PGM=V16459,PARM='W33086/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W33086D1 DD  DSN=&INDIN..W33085(+0),DISP=SHR                                  
//************ SUMMERADE VP1 NIVÅ 2 URVAL OCH RESULTAT                          
//*                                                                             
//W33086D2 DD  DSN=&INDUT..W33086(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ LISTFIL VP1 NIVÅ 2                                               
//**           DCB=(RECFM=FBA,LRECL=122,BLKSIZE=23424),                         
//             MGMTCLAS=NOBACKUP,VOL=(,,,2),                                    
//             SPACE=(23424,(2000,2000),RLSE)                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
