//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PLOCKAR FRAM UPPGIFTER FÖR DE OLIKA URVALEN                                
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B2                                      
//*                                                                             
//*  ÅTERSTART:    W33070   NORMAL                                              
//*                         LÄSER WDB2 MED HJÄLP AV SUBPGM                      
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W330..W330V1,                                            
//             INDIN=&W330..W330B2,                                             
//             INDUT=&W330..W330B2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33070   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33070,W33070,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//W33070D1 DD  DSN=&INDIN..W33035(+0),DISP=SHR                                  
//************ URVALS-FIL                                                       
//*                                                                             
//W33070D2 DD  DSN=&INDIN1..W33013(+0),DISP=SHR                                 
//************ VECKO-FIL PRIMÄWREGISTRET                                        
//*                                                                             
//W33070D3 DD  DSN=&INDIN1..W33019(+0),DISP=SHR                                 
//************ ARTIKEL-INFO                                                     
//*                                                                             
//W33070D4 DD  DSN=&INDUT..W33071(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ URVALSINFORMATION                                                
//**           DCB=(RECFM=FB,LRECL=176,BLKSIZE=24288),                          
//             MGMTCLAS=DEL2,VOL=(,,,3),                                        
//             SPACE=(24288,(4000,3000),RLSE)                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
