//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELSTATISTIK                                                           
//*  SKAPAR FIL FÖR LISTA P1                                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B1                                      
//*                                                                             
//*  ÅTERSTART:    W33046   NORMAL                                              
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P046 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330B1,                                             
//             INDUT=&W330..W330B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33046   EXEC PGM=V16459,PARM='W33046/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(9000,1000))                                         
//W33046D1 DD  DSN=&INDIN..W33045(+0),DISP=SHR                                  
//************ URVAL OCH RESULTAT, SUMMERADE P1                                 
//*                                                                             
//W33046D2 DD  DSN=&INDUT..W33046(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ LISTFIL P1                                                       
//**           DCB=(RECFM=FBA,LRECL=133,BLKSIZE=23408),                         
//             MGMTCLAS=NOBACKUP,                                               
//             VOL=(,,,2),SPACE=(23408,(2000,2000),RLSE)                        
//*                                                                             
//W33046D3 DD  DSN=&INDUT..W33048(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ LISTFIL PLV PPV                                                  
//**           DCB=(RECFM=FBA,LRECL=133,BLKSIZE=23408),                         
//             MGMTCLAS=NOBACKUP,                                               
//             VOL=(,,,2),SPACE=(23408,(2000,2000),RLSE)                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
