//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR FIL                                                               
//*                                                                             
//*  FREKVENS:     RTN W330V1                                                   
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P004 PROC INDIN=&W330..W330V1,                                            
//             INDUT=&W803..ULFH                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33004   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W33003(+0),DISP=SHR                                  
//************ SEKUNDÄRREGISTER FRÅN VECKORUTINEN W330V1                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33003(+1),DISP=(NEW,CATLG,DELETE),  -LIM(6)         
//************ FAKTUROR                                                         
//             MGMTCLAS=NOBACKUP,SPACE=(23461,(1000,666),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
