//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W91042(+0) OCH SKAPAR EN UTFIL MED ARTIKEL INFO.                     
//*                                                                             
//*  FREKVENS:     ÅRSKÖRNING     RTN W330Y1                                    
//*                                                                             
//*  ÅTERSTART:    W33097    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P097 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910,                                                     
//             INDUT=&W330..W330Y1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33097   EXEC PGM=V16459,PARM='W33097/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W33097D1 DD  DSN=&INDIN..W91042(+0),DISP=SHR                                  
//************ ARTIKELFIL, CDC- OCH SUMMERADE SDC-UPPGIFTER                     
//*                                                                             
//W33097D2 DD  DSN=&INDUT..W33097(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ ARTIKELFIL                                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
