//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER S1-URVAL OCH S1A-URVAL.                                              
//*  SKILLNADEN ÄR STORSÄLJARE PÅ SUMMA RESP. STYCK                             
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B1                                      
//*                                                                             
//*  ÅTERSTART:    W33054S   NORMAL                                             
//*                .                                                            
//*                W33054   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P054 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330B1,                                             
//             INDUT=&W330..W330B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W330PD53),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33053(+0),DISP=SHR                                  
//************ W33053-FILEN  MATCHADE S1:OR SORTERAS PÅ SUMMA                   
//*                                                                             
//SORTOUT  DD  DSN=&&W33053S,DISP=(NEW,PASS,DELETE),                            
//************ SORTERADE S1:OR                                                  
//             SPACE=(23460,(5000,1000),RLSE)                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W330PD54),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33054(+0),DISP=SHR                                  
//************ W33054-FILEN  MATCHADE S1:OR SORTERAS PÅ ANTAL                   
//*                                                                             
//SORTOUT  DD  DSN=&&W33054S,DISP=(NEW,PASS,DELETE),                            
//************ SORTERADE S1A:OR                                                 
//             SPACE=(23460,(5000,100),RLSE)                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33054   EXEC PGM=W33054                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33054D1 DD  DSN=&INDIN..W33031(+0),DISP=SHR                                  
//************ URVALSFIL AF-OFATTNINGAR                                         
//*                                                                             
//W33054D2 DD  DSN=&&W33053S,DISP=(OLD,DELETE,DELETE)                           
//************ SORTERADE S1:OR                                                  
//*                                                                             
//W33054D3 DD  DSN=&&W33054S,DISP=(OLD,DELETE,DELETE)                           
//************ SORTERADE S1A:OR                                                 
//*                                                                             
//W33054D4 DD  DSN=&INDUT..W33055(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SUMMERADE S1:OR                                                  
//             MGMTCLAS=&BACKUPC,VOL=(,,,3),                                    
//             SPACE=(23381,(1500,2000),RLSE)                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
