//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELSTATISTIK                                                           
//*  SKAPAR FIL FÖR LISTA A1                                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W330B1                                      
//*                                                                             
//*  ÅTERSTART:    W33050   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .        .                                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W330P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W330..W330B1,                                             
//             INDUT=&W330..W330B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33050   EXEC PGM=V16459,PARM='W33050/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,100))                                           
//W33050D1 DD  DSN=&INDIN..W33049(+0),DISP=SHR                                  
//************ LISTFIL FÖR LISTA A1                                             
//*                                                                             
//W33050D2 DD  DSN=&INDUT..W33050(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ LISTFIL FÖR LISTA A1                                             
//             DCB=(RECFM=FBA,LRECL=122,BLKSIZE=23424),                         
//             MGMTCLAS=NOBACKUP,                                               
//             VOL=(,,,2),SPACE=(23424,(2000,1500),RLSE)                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
