//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA ERSÄTTNINGSINFO                                                      
//*                                                                             
//*  FREQUENCE:    VECKA RTN W331V5                                             
//*                                                                             
//*  RESTART:      W33137    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W331P037 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910,                                                     
//             INDIN2=&W331..W331V5,                                            
//             INDUT2=&W331..W331V5,                                            
//             INDUT=&W331..W331V5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33137   EXEC PGM=W33137                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33137D1 DD  DSN=&INDIN..W91042(+0),DISP=SHR                                  
//************ NY INFO                                                          
//*                                                                             
//W33137D2 DD  DSN=&INDIN2..W33137(+0),DISP=SHR                                 
//************ REGISTER IN                                                      
//*                                                                             
//W33137D3 DD  DSN=&INDUT2..W33137(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ REGISTER UT                                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W33137D4 DD  DSN=&INDUT..W33138(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ ÄNDRAD ERSKOD                                                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
