//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *               
//*                                                                             
//*  HÄMTAR ERSÄTTNINGSINFORMATION FRÅN WDD7 FÖR ATT                            
//*  SKICKA TILL S&T                                                            
//*  HÄMTAR PRODUKTSLAG FRÅN WDK6                                               
//*                                                                             
//*  FREKVENS:     VECKA  RTN W331V5                                            
//*                                                                             
//*  ÅTERSTART:    W33138      NORMAL                                           
//*                LÄSER  WDD7                                                  
//*                       WDK6                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *               
//W331P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W331..W331V5,                                             
//             INDUT=&W331..W331V5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *               
//W33138   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33138,W33138,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W33138D1 DD  DSN=&INDIN..W33138(+0),DISP=SHR                                  
//************ ARTIKLAR MED FÖRÄNDRAD ERSÄTTNINGSKOD                            
//*                                                                             
//W33138D2 DD  DSN=&INDUT..W33139(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED ERSÄTTNINGSINFORMATION.                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
