//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FIL MED FÄRSKASTE PRISRAD PER LEVERANTÖR OCH ARTIKEL                       
//*                                                                             
//*  FREKVENS:  DAG   RTN W335D6                                                
//*                                                                             
//*  ÅTERSTART: W33585      NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P085 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDIN2=&W335..W335D6,                                            
//             INDUT=&W335..W335D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33585   EXEC PGM=V16459,PARM='W33585/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W33585D1 DD  DSN=&INDIN1..W01161(+0),DISP=SHR                                 
//************ FIL MED ALLA PRISRADER I PULS                                    
//*                                                                             
//W33585D2 DD  DSN=&INDIN2..W33591(+0),DISP=SHR                                 
//************ FIL MED PULS ALLA LEVERANTÖRER                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//TPFIL3   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//W33585D3 DD  DSN=&INDUT..W33585(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SENASTE PRISRAD PER ARTIKEL OCH LEVERANTÖR                       
//             MGMTCLAS=BACKUPC,DATACLAS=PSEB                                   
