//*                                                                             
//*  RUTINE STARTED EVERY 20 MIN TO SEND PRICE REQUESTS FOR                     
//*  SWEDEN DISTRICT 778.                                                       
//*                                                                             
//*  FREQUENCE:    EACH 20 MINUTES A DAY     RTN W335S7                         
//*                                                                             
//*  RESTART:      W3359B    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P09B PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W335..W335S7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3359B   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W3359B,W3359B,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W3359BD1 DD  DSN=&INDIN..W3359C(+0),DISP=SHR                                  
//************ PRISFRÅGOR EJ SÄNDA                                              
//*                                                                             
