//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR OCH MATCHAR IHOP TVÅ FILER W33573 W33575                          
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W335R1                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                W33577    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335R1,                                             
//             INDUT=&W335..W335R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD75),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33575(+0),DISP=SHR                                  
//************ SORTERAR INFILEN W33575                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W33575OS,DISP=(NEW,PASS,DELETE),                           
//************ SORTERAD UTFIL W33575                                            
//         SPACE=(13,(2000,666),RLSE),AVGREC=U                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD73),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33573(+0),DISP=SHR                                  
//************ SORTERAR INFILEN W33573                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W33573OS,DISP=(NEW,PASS,DELETE),                           
//************ SORTERAD UTFIL W33573                                            
//         SPACE=(81,(2000,666),RLSE),AVGREC=U                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33577   EXEC PGM=W33577                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W33577D1 DD  DSN=&&W33575OS,DISP=(OLD,DELETE,DELETE)                          
//************ SORTERAD UTFIL W33575                                            
//*                                                                             
//W33577D2 DD  DSN=&&W33573OS,DISP=(OLD,DELETE,DELETE)                          
//************ SORTERAD UTFIL W33573                                            
//*                                                                             
//W33577D3 DD  DSN=&INDUT..W33577(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ IHOPSLAGEN UTFIL                                                 
//             SPACE=(82,(2000,666),RLSE),AVGREC=U,                             
//             MGMTCLAS=&DEL2BKPC                                               
