//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR PRISÄNDRINGAR MED TIDPUNKT                                    
//*                                                                             
//*  FREKVENS:     DAG     RTN W335X3                                           
//*                                                                             
//*  ÅTERSTART:    W33506    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335X3,                                             
//             INDUT=&W335..W335X3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33506   EXEC PGM=W33506                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33506D1 DD  DSN=&INDIN..W33520(+0),DISP=SHR                                  
//************ PRISFIL UTAN TID FRÅN MARKNADSBOLAG                              
//*                                                                             
//W33506D2 DD  DSN=&INDUT..W33506(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ PRISFIL MED TID                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
