//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDAR NYA ARTIKELRABATTER AMC                                             
//*  LOADING NEW SPECIAL DISCOUNTS PER PART NO.                                 
//*                                                                             
//*  FREKVENS:     VECKA    RTN W335D3                                          
//*                                                                             
//*  ÅTERSTART:    W33530    NORMAL  (BMP)                                      
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=4,                                                           
//             INDIN0=&W335..W335D3M0,                                          
//             INDIN1=&W335..W335D3M1,                                          
//             INDIN2=&W335..W335D3M2,                                          
//             INDIN3=&W335..W335D3M3,                                          
//             INDIN4=&W335..W335D3M5,                                          
//             INDUT=&W335..W335D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD07),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN0..W33507,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER VCAS                         
//         DD  DSN=&INDIN1..W33507,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER SVERIGE                      
//         DD  DSN=&INDIN2..W33507,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER VCEM                         
//         DD  DSN=&INDIN3..W33507,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER ASIA PACFIC                  
//         DD  DSN=&INDIN4..W33507,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER VCNA                         
//*                                                                             
//SORTOUT  DD  DSN=&&W335SOR2,DISP=(NEW,PASS,DELETE),                           
//************ PRISFIL MED TID                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33530   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W33530,W33530,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W33530D1 DD  DSN=&&W335SOR2,DISP=(OLD,DELETE,DELETE)                          
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER                              
//*                                                                             
//W33530D2 DD  DSN=&INDUT..W33531(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FEL FIL                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
