//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ARTIKELINFORMATION TILL MB                                                 
//*                                                                             
//*  FREQUENCE:    WEEKLY   RTN W335V2                                          
//*                                                                             
//*  RESTART:      W33536    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W261..W261P1,                                            
//             INDIN2=&W910,                                                    
//             INDIN3=&W479,                                                    
//             INDUT=&W335..W335V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33536   EXEC PGM=V16459,PARM='W33536/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W33536D1 DD  DSN=&INDIN1..W26121(+0),DISP=SHR                                 
//************ ORDERTRÄFF BUYBACK                                               
//*                                                                             
//W33536D2 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ ALLMÄNNAFILEN                                                    
//*                                                                             
//W33536D3 DD  DSN=&INDIN3..W47984(+0),DISP=SHR                                 
//************ FIL FRÅN WDK9                                                    
//*                                                                             
//W33536D4 DD  DSN=&INDUT..W33537(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTINFO MED BUYBACKCODE                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUP7                                                
