//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER ARTIKELFIL                                                         
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W011..&RTEGRP.,                                          
//             INDUT=&W335..W335D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33545   EXEC PGM=V16459,PARM='W33545/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(150000,10000))                                      
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W33545D1 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ ARTIKELDATA                                                      
//*                                                                             
//W33545D2 DD  DSN=&INDREG..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGAR                                                      
//*                                                                             
//W33545D3 DD  DSN=&INDREG..W01162(+0),DISP=SHR                                 
//************ NOTERINGAR                                                       
//*                                                                             
//W33545D4 DD  DSN=&INDREG..W01166(+0),DISP=SHR                                 
//************ NYPONDATA                                                        
//*                                                                             
//W33545D5 DD  DSN=&INDUT..W33545(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTIKELUPPGIFTER                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//W33545D6 DD  DSN=&&W33546,DISP=(NEW,PASS,DELETE),                             
//************ ARTIKELUPPGIFTER TEMPFIL                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//W33545D7 DD  DSN=&&W33547,DISP=(NEW,PASS,DELETE),                             
//************ ARTIKELUPPGIFTER TEMPFIL                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
