//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL INEHÅLLANDE ARTIKELINFO TILL MB                                  
//*  DENNA FIL SKAPAS "LAGOM STOR" UTFIL SOM SKALL SKICKAS                      
//*  VIA VCOM. EV. RESTERANDE POSTER SKRIVS SOM NY GENERATION                   
//*  AV INFILEN.                                                                
//*    OM RESTERANDE POSTER FINNS LÄMNAS RETURKOD 8 FRÅN PGM.                   
//*  RETURKODEN TESTAS SEDAN I JCL OCH OM DEN ÄR 8 BESTÄLLS                     
//*  JOBBET IGEN OCH DEN NYA GENERATIONEN TAS IN FÖR ATT KUNNA                  
//*  SKICKA RESTERANDE POSTER OSV.                                              
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W335B9                                          
//*                                                                             
//*  ÅTERSTART:    W33583    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335B9,                                             
//             INDUT=&W335..W335B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583   EXEC PGM=W33583                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33583D2 DD  DSN=&INDIN..W33581(+0),DISP=SHR                                  
//************ FIL MED SPRÅK    PÅ BEN.REG TILL MB                              
//************ POSTER ATT SÄNDA TILL MB                                         
//*                                                                             
//W33583D3 DD  DSN=&INDUT..W33581(+1),DISP=(NEW,PASS,DELETE),                   
//************ EV. POSTER KVAR ATT SÄNDA EFTER DENNA SÄNDNING.                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=BACKUPC                                                 
//*                                                                             
//W33583D4 DD  DSN=&INDUT..W33581V(+1),DISP=(NEW,CATLG,DELETE),                 
//************ FIL MED FÖRÄNDR. PÅ ART.REG TILL MB                              
//************ 'DEL-FIL' ATT SÄNDA VIA VCOM                                     
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=BACKUPC                                                 
//*                                                                             
//W33583D5 DD  DSN=&INDIN..W33588(+0),DISP=SHR                                  
//************ FIL MED EN POST = VISAR FIL 81:S TOTANTAL                        
//*                                                                             
//************ OBS! CATALOG-STEGET LIGGER I JCL:EN                              
//*                                                                             
