//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR ARTIKLAR FRÅN WDN6                                                
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD    RTN W335P1                               
//*                                                                             
//*  ÅTERSTART:    W33546    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P046 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W910,                                                    
//             INDIN1=&W011,                                                    
//             INDUT=&W335..W335P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33546   EXEC PGM=W33546                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33546D1 DD  DSN=&INDIN2..W91028(+0),DISP=SHR                                 
//************ ARTIKLAR FRÅN WDN6                                               
//*                                                                             
//W33546D2 DD  DSN=&INDIN1..W01172(+0),DISP=SHR                                 
//************ DAGLIGA LAGERBANDET                                              
//*                                                                             
//W33546D3 DD  DSN=&INDUT..W33546(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERADE ARTIKLAR                                               
//             MGMTCLAS=&BACKUPC,SPACE=(10,(1100,100),RLSE),AVGREC=K            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
