//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FIL MED FÄRSKASTE PRISRAD PER LEVERANTÖR OCH ARTIKEL                       
//*                                                                             
//*  FREKVENS:  DAG   RTN W335D6                                                
//*                                                                             
//*  ÅTERSTART: W3358A      NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P08A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..NDC,                                               
//             INDIN2=&W335..W335D6,                                            
//             INDUT=&W335..W335D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3358A   EXEC PGM=V16459,PARM='W3358A/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W3358AD1 DD  DSN=&INDIN1..W01185(+0),DISP=SHR                                 
//************ FIL MED ALLA PRISRADER I PULS                                    
//*                                                                             
//W3358AD2 DD  DSN=&INDIN2..W3358H(+0),DISP=SHR                                 
//************ FIL MED PULS ALLA LEVERANTÖRER                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//TPFIL3   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//W3358AD3 DD  DSN=&INDUT..W3358A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SENASTE PRISRAD PER ARTIKEL OCH LEVERANTÖR                       
//             MGMTCLAS=BACKUPC,DATACLAS=PSEB                                   
