//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FIL MED PRISINFO TILL ESDIC                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W335V2                                         
//*                                                                             
//*  RESTART:      W33558      NORMAL                                           
//*                READS        WDK6 WDB2 WDG1 WDC1 WDC2 WDK6 WDK7 WDF1         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P058 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W910,                                                    
//             INDUT=&W335..W335V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33558   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33558,W33558,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDG1     INCLUDE MEMBER=WDB1                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDC2     INCLUDE MEMBER=WDC2                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W33558D1 DD  DSN=&INDIN2..W91042(+0),DISP=SHR                                 
//************ FIL MED ARTIKELINFO                                              
//*                                                                             
//W33558D2 DD  DSN=&INDUT..W33559(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ ARTIKLAR MED PRISER                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
