//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W33545 OCH W91042 OCH BYTER DIV FÄLT                               
//*                                                                             
//*  FREKVENS:     VECKA       RTN W335D7                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W33537    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P049 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910,                                                     
//             INDIN1=&W335..W335D7,                                            
//             INDUT=&W335..W335D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33537   EXEC PGM=V16459,PARM='W33537/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W33537D1 DD  DSN=&INDIN..W91042(+0),DISP=SHR                                  
//************ PRISFIL TOTAL GÅRDAGENS                                          
//*                                                                             
//W33537D2 DD  DSN=&INDIN1..W33545(+0),DISP=SHR                                 
//************ ARTINFO                                                          
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELRADFIL                                           
//             DATACLAS=PSEB                                                    
//W33537D3 DD  DSN=&INDUT..W33537(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ARTINFO MED MÅNADSSJÄLVKOST                                      
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
