//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DAILY UPDATE COST OF SALES FILE                                            
//*                                                                             
//*  FREKVENS:  DAG   RTN W335D6                                                
//*                                                                             
//*  FREQUENCE: DAILY  RTN W335D6                                               
//*                                                                             
//*  RESTART:   W3358F  NORMAL                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P08F PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W335                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3358F   EXEC PGM=V16459,PARM='W3358F/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W3358FD1 DD  DSN=&INDREG..W3358E(+0),DISP=SHR                                 
//************ PRISFIL SJÄLVKOST MÅNAD LOKALA ARTIKLAR MED WDK7-PRISER          
//*                                                                             
//W3358FD2 DD  DSN=&INDREG..W3358I(+0),DISP=SHR                                 
//************ PRICEFILE WITH PRICES TO MONTHLY RATE MED WDK6-PRISER            
//*                                                                             
//W3358FD3 DD  DSN=&INDREG..W33588(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ PRICEFILE WITH PRICES TO MONTHLY RATE                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
