//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  RUTINE STARTED EVERY HOUR TO CREATE RECORDS FOR SENDING                    
//*  PRICE REQUEST TO VCOM.                                                     
//*                                                                             
//*  READS WDC7 WITH SB.                                                        
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W335S6                           
//*                                                                             
//*  RESTART:      W3359E    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P09E PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W335..W335S6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3359E   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W3359E,W3359E,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,                                                           
//             DCB=(RECFM=VB,LRECL=6229,BLKSIZE=27998,BUFNO=5)                  
//DFSVSAMP DD  DSN=&INDGRND..CONSTANT(OSAM8K),DISP=SHR                          
//         DD  DSN=&INDGRND..CONSTANT(OSAM4K),DISP=SHR                          
//         DD  DSN=&INDGRND..CONSTANT(VSAM),DISP=SHR                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDC7     INCLUDE MEMBER=WDC7                                                  
//WDR4     INCLUDE MEMBER=WDR4                                                  
//W3359ED1 DD  DSN=&INDUT..W3359E(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ NYCKLAR TILL WDC7 - PRISFRÅGOR                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
