//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EMPTY  OF FILES WITH MULTILANG BESTÄLLNING= 'N'                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W335X9                                         
//*                                                                             
//*  RESTART:      W33582    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..EMPTYY,                                             
//             INDUT=&W335..EMPTYY                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33582   EXEC PGM=W33582                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33582D1 DD  DSN=&INDIN..W33581(+0),DISP=SHR                  -LIM(1)         
//************ INFILE                                                           
//*                                                                             
//W33582D2 DD  DSN=&INDUT..W33581(+1),DISP=(NEW,CATLG,DELETE),                  
//************ OUTFILE                                                          
//             SPACE=(11,(1,1),RLSE),AVGREC=U,                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
