//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR RENSNINGSPOSTER TILL WDC7                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W335V7                                         
//*                                                                             
//*  RESTART:      W33590      NORMAL                                           
//*                READS        WDC7  WDQ2C1                                    
//*                                                                             
//* E'TRACKER: 6277114 DATED 20080208                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W335..W335V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33590   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33590,W33590,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDC7     INCLUDE MEMBER=WDC7                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//W33590D1 DD  DSN=&INDUT..W33590(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ RENSNINGPOSTER WDC7                                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
