//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDAR NYA KAMPANJRABATTER TRANSFER DISCOUNT CODES.                        
//*                                                                             
//*  FREKVENS:     VECKA    RTN W335D2                                          
//*                                                                             
//*  ÅTERSTART:    W33520    NORMAL  (BMP)                                      
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P020 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN0=&W335..W335D2M0,                                          
//             INDIN1=&W335..W335D2M1,                                          
//             INDIN2=&W335..W335D2M2,                                          
//             INDIN3=&W335..W335D2M3,                                          
//             INDIN4=&W335..W335D2M5,                                          
//             INDUT=&W335..W335D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD06),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN0..W33506,DISP=SHR                                     
//************ FIL FRÅN VCAS ARTIKELINFO                                        
//         DD  DSN=&INDIN1..W33506,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(SVERIGE) ARTIKELINFO                      
//         DD  DSN=&INDIN2..W33506,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(VCEM) ARTIKELINFO                         
//         DD  DSN=&INDIN3..W33506,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(ASIA PACFIC) ARTIKELINFO                  
//         DD  DSN=&INDIN4..W33506,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(VCNA) ARTIKELINFO                         
//************ PRISFIL MED TID                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W335SOR1,DISP=(NEW,PASS,DELETE),                           
//************ PRISFIL MED TID                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33520   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W33520,W33520,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33520D1 DD  DSN=&&W335SOR1,DISP=(OLD,DELETE,DELETE)                          
//************ FIL FRÅN MARKNADSBOLAG MED RABATTER                              
//*                                                                             
//W33520D2 DD  DSN=&INDUT..W33521(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FEL FIL                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
