//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL FÖR UPPDATERING AV SJK OCH STD PÅ WDC1                          
//*                                                                             
//*  FREKVENS:     DAG         RTN W335D1                                       
//*                                                                             
//*  ÅTERSTART:    W33502    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011,                                                    
//             INDIN2=&W335,                                                    
//             INDUT1=&W335..W335D1XY,                                          
//             INDUT2=&W335                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33502   EXEC PGM=V16459,PARM='W33502/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W33502D1 DD  DSN=&INDIN1..W01172(+0),DISP=SHR                                 
//************ "LAGERBAND" MED SJK STD                                          
//*                                                                             
//W33502D2 DD  DSN=&INDIN2..W33502(+0),DISP=SHR                                 
//************ REGISTER SOM DET MATCHAS MOT                                     
//*                                                                             
//W33502D3 DD  DSN=&INDUT1..W33505(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FIL TILL W33501                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W33502D4 DD  DSN=&INDUT2..W33502(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ UTFIL SOM MAN DIFFAR PÅ NÄSTA GÅNG                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
