//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR PRISÄNDRINGAR MED TIDPUNKT                                    
//*                                                                             
//*  FREKVENS:     DAG     RTN W335X4                                           
//*                                                                             
//*  ÅTERSTART:    W33507    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335X4,                                             
//             INDUT=&W335..W335X4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33507   EXEC PGM=W33507                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33507D1 DD  DSN=&INDIN..W33530(+0),DISP=SHR                                  
//************ PRISFIL UTAN TID FRÅN MARKNADSBOLAG ARTIKELRABATT                
//*                                                                             
//W33507D2 DD  DSN=&INDUT..W33507(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ PRISFIL MED TID ARTIKELRABATT                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
