//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDAR NYA NORMALRABATTKODER AMC                                           
//*                                                                             
//*  FREKVENS:     VECKA    RTN W335D4                                          
//*                                                                             
//*  ÅTERSTART:    W33510    NORMAL  (BMP)                                      
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN0=&W335..W335D4M0,                                          
//             INDIN1=&W335..W335D4M1,                                          
//             INDIN2=&W335..W335D4M2,                                          
//             INDIN3=&W335..W335D4M3,                                          
//             INDIN4=&W335..W335D4M5,                                          
//             INDUT=&W335..W335D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD08),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN0..W33508,DISP=SHR                                     
//************ FIL FRÅN VCAS ARTIKELINFO                                        
//         DD  DSN=&INDIN1..W33508,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(SVERIGE) RABATTKODER                      
//         DD  DSN=&INDIN2..W33508,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(VCEM) RABATTKODER                         
//         DD  DSN=&INDIN3..W33508,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(ASIA PACFIC) RABATTKODER                  
//         DD  DSN=&INDIN4..W33508,DISP=SHR                                     
//************ FIL FRÅN MARKNADSBOLAG(VCNA) RABATTKODER                         
//*                                                                             
//SORTOUT  DD  DSN=&&W335SOR3,DISP=(NEW,PASS,DELETE),                           
//************ PRISFIL MED TID                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33510   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W33510,W33510,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W33510D1 DD  DSN=&&W335SOR3,DISP=(OLD,DELETE,DELETE)                          
//************ FIL FRÅN MARKNADSBOLAG MED RABATTKODER VCAS                      
//*                                                                             
//W33510D2 DD  DSN=&INDUT..W33511(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ MEMO TILL MF                                                     
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W33510D3 DD  DSN=&INDUT..W33512(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB A (SVERIGE)                                         
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D4 DD  DSN=&INDUT..W33513(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB B  (VCEM)                                           
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D5 DD  DSN=&INDUT..W33514(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB C                                                   
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D6 DD  DSN=&INDUT..W33515(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB D                                                   
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D7 DD  DSN=&INDUT..W33516(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB E (VCNA)(M5)                                        
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D8 DD  DSN=&INDUT..W33517(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB F = VCAS                                            
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W33510D9 DD  DSN=&INDUT..W33518(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MEMO TILL MB G = VCI                                             
//             SPACE=(10,(30,15),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
