//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER PRISER TILL MARKNADSBOLAGSVALUTA                                     
//*  SJÄLVKOST MED BESTÄLLNINGSPRIS(SEK)/SJÄLVKOST SOM ÄR                       
//*  OMRÄKNAR MED MÅNADSVALUTA.                                                 
//*                                                                             
//*  FREKVENS:     DAG     RTN W335B2                                           
//*                                                                             
//*  ÅTERSTART:    W3354A      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P04A PROC STPLIB=&INDRTE..LOAD,                                           
//             TYP=SAKNAS,                                                      
//             DSIN=NULLFILE,                                                   
//             DSUT=NULLFILE                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3354A   EXEC PGM=W3354A                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W3354AD1 DD  DSN=&INDRTE..CONSTANT(W335&TYP),DISP=SHR                         
//************ TYP AV MARKNADSBOLAG                                             
//*                                                                             
//W3354AD2 DD  DSN=&DSIN,DISP=SHR                                               
//************ FIL FRÅN W33540                                                  
//*                                                                             
//W3354AD3 DD  DSN=&DSUT,DISP=(NEW,CATLG,DELETE),  -LIM(3)                      
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
