//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER PRISER TILL MARKNADSBOLAGSVALUTA                                     
//*  SJÄLVKOST MED BESTÄLLNINGSPRIS(SEK)/SJÄLVKOST SOM ÄR                       
//*  OMRÄKNAR MED MÅNADSVALUTA.                                                 
//*                                                                             
//*  FREKVENS:     DAG     RTN W335D7                                           
//*                                                                             
//*  ÅTERSTART:    W3354A      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P34B PROC STPLIB=&INDRTE..LOAD,                                           
//             DSIN=NULLFILE,                                                   
//             DSUT=W335.W335D7                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3354B   EXEC PGM=W3354B                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W3354BD1 DD  DSN=&DSIN,DISP=SHR                                               
//************ FIL FRÅN W33540                                                  
//*                                                                             
//W3354BD2 DD  DSN=&DSUT..W3354BA(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG A                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD3 DD  DSN=&DSUT..W3354BB(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG B                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD4 DD  DSN=&DSUT..W3354BC(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG C                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD5 DD  DSN=&DSUT..W3354BD(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG D                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD6 DD  DSN=&DSUT..W3354BE(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG E                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD7 DD  DSN=&DSUT..W3354BF(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG F                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W3354BD8 DD  DSN=&DSUT..W3354BG(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2, PRIS OMRÄKNAT - MARKNADSBOLAG G                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
