//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄGGER IHOP VÄRDEN TILL EN POST PER ARTIKELNR                              
//*                                                                             
//*  FREKVENS:     VECKA    RTN W335V1                                          
//*                                                                             
//*  ÅTERSTART:    W33504    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P004 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335V1,                                             
//             INDUT=&W335..W335V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33504   EXEC PGM=V16459,PARM='W33504/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(800,800))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W33504D1 DD  DSN=&INDIN..W33504(+0),DISP=SHR                                  
//************ FIL FRÅN WDC1                                                    
//*                                                                             
//SORTFIL  DD  SPACE=(54,(700,200),RLSE),AVGREC=K                               
//************ SORTERAD PÅ ARTNR                                                
//*                                                                             
//W33504D3 DD  DSN=&INDUT..W33505(+1),DISP=(NEW,CATLG,DELETE),  -LIM(99         
//************ EN POST PER ARTIKELNR                                            
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*COPY     EXEC PGM=V16459,PARM='ICEGENER/3/'                                  
//*SYSPRINT DD  SYSOUT=*                                                        
//*SYSIN    DD  DUMMY                                                           
//*SYSUT1   DD  DSN=&INDUT..W33505(+1),DISP=SHR                                 
//************  FIL FRÅN TIDIGARE STEG                                          
//*                                                                             
//*SYSUT2   DD  DSN=&INDUT..W3350F(+1),                        -LIM(99)         
//*            DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA AV W33505                                                  
//*             SPACE=(54,(900,200),RLSE),AVGREC=K,                             
//*             MGMTCLAS=&NOBACKUP                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
