//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA ARTIKELINFO                                                          
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W335D5 W335D7 W335D8                           
//*                                                                             
//*  RESTART:      W33538      NORMAL                                           
//*                READS        WDD7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335D5,                                             
//             INDIN2=&W335..W335D5,                                            
//             INDIN3=&W335..W335D5,                                            
//             INDUT2=&W335..W335D5,                                            
//             INDUT=&W335..W335D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33538   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W33538,W33538,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM1K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR               -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD7     INCLUDE MEMBER=WDD7                                                  
//W33538D1 DD  DSN=&INDIN..W33547(+0),DISP=SHR                                  
//************ NY INFO                                                          
//*                                                                             
//W33538D6 DD  DSN=&INDIN3..W33548(+0),DISP=SHR                                 
//************ NYA NDC ARTIKLEL ELLER NY LEVERANTÖR PÅ NDC                      
//*                                                                             
//W33538D2 DD  DSN=&INDIN2..W33538(+0),DISP=SHR                                 
//************ REGISTER IN                                                      
//*                                                                             
//W33538D3 DD  DSN=&INDUT2..W33538(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ REGISTER UT                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W33538D4 DD  DSN=&INDUT..W33539(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ÄNDRADE ARTIKLAR                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W33538D5 DD  DSN=&INDUT..W33549(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ÄNDRAD ERSKOD                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
