//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PREPARING TABLE TP7PART FOR ISRT/LOAD                                      
//*                                                                             
//*  FREQUENCE: ORDERED      RTN W335S1                                         
//*                                                                             
//*  RESTART:      W33524      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P024 PROC INDIN=&W335..W335S1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33524   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W335PD24),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W33523(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDIN..W33524(+1),DISP=(NEW,CATLG,DELETE),                  
//             DATACLAS=PSEN                                                    
