//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  WEEKLY UPDATE OF COSTS SENT TO S&T VIA VCOM                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W335V6                                         
//*                                                                             
//*  RESTART:      W3359A    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P09A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W335..W335V6,                                             
//             INDUT=&W335..W335V6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3359A   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,DSNMTV01,W3359A,,00')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//DDOTV02  DD  DSN=&INDUT..W3359ABT,DISP=(,PASS),                               
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(RECFM=VB,LRECL=4092),                                       
//             MGMTCLAS=DEL2                                                    
//DDITV02  DD  DSN=&W..&DB2GRP..CONSTANT(W3359AI2),DISP=SHR                     
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD2     INCLUDE MEMBER=WDD2                                                  
//*                                                                             
//W3359AD1 DD  DSN=&INDIN..W33597(+0),DISP=SHR                                  
//************ COST FILE TO S&T                                                 
//*                                                                             
//W3359AD2 DD  DSN=&INDUT..W3359A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ COST FILE TO S&T                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
