//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPY TO B9 RUTINE FILE.                                                    
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W335B9                             
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P183 PROC INDIN=&W335..W335X9,                                            
//             INDUT=&W335..W335B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583A  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M0.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M0.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583B  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M1.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M1.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583C  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M2.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M2.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583D  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M3.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M3.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583E  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M4.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M4.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583F  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M5.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M5.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583G  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.M6.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG MX                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.M6.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33583H  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN.TT.W33581(+0),DISP=SHR                                
//************ SPRÅK BESTÄLLNINGAR FRÅN MARKNADSBOLAG TT                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT.TT.W33581(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA                                                            
//             DCB=(RECFM=FB,LRECL=11,BLKSIZE=11),                              
//             MGMTCLAS=&BACKUPC,SPACE=(11,(2,2),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
