//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA INFO TILL MB                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W335D7                                          
//*                                                                             
//*  ÅTERSTART:    W33540      NORMAL                                           
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W335P240 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=,                                                         
//             INDIN3=&W910,                                                    
//             INDUT=                                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W33540   EXEC PGM=W33540                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W33540D1 DD  DSN=&INDIN2..W33539(+0),DISP=SHR                                 
//************ FIL SOM SKALL KOMPLETTERAS                                       
//*                                                                             
//W33540D2 DD  DSN=&INDIN3..W91044(+0),DISP=SHR                                 
//************ INNEH BELEVART                                                   
//*                                                                             
//W33540D3 DD  DSN=&INDUT..W33540A(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)        
//************ INFO TILL MB (EJ USA)                                            
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=DEL2                                                    
//W33540D4 DD  DSN=&INDUT..W33541(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INNEH ENDAST EN POST SOM VISAR ANTAL ARTIKLAR                    
//************ PÅ W33540 FILEN                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=DEL2                                                    
//W33540D5 DD  DUMMY                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR FILEN W33541                                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541D(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541F(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W33541(+1),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W33541G(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
