//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR DETALJLISTA ÖVER BYTESHISTORIK TILL ON-DEMAND.                     
//*                                                                             
//*  FREKVENS:     VECKA   RTN W371V7                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P182 PROC INDIN=&W371..W371V7,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,EXCH)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W37182(+0),DISP=SHR                                  
//************** VECKANS BYTESHISTORIK TILL ON-DEMAND              ***          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W37182-001 LISTA BYTESHISTORIK                                   
//*                                                                             
