//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER BASEN WDA7 OCH SKAPAR EN UTFIL W37114                                
//*                                                                             
//*  FREKVENS:     VECKA     RTN W371V6                                         
//*                                                                             
//*  ÅTERSTART:    W37114      NORMAL                                           
//*                LÄSER        WDA7 WDA7                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371V6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37114   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37114,W37114,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA7     INCLUDE MEMBER=WDA7                                                  
//*                                                                             
//W37114D1 DD  DSN=&&W37114T,                                                   
//************ TEMPORÄRFIL                                                      
//             DISP=(NEW,PASS,DELETE),                                          
//             SPACE=(159,(100,50),RLSE),AVGREC=K                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD14),DISP=SHR                         
//SORTIN   DD  DSN=&&W37114T,DISP=(OLD,DELETE,DELETE)                           
//************ TEMPORÄRFILEN                                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W37114(+1),                                          
//************ SORTERAD URVALSFIL WDA7                                          
//             DISP=(NEW,CATLG,DELETE), -LIM(5)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
