//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UPPFÖLJNING PÅ GARANTIRAPPORTER I STATUS 4 KOD 210                  
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W371D4                                         
//*                                                                             
//*  ÅTERSTART:    W3714H    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P24H PROC INDIN=&W371..W371D4,                                            
//             DEST4=&QJP20109,                                                 
//             DEST5=&QAU10012,                                                 
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3714H   EXEC PGM=V16459,PARM='W3714H/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//*                                                                             
//W3714HD1 DD  DSN=&INDIN..W3714F(+0),DISP=SHR                                  
//************ BYTES GARANTI RAPPORTER I STATUS 4 MED KOD 210                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ÅRSFIL SORTERAD PÅ ARTIKELNR                            
//             SPACE=(18,(50,10),RLSE),AVGREC=K                                 
//*                                                                             
//W3714HD2 DD  DUMMY                                                            
//************ UPPFÖLJNING PÅ GARANTIRAPPORTER DC11                             
//*                                                                             
//W3714HD3 DD  DUMMY                                                            
//************ DAILY FOLLOWING-UP WARRANTY-REPORTS TO TMA DC 41                 
//*                                                                             
//W3714HD4 DD  DUMMY                                                            
//************ DAILY FOLLOWING-UP WARRANTY-REPORTS SUMMARY DC 41                
//*                                                                             
//W3714HD5 DD  SYSOUT=(A,,STD),DEST=&DEST4,                                     
//************ DAILY FOLLOWING-UP WARRANTY-REPORTS TO     DC 61                 
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W3714HD6 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//************ DAILY FOLLOWING-UP WARRANTY-REPORTS TO     DC 62                 
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
