//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      BYTES POÄNG                                                  *         
//*                                                                   *         
//*      PERIODICITET: VECKA   RTN W371V4                             *         
//*                                                                   *         
//*      ÅTERSTART:    W37162  NORMAL                                 *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P062  PROC INDUT=&W371..W371V4,                                           
//             STPLIB=&INDRTE..LOAD,                                            
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDIN2=&W335..W335V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371S1  EXEC PGM=SORT                                                         
//* SEKVENS= IDARTNR                                                            
//*SORTIN   DD  DSN=&INDIN2..W33504(+0),DISP=SHR                                
//SORTIN   DD  DSN=&INDIN2..W33505(+0),DISP=SHR                                 
//************ EXTRAKT WDC1                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W33504,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAT EXTRAKT WDC1                                ***         
//             SPACE=(54,(500,66),RLSE),AVGREC=K                                
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD62),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37162  EXEC PGM=DFSRRC00,                                                    
//             PARM=('&DBB,W37162,W37162,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                    -- POSTSUM           
//*                                                                             
//WDR1     INCLUDE MEMBER=WDR1                                                  
//*                                                                             
//W37162D1 DD  DSN=&INDIN1..W01160(+0),DISP=SHR                                 
//************ EXTRAKT WDK601/WDK611                                            
//W37162D2 DD  DSN=&&W33504,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAT EXTRAKT WDC1                                            
//W37162D3 DD  DSN=&INDUT..W37164(+1),                        -LIM(155)         
//             DISP=(NEW,CATLG,DELETE),                                         
//**************  UPPDATERINGSPOSTER ETC. BYTES POÄNG                           
//             SPACE=(42,(10,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
