//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      BYTES POÄNG                                                  *         
//*                                                                   *         
//*      PERIODICITET: VECKA   RTN W371V4                             *         
//*                                                                   *         
//*      ÅTERSTART:    W37163  NORMAL                                 *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P062  PROC INDUT=&W371..W371V4,                                           
//             STPLIB=&INDRTE..LOAD,                                            
//             INDIN=&W371..W371V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37163  EXEC PGM=DFSRRC00,                                                    
//             PARM=('&DBB,W37163,W37163,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                    -- POSTSUM           
//*                                                                             
//WDR1     INCLUDE MEMBER=WDR1                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//*                                                                             
//W37163D1 DD  DSN=&INDIN..W37164(+0),DISP=SHR                                  
//************ UPPDATERINGSPOSTER ETC. BYTES POÄNG                              
//W37163D2 DD  DSN=&INDUT..W37163(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//**************  RAPPORTPOSTER BYTES POÄNG                                     
//             SPACE=(80,(10,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W37163D3 DD  DSN=&INDUT..W37165(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//**************  HEADERPOSTER BYTES POÄNG                                      
//             SPACE=(80,(1,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
