//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROFORMA FAKTUROR FRÅN NDC:ER TILL SITTARD                                 
//*                                                                             
//*  FREKVENS:     DAG         RTN W371S5                                       
//*                                                                             
//*  ÅTERSTART:    W37178    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W371..W371S5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37178   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37178,W37178,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37178D2 DD  DSN=&INDUT..W3717H(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RAPPORTER TILL WDM6                                              
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W37178D3 DD  DSN=&INDUT..W37178(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RAPPORTER TILL DAP                                               
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W37178D4 DD  DSN=&INDUT..W3717C(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RAPPORTER TILL DOC. RETRIEVAL                                    
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
