//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      LISTAR GENOMSNITTS ARBETSDAGEN DET TAR FRÅN STAUS 3 TILL 4   *         
//*                                                                   *         
//*      PERIODICITET: DAG                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P054 PROC INDIN=&W371..W371D3,                                            
//             DEST1=&CPRINT,                                                   
//             DEST3=&QUS05304,                                                 
//             DEST4=&QUS05257,                                                 
//             DEST5=&QUS05650,                                                 
//             DEST6=&QUS05692,                                                 
//             INDUT=&W371..W371D3,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD54),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W3714D(+0),DISP=SHR                                  
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W371SORT,DISP=(NEW,PASS,DELETE),                           
//************ SORTAT LAGERBAND FRÅN NDC:ERNA                                   
//         SPACE=(10,(100,50),RLSE),AVGREC=K                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W37154   EXEC PGM=W37154                                                      
//STEPLIB   DD DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//          DD DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT    DD SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT     DD DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN     DD DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT     DD SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//W37154D1  DD DSN=&&W371SORT,DISP=(OLD,DELETE,DELETE)                          
//***********                                                                   
//*                                                                             
//*                                                                             
//W37154D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 11                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D3 DD  DSN=&INDUT..W37154(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 91                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W37154D4 DD  SYSOUT=(A,,STD),DEST=&DEST3,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 51                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D5 DD  SYSOUT=(A,,STD),DEST=&DEST4,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 41                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D6 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 42                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D7 DD  SYSOUT=(A,,STD),DEST=&DEST6,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 43                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D8 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 61                         
//*                                                                             
//W37154D9 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 62                         
//*                                                                             
