//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDM6 OCH SKAPAR EN UTFIL                                             
//*                                                                             
//*  FREKVENS:     DAG     RTN W371XX                                           
//*                                                                             
//*  ÅTERSTART:    W37112      NORMAL                                           
//*                LÄSER        WDM6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371V5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37112   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37112,W37112,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDM6     INCLUDE MEMBER=WDM6                                                  
//W37112D1 DD  DSN=&INDUT..W37112(+1),                                          
//             DISP=(NEW,CATLG,DELETE), -LIM(5)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W37112D2 DD  DSN=&INDUT..W37112X(+1),                                         
//             DISP=(NEW,CATLG,DELETE),                                         
//             SPACE=(159,(100,50),RLSE),AVGREC=K                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
