//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR BYTESUPPFÖLJNINGEN TILL BORN MED FUNKTIONSGRUPP               
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W371D3                                         
//*                                                                             
//*  ÅTERSTART:    W3714J    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P04J PROC INDIN=&W011..&RTEGRP.,                                          
//             INDIN1=&W371..W371D3,                                            
//             INDUT=&W371..W371D3,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3714J   EXEC PGM=V16459,PARM='W3714J/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//*                                                                             
//W3714JD1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ EXTRAKT FRÅN WDK6                                                
//*                                                                             
//W3714JD2 DD  DSN=&INDIN1..W3714J(+0),DISP=SHR                                 
//************ BYTESUPPFÖLJNINGSFIL I STATUS 4 UTAN FUKTIONSGRUPP               
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ BYTESUPPFÖLJNING SORTERAD PÅ ARTIKELNR OCH DC                    
//             SPACE=(42,(50,10),RLSE),AVGREC=K                                 
//*                                                                             
//W3714JD3 DD  DSN=&INDUT..W3714K(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ BYTESUPPFÖLJNING MED FUKTIONSGRUPP I STATUS 4 (BORN)             
//             SPACE=(42,(156,114),RLSE),AVGREC=K,                              
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
