//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE CORE EXPORT DOCUMENT WHEN SENDING CORES                             
//*  FROM LDC (NONE EU) TO MAASTRICHT (DC91) OR CDC (DC11).                     
//*                                                                             
//*  FREQUENCE:    DAY       RTN W371S2                                         
//*                                                                             
//*  RESTART:      W37158    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37158   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37158,W37158,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDM6     INCLUDE MEMBER=WDM6                                                  
//WDB2     INCLUDE MEMBER=WDB6                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDC2     INCLUDE MEMBER=WDC2                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDB6     INCLUDE MEMBER=WDB2                                                  
//W37158D1 DD  DDNAME=SYSIN                                                     
//************ USER/DC/DISTRICT/DC-REC PARAMETERS FROM                          
//************ CORE RECEIVING SCREEN (WEB)                                      
//*                                                                             
//W37158D2 DD  DSN=&INDUT..W37151(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ MAIL FILE IN CSV FORMAT                                          
//************ DOCUMENT RETRIVAL REPORT                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W37158D3 DD  DSN=&INDUT..W37152(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ DOCUMENT RETRIVAL REPORT                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
