//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSAR WDR4 FRÅN GODKÄNDA FAKTUROR  SOM                                    
//*  HAR DATUM ÄLDRE ÄN 12 VECKOR(84 DAGAR)                                     
//*                                                                             
//*  FREKVENS:     VECKA    RTN W371S6                                          
//*                                                                             
//*  ÅTERSTART:    W37179    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P079 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W371..W371S6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37179   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37179,W37179,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W37179D1 DD  DSN=&INDUT..W37179(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INNEHÅLLER DE RAPPORTER SOM SKALL RENSAS                         
//             SPACE=(40,(200,266),RLSE),AVGREC=U,                              
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//*                                                                             
