//W371P01B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3711B   EXEC PGM=V16459,PARM='W3711B/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//INFIL01  DD  DSN=&INDIN..W37112X(+0),DISP=SHR                                 
//************                                                                  
//*                                                                             
//UTFIL01  DD  DSN=&&W3711BX,DISP=(NEW,PASS,DELETE),                            
//************ TAB-SEPARATED EXTRACT FILE OF WDM6 FOR DATALAKE                  
//             DATACLAS=PSEB                                                    
//*                                                                             
