//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR MED LEVNR                                                     
//*                                                                             
//*  FREKVENS:     MÅNAD       RTN W371M1                                       
//*                                                                             
//*  ÅTERSTART:    W37149      NORMAL                                           
//*                LÄSER        WDK7 WDK6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P049 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371M1,                                             
//             INDUT=&W371..W371M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37149   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37149,W37149,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W37149D1 DD  DSN=&INDIN..W371NA,DISP=SHR                                      
//************ INFILEN FRÅN V371V1 BARA NDC RAPPORTER FRÅN                      
//************ FÖREGÅENDE MÅNAD                                                 
//*                                                                             
//W37149D2 DD  DSN=&INDUT..W37149(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERAD MED LEVNR                                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
