//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER FAKTUROR CLEARING FLEN BORN.                                       
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W371S4                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W371..W371S4,                                             
//             INDUT=&W371..W371S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37156   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37156,W37156,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37156D3 DD  DSN=&INDUT..W37157(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TULLINFO                                                         
//             SPACE=(74,(2,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W37156D5 DD  DSN=&INDUT..W37160(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ECONOMICAL DATA LOG                                              
//             SPACE=(250,(50,10),RLSE),AVGREC=K,                               
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//W37156D6 DD  DDNAME=SYSIN                                                     
//************ IDFAKT-PARAMETER FRÅN W3018200                                   
//W37156D7 DD  DSN=&INDUT..W37161(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LISTA W37156-001 TILL D&P DC21                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W37156D8 DD  DSN=&INDUT..W37162(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LISTA W37156-061 TILL D&P DC61                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W37156D9 DD  DSN=&INDUT..W37163(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LISTA W37156-062 TILL D&P DC62                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W37156DA DD  DSN=&INDUT..W37164(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LISTA W37156-062 TILL DOC. RETRIEVAL DC62                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
