//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRODUCTION OF REPORTFILES                                                  
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W371V7                                         
//*                                                                             
//*  RESTART:      W37177    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * *                                   
//W371P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371V7,                                             
//             INDUT=&W371..W371V7                                              
//* * * * * * * * * * * * * * * * * * * * * *                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD78),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37141(+0),DISP=SHR                                  
//SORTOUT  DD  DSN=&&W41T,DISP=(NEW,PASS,DELETE),                               
//             SPACE=(159,(100,50),RLSE),AVGREC=K                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD77),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37131(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W31T,DISP=(NEW,PASS,DELETE),                               
//             SPACE=(159,(100,50),RLSE),AVGREC=K                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37177   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37177,W37177,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR1     INCLUDE MEMBER=WDR1                                                  
//W37177D1 DD  DSN=&&W31T,DISP=(OLD,DELETE,DELETE)                              
//************ EXTRACT FROM CUST PARM FILE                                      
//*                                                                             
//W37177D2 DD  DSN=&&W41T,DISP=(OLD,DELETE,DELETE)                              
//************ WEEKS TRANSACTIONS                                               
//*                                                                             
//W37177D3 DD  DSN=&INDUT..W37177(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ REPORT FILES                                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
