//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR DIV SALDON SAMT SKAPAR TRANSAR TILL LAB/SAP-R3                  
//*                                                                             
//*  FREKVENS:     DAG         RTN W371D1                                       
//*                                                                             
//*  ÅTERSTART:    W37123    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDREG=&W371,                                                    
//             INDIN=&W371..W371D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37123   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37123,W37123,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37123D1 DD  DSN=&INDIN..W37104(+0),DISP=SHR                                  
//************ INFIL FRÅN W37122 MED GODKÄNDA RETURER                           
//*                                                                             
//W37123D2 DD  DSN=&INDREG..W37181(+0),DISP=SHR                                 
//************** KVITTNINGSTABELLEN                                 ***         
