//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDA9 OCH SKAPAR EN UPPDATERINGSFIL                                   
//*                                                                             
//*  FREKVENS:     PERIOD  RTN W371P3                                           
//*                                                                             
//*  ÅTERSTART:    W37170      NORMAL                                           
//*                LÄSER       WDA9                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371P3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37170   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37170,W37170,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA9     INCLUDE MEMBER=WDA9                                                  
//W37170D1 DD  DSN=&&W37170T,                                                   
//************ TEMPORÄRFIL                                                      
//             DISP=(NEW,PASS,DELETE),                                          
//             SPACE=(25,(50,5),RLSE),AVGREC=K                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD70),DISP=SHR                         
//SORTIN   DD  DSN=&&W37170T,DISP=(OLD,DELETE,DELETE)                           
//************ TEMPORÄRFILEN                                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W37170(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SORTERAD UPPDATERINGSFIL                                         
//             SPACE=(25,(50,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
