//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      LISTAR GENOMSNITTS ARBETSDAGEN DET TAR FRÅN STAUS 2 TILL 3   *         
//*      UNDER EN PERIOD                                              *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P057 PROC INDIN=&W371..W371V2,                                            
//             DEST1=LOCAL,                                                     
//             DEST7=&QJP20109,                                                 
//             INDUT=&W371..W371V2,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD57),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W3714E,DISP=SHR                                      
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W371SORT,DISP=(NEW,PASS,DELETE),                           
//************ SORTAT LAGERBAND FRÅN NDC:ERNA                                   
//         SPACE=(11,(200,266),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W37157   EXEC PGM=W37157                                                      
//STEPLIB   DD DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//          DD DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT    DD SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT     DD DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN     DD DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT     DD SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//W37157D1 DD  DSN=&&W371SORT,DISP=(OLD,DELETE,DELETE)                          
//***********                                                                   
//*                                                                             
//*                                                                             
//W37157D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 2 TILL 3 DC 11                      
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37157D3 DD  DSN=&INDUT..W37157(+1),DISP=(NEW,CATLG,DELETE), -LIM(7)          
//************ BYTES UPPFÖLJNING FÖR STATUS 2 TILL 3 DC 91                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W37157D4 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 2 TILL 3 DC 61                      
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37157D5 DD  DSN=&INDUT..W37157.WEBDC(+1),                   -LIM(7)          
//************ BYTES UPPFÖLJNING FÖR STATUS 2 TILL 3 WEB DC'S                   
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
