//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BATCH TO CREATE WEEK FILE WITH POINTS TO VIPS VIA                          
//*  VCOM                                                                       
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W371V4                                         
//*                                                                             
//*  RESTART:      W37164    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371V4,                                             
//             INDUT=&W371..W371V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37164   EXEC PGM=W37164                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37164D1 DD  DSN=&INDIN..W37164(+0),DISP=SHR                                  
//************ WEEKLY POINT TRANSACTION FILE                                    
//*                                                                             
//W37164D2 DD  DSN=&INDUT..W37167(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FILE TO NOAC WITH WEEKLY POINT FILE                              
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
