//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*                                                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W371V1                                          
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W371..W371V1,                                            
//             INDIN2=&W371,                                                    
//             INDUT=&W371,                                                     
//             INDUT2=&WXTR..W371V1                                             
//*                                                                             
//W37141   EXEC PGM=W37141                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37141D1 DD  DSN=&INDIN1..W37138(+0),DISP=SHR                                 
//************ INTRANS                                                          
//*                                                                             
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37141D2 DD  DSN=&INDIN2..W37148(+0),DISP=SHR                                 
//************ IN-REG                                                           
//*                                                                             
//W37141D3 DD  DSN=&INDUT..W37148(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTREG                                                            
//             SPACE=(132,(300,90),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//COPY     EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN2..W37148(+1),DISP=SHR                                 
//************ IN-REG                                                           
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WXTR3F(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ KOPIA AV W4140K                                                  
//             SPACE=(132,(300,90),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
