//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTES BANK - UPPDATERAR WDA7 M.H.A ORDERTRANSAKTIONER                      
//*                                                                             
//*  FREKVENS:    VECKA     RTN W371V8                                          
//*                                                                             
//*  ÅTERSTART:   W37168    NORMAL  (BMP)                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,CPU=1,                                                     
//             INDIN=&W371..W371V8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37168   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37168,W37168,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                    -- POSTSUM           
//W37168D1 DD  DSN=&INDIN..W37111(+0),DISP=SHR                                  
//************ ORDER-TRANSAKTIONER TILL FAKTURERING                             
//W37168D2 DD  DSN=&INDIN..W37133(+0),DISP=SHR                                  
//************ SIGNALTRANSAKTIONER                                              
//*                                                                             
