//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR BYTESUPPFÖLJNINGEN TILL BORN MED FUNKTIONSGRUPP               
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W371D3                                         
//*                                                                             
//*  ÅTERSTART:    W3714O    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P04O PROC INDIN=&W371..W371D3,                                            
//             INDUT=&W371..W371D3,                                             
//             DEST1=&R3130060,                                                 
//             DEST2=&CPRINT,                                                   
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3714O   EXEC PGM=V16459,PARM='W3714O/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//*                                                                             
//W3714OD1 DD  DSN=&INDIN..W3714N(+0),DISP=SHR                                  
//************ UDERLAG TILL BYTESUPPFÖLJNINGSLISTAN                             
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD PÅ DIST OCH BYTRAP                             
//             SPACE=(7,(50,10),RLSE),AVGREC=K                                  
//*                                                                             
//W3714OD2 DD  SYSOUT=(A,,F001),DEST=&DEST1,                                    
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 91                         
//             DCB=(RECFM=FBA,LRECL=132,BLKSIZE=132)                            
//*                                                                             
//W3714OD3 DD  DSN=&INDUT..W3714O(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ BYTESUPPFÖLJNING I STATUS 4 EXCELFORMAT  MAASTRICHT              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W3714OD4 DD  SYSOUT=(A,,STD),DEST=&DEST2,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 11                         
//             DCB=(RECFM=FBA,LRECL=132,BLKSIZE=132)                            
//*                                                                             
