//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      LISTAR GENOMSNITTS ARBETSDAGEN DET TAR FRÅN STAUS 3 TILL 4   *         
//*      ENDAST FÖR JAPAN OCH AUSTRALIEN                              *         
//*                                                                   *         
//*      PERIODICITET: DAG   RUTIN W371D4                             *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P254 PROC INDIN=&W371..W371D4,                                            
//             DEST7=&QJP20109,                                                 
//             DEST8=&QAU10012,                                                 
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD54),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W3714D(+0),DISP=SHR                                  
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W371SORT,DISP=(NEW,PASS,DELETE),                           
//************ SORTAT LAGERBAND FRÅN NDC:ERNA                                   
//         SPACE=(10,(100,50),RLSE),AVGREC=K                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W37154   EXEC PGM=W37154                                                      
//STEPLIB   DD DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//          DD DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT    DD SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT     DD DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN     DD DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT     DD SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//W37154D1  DD DSN=&&W371SORT,DISP=(OLD,DELETE,DELETE)                          
//***********                                                                   
//*                                                                             
//*                                                                             
//W37154D2 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 11                         
//*                                                                             
//W37154D3 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 21                         
//*                                                                             
//W37154D4 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 51                         
//*                                                                             
//W37154D5 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 41                         
//*                                                                             
//W37154D6 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 42                         
//*                                                                             
//W37154D7 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 43                         
//*                                                                             
//W37154D8 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 61                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37154D9 DD  SYSOUT=(A,,STD),DEST=&DEST8,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 62                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
