//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES OUTPUTFILE WITH SUMMARIZED RECORDS CONTAINING                      
//*  THE MOST RECENT RETURNS FOR EXCH-PARTS                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W371D2                                         
//*                                                                             
//*  RESTART:      W37188    NORMAL                                             
//*                READS     WDM6E                                              
//*                          WDM6                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P088 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37188   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37188,W37188,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDM6     INCLUDE MEMBER=WDM6                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//*                                                                             
//W37188D1 DD  DSN=&INDUT..W37188(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ SUMMERADE NYINKOMNA RETUR-TRANSAKTIONER                          
//             SPACE=(18,(10,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
