//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERING OCH BORTTAG AV DUBLETTER                                         
//*                                                                             
//*  FREKVENS:     VECKA     RTN W371V9                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P07A PROC INDIN=&W371..W371V9,                                            
//             INDUT=&W371..W371V9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD7A),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37178(+0),DISP=SHR                                  
//************ LADDDATA TILL BYLRAD                                             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W3717A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LADDATA UTAN DUBLETTER                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
