//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR BYTES UPPFÖLJNINGSLISTOR FÖR RAPPORTSTATUS 3                        
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W371D4                                         
//*                                                                             
//*  ÅTERSTART:    W37148    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W371P248 PROC INDIN=&W371..W371D4,                                            
//             DEST7=&QJP20109,                                                 
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37148   EXEC PGM=V16459,PARM='W37148/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//*                                                                             
//W37148D1 DD  DSN=&INDIN..W3714B(+0),DISP=SHR                                  
//************ BYTES RAPPORTER MED STATUS 3                                     
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ÅRSFIL SORTERAD PÅ ARTIKELNR                            
//             SPACE=(10,(50,10),RLSE),AVGREC=K                                 
//*                                                                             
//W37148D2 DD  DUMMY                                                            
//************ BYTES UP FÖLJNING FÖR STATUS 3 OCH DC 11                         
//*                                                                             
//W37148D3 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 21                         
//*                                                                             
//W37148D4 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 41                         
//*                                                                             
//W37148D5 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 51                         
//*                                                                             
//W37148D6 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 42                         
//*                                                                             
//W37148D7 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 43                         
//*                                                                             
//W37148D8 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 61                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37148D9 DD  DUMMY                                                            
//************ BYTES UPPFÖLJNING FÖR STATUS 3 OCH DC 62                         
//*                                                                             
//*                                                                             
