//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES OUTPUTFILE WITH DELETION RECORDS SELECTED DEPENDING ON             
//*  A GIVEN TIME-LIMIT                                                         
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W371V8                                         
//*                                                                             
//*  RESTART:      W37180    NORMAL                                             
//*                READS     WDGX3161/62                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P080 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371V8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37180   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37180,W37180,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR4     INCLUDE MEMBER=WDR4                                                  
//WDR1     INCLUDE MEMBER=WDR1                                                  
//*                                                                             
//W37180D1 DD  DSN=&INDUT..W37180(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ BORTTAGS-TRANSAKTIONER REMAN CONFIRMATION                        
//             SPACE=(27,(10,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W37180D2 DD  DSN=&INDUT..W37173(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//**************  DETALJRADER LARM -> MEMO                                      
//             SPACE=(80,(10,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W37180D3 DD  DSN=&INDUT..W37174(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//**************  HEADERPOSTER LARM -> MEMO                                     
//             SPACE=(80,(1,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
