//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STÄDAR BORT RADER I POÄNG-TABELLEN SOM FALLIT                              
//*  FÖR ÅLDERSSTRECKET                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W371V9                                          
//*                                                                             
//*  ÅTERSTART:    W37132   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P032 PROC STPLIB=&INDRTE..LOAD                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
