//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER INFIL W37112 OCH KOMPLETTERAR DEN MED INFO IFRÅN                     
//*  WDK6 ARTIKELBASEN                                                          
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W371XX                                         
//*                                                                             
//*  RESTART:      W37113      NORMAL                                           
//*                READS        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371V5,                                             
//             INDUT=&W371..W371V5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD12),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37112(+0),DISP=OLD                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W37113A,DISP=(NEW,PASS,DELETE),                            
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W37113   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37113,W37113,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W37113D1 DD  DSN=&&W37113A,DISP=(OLD,DELETE,DELETE),                          
//************ INFIL W37112 BYTESINFO WDM6                                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//W37113D2 DD  DSN=&&W37113T,DISP=(NEW,PASS,DELETE),                            
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD13),DISP=SHR                         
//SORTIN   DD  DSN=&&W37113T,DISP=(OLD,DELETE,DELETE)                           
//************ TEMPORÄRFILEN                                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W37113(+1),                                          
//************ SORTERAD BYTESFIL                                                
//             DISP=(NEW,CATLG,DELETE), -LIM(5)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
