//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SB, SKAPAR BYTESUPPFÖLJNING FÖR ALLA DC                                    
//*                                                                             
//*  FREKVENS:     DAG                 RTN W371D4                               
//*                                                                             
//*  ÅTERSTART:    W3714Q   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P04Q PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W3714Q   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W3714Q,W3714Q,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WDM6     INCLUDE MEMBER=WDM6                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W3714QD1 DD  DSN=&INDUT..W3714A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ BYTESRAPPORTER I STATUS 2 TILL VECKUPPFÖLJNING                   
//             SPACE=(22,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//W3714QD2 DD  DSN=&INDUT..W3714B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ BYTESRAPPORTER I STATUS 3 VISAR DISTRIKT OCH ANTAL               
//             SPACE=(11,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//W3714QD4 DD  DSN=&INDUT..W3714D(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ ANTAL ARBETSDAGAR DET TAR ATT GODKÄNNA BYTESRAPPORTER            
//             SPACE=(10,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//W3714QD5 DD  DSN=&INDUT..W3714E(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ LKLKLKLKLKL                                                      
//             SPACE=(11,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//W3714QD6 DD  DSN=&INDUT..W3714F(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ LKLKLKLKLKL                                                      
//             SPACE=(23,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//W3714QD7 DD  DSN=&INDUT..W3714G(+1),DISP=(NEW,CATLG,DELETE),  -LIM(7)         
//************ LKLKLKLKLKL                                                      
//             SPACE=(18,(10,5),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&NOBACKUP                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
