//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR HISTORIK-LISTA ÖVER BYTES-TRANSAKTIONER                             
//*                                                                             
//*  FREKVENS:     VECKA   RTN W371V7                                           
//*                                                                             
//*  ÅTERSTART:    W37182  NORMAL                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371V7,                                             
//             INDUT=&W371..W371V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD82),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37141(+0),DISP=SHR                                  
//************ FIL MED VECKANS TRANSAKTIONER                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W37141,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD TEMP-FIL                                                
//         SPACE=(159,(100,10),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37182   EXEC PGM=W37182                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W37182D1 DD  DSN=&&W37141,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD TEMP-FIL                                                
//*                                                                             
//W37182D2 DD  DSN=&INDUT..W37182(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ W37182-001  LISTA HISTORIK BYTES                                 
//         SPACE=(121,(100,10),RLSE),AVGREC=K                                   
