//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BATCH TO CREATE LOAD FILE FOR LEAKAGE/SURPLUS                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P099 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W371..W371V7,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W371..W371V7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W371PD99),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W37175(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W37175,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD TEMP-FIL                                                
//             SPACE=(117,(15,5),RLSE),AVGREC=K                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37199   EXEC PGM=W37199                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37199D1 DD  DSN=&&W37175,DISP=SHR                                            
//************ LOAD FILE FOR LEAKAGE/SURPLUS                                    
//*                                                                             
//W37199D2 DD  DSN=&INDUT..W37178(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ LOAD FILE FOR LEAKAGE/SURPLUS                                    
//             SPACE=(117,(15,5),RLSE),AVGREC=K,                                
//             MGMTCLAS=&NOBACKUP                                               
//W37199D3 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ BENÄMNINGAR PER ARTIKEL, SORT IDARTNR                            
//************ SORT; IDARTNR                                                    
//*                                                                             
