//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*                                                                             
//*  LÄSER KVITTNINGSBAS WDR2 TILL FIL                                          
//*                                                                             
//*  FREKVENS:     VECKA    RTN W371V1                                          
//*                                                                             
//*  ÅTERSTART:    W37134      NORMAL                                           
//*                LÄSER  WDR2 WDD3 WDK6                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37134   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37134,W37134,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W37134D1 DD  DSN=&INDUT..W37181(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ KVITTNINGSTABELL                                                 
//             MGMTCLAS=&BACKUPC,SPACE=(61,(1800,400),RLSE),AVGREC=U            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
