//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*                                                                             
//*  LÄSER GODKÄNDA RAPPORTER TILL UPPFÖLJNING I BYTES                          
//*  OCH VIPS SAMT SKAPAR FIL FÖR UPPDATERING AV STATUS PÅ WDM6.                
//*                                                                             
//*  FREKVENS:     DAG    RTN W371D1                                            
//*                                                                             
//*  ÅTERSTART:    W37122      NORMAL                                           
//*                LÄSER  WDM6                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W371..W371D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37122   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W37122,W37122,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VBS,LRECL=1400,BLKSIZE=1408,BUFNO=1)            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDM6     INCLUDE MEMBER=WDM6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W37122D1 DD  DSN=&INDUT..W37104(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ R56 TILL BYTES W371J023                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W37122D2 DD  DSN=&INDUT..W37119(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ VIPS                                                             
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W37122D3 DD  DSN=&INDUT..W37118(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ WDM6 ÄNDRA STATUS                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W37122D6 DD  DSN=&INDUT..W37132(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TRANSAR TILL INTRASTAT                                           
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W37122D7 DD  DSN=&INDUT..W37159(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UPPDATERINGSTRANSAKTIONER TILL WDM6                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
