//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  DELETE PRINTED REPORTS ON EVENT DATABASE.                                  
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY   RTN W371S2                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P055 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37155   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37155,W37155,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37155D1 DD  DDNAME=SYSIN                                                     
//************ USER/DC/DC-REC PARAMETERS FROM                                   
//************ CORE RECEIVING SCREEN (WEB)                                      
