//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDA WDM6                                                                 
//*                                                                             
//*  FREKVENS:     DAG    RTN W371D3                                            
//*                                                                             
//*  ÅTERSTART:    W37116    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W371P016 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W460..W371D1,                                             
//             INDIN2=&W371..W371D1,                                            
//             INDUT=&W371..W371D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37116   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W37116,W37116,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W37116D1 DD  DSN=&INDIN..W46091,DISP=SHR                                      
//************ TRANSAR TILL BYTES WDM6                                          
//         DD  DSN=&INDIN2..W3717H,DISP=SHR                                     
//************ TRANSAR TILL BYTES WDM6                                          
//*                                                                             
//W37116D2 DD  DSN=&INDUT..W371DUB(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FIL MED DUBLETTER (FELAKTIGAPOSTER FRÅN VIPS)                    
//      MGMTCLAS=&BACKUPC,SPACE=(46,(15,4),RLSE),AVGREC=K                       
//*                                                                             
//W37116D3 DD  DSN=&INDUT..W371FEL(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FIL MED DUBLETTER (FELAKTIGAPOSTER FRÅN VIPS)                    
//      MGMTCLAS=&BACKUPC,SPACE=(46,(15,4),RLSE),AVGREC=K                       
//*                                                                             
//W37116D4 DD  DSN=&INDUT..W371FE2(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FIL SAKNAR SJÄLVKOST                                             
//      MGMTCLAS=&BACKUPC,SPACE=(46,(15,4),RLSE),AVGREC=K                       
//*                                                                             
