//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR BYTES UPPFÖLJNINGSLISTOR FÖR RAPPORTSTATUS 3                        
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W371V2                                         
//*                                                                             
//*  ÅTERSTART:    W37253    NORMAL                                             
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W372P053 PROC INDIN=&W371..W371V2,                                            
//             DEST1=LOCAL,                                                     
//             DEST7=&QJP20109,                                                 
//             INDUT=&W371..W371V2,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W37253   EXEC PGM=V16459,PARM='W37253/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//*                                                                             
//W37253D1 DD  DSN=&INDIN..W3714C,DISP=SHR                                      
//************ BYTES RAPPORTER MED STATUS 4                                     
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ÅRSFIL SORTERAD PÅ ARTIKELNR                            
//             SPACE=(10,(50,10),RLSE),AVGREC=K                                 
//*                                                                             
//W37253D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 11                         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37253D3 DD  DSN=&INDUT..W37253(+1),DISP=(NEW,CATLG,DELETE), -LIM(7)          
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 91                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W37253D4 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH DC 61 JAPAN                   
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W37253D5 DD  DSN=&INDUT..W37253.WEBDC(+1),                   -LIM(7)          
//************ BYTES UPPFÖLJNING FÖR STATUS 4 OCH WEB DC                        
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
