//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ACKUMULERAR ANTAL PÅ ARTIKLAR OCH DC                                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W412D6                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W41240    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412D6,                                             
//             INDUT=&W412..W412D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD40),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W41239(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W41239,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD INFIL                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41240   EXEC PGM=V16459,PARM='W41240/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W41240D1 DD  DSN=&&W41239,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL                                                            
//*                                                                             
//W41240D2 DD  DSN=&INDUT..W41240(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
