//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SIGNALFIL(GSAM) I PROFORMA                                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D3                                            
//*                                                                             
//*  ÅTERSTART:    W41261    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W412..W412D3,                                             
//             INDUT=&W412..W412D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41261   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W41261,W41261,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41261D1 DD  DSN=&INDIN..W41261R(+0),DISP=SHR                                 
//************  INFIL VID ÅTERSTART                                             
//*                                                                             
//WDS1G    DD  DSN=&INDIN..W41261R(+1),DISP=(NEW,CATLG,CATLG),  -LIM(3)         
//             MGMTCLAS=NOBACKUP,                                               
//             SPACE=(27998,(700,700),RLSE),AVGREC=U                            
//************  GSAM RESTART-FIL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*            -- NEDANSTÅENDE STEG GÅR EJ VID ABEND, OCH DÄRMED                
//*            -- SKAPAS INTE NÅGON FIL TILL VECKORUTINEN DÅ.                   
//*                                                                             
//GENER    EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W41261R(+1),DISP=SHR                                 
//************  GSAM RESTART-FIL                                                
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W41261(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************  UTFIL TILL VECKORUTIN PGM W41262 (E+)                           
//             SPACE=(27998,(100,133),RLSE),AVGREC=U,                           
//             MGMTCLAS=&NOBACKUP                                               
