//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTNING AV S-RANSAR I DISPATCHEN                                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D5                                            
//*                                                                             
//*  ÅTERSTART:    W41263      NORMAL                                           
//*                LÄSER  WDP8                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W412..W412D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41263   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41263,W41263,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDP8     INCLUDE MEMBER=WDP8                                                  
//W41263D1 DD  DSN=&INDUT..W41265(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ S-TRANSAR KVAR I DISPATCH (TILL MAIL)                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W41263D2 DD  DSN=&INDUT..W41263(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TACDIS DLET TILL HENRIK D                                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
