//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONSOLIDERING PIE SW-ORDER OCH UTTAG PULS-ORDERNR                          
//*                                                                             
//*  FREKVENS:     DAG     RTN W412D4                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W41203      NORMAL                                           
//*                LÄSER        WDQ2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P003 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412D4,                                             
//             INDIN2=&W463..W412D4,                                            
//             INDUT=&W412..W412D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD05),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W46333,DISP=SHR                                     
//************ PIE SW-ORDER OCH AUTOMATPACKNING                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W46333,DISP=(NEW,PASS,DELETE),                             
//************ PIE SW-ORDER OCH AUT.PACK SORTERAD DISTRIKT KUND                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41203   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41203,W41203,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W41203D1 DD  DSN=&INDIN..W41206(+0),DISP=SHR                                  
//************ ORDERNR-SERIE PIE SW-ORDER                                       
//*                                                                             
//W41203D2 DD  DSN=&INDUT..W41206(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ ORDERNR-SERIE PIE SW-ORDER                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W41203D3 DD  DSN=&&W46333,DISP=(OLD,DELETE,DELETE)                            
//************ PIE SW-ORDER OCH AUT.PACK SORTERAD DISTRIKT KUND                 
//*                                                                             
//W41203D4 DD  DSN=&INDUT..W41227(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ KONSOLIDERADE PIE SW-ORDER                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
