//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  UTSKRIFT ORDERBEKRÄFTELSER                                                 
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D3                                            
//*                                                                             
//*  ÅTERSTART:    W4123500                                                     
//*                LÄSER  WDD3 WDE8 WDR1 WDJ1 WDQ2                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P035 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412D3,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41235   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41235,W41235,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDE8     INCLUDE MEMBER=WDE8                                                  
//WDR1     INCLUDE MEMBER=WDR1                                                  
//WDJ1     INCLUDE MEMBER=WDJ1                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//W41235D1 DD  DSN=&INDIN..W41234(+0),DISP=SHR                                  
//************ INFIL WDQ1-POSTER                                                
//*                                                                             
//A4PS OUTPUT FORMDEF=079AVD,PAGEDEF=079AVD                                     
//*                                                                             
//W41235D2 DD  SYSOUT=(A,,3827),DEST=&DEST1,OUTPUT=(*.A4PS)                     
//************ W41235-001 LISTA ORDERBEKRÄFTELSER EUROPA                        
//*                                                                             
//W41235D3 DD  SYSOUT=(A,,3827),DEST=&DEST1,OUTPUT=(*.A4PS)                     
//************ W41235-002 LISTA ORDERBEKRÄFTELSER NORDEN                        
//*                                                                             
//W41235D4 DD  SYSOUT=(A,,3827),DEST=&DEST1,OUTPUT=(*.A4PS)                     
//************ W41235-003 LISTA ORDERBEKRÄFTELSER OVERSEAS                      
//*                                                                             
//W41235D5 DD  DUMMY                                                            
//*41235D5 DD  SYSOUT=(A,,3827),DEST=&DEST1,OUTPUT=(*.A4PS)                     
//************ W41235-004 LISTA ORDERBEKRÄFTELSER EUROPA 2                      
//*                                                                             
