//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ORDERTRATTEN - INTERNA TPO1 ORDER FRÅN LV-PARTS                            
//*  RECFM ÄNDRAS TILL VB                                                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D1                                            
//*                                                                             
//*  ÅTERSTART:             NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P004 PROC INDIN=&W412..W412D1,INDUT=&W412..W412D1                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41204   EXEC PGM=V16459,PARM='V164D0/3/'                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY,DCB=BLKSIZE=100                                            
//IN       DD  DSN=&INDIN..R23436,DISP=SHR                                      
//*                                                                             
//UT       DD  DSN=&INDUT..W41204(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RECFM FB ÄNDRAD TILL VB                                          
//             DCB=(RECFM=VB,LRECL=84,BLKSIZE=27998),                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(500,500),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
