//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  SKRIVER UT SIGNALFIL I PROFORMA                                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN W412V1                                          
//*                                                                             
//*  ÅTERSTART:    W41262    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412V1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41262   EXEC PGM=W41262                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W41262D1 DD  DSN=&INDIN..W41261(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W41262D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W41262-001  LISTA                                                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
