//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RELEASE BO TO ORDER                                                        
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W412S5                           
//*                                                                             
//*  RESTART:      W41223    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412S5,                                             
//             INDUT=&W412..W412S5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41223   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W41223,W41223,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41223D1 DD  DSN=&INDIN..W41224(+0),DISP=SHR                                  
//************ BO TO BE RELEASED                                                
//W41223D2 DD  DSN=&INDUT..W4122B(+1),DISP=(NEW,CATLG,DELETE),                  
//************ RELEASED REP ORDERS USED IN W412D5                               
//             DATACLAS=PSEN                                                    
