//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER LISTA 'DIRLEV.RADER I STATUS U, ÄLDRE ÄN 1 VECKA'                  
//*                                                                             
//*  FREKVENS:     VECKA  RUTIN W412V2                                          
//*                                                                             
//*  ÅTERSTART:    W41271    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412V2,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41271   EXEC PGM=V16459,PARM='W41271/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W41271D1 DD  DSN=&INDIN..W41270(+0),DISP=SHR                                  
//************ DIREKT.LEV RADER I STATUS U, ÄLDRE ÄN 1 VECKA                    
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W41271D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W41271  LISTA 'DIRLEV.RADER MED STATUS U'                        
//************ SORTERAT PÅ LEVERANTÖRSNUMMER                                    
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
