//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  RECFM ÄNDRAS TILL VB                                                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D1                                            
//*                                                                             
//*  ÅTERSTART:             NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P005 PROC INDIN=&WIN..W412D1,INDUT=&W412..W412D1                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41205   EXEC PGM=V16459,PARM='V164D0/3/'                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY,DCB=BLKSIZE=100                                            
//IN       DD  DSN=&INDIN..D88625,DISP=SHR                                      
//************ VR-ORDER FRÅN VD                                                 
//*                                                                             
//UT       DD  DSN=&INDUT..W41205(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RECFM FB ÄNDRAD TILL VB                                          
//             DCB=(RECFM=VB,LRECL=84,BLKSIZE=6233),                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(500,500),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
