//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISPATCH ORDER TRANSACTIONS                                                
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W412S2                           
//*                                                                             
//*  RESTART:      W41284    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P084 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412S2,                                             
//             INDUT=&W412..W412S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41284   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W41284,W41284,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W41284D0 DD  DUMMY                                                            
//************ DATE AND TIME INFO FROM WEB                                      
//*                                                                             
//W41284D1 DD  DSN=&INDIN..W41283(+0),DISP=SHR                                  
//************ ORDER LINES                                                      
//*                                                                             
//W41284D2 DD  DSN=&INDIN..W4128A(+0),DISP=SHR                                  
//************ RESTART FILE (GSAM FILE FROM PREVIOUS JOB)                       
//*                                                                             
//WDS1G    DD  DSN=&INDUT..W4128A(+1),DISP=(NEW,CATLG,CATLG), -LIM(1)           
//************ ACCEPTANCE MAIL (GSAM FILE)                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
