//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPFÖLJNING VOR                                                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN W412V3                                          
//*                                                                             
//*  ÅTERSTART:    W41215    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P015 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412V3,                                             
//             INDIN2=&W011,                                                    
//             INDUT=&W412..W412V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD15),DISP=SHR                         
//************ SORTERAR, SUMMERAR, SELECTERAR OCH RÄKNAR RADER                  
//*                                                                             
//SORTIN   DD  DSN=&INDIN..W41211(+0),DISP=SHR                                  
//************ Q4-KLASS 0:OR                                                    
//         DD  DSN=&INDIN..W41212(+0),DISP=SHR                                  
//************ E4-KLASS0:OR                                                     
//         DD  DSN=&INDIN..W41213(+0),DISP=SHR                                  
//************ VORKÖ                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W412VOR,DISP=(NEW,PASS,DELETE),                            
//************ STRIPPAD OCH SORTAD Q4+E4+VORKÖ(EJLÖSTA)                         
//             SPACE=(19,(5,1),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD16),DISP=SHR                         
//************ SORTERAR, SUMMERAR OCH RÄKNAR RADER                              
//*                                                                             
//SORTIN   DD  DSN=&INDIN..W41213(+0),DISP=SHR                                  
//************ VORKÖ                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W41213,DISP=(NEW,PASS,DELETE),                             
//************ SORTAD VORKÖ-FIL(HELA)                                           
//             SPACE=(19,(3,1),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W41215   EXEC PGM=V16459,PARM='W41215/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W41215D1 DD  DSN=&&W412VOR,DISP=SHR                                           
//************ Q4+E4+VOR(VECKANS ALLA KL=0) FRÅN SORT01                         
//*                                                                             
//W41215D2 DD  DSN=&&W41213,DISP=SHR                                            
//************ VOR-KÖ FRÅN SORT02                                               
//*                                                                             
//W41215D3 DD  DSN=&INDIN2..W01172(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//SORTFIL  DD  DSN=&&SORTFIL,DISP=(NEW,PASS,DELETE),                            
//************ MELLANLAGRINGSFIL                                                
//             SPACE=(19,(5,1)),AVGREC=K                                        
//*                                                                             
//TEMP01   DD  DSN=&&TEMP01,DISP=(NEW,PASS,DELETE),                             
//************ MELLANLAGRINGSFIL                                                
//             SPACE=(17,(5,1)),AVGREC=K                                        
//*                                                                             
//TEMP02   DD  DSN=&&TEMP02,DISP=(NEW,PASS,DELETE),                             
//************ MELLANLAGRINGSFIL                                                
//             SPACE=(12,(5,1)),AVGREC=K                                        
//*                                                                             
//TEMP03   DD  DSN=&&TEMP03,DISP=(NEW,PASS,DELETE),                             
//************ MELLANLAGRINGSFIL                                                
//             SPACE=(12,(5,1)),AVGREC=K                                        
//*                                                                             
//MATCH01  DD  DSN=&&MATCH01,DISP=(NEW,PASS,DELETE),                            
//************ MELLANLAGRINGSFIL                                                
//             SPACE=(17,(5,1)),AVGREC=K                                        
//*                                                                             
//W41215D4 DD  DSN=&INDUT..W41215(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ VOR RAD+VÄRDE INFO                                               
//             SPACE=(40,(5,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
