//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SAMLAR ALLA ORDERFILER TILL EN FIL (BÖRJAR MED 1)                          
//*                                                                             
//*  FREKVENS:     DAG         RTN W412S2                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P106 PROC INDIN=&W412..W412S2,                                            
//             INDUT=&W412..IN                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W41220(+0),DISP=SHR                                  
//************ TACDISFIL                                                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W41210(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ORDERFIL TILL W412S1                                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
