//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  JUSTERAR VOR-REG TILL VIOS                                                 
//*                                                                             
//*  FREKVENS:     DAG    RTN W412V3                                            
//*                                                                             
//*  ÅTERSTART:    W41216    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P016 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412V3,                                             
//             INDREG=&WXTR                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41216   EXEC PGM=W41216                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41216D1 DD  DSN=&INDIN..W41216(+0),DISP=SHR                                  
//************ VOR-LEDTIDER                                                     
//*                                                                             
//W41216D2 DD  DSN=&INDIN..W41215(+0),DISP=SHR                                  
//************ VOR-RADER+VÄRDE                                                  
//*                                                                             
//W41216D3 DD  DSN=&INDREG..WXTRD1(+0),DISP=SHR                                 
//************ VOR-LEDTIDER                                                     
//*                                                                             
//W41216D4 DD  DSN=&INDREG..WXTRD2(+0),DISP=SHR                                 
//************ VOR-RADER+VÄRDE                                                  
//*                                                                             
//W41216D5 DD  DSN=&INDREG..WXTRD1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             SPACE=(34,(2,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W41216D6 DD  DSN=&INDREG..WXTRD2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             SPACE=(40,(2,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
