//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLERAR OM DISTR SKALL HA TRANSAKTIONER ELLER EJ                      
//*                                                                             
//*  FREKVENS:     DAG    RTN W412D9                                            
//*                                                                             
//*  ÅTERSTART:    W4129000                                                     
//*                LÄSER  WDB2                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412D9,                                             
//             INDUT=&W412..W412D9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4129000 EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41290,W41290,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//W41290D1 DD  DSN=&INDIN..W41229(+0),DISP=SHR                                  
//************ VIPS TRANSAR BL A                                                
//*                                                                             
//W41290D2 DD  DSN=&INDUT..W41290SE(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT SVERIGE SVENSKA BIL                                
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D3 DD  DSN=&INDUT..W41290NO(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT NORGE                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D4 DD  DSN=&INDUT..W41290DK(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT DANMARK                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D5 DD  DSN=&INDUT..W41290FI(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT FINLAND                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D6 DD  DSN=&INDUT..W41290BE(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT BELGIEN                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D7 DD  DSN=&INDUT..W41290GB(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT ENGLAND                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D8 DD  DSN=&INDUT..W41290FR(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT FRANKRIKE                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290D9 DD  DSN=&INDUT..W41290NL(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT HOLLAND 1678                                       
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DA DD  DSN=&INDUT..W41290IE(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT IRLAND                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DB DD  DSN=&INDUT..W41290IT(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT ITALIEN                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DC DD  DSN=&INDUT..W41290PT(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT PORTUGAL                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DD DD  DSN=&INDUT..W41290PX(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT PORTUGAL2                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DE DD  DSN=&INDUT..W41290CH(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT SCHWEIZ                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DF DD  DSN=&INDUT..W41290ES(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT SPANIEN                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DG DD  DSN=&INDUT..W41290DE(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT TYSKLAND                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DH DD  DSN=&INDUT..W41290AT(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT ÖSTERRIKE                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DI DD  DSN=&INDUT..W41290PL(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT POLEN                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DJ DD  DSN=&INDUT..W41290SA(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT SAUDI 4850                                         
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DK DD  DSN=&INDUT..W41290MY(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT MALAYSIA                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DL DD  DSN=&INDUT..W41290TR(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT TURKIET                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DM DD  DSN=&INDUT..W41290KR(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT KOREA SYD-                                         
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DN DD  DSN=&INDUT..W41290TX(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT TAIWAN                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DO DD  DSN=&INDUT..W41290TW(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT TAIWAN2                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DP DD  DSN=&INDUT..W41290MX(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT MEXICO                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DQ DD  DSN=&INDUT..W41290BR(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT BRASILIEN                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DR DD  DSN=&INDUT..W41290CA(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT CANADA                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DS DD  DSN=&INDUT..W41290JP(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT JAPAN                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DT DD  DSN=&INDUT..W41290HU(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT UNGERN                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DU DD  DSN=&INDUT..W41290C1(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT KINA C1                                            
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DV DD  DSN=&INDUT..W41290PE(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT PERU                                               
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DW DD  DSN=&INDUT..W41290RU(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT RYSSLAND                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DX DD  DSN=&INDUT..W41290ZA(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT SYDAFRIKA                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DY DD  DSN=&INDUT..W41290US(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT USA                                                
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290DZ DD  DSN=&INDUT..W41290CZ(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT TJECKIEN                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290E1 DD  DSN=&INDUT..W41290IN(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT INDIEN                                             
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290E2 DD  DSN=&INDUT..W41290TH(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT THAILAND                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//W41290E3 DD  DSN=&INDUT..W41290AU(+1),                        -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ VIPS DISTRIKT AUSTRALIA                                          
//             MGMTCLAS=&DEL2BKPC,SPACE=(23476,(2000,250),RLSE)                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
