//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO RELEASE REP.ORDERS FROM WDA5 EVERY XXMINS                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W412S5                                         
//*                                                                             
//*  RESTART:      W41222    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W412..W412S5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41222   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41222,W41222,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDR5     INCLUDE MEMBER=WDR5                                                  
//WDR1     INCLUDE MEMBER=WDR1                                                  
//WDB5     INCLUDE MEMBER=WDB5                                                  
//WDB3     INCLUDE MEMBER=WDB3                                                  
//W41222D1 DD  DSN=&INDUT..W41224(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ RELEASED REP ORDERS FROM BACKORDER(WDA5)                         
//             DATACLAS=PSEN                                                    
