//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO RELEASE VOR ORDERS FROM 4225 EVERY 10MINS                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W412S4                                         
//*                                                                             
//*  RESTART:      W41218    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P018 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W412..W412S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41218   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W41218,W41218,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.CEE.DEBUG,DISP=SHR                                      
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W41218D1 DD  DSN=&INDUT..W41218(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RELEASED VOR ORDERS FROM VOR QUEUE(WDA6)                         
//             DATACLAS=PSEB                                                    
