//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UTFIL FÖR VECKANS REGISTRERADE ORDER                                
//*                                                                             
//*  FREKVENS:     DAG    RTN W412V2                                            
//*                                                                             
//*  ÅTERSTART:    W41245                                                       
//*                LÄSER  WDQ2 MED SB                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W412..W412V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41245   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41245,W41245,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR                                
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//W41245D1 DD  DSN=&&W41245,DISP=(NEW,PASS,DELETE),                             
//************ VECKANS ORDER                                                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41245S  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD45),DISP=SHR                         
//SORTIN   DD  DSN=&&W41245,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W41245(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ GODKÄNDA ORDER - SORTERADE                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
