//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDQ4 FÖR LDC ORDRAR MED RFS OM X DAGAR                               
//*                                                                             
//*  FREKVENS:     DAG     RTN W412D6                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W41239      NORMAL                                           
//*                LÄSER        WDQ4                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W412P039 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W412..W412D6,                                             
//             INDUT=&W412..W412D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W412PD39),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W41238(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W41238,DISP=(NEW,PASS,DELETE),                             
//************ UTFIL                                                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41239   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41239,W41239,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//*                                                                             
//W41239D1 DD  DSN=&&W41238,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL                                                            
//*                                                                             
//W41239D2 DD  DSN=&INDUT..W41239(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
