//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GERAPPORTEERDE ORDERLIJNEN VAN GISTEREN WDE4                               
//*  GERAPPORTEERDE ORDERLIJNEN VAN GISTEREN WDD3                               
//*  NUL GERAPPORTEERDE LIJNEN VAN GISTEREN  WDQ3                               
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W413D2                                          
//*                                                                             
//*  RESTART:      W41338    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W413P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479D1,                                             
//             INDIN2=&W413,                                                    
//             DEST1=&QSE09012,                                                 
//             DEST2=&QSE09012                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41338   EXEC PGM=V16459,PARM='W41338/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJO00174,HOLD=YES                          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(9990,(900,300))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                                   
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//W41338D1 DD  DSN=&INDIN..W47922(+0),DISP=SHR                                  
//************ ORDERLINES/ WDE4     FILE                                        
//*                                                                             
//W41338D2 DD  DSN=&INDIN2..W41302(+0),DISP=SHR                                 
//************ ORDERPARTS FILE WDQ3                                             
//*                                                                             
//W41338D3 DD  SYSOUT=(A,,STD),DEST=&DEST1,                                     
//************ W41338-001  002 003                                              
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//W41338D4 DD  SYSOUT=(A,,STD),DEST=&DEST2,                                     
//************ W41338-005                                                       
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//W47922S1 DD  SPACE=(23436,(2900,1000))                                        
//W41302S2 DD  SPACE=(23427,(2900,1000))                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
