//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EN SEKVENSIELL KOPIA AV PRCTABELLEN                                 
//*                                                                             
//*  FREKVENS:     DAG      RTN W413D1                                          
//*                                                                             
//*  ÅTERSTART:    W41301   NORMAL                                              
//*                                                                             
//*                         LÄSER WDR1                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W413P001 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W413                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41301   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41301,W41301,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJO00174,HOLD=YES        -- ABEND          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR1     INCLUDE MEMBER=WDR1                                                  
//W41301D1 DD  DSN=&INDREG..W41301(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ SEKVENSIELL KOPIA AV PRC-REGISTRET                               
//             MGMTCLAS=&BACKUPC,SPACE=(6191,(40,6),RLSE)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
