//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR PRCREG-FILEN OCH ORDERDELS-FILEN OCH SKAPAR W41303                 
//*                                                                             
//*  FREKVENS:     DAILY    RTN W413D1 OCH W413D2                               
//*                                                                             
//*  ÅTERSTART:    W41303   NORMAL                                              
//*                                                                             
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W413P003 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W413,                                                    
//             INDUT=&W413..W413D1,                                             
//             INDUT2=&WXTR..W413D1,                                            
//             INDUT3=&W413..W413D1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41303   EXEC PGM=V16459,PARM='W41303/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJO00174,HOLD=YES                          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(900,300),RLSE)                                      
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W41303D1 DD  DSN=&INDREG..W41301(+0),DISP=SHR                                 
//************ PRCTABELLER                                                      
//*                                                                             
//W41303D2 DD  DSN=&INDREG..W41302(+0),DISP=SHR                                 
//************ ORDERDELAR                                                       
//*                                                                             
//SORTF1   DD  DATACLAS=PSEN                                                    
//*                                                                             
//SORTF2   DD  DATACLAS=PSEN                                                    
//*                                                                             
//W41303D3 DD  DSN=&INDUT..W41303(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ MATCHAD UTFIL                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W41303D4 DD  DSN=&INDUT2..W41304(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ MATCHAD UTFIL                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W41303D5 DD  DSN=&INDUT3..W41314(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ FIL TILL W413D4                                                  
//************ SKAPAS AV W413J003 (MORGON) OCH W413J203 (KVÄLL)                 
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
