//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROC TO CREATE REPORTS FOR SERVICE DC21 BUMPERS                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W414D3                                         
//*                                                                             
//*  RESTART:      W41408    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W414P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W414..W414D3,                                             
//             INDUT=&W414..W414D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT10   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W414PD08),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W41412,DISP=SHR                                      
//SORTOUT  DD  DSN=&&W41408,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41408   EXEC PGM=W41408                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41408D1 DD  DSN=&&W41408,DISP=(OLD,PASS,DELETE)                              
//************ INPUT FROM W41401                                                
//*                                                                             
//W41408D2 DD  DSN=&INDUT..W41413(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SUMMARY REPORT                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W41408D3 DD  DSN=&INDUT..W41414(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DETAILED REPORT                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W41408D4 DD  DSN=&INDUT..W41415(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ SAVE DAILY RECORDS FOR WEEKLY REPORT                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
