//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT SPX ORDERS                                                         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W414D1                                         
//*                                                                             
//*  RESTART:      W41406    NORMAL                                             
//*                SORT      NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W414P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W414..W414D1,                                             
//             INDUT=&W414..W414D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41406   EXEC PGM=V16459,PARM='W41406/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W41406D1 DD  DSN=&INDIN..W41401(+0),DISP=SHR                                  
//************ ORDER HEADS                                                      
//*                                                                             
//W41406D2 DD  DSN=&INDIN..W414X2(+0),DISP=SHR,                                 
//             LRECL=200   - LONG ENOUGH TO HANDLE BOTH FILES                   
//************ SPX ORDER LINES                                                  
//         DD  DSN=&INDIN..W414X3(+0),DISP=SHR                                  
//************ SPX ORDER CONFIRMATIONS                                          
//*                                                                             
//W41406D3 DD  DSN=&&W41401,DISP=(NEW,PASS,DELETE),                             
//************ SORTED ORDER HEADS                                               
//             DATACLAS=PSEN                                                    
//*                                                                             
//W41406D4 DD  DSN=&&W414X2,DISP=(NEW,PASS,DELETE),                             
//************ SORTED ORDER LINES/CONFIRMATIONS                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//W41406D5 DD  DSN=&&W414X1,DISP=(NEW,PASS,DELETE),                             
//************ SPX ORDER HEADS                                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W414PD06),DISP=SHR                         
//SORTIN   DD  DSN=&&W414X1,DISP=(OLD,DELETE,DELETE)                            
//************ SPX ORDER HEADS                                                  
//         DD  DSN=&INDIN..W414X2(+0),DISP=SHR                                  
//************ SPX ORDER LINES                                                  
//         DD  DSN=&INDIN..W414X3(+0),DISP=SHR                                  
//************ SPX ORDER CONFIRMATIONS                                          
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W414X6(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ MERGED AND SORTED SPX TRANSACTIONS                               
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
