//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GENERATE ON-ORDER REPORT TO SPX                                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W414D2                                         
//*                                                                             
//*  RESTART:      W41407    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W414P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W414..W414D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41407   EXEC PGM=W41407                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W41407D1 DD  DSN=&INDIN..W414X6,DISP=SHR                                      
//************ ON-ORDER TRANSACTIONS FOR SPX                                    
//*                                                                             
//W41407D2 DD  DSN=&&W414X7,DISP=(NEW,PASS,DELETE),                             
//************ SPX REPORT (SENT VIA D&P)                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
