//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISTRIBUTES FILES WITH HANDLING FEE DATA TO VIPS VIA                       
//*  MQ FLOW                                                                    
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W418S3                           
//*                                                                             
//*  RESTART:      W4183F      NORMAL                                           
//*                READS        WDB2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P03F PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418S3,                                             
//             INDUT=&W418..W418S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4183F   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W4183F,W4183F,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//W4183FD1 DD  DSN=&INDIN..W418C3(+0),DISP=SHR                                  
//************ FEEDBACK DATA FILE                                               
//*                                                                             
//W4183FD2 DD  DSN=&INDUT..W4183F(+1),DISP=(NEW,CATLG,CATLG), -LIM(9)           
//************ TEXT INFO FOR THE MQ FLOW                                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
