//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FILE TO AZURE DATALAKE IN DISPLAY FORMAT                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W418D6                                         
//*                                                                             
//*  RESTART:      W41847    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P047 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41847   EXEC PGM=W41847                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41847D1 DD  DSN=&INDIN..W41842X2(+0),DISP=SHR                                
//************ INPUT FILE FROM W41846                                           
//*                                                                             
//W41847D2 DD  DSN=&&W41842,DISP=(NEW,PASS,DELETE),                             
//************ WDA2 INFO TO AZURE DATALAKE                                      
//             DATACLAS=PSEB                                                    
//*                                                                             
//*TO SPLIT THE FILE BASED ON DISCREPANCY STATUS                                
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&W41842,DISP=(OLD,DELETE,DELETE)                            
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W418PD47),DISP=SHR                         
//************ ARTIKLAR MED SÄSONGSVARIATION                                    
//*                                                                             
//SORTOF01 DD  DSN=&&W41842X,DISP=(NEW,PASS,DELETE),                            
//************ WDA2 INFO TO AZURE DATALAKE WITH DISCREPANCY STATUS = 8          
//             DATACLAS=PSEB                                                    
//SORTOF02 DD  DSN=&&W41842Y,DISP=(NEW,PASS,DELETE),                            
//************ WDA2 INFO TO AZURE DATALAKE WITH DISCREPANCY STATUS <> 8         
//             DATACLAS=PSEB                                                    
