//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LEVERANSANM - RETURTILLSTÅND, VARNINGSLISTA                                
//*                                                                             
//*  FREKVENS:     DAG  RTN W418D2                                              
//*                                                                             
//*  ÅTERSTART:    W41837   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W418P037 PROC INDIN=&W418..W418D2,                                            
//             STPLIB=&INDRTE..LOAD,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41837   EXEC PGM=V16459,PARM='W41837/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W41837D1 DD  DSN=&INDIN..W41871(+0),DISP=SHR                                  
//************ RETURTILLSTÅNDSDATA                                              
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W41837D2 DD  SYSOUT=(E,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ LISTA W41837-001 VARNINGSLISTA, RETURTILLSTÅND                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
