//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR WDA2 MED STATUS 9 OCH EV. RETURUPPGIFTER                        
//*  SKICKAR TRANSAR TILL BILLIT VIA WZ01-MODULEN.                              
//*                                                                             
//*  FREKVENS:     DAG     RTN W418D2                                           
//*                                                                             
//*  ÅTERSTART:    W41831    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P031 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W418..W418D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W418PD31),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W418AI(+0),DISP=SHR                                  
//************ INFIL FRÅN W4183000                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W418AI,DISP=(NEW,PASS,DELETE),                             
//************ SORTAD FIL  ( IDLEVANM,IDPTYP,IDDC )                             
//         SPACE=(127,(5,2),RLSE),AVGREC=K                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41831   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W41831,W41831,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41831D1 DD  DSN=&&W418AI,DISP=(OLD,DELETE,DELETE)                            
//************ KREDITPOSTER FRÅN W41830 SOM SKALL KRED I BILLIT.                
//*                                                                             
