//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AZURE DATALAKE                                                             
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W418D6                                         
//*                                                                             
//*  RESTART:      W41848    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P048 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418D2,                                             
//             INDUT=&W418..W418D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41848   EXEC PGM=W41848                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41848D1 DD  DSN=&INDIN..W41842(+0),DISP=SHR                                  
//************ WDA2 INFO                                                        
//*                                                                             
//W41848D2 DD  DSN=&&W41842X1,DISP=(NEW,PASS,DELETE),                           
//************ AZURE DATALAKE                                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W418PD42),DISP=SHR                         
//SORTIN   DD  DSN=&&W41842X1,DISP=(OLD,DELETE,DELETE)                          
//************ ARTIKLAR MED SÄSONGSVARIATION                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W41842X1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)        
//************ AZURE DATALAKE                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
