//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA AVVIKELSE REFILL INLEVERANS                                   
//*                                                                             
//*  FREKVENS:     DAG       RTN W418D5                                         
//*                                                                             
//*  ÅTERSTART:    W41841    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W612..W418D5,                                             
//             INDIN2=&W414..W418D5                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61271(0),DISP=SHR                                   
//         DD  DSN=&INDIN2..W41411,DISP=SHR                                     
//         DD  DSN=&INDIN..W61228,DISP=SHR                                      
//************ LISTFIL                                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W41411,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD W61271 OCH W41411 OCH W61228                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41841   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W41841,W41841,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41841D1 DD  DSN=&&W41411,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD W41411                                                  
//*                                                                             
