//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NER WDA2 (LEVERANSANMÄRKNINGSREGISTRET)                              
//*  PÅ FIL MED SB                                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W418D2                                            
//*                                                                             
//*  ÅTERSTART:    W41842   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W418..W418D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41842   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W41842,W41842,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                     -- ABEND           
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                     -- ABEND           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDA2     INCLUDE MEMBER=WDA2                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W41842D1 DD  DSN=&INDUT..W41842(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ WDA201 WDA211 WDA221                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//W41842D2 DD  DSN=&INDUT..W41844(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ WDA201 WDA211                                                    
//************ FILEN TAS IN I RUTIN W418D6,JOB W418P044                         
//************ ENDAST GEN (+0) ANVÄNDS I W418D6                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
