//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR PÅ IDLEVANM MHA W015RAND                                          
//*                                                                             
//*  FREKVENS:     MÅNAD       RTN W418M1                                       
//*                                                                             
//*  ÅTERSTART:    W41882    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418M1,                                             
//             INDUT=&W418..W418M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41882   EXEC PGM=W41882                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41882D1 DD  DSN=&INDIN..W41880(+0),DISP=SHR                                  
//************ FIL MED RENSNINGS NYCKLAR                                        
//*                                                                             
//W41882D2 DD  DSN=&INDUT..W41882(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RANDOM SORTERAD FIL MED RENSNINGSNYCKLAR                         
//             SPACE=(18,(50,33),RLSE),AVGREC=K,                                
//             MGMTCLAS=&NOBACKUP                                               
