//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INFO TO AZURE DATALAKE                                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W418D6                                         
//*                                                                             
//*  RESTART:      W41846    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P046 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418D6,                                             
//             INDUT=&W418..W418D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41846   EXEC PGM=V16459,PARM='W41846/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W41846D1 DD  DSN=&INDIN..W41842X1(+0),DISP=SHR                                
//************ WDA2 INFO                                                        
//*                                                                             
//W41846D2 DD  DSN=&INDIN..W41842X1(-1),DISP=SHR                                
//************ WDA2 INFO                                                        
//*                                                                             
//W41846D3 DD  DSN=&INDUT..W41842X2(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//************ WDA2 INFO TO AZURE DATALAKE                                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
