//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TAR IN EN FIL INFRÅN UNIX, MATCHAR EMOT FIL MED                            
//*  GODKÄNDA BUY BACK OCH SKAPAR EN UT FIL                                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W418B2                                     
//*                                                                             
//*  ÅTERSTART:    W41828    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418B2,                                             
//             INDIN2=&W116,                                                    
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDUT=&W418..W418B2.FEL,                                         
//             INDUT2=&W418..W418B2                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41828   EXEC PGM=V16459,PARM='W41828/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//SYSINPUT DD  DUMMY                                                            
//************ SOP PARAMETRAR IRFÅN WEBBEN   SOP-VALUES I JCL                   
//*                                                                             
//W41828D2 DD  DSN=&INDIN..CSV.W41828(+1),DISP=SHR                              
//************ UNIXFIL                                                          
//*                                                                             
//TEMP01   DD  DSN=&&TEMP01,DISP=(NEW,PASS,DELETE),                             
//************ SORTAT UNIXFIL                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//W41828D3 DD  DSN=&INDUT..W41828(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ FELPOSTER                                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//W41828D4 DD  DSN=&INDIN2..W11604(+0),DISP=SHR                                 
//************ IN FIL MED ARTIKLAR                                              
//*                                                                             
//TEMP02   DD  DSN=&&TEMP01,DISP=(NEW,PASS,DELETE),                             
//************ SORTAT UNIXFIL                                                   
//             DATACLAS=PSEN                                                    
//W41828D5 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//W41828D6 DD  DSN=&INDUT2..W41828(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ GODKÄNDA POSTER TILL NÄSTA JOBB                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
