//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DAILY REPORT RECEIVED LINES                                                
//*                                                                             
//*  FREKVENS:     DAG,VECKA RTN W418D6                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W41844    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W418P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W418..W418D2,                                             
//             INDUT=&W418..W418D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W418PD44),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W41844(+0),DISP=SHR                                  
//************ LEVERANSAMÄRKNING                                                
//*                                                                             
//SORTOUT  DD  DSN=&&W41844,DISP=(NEW,PASS,DELETE),                             
//************ LEVERANSANMÄRKNING SORTERAD  PÅ IDLEVANM IDPTYP                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W41844   EXEC PGM=W41844                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W41844D1 DD  DSN=&&W41844,DISP=(OLD,DELETE,DELETE)                            
//************ LEVERANSANMÄRKNING SORTERAD  PÅ IDLEVANM IDPTYP                  
//*                                                                             
//W41844D2 DD  DSN=&INDUT..W41844D(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ LISTPOSTER RECEIVED LINES                                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
