//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VR  -  KOPPLING                                              *         
//*                                                                   *         
//*      PERIODICITET: DAGLIGEN                                       *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W425P043 PROC INDIN3=&W476..W425D1,INDUT=&W425..W425D1,                       
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42543  EXEC PGM=W42543                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SORTMSG  DD  SYSOUT=*                                         (SORT)          
//SYSOUT   DD  SYSOUT=*                                      (DISPLAY)          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=*                                    (VID ABEND)          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//*                                                                             
//W42543D1 DD  DSN=&INDIN3..W47662,DISP=SHR                                     
//************** FIL FRÅN FAKTURERINGEN                                         
//*                                                                             
//W42543D2 DD  DSN=&INDUT..W42543(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** REDIGERADE VR-POSTER                               ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
