//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            KOPPLING VR-SYSTEM                                     *         
//*                                                                   *         
//*            PERIODICITET: DAGLIGEN                                 *         
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W425P020 PROC INDIN=&W425..W425D1,                                            
//             INDUT=&W425..W425D1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42520  EXEC PGM=W42520                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W42520D1 DD  DSN=&INDIN..W42525,DISP=SHR                                      
//**************                                                    ***         
//*                                                                             
//W42520D2 DD  DSN=&INDUT..W42599(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//**************                                                    ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
