//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL MED SU-TRANSAR OCH TAR BORT DUBBLETTER PÅ PT 686                 
//*  (SU7-TRANSAR)                                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W425D1                                            
//*                                                                             
//*  ÅTERSTART:    W42525    NORMAL                                             
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W425P025 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W425..W425D1,                                             
//             INDUT=&W425..W425D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42525   EXEC PGM=V16459,PARM='W42525/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//TEMPFIL1 DD  DATACLAS=PSEN                                                    
//TEMPFILA DD  DATACLAS=PSEN                                                    
//TEMPFIL2 DD  DATACLAS=PSEN                                                    
//TEMPFIL3 DD  DATACLAS=PSEN                                                    
//*                                                                             
//W42525D1 DD  DSN=&INDIN..W42545(+0),DISP=SHR                                  
//************ VR-TRANSAR FRÅN W425P045                                         
//*                                                                             
//W42525D2 DD  DSN=&INDUT..W42525(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ VR-TRANSAR, BORTTAGNA DUBLETTER PÅ POSTTYP 686                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
