//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR DENNA VECKAS NOTERINGAR MED FÖREGÅENDE VECKAS                      
//*  NOTERINGAR FÖR ATT HITTA VECKANS NYTILLKOMNA                               
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V4                                          
//*                                                                             
//*  ÅTERSTART:    W42685    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P085 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426V4,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42685   EXEC PGM=V16459,PARM='W42685/8/',REGION=8M                           
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(CYL,(100,100),RLSE)                                       
//SORTMSG  DD  SYSOUT=*                                                         
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W42685D1 DD  DSN=&INDIN..W42671(+0),DISP=SHR                                  
//************ DENNA VECKANS 6212-NOTERINGAR                                    
//*                                                                             
//W42685D2 DD  DSN=&INDIN..W42671(-1),DISP=SHR                                  
//************ FÖRRA VECKANS 6212-NOTERINGAR                                    
//*                                                                             
//W42685D3 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELINFO                                                      
//*                                                                             
//W42685D4 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W42685-001  NYA NOTERINGAR                                       
//*                                                                             
