//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KVALITETSINDEX                                                             
//*                                                                             
//*  FREKVENS:     DAG    RTN W426R2                                            
//*                                                                             
//*  ÅTERSTART:    W42610   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426R2,INDUT=&W426..W426R2,                         
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42610   EXEC PGM=W42610                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W42610D1 DD  DSN=&INDIN..W42602(+0),DISP=SHR                                  
//************ FRÅN W426P005                                                    
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W42610D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W42610-001 KVALITETSINDEX SVENSKA CDC                            
//*                                                                             
//W42610D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W42610-001A KVALITETSINDEX ENGELSKA CDC                          
//* -----------------------------------------------------------                 
//W42610D4 DD  DSN=&INDUT..DC21.W42611(+1),                     -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ LISTFIL  KVALITETSINDEX FLAMLÄNDSKA DC21                         
//             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                      
//*                                                                             
//W42610D5 DD  DSN=&INDUT..DC21.W42612(+1),                     -LIM(1)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ LISTFIL  KVALITETSINDEX ENGELSKA DC21                            
//             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                      
//* -----------------------------------------------------------                 
//*W42610D6 DD  DSN=&INDUT..DC22.W42611(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX FRANSKA     DC22                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//**                                                                            
//*W42610D7 DD  DSN=&INDUT..DC22.W42612(+1),                    -LIM(1)         
//**             DISP=(NEW,CATLG,DELETE),                                       
//************ LISTFIL  KVALITETSINDEX ENGELSKA    DC22                         
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//* -----------------------------------------------------------                 
//*                                                                             
//*W42610D8 DD  DSN=&INDUT..DC23.W42612(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ENGELSKA    DC23                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//** -----------------------------------------------------------                
//*W42610D9 DD  DSN=&INDUT..DC24.W42611(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX SPANSKA     DC24                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//**                                                                            
//*W42610DA DD  DSN=&INDUT..DC24.W42612(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ENGELSKA    DC24                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//* -----------------------------------------------------------                 
//*W42610DB DD  DSN=&INDUT..DC25.W42611(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ITALIENSKA  DC25                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//**                                                                            
//*W42610DC DD  DSN=&INDUT..DC25.W42612(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ENGELSKA    DC25                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//* -----------------------------------------------------------                 
//*W42610DD DD  DSN=&INDUT..DC26.W42611(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ÖSTERRIKE   DC26                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//**                                                                            
//*W42610DE DD  DSN=&INDUT..DC26.W42612(+1),                    -LIM(1)         
//*             DISP=(NEW,CATLG,DELETE),                                        
//************* LISTFIL  KVALITETSINDEX ENGELSKA    DC26                        
//*             SPACE=(6171,(50,10),RLSE),MGMTCLAS=&BACKUPC                     
//** -----------------------------------------------------------                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(8,GT,W42610)                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
