//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KVALITET FILER FÖR STATISTIK                                               
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W426R2                             
//*                                                                             
//*  ÅTERSTART:    W42605   NORMAL (BMP)                                        
//*                .                                                            
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P105 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W426..W426R2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42605   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W42605,W42605,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W42605D1 DD  DSN=&INDUT..W42601(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FELFÖRDELNING TILL W426P009                                      
//             SPACE=(168,(5,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W42605D2 DD  DSN=&INDUT..W42602(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KVALITETSINDEX TILL W426P010                                     
//             SPACE=(104,(7,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W42605D3 DD  DSN=&INDUT..W42603(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FÖRDELNING FELGRUPPER TILL W426P011                              
//             SPACE=(147,(5,1),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
