//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL TILL HISTORIKREG. FRÅN MOTTAGNINGSKONTR.                        
//*  SAMT FIL FÖR RENSNIG AV UPPFÖLJN.REG.(W6L1)                                
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W426V1                                          
//*                                                                             
//*  RESTART:      W42668      NORMAL                                           
//*                READS  WDL2 W6L1                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W426..W426V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42668   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W42668,W42668,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6L1     INCLUDE MEMBER=W6L1                                                  
//W6D1     INCLUDE MEMBER=W6D1                                                  
//W42668D1 DD  DSN=&INDUT..W42668(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TILL HISTORIKREG ÖVER RESULTAT FRÅN MOTTAGN.KONTR.               
//             SPACE=(293,(10,1),RLSE),AVGREC=K,                                
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//W42668D2 DD  DSN=&INDUT..W42669(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED NYCKEL FÖR RENSN. AV W6L1 SAMMA SOM W42668               
//             SPACE=(5,(10,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
