//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FELLISTE-DATA FÖR KR-SYSTEMET.                                      
//*                                                                             
//*  FREKVENS:     VECKA     RTN W426V1                                         
//*                                                                             
//*  ÅTERSTART:    W4264200    NORMAL                                           
//*                LÄSER        W6H7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426V1,                                             
//             INDUT=&W426..W426V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4264200 EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W42642,W42642,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6H7     INCLUDE MEMBER=W6H7                                                  
//W42642D1 DD  DSN=&INDIN..W42698(+0),DISP=SHR                                  
//************ KRL-SEGMENT                                                      
//*                                                                             
//W42642D2 DD  DSN=&INDUT..W42642(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DATA FÖR FELLISTA                                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
