//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KVALITET. ARTIKELHISTORIK PÅ E+ FILER                                      
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V4                                          
//*                                                                             
//*  ÅTERSTART:    W42674    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P072 PROC INDIN=&W426..W426V4,                                            
//             INDUT=&WXTR..W426V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42671(+0),DISP=SHR                                  
//************ ARTIKELHISTORIK FRÅN W6D211                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTRK2(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ ARTIKELHISTORIK                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
