//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INLEVERADE ARTIKLAR UTAN KKOD, KOMPLETTERAS MED                            
//*  ARTIKELUPPGIFTER, SAMT UPPPDATERAR W6G2                                    
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V3                                          
//*                                                                             
//*  ÅTERSTART:    W42664    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W426..W426V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42664   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W42664,W42664,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W42664D1 DD  DSN=&INDUT..W42664(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INLEV ART UTAN KKOD                                              
//             SPACE=(82,(1,1),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
