//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KVALITET. MOTTAGNINGSKONTROLL HISTORIK                                     
//*            SKRIVS PÅ ÅRSFIL OCH E+ ÅRSFIL.                                  
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V4                                          
//*                                                                             
//*  ÅTERSTART:    W42672    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P072 PROC INDREG=&W426..W426V4,                                           
//             INDUT1=&W426..W426Y1,                                            
//             INDUT2=&WXTR..W426Y1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDREG..W42670(+0),DISP=SHR                                 
//************ MOTTAGNINGSKONTROLL HISTORIK                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT1..W42670(+1),                        -LIM(10)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ MOTTAGNINGSKONTROLL HISTORIK ÅRSFIL                              
//             SPACE=(293,(200,33),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDREG..W42670(+0),DISP=SHR                                 
//************ MOTTAGNINGSKONTROLL HISTORIK                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WXTRK1(+1),                        -LIM(10)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ MOTTAGNINGSKONTROLL HISTORIK ÅRSFIL E+                           
//             SPACE=(293,(200,33),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
