//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL MED ARTIKLAR SOM ÄR NYA ELLER HAR BYTT                          
//*  LEVERANTÖR OCH DÄRMED SAKNAR KONTROLLKOD                                   
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V3                                          
//*                                                                             
//*  ÅTERSTART:    W42663      NORMAL                                           
//*                LÄSER  W6D2 W6F1 WDK6                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426V3,                                             
//             INDUT=&W426..W426V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42663   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W42663,W42663,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6D2     INCLUDE MEMBER=W6D2                                                  
//W6F1     INCLUDE MEMBER=W6F1                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W42663D1 DD  DSN=&INDIN..W42661(+0),DISP=SHR                                  
//************ NYA ART/LEV                                                      
//*                                                                             
//W42663D2 DD  DSN=&INDUT..W42663(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ART FÖR UPPD. AV KKOD                                            
//*            SPACE=(82,(1,1),RLSE),AVGREC=K,                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
