//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KVALITET. MOTTAGNINGSKONTROLL HISTORIK PÅ E+ FILER                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W426V4                                          
//*                                                                             
//*  ÅTERSTART:    W42672    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P072 PROC INDIN=&W426..W426V4,                                            
//             INDUT=&WXTR..W426V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42670(+0),DISP=SHR                                  
//************ MOTTAGNINGSKONTROLL HISTORIK                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTRK0(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ MOTTAGNINGSKONTROLL HISTORIK                                     
//             SPACE=(293,(200,33),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
