//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR KONTROLLRAPPORTER ÖVER ÅTGÄRD BEGÄRD                                
//*                                                                             
//*  FREKVENS:     DAG    RTN W426R3                                            
//*                                                                             
//*  ÅTERSTART:    W42628    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426D2,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42628   EXEC PGM=V16459,PARM='W42628/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W42628D1 DD  DSN=&INDIN..W42620(+0),DISP=SHR                                  
//************ SB W6H7                                                          
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W42628D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W42628-001 LISTA KONTROLLRAPPORTER DÄR ÅTGÄRD ÄR BEGÄRD          
//************            C1 LAGER                                              
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W42628D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W42628-002 LISTA KONTROLLRAPPORTER DÄR ÅTGÄRD ÄR BEGÄRD          
//************            C1 INLEV                                              
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W42628D4 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W42628-003 LISTA KONTROLLRAPPORTER DÄR ÅTGÄRD ÄR BEGÄRD          
//************            C2 LAGER + INLEV                                      
//           DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
