//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRINTAR BEREDARLISTA                                                       
//*                                                                             
//*  FREKVENS:   VECKA    RTN W426V3                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P077 PROC INDIN=&W426..W426V3,                                            
//             DEST1=&R3110015                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42666(+0),DISP=SHR                                  
//************ LISTFIL FRÅN W426P065                                            
//*                                                                             
//OUTD3 OUTPUT CLASS=A,FORMS=F001,DEST=&DEST1                                   
//*                                                                             
//SYSUT2   DD  SYSOUT=(,),OUTPUT=(*.OUTD3)                                      
//************ W42665-004A BEREDARLISTA ATT PRINTAS I HELMOND                   
//*                                                                             
