//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STATISTIK ÖVER PRIMÄRKONTROLL                                              
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W426R1                             
//*                                                                             
//*  ÅTERSTART:    W42682    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&WXTR..W426V4,                                            
//             INDIN2=&WXTR..W426Y1,                                            
//             INDIN3=&W910,                                                    
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42682   EXEC PGM=V16459,PARM='W42682/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W42682D1 DD  DSN=&INDIN1..WXTRK0(+0),DISP=SHR                                 
//************ VECKOFIL MED KR-INFO                                             
//     DD DSN=&INDIN2..WXTRK1(+0),DISP=SHR                                      
//************ ÅRSFIL MED KR-INFO                                               
//W42682D2 DD  DSN=&INDIN3..W91042(+0),DISP=SHR                                 
//************ ARTIKEL-INFO                                                     
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W42682D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W42682-001  PRIMÄRKONTROLLSTATISTIK C1                           
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//W42682D4 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W42682-002  PRIMÄRKONTROLLSTATISTIK C2                           
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
