//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER TVÅFILER MED ARTIKELINFO SORTERAR OCH                                
//*  SKRIVER TVÅ UTFILER                                                        
//*                                                                             
//*  FREKVENS:     VECKA  RTN W426V3                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W42661    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426V3,                                             
//             INDUT=&W426..W426V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42661   EXEC PGM=V16459,PARM='W42661/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W42661D1 DD  DSN=&INDIN..W42660(+0),DISP=SHR                                  
//************ DAGENS ARTIKELINFO                                               
//*                                                                             
//W42661D2 DD  DSN=&INDIN..W42660(-1),DISP=SHR                                  
//************ GÅRDAGENS ARTIKELINFO                                            
//*                                                                             
//W42661D3 DD  DSN=&INDUT..W42661(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ NYA ARTIKLAR                                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
