//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLRAPPORT EJ BEHANDLAD AV EKONOMI                                    
//*  VID REDOVISNINGSPERIOD                                                     
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W426R3                             
//*                                                                             
//*  ÅTERSTART:    W42638    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W426..W426R3,                                            
//             INDUT1=&W426..W426R3                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42638   EXEC PGM=V16459,PARM='W42638/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W42638D1 DD  DSN=&INDIN1..W42652(+0),DISP=SHR                                 
//************ FIL FRÅN W426J052                                                
//*                                                                             
//W42638D2 DD  DSN=&INDUT1..W42638(+1),DISP=(NEW,CATLG,DELETE),                 
//************ W42638-001  EJ BEHANDLADE KONTOLLRAPP. AV EKONOMI PV C1          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W42638D3 DD  DSN=&INDUT1..W42638A(+1),DISP=(NEW,CATLG,DELETE),                
//************ W42638-002  EJ BEHANDLADE KONTOLLRAPP. AV EKONOMI PV C2          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
