//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLRAPPORT                                                            
//*  FIL MED JUSTERINGAR EKONOMI                                                
//*                                                                             
//*  FREKVENS:     DAG      RTN W426D2                                          
//*                                                                             
//*  ÅTERSTART:    W42639    NORMAL                                             
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P039 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W426..W426D2,                                             
//             INDUT=&W426..W426D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42639   EXEC PGM=V16459,PARM='W42639/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//*                                                                             
//W42639D1 DD  DSN=&INDIN..W42620(+0),DISP=SHR                                  
//************ KONTROLLRAPPORT REGISTER                                         
//*                                                                             
//W42639D2 DD  DSN=&INDUT..W42639(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TILL W426P040 I W426V2                                           
//************ KONTROLLRAPPORT, FIL MED JUSTERINGAR EKONOMI                     
//             MGMTCLAS=&NOBACKUP,SPACE=(49,(50,25),RLSE),AVGREC=K              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
