//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRINTAR BEREDARLISTA                                                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W426V3                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W426P076 PROC INDIN=&W426..W426V3,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42666(+0),DISP=SHR                                  
//************ LISTFIL FRÅN W426P065                                            
//*                                                                             
//OUTD3 OUTPUT CLASS=6,FORMS=3803,DEST=&DEST1,                                  
//             PAGEDEF=SLS06C,FORMDEF=SLS06C                                    
//*                                                                             
//SYSUT2   DD  SYSOUT=(,),OUTPUT=(*.OUTD3)                                      
//************ W42665-004  BEREDARLISTA ATT PRINTAS PÅ VD                       
//*                                                                             
