//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR ETT EXTRAKT FRÅN WDA2 (LEVERANSANMÄRKNINGSREGISTRET)                
//*  TILL IC-DATABANK                                                           
//*                                                                             
//*  FREKVENS:     VECKA    RTN W428V1                                          
//*                                                                             
//*  ÅTERSTART:    W42856   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W428..W428V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42856   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W42856,W42856,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//WDA2     INCLUDE MEMBER=WDA2                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//*                                                                             
//W42856D1 DD  DSN=&INDUT..W42856(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ EXTRAKT AV WDA1                                                  
//             SPACE=(95,(5,2),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
