//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXECUTES THE PROGRAM THAT GENERATES                                        
//*  'DEALER RETURN DAILY FOLLOW UP' REPORT W42838-001                          
//*   ** ONLY FOR US AND CANADA **                                              
//*  FREQUENCE:    DAILY     RTN W428D3                                         
//*                                                                             
//*  RESTART:      W42838    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P138 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W428..W428D3,                                             
//             INDUT=&W428..W428D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD30),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W42837(+0),DISP=SHR                                  
//************ SORTFIL IN                                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W42837,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE ARTIKLAR FÖR LISTUTSKRIFT                              
//             DATACLAS=PSEB                                                    
//*                                                                             
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD30),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W42838(+0),DISP=SHR                                  
//************ SORTFIL IN                                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W42838,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE ARTIKLAR FÖR LISTUTSKRIFT                              
//             DATACLAS=PSEB                                                    
//*                                                                             
//W42838   EXEC PGM=W42838                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W42838D1 DD  DSN=&&W42837,DISP=(OLD,DELETE,DELETE)                            
//************ W42837 FILE TREATED LINES LAST DAY                               
//*                                                                             
//W42838D2 DD  DSN=&&W42838,DISP=(OLD,DELETE,DELETE)                            
//************ W42838 FILE NOT YET TREATED LINES                                
//*                                                                             
//W42838D3 DD  DSN=&INDUT..W428381(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W42838-001 REPORT FILE                                           
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
