//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL MED UPPFÖLJNINGSDATA FÖR RETURER LDC.                           
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W428V1                                          
//*                                                                             
//*  RESTART:      W42811    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W428..W428V1,                                             
//             INDIN2=&W428..W428V1,                                            
//             INDUT=&W428..W428V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42811   EXEC PGM=V16459,PARM='W42811/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(35000,3500))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W42811D1 DD  DSN=&INDIN..W42820(+0),DISP=SHR                                  
//************ UPPFÖLJNINGSFIL (LEVERANSANMÄRKNINGAR)                           
//*                                                                             
//W42811D2 DD  DSN=&INDIN2..W42822(+0),DISP=SHR                                 
//************ UPPFÖLJNINGSFIL (LEDTIDSFIL)                                     
//*                                                                             
//TEMPFIL DD   DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL LEVERANSANMÄRKNINGAR                                
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL LEDTID RETURER                                      
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL3 DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL ANTAL RETURDAGAR                                    
//             DATACLAS=PSEB                                                    
//*                                                                             
//W42811D3 DD  DSN=&INDUT..W42811(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ UPPFÖLJNINGSFIL (RETURER TILL LDC)                               
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
