//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR                                                                     
//*                                                                             
//*  FREKVENS:     VECKA     RTN W428V1                                         
//*                                                                             
//*  ÅTERSTART:    W42836    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W428..W428V1,                                             
//             INDUT=&W428..W428V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42836   EXEC PGM=V16459,PARM='W42836/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJORS2,HOLD=YES                            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W42836D1 DD  DSN=&INDIN..W42834,DISP=SHR                                      
//************ VECKANS INRAPPORTERADE RETURER FRÅN DISTR 8111/8211              
//*                                                                             
//W42836D2 DD  DSN=&INDUT..W42836PR(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)        
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
//************ W42836-001  UPPFÖLJNINGSLISTA NA-RETURER R32'OR                  
//*                                                                             
