//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRINTING OF LIST FROM INPUT FILE                                           
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY    RTN W428S1                            
//*                                                                             
//*  RESTART:      SORT      NORMAL                                             
//*                W4286200  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W428..W428S1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD62),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W42863(+0),DISP=SHR                                  
//************ RECORDS FROM W428P060                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W42863S,DISP=(NEW,PASS,DELETE),                            
//************ SORTED RECORDS TO BE PRINTED                                     
//         SPACE=(141,(2,1),RLSE),AVGREC=K                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42862   EXEC PGM=V16459,PARM='W42862/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W42862D1 DD  DSN=&&W42863S,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED RECORDS TO BE PRINTED                                     
//*                                                                             
//W42862D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W42862-001  REPORT                                               
//*                                                                             
