//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LEDTIDS FIL                                                         
//*                                                                             
//*  FREQUENCE:    DAILY    RTN W428V1                                          
//*                                                                             
//*  RESTART:      W42822    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W418..W418D2,                                            
//             INDIN=&W428..W428V1,                                             
//             INDUT1=&W428..W428V1,                                            
//             INDUT2=&WXTR..W428V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42822   EXEC PGM=V16459,PARM='W42822/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(35000,3500))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//W42822D1 DD  DSN=&INDIN2..W41842(+0),DISP=SHR                                 
//************ KOPIA AV LEVERANSANMÄRKNINGS REGISTRET                           
//*                                                                             
//W42822D2 DD  DSN=&INDIN..W42821(+0),DISP=SHR                                  
//************ KOPIA AV SÄNDNINGSREGISTRET                                      
//*                                                                             
//W42822D3 DD  DSN=&INDUT1..W42822(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ UPPFÖLJNINGSFIL (LEDTIDSFIL)                                     
//             SPACE=(143,(10,4),RLSE),AVGREC=M,                                
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W42822 TILL EXTRAKTFIL WXTR8E                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR8E   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT1..W42822(+1),DISP=SHR                                 
//************ UPPFÖLJNINGSFIL (LEDTIDSFIL)                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WXTR8E(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ UPPFÖLJNINGSFIL (LEDTIDSFIL)                                     
//             SPACE=(143,(5,2),RLSE),AVGREC=M,                                 
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
