//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FAKTURERADE RADER UNDER PERIODEN                                           
//*                                                                             
//*  FREKVENS:     VECKA    RTN W428R1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P046 PROC INDIN2=&W428..W428R1,                                           
//             INDUT1=&W428..W428R1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD46),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W42845,DISP=SHR                                     
//************ FAKT INFIL                                                       
//*                                                                             
//SORTOUT  DD  DSN=&INDUT1..W42846(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UPPFÖLJNINGSFIL (FAKTURERADE RADER)                              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPY W42846 FOR W428V1 W4281800                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY2    EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT1..W42846(+1),DISP=SHR                                 
//************ UPPFÖLJNINGSFIL (FAKTURERADE RADER)                              
//*                                                                             
//SYSUT2   DD  DSN=&INDUT1..W42846A(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)        
//************ UPPFÖLJNINGSFIL (FAKTURERADE RADER)                              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=BACKUPC                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
