//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR LISTPOSTER TILL DISTR. AND PRINT FÖR UPPFÖLJNING                   
//*  AV KOD 72 HOS LDC.PERIODLISTA VIA WZ01-MODULEN.                            
//*                                                                             
//*  FREKVENS:     DAG     RTN W428R1                                           
//*                                                                             
//*  ÅTERSTART:    W42813    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W428..W428R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD13),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W42811,DISP=SHR                                      
//************ LEDTIDSFIL RETURER FRÅN W428V1 - W42811                          
//*                                                                             
//SORTOUT  DD  DSN=&&W42811,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//************ SORTERAD FIL                                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42813   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W42813,W42813,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W42813D1 DD  DSN=&&W42811,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL WEEKLY FOLLOW UP CODE 72, LDC                              
//*                                                                             
