//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL LISPOSTER TILL DISTR. AND PRINT FÖR UPPFÖLJNING                 
//*  AV KOD 72 HOS LDC.PERIODLISTA VIA WZ01-MODULEN.                            
//*                                                                             
//*  FREKVENS:     VECKA   RTN W428V1                                           
//*                                                                             
//*  ÅTERSTART:    W42816    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P016 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W428..W428V1,                                             
//             INDUT=&W428..W428V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W428PD16),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W42811(+0),DISP=SHR                                  
//************ LEDTIDSFIL RETURER FRÅN W428V1 - W42811                          
//*                                                                             
//SORTOUT  DD  DSN=&&W42811,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//************ SORTERAD FIL                                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42816   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W42816,W42816,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W42816D1 DD  DSN=&&W42811,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL WEEKLY FOLLOW UP CODE 72, LDC                              
//*                                                                             
//W42816D2 DD  DSN=&INDUT..W42816(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ UPPFÖLJNINGSFIL, LEVERANSANMÄRKNINGAR, NDC:ER                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
