//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FAKTURERADE RADER UNDER PERIODEN                                           
//*  KOPIERAR UT EXTRAKTFIL (FAKTURERADE RADER)                                 
//*                                                                             
//*  FREKVENS:     VECKA    RTN W428R1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P048 PROC INDIN1=&W428..W428R1,                                           
//             INDUT1=&WXTR..W428R1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W42847 TILL EXTRAKTFIL WXTR8G                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR8G   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN1..W42847(+0),DISP=SHR                                 
//************ UPPFÖLJNINGSFIL (FAKTURERADE RADER)                              
//*                                                                             
//SYSUT2   DD  DSN=&INDUT1..WXTR8G(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UPPFÖLJNINGSFIL (FAKTURERADE RADER)                              
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
