//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXECUTES W4285400.CREATES MANAGEMENT DEALER WEEKLY FOLLOW-UP               
//*  REPORT W42854-001.                                                         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W428V1                                         
//*                                                                             
//*  RESTART:      W42854      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W428P054 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W428..W428V1,                                             
//             INDUT=&W428..W428V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W42854   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W42854,W42854,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W42854D1 DD  DSN=&INDIN..W4285A(+0),DISP=SHR                                  
//************ W4285A FILE                                                      
//*                                                                             
//W42854D2 DD  DSN=&INDIN..W4285B(+0),DISP=SHR                                  
//************ W4285B FILE                                                      
//*                                                                             
//W42854D3 DD  DSN=&INDUT..W428541(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ O/P REPORT FILE TO D&P                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
