//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      RENSNING AV REGISTER                                         *         
//*                                                                   *         
//*      PERIODICITET: PÅ BESTÄLLNING (ÅRSKÖRNING)                    *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W430P020 PROC INDIN=&W430..W430P1,INDUT=&W430..W430P1,                        
//             INDREG=&W011,                                                    
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//W43020  EXEC PGM=W43020                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SYSOUT   DD  SYSOUT=*                                    (DISPLAY)            
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                    (POSTSUM)            
//*                                                                             
//W43020D1 DD  DSN=&INDREG..W01172(+0),DISP=SHR                                 
//************** IN-LAGERBAND                                       ***         
//*                                                                             
//W43020D2 DD  DSN=&INDIN..W43023(+0),DISP=SHR                                  
//************** IN-REGISTER                                        ***         
//*                                                                             
//W43020D3 DD  DSN=&INDUT..W43023(+1),DISP=(NEW,CATLG,DELETE),                  
//************** UT-REGISTER                                        ***         
//             UNIT=T9,                                                         
//             LABEL=RETPD=400                                                  
