//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER RAPPORTFIL AVSEENDE                                                
//*  GODSMOTTAGARE, KÖPARE, NAMN OCH ADRESS.                                    
//*                                                                             
//*  FREQUENCE:    QUARTER+WEEK  RTN W432V1                                     
//*                                                                             
//*  RESTART:      W43226    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W432P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W432..W432V1,                                             
//             INDUT=&W432..W432V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W43226   EXEC PGM=V16459,PARM='W43226/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W43226D1 DD  DSN=&INDIN..W43230(+0),DISP=SHR                                  
//************ SELECTED GODS RECEIVER                                           
//*                                                                             
//W43226D2 DD  DSN=&INDUT..W43226(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************** W43226-001                                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
