//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR FIL W43230 TILL WXTRB8                                            
//*                                                                             
//*  FREQUENCE:    WEEKLY   RTN W432V1                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W432P031 PROC INDIN=&W432..W432V1,                                            
//             INDUT=&WXTR..W432V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W43230(+0),DISP=SHR                                  
//************ EXTRAKTFIL KUNDREG. FRÅN W432P030                                
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTRB8(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ EXTRAKTFIL KUNDREG.                                              
//             SPACE=(335,(10,5),RLSE),AVGREC=K,                                
//             MGMTCLAS=NOBACKUP                                                
