//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR KUNDREGISTERUPPGIFTER-FIL MOT (-1)-FIL OCH                         
//*  SKAPAR NY FIL MED ÄNDRADE OCH NYA POSTER                                   
//*                                                                             
//*  FREKVENS:     DAG     RTN W432D1                                           
//*                                                                             
//*  ÅTERSTART:    W43233    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W432P033 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W432..W432D1,                                             
//             INDUT=&W432..W432D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W43233   EXEC PGM=V16459,PARM='W43233/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W43233D1 DD  DSN=&INDIN..W43232(-1),DISP=SHR                                  
//************ GÅRDAGENS KUNDUPPGIFTER                                          
//*                                                                             
//W43233D2 DD  DSN=&INDIN..W43232(+0),DISP=SHR                                  
//************ DAGENS KUNDUPPGIFTER                                             
//*                                                                             
//W43233D3 DD  DSN=&INDUT..W43233(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ÄNDRADE OCH NYA KUNDREG. UPPGIFTER                               
//             SPACE=(66,(1,4),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
