//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BO-LIST      FROM VPD TO THE ITALIEN PV IMPORTER                           
//*                                                                             
//*  FREKVENS:         VECKA                                                    
//*                RTN W440V1                                                   
//*                                                                             
//*  ÅTERSTART:    W4404D     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P04D PROC INDIN=&W440..W440V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//SYSUT1   DD DSN=&INDIN..W4404D(+0),DISP=SHR                                   
//SYSUT2   DD SYSOUT=(E,,1001),DEST=NJO00295                                    
