//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERING AV VOR-INFO                                                  
//*                                                                             
//*  FREKVENS:     VECKA     RTN W440V3                                         
//*                                                                             
//*  ÅTERSTART:    W44058      NORMAL                                           
//*                LÄSER        WDE2 WDE6 WDQ3                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P058 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440V3,                                             
//             INDUT=&W440..W440V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD58),DISP=SHR                         
//SORTIN   DD   DSN=&INDIN..W4405A(+0),DISP=SHR                                 
//************ VOR EXTRAKT                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W4405A,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD VOR TILL OKS UPPF.                                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W44058   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44058,W44058,,00')                                  
//*FOR PROD DB PARM=('DLI,W44058,W44058,,00')                                   
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDE2     INCLUDE MEMBER=WDE2                                                  
//WDE6     INCLUDE MEMBER=WDE6                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//W44058D1 DD  DSN=&&W4405A,DISP=(OLD,DELETE,DELETE)                            
//************ VOR EXTRAKT SORT: DISTRIKT, KUND, ORDER, ARTIKEL                 
//*                                                                             
//W44058D2 DD  DSN=&INDUT..W44062(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERAD VOR-INFO                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
