//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RESTORDERREG. LÄSES FÖR VARJE ERSATT                                       
//*  ARTIKEL. KOMPLETTERING MED RO-INFO OCH KUNDINFO.                           
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D1                                            
//*                                                                             
//*  ÅTERSTART:    W44022   NORMAL                                              
//*                .                                                            
//*                LÄSER WDA5 WDB2                                              
//*                      WDQ2 WDR2 WDR5                                         
//*                FÖR W411DLEV                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440D1,                                             
//             INDUT=&W440..W440D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44022   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44022,W44022,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDR5     INCLUDE MEMBER=WDR5                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDC2     INCLUDE MEMBER=WDC2                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDF2     INCLUDE MEMBER=WDF2                                                  
//W44022D1 DD  DSN=&INDIN..W44020(+0),DISP=SHR                                  
//************ ERSATTA, TILLKOMMANDE ARTIKLAR                                   
//*                                                                             
//W44022D2 DD  DSN=&INDUT..W44022(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR MED RESTORDER OCH KUNDINFORMATION                       
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
