//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER INFIL IDORDER URVAL FRÅN WDE8, KOMPLETTERAR                          
//*  MED DATA FRÅN WDE9 SAMT SKRIVER UTFIL                                      
//*                                                                             
//*  FREKVENS:     VECKA    RTN W440V3                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W44072    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P072 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440V3,                                             
//             INDUT=&W440..W440V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD72),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W44071(+0),DISP=SHR                                  
//************ IDORDER URVAL FRÅN WDE8                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W4407S,DISP=(NEW,PASS,DELETE),                             
//************ IDORDER SORTERAT URVAL FRÅN WDE8                                 
//             SPACE=(4,(5,15),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44072   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44072,W44072,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDE9     INCLUDE MEMBER=WDE9                                                  
//W44072D1 DD  DSN=&&W4407S,DISP=(OLD,DELETE,DELETE)                            
//************ IDORDER SORTERAT URVAL FRÅN WDE8                                 
//*                                                                             
//W44072D2 DD  DSN=&INDUT..W44072(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KVOFFERT PER IDGMTREF/ARTNR/CLAGER URVAL FRÅN WDE9               
//             SPACE=(27,(5,15),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
