//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA 2204-TRANSAR                                                         
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D3                                            
//*                                                                             
//*  ÅTERSTART:    W44081    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P081 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440D3,                                             
//             INDUT2=&W440..W440D3                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44081   EXEC PGM=V16459,PARM='W44081/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(27995,(900,300))                                          
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W44081D1 DD  DSN=&INDIN..W44080(+0),DISP=SHR                                  
//************ INFIL-1                                                          
//*                                                                             
//W44081D2 DD  DSN=&INDIN..W44080(-1),DISP=SHR                                  
//************ INFIL-2                                                          
//*                                                                             
//TEMP1    DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ MELLANLAGRINGSFIL                                                
//             DATACLAS=PSEN                                                    
//TEMP2    DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ MELLANLAGRINGSFIL                                                
//             DATACLAS=PSEN                                                    
//*                                                                             
//W44081D3 DD  DSN=&INDUT2..W44081(+1),DISP=(NEW,CATLG,DELETE), -LIM(6)         
//************ 2204-TRANSAR                                                     
//             MGMTCLAS=&NOBACKUP,                                              
//             DATACLAS=PSEN                                                    
//*                                                                             
