//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDR4   OCH SORTERAR I ARTNR ORDNING                                  
//*                                                                             
//*  FREKVENS:     VECKA    RTN W440V3                                          
//*                                                                             
//*  ÅTERSTART:    W44064                                                       
//*                LÄSER  WDR4                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W440..W440V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44064   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44064,W44064,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR4     INCLUDE MEMBER=WDR4                                                  
//W44064D1 DD  DSN=&&W44064,DISP=(NEW,PASS,DELETE),                             
//************ TEMP-FIL MED WDR480 INFO                                         
//             SPACE=(23457,(134,15),RLSE)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&W44064,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDR4480 INFO                                        
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W44064(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD FIL FRÅN WDR4                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(23457,(134,15),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
