//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL FRÅN LAGERBAND ( NDC) MED KVROS-DAG > 0                         
//*                                                                             
//*  FREKVENS:     DAG      RTN W440D5                                          
//*                                                                             
//*  ÅTERSTART:    W44035    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P035 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..NDCTIME,                                            
//             INDUT=&W440..W440D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44035   EXEC PGM=V16459,PARM='W44035/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,10000))                                       
//SORTWK01 DD  DATACLAS=PSEB                                                    
//SORTWK02 DD  DATACLAS=PSEB                                                    
//SORTWK03 DD  DATACLAS=PSEB                                                    
//SORTWK04 DD  DATACLAS=PSEB                                                    
//SORTWK05 DD  DATACLAS=PSEB                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W44035D1 DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//************ DAG-LAGERBAND NDC                                                
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR ARTIKELFIL                                              
//             DATACLAS=PSEB                                                    
//*                                                                             
//W44035D2 DD  DSN=&INDUT..W44035(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FIL MED KVROS > 0 ( FRÅN LAGERBAND                               
//             SPACE=(11,(120,50),RLSE),AVGREC=K,                               
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
