//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SB, LÄSER NER HELA WDA5 TILL EN SEKVENTIELL FIL                            
//*                                                                             
//*  FREKVENS:     DAG            RTN W440V3                                    
//*                                                                             
//*  ÅTERSTART:    W44060   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P260 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W440..W440V3,                                             
//             INDREG=&W440                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44060   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44060,W44060,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDA5     INCLUDE MEMBER=WDA5                                                  
//*                                                                             
//W44060D1 DD  DSN=&INDREG..W44061(+1),                        -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SEKVENTIELL KOPIA AV WDA5                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W44060D2 DD  DSN=&&W44065,DISP=(NEW,PASS,DELETE),                             
//************ TEMP-FIL MED WDA5 INFO                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//**                                                                            
//W44060D3 DD  DUMMY                                                            
//*                                                                             
//W44060D4 DD  DUMMY                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&W44065,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDA5 INFO                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W44065(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD FIL FRÅN WDA5                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
