//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*   KOPIERA W440.W44061 TILL W020.RORAD                             *         
//*                                                                   *         
//*   PERIODICITET:  DAG    RTN W440D3                                *         
//*                                                                   *         
//*   ÅTERSTART:    NORMAL                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W440P061 PROC INDIN=&W440,INDREG=&W020                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY61  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W44061(+0),DISP=SHR                                  
//**************  RESTORDER-FILEN (FRÅN WDA5)                                   
//*                                                                             
//SYSUT2   DD  DSN=&INDREG..RORAD(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//**************  RESTORDER-FILEN (ANVÄNDS AV LINJEN)                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
