//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSATTA OCH TILKFÖRÄNDRADE ARTIKLAR - KOMPLETTERING ART.INFO               
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D1                                            
//*                                                                             
//*  ÅTERSTART:    W44020   NORMAL                                              
//*                                                                             
//*                LÄSER WDK6, WDK7 OCH WDD7                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P020 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440D1,                                             
//             INDUT=&W440..W440D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44020   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W44020,W44020,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//*                                                                             
//W44020D1 DD  DSN=&INDIN..W44031(+0),DISP=SHR                                  
//************ ARTIKLAR FÖR ERS I RO FRÅN LAGERBANDET-CDC                       
//         DD  DSN=&INDIN..W44033(+0),DISP=SHR                                  
//************ ARTIKLAR FÖR ERS I RO FRÅN LAGERBANDET-NDC51                     
//*                                                                             
//W44020D2 DD  DSN=&INDUT..W44020(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ERSATTA, TILLKOMMANDE-FÖRÄNDRADE ARTIKLAR                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
