//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BO-LIST FROM VPD TO VPD TOTAL-BO-LIST                                      
//*                                                                             
//*  FREKVENS:         VECKA                                                    
//*                RTN W440V1                                                   
//*                                                                             
//*  ÅTERSTART:    W4404T     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P04T PROC INDIN=&W440..W440V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//*UT1    OUTPUT FORMDEF=LARE,PAGEDEF=L481                                      
//OUT1    OUTPUT FORMDEF=SLS06C,PAGEDEF=SLS06C                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//SYSUT1   DD DSN=&INDIN..W4404T(+0),DISP=SHR                                   
//SYSUT2   DD SYSOUT=(A,,3803),OUTPUT=(*.OUT1),DEST=&CPRINT                     
