//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR FIL W44020(+0) TILL W44021(+1)                                    
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D1                                            
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P021 PROC INDIN=&W440..W440D1,                                            
//             INDUT=&W440..W440D1                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W44020(+0),DISP=SHR                                  
//************ ERSATTA, TILLKOMMANDE OCH LTK-FÖRÄNDRADE ARTIKLAR                
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W44021(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ERSATTA, TILLKOMMANDE-FÖRÄNDRADE ARTIKLAR, KOPIA                 
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
