//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BO-LIST      FROM VPD TO THE ENGLAND (CRICK) IMPORTER                      
//*                                                                             
//*  FREKVENS:         VECKA                                                    
//*                RTN W440V1                                                   
//*                                                                             
//*  ÅTERSTART:    W4404E     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P04E PROC INDIN=&W440..W440V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//SYSUT1   DD DSN=&INDIN..W4404E(+0),DISP=SHR                                   
//SYSUT2   DD SYSOUT=(A,,STD),DEST=LOCAL                                        
//*YSUT2   DD SYSOUT=(A,,STD),DEST=QGB15007                                     
