//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDQ1   OCH SORTERAR I IDDC/ARTNR ORDNING                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W440V3                                          
//*                                                                             
//*  ÅTERSTART:    W44070                                                       
//*                LÄSER  WDQ1                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W440..W440V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44070   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,DSNMTV01,W44070,,00')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//DDITV02  DD  DSN=&W..&RTEGRP..CONSTANT(W44070I1),DISP=SHR                     
//WDQ1     INCLUDE MEMBER=WDQ1                                                  
//*                                                                             
//W44070D1 DD  DSN=&&W44070,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL MED WDQ1 INFO                                            
//             SPACE=(27980,(134,15),RLSE)                                      
//*                                                                             
//W44070D2 DD  DSN=&&W44068,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL MED WDQ1 INFO                                            
//             SPACE=(27980,(134,15),RLSE)                                      
//*                                                                             
//W44070D3 DD  DSN=&&W44075,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL MED WDQ1 INFO                                            
//             SPACE=(44,(50,10),RLSE),AVGREC=K                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT70   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&W44070,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDQ1 INFO                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W44070(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD FIL FRÅN WDQ1                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(27980,(134,15),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT68   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&&W44068,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDQ1 INFO                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W44068(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD FIL FRÅN WDQ1                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(27980,(134,15),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT75   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD71),DISP=SHR                         
//SORTIN   DD  DSN=&&W44075,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP-FIL MED WDQ1 INFO                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W44075(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SORTERAS PÅ IDDISTR, IDKUNDRF, KDORDBEK OCH IDARTNR              
//             SPACE=(44,(50,10),RLSE),AVGREC=K,                                
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
