//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ERSÄTTNINGSBEVAKNING RESTORDER.                                            
//*  UPPDATERAR RESTORDER-REG.,                                                 
//*  LARM-KÖ SAMT SALDON PÅ ARTIKELREGISTER                                     
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D1                                            
//*                                                                             
//*  ÅTERSTART:    W44024    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P024 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W440..W440D1,                                             
//             INDIN2=&W440..W440D1,                                            
//             INDUT=&W440..W440D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44024S  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD24),DISP=SHR                         
//*                                                                             
//SORTIN   DD  DSN=&INDIN..W44022(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W44023,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44024   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W44024,W44024,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W44024D1 DD  DSN=&&W44023,DISP=(OLD,DELETE,DELETE)                            
//************ ERSÄTTNINGS-STRUKTURER KOMPL. MED RO- & KUND-INFO                
//*                                                                             
//W44024D2 DD  DSN=&INDIN2..W44024(+0),DISP=SHR                                 
//************ RESTART-FIL (DVS GSAM-FILEN FRÅN AVBRUTNA JOBBET)                
//*                                                                             
//WDS1G    DD  DSN=&INDUT..W44024(+1),DISP=(NEW,CATLG,CATLG),                   
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//************ GSAM-FIL RESTORDER                                               
//*                                                                             
