//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TRANSAR TILL VR, NOAC, ANSKAFFARNA                                         
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D1                                            
//*                                                                             
//*  ÅTERSTART:    W44026   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .        .                                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440D1,                                             
//             INDUT=&W440..W440D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44026   EXEC PGM=W44026                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W44026D1 DD  DSN=&INDIN..W44024(+0),DISP=SHR                                  
//************ ERSATTA, TILLKOMMANDE FÖRÄNDRADE ARTIKLAR                        
//*                                                                             
//W44026D2 DD  DSN=&INDUT..W44026(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ VR: SU2, SU3, SU5, SUD                                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//W44026D3 DD  DSN=&INDUT..W44027(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ NOAC: 002 - 005, 008                                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
