//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LDC-INFO                                                                   
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    W44046    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440     PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440D6,                                             
//             DEST1=LOCAL                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44046   EXEC PGM=V16459,PARM='W44046/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W44046D1 DD  DSN=&INDIN..W44045(+0),DISP=SHR                                  
//************ FIL FRÅN W440P045                                                
//*                                                                             
//W44046D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ LISTA MED RESTORDER                                              
//A4LF     OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                 
