//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BO-LIST      FROM VPD TO THE SPANISH IMPORTER, PV-DISTRIKT                 
//*                                                                             
//*  FREKVENS:         VECKA                                                    
//*                RTN W440V1                                                   
//*                                                                             
//*  ÅTERSTART:    W4404Q     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P05Q PROC INDIN=&W440..W440V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SPAIN    OUTPUT CLASS=E,FORMS=1001,DEST=LOCAL                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//SYSUT1   DD DSN=&INDIN..W4405Q(+0),DISP=SHR                                   
//SYSUT2   DD SYSOUT=(,),OUTPUT=(*.SPAIN)                                       
