//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LDC-INFO                                                                   
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    W44045    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W440,                                                    
//             INDREG1=&W910,                                                   
//             INDUT=&W440..W440D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44045   EXEC PGM=V16459,PARM='W44045/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(2000,1000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W44045D1 DD  DSN=&INDREG..W44061(0),DISP=SHR                                  
//************ FIL FRÅN    RESTORDERREGISTER                                    
//*                                                                             
//W44045D2 DD  DSN=&INDREG1..W91042(+0),DISP=SHR                                
//************ EXTRAKT ARTIKELREGISTER                                          
//*                                                                             
//W44045D3 DD  DSN=&INDUT..W44045(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL FÖR LISTA VIA PGM W44046                                     
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
