//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EN FIL MED BARA TPO:ER                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W440D3                                            
//*                                                                             
//*  ÅTERSTART:    W44080    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P080 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440,                                                     
//             INDUT=&W440..W440D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44080   EXEC PGM=V16459,PARM='W44080/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W44080D1 DD  DSN=&INDIN..W44061(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//W44080D2 DD  DSN=&INDUT..W44080(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
