//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR RO-LISTOR                                                           
//*                                                                             
//*  FREKVENS:     VECKA    RTN W440V1                                          
//*                                                                             
//*  ÅTERSTART:    W44041   NORMAL                                              
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440V1,                                             
//             INDUT=&W440..W440V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD41),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W44047(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W44047,DISP=(NEW,PASS,DELETE),                             
//************                                                                  
//             SPACE=(27946,(1000,300),RLSE)                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W44041   EXEC PGM=V16459,PARM='W44041/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(1500,300))                                          
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W44041D1 DD  DSN=&&W44047,DISP=(OLD,PASS,DELETE)                              
//************ KOMPLETTERAD INFIL FRÅN W4404700                                 
//*                                                                             
//W44041D2 DD  DSN=&INDUT..W4404D(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-004  RO-LISTA ITALIEN                                     
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041D3 DD  DSN=&&W4404E,DISP=(NEW,PASS,DELETE)                              
//************ W44041-005  RO-LISTA ENGLAND(MARLOW)                             
//*                                                                             
//W44041D4 DD  DSN=&INDUT..W4404F(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-006  RO-LISTA ISRAEL                                      
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041D5 DD  DSN=&INDUT..W4404J(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-010  RO-LISTA ÖSTERRIKE                                   
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041D6 DD  DSN=&INDUT..W4404N(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-014  RO-LISTA FINLAND                                     
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041D8 DD  DSN=&INDUT..W4404R(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-018  RO-LISTA JAPAN                                       
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041D9 DD  DSN=&INDUT..W4404T(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-101  RO-LISTA TOTAL                                       
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(12000,1200),RLSE)                
//*                                                                             
//W44041DB DD  DSN=&&W4405I,DISP=(NEW,PASS,DELETE)                              
//************ W44041-009  RO-LISTA HOLLAND                                     
//*                                                                             
//W44041DC DD  DSN=&INDUT..W4405K(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-011  RO-LISTA TYSKLAND                                    
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041DD DD  DSN=&INDUT..W4405M(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-013  RO-LISTA FRANKRIKE                                   
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041DE DD  DSN=&INDUT..W4405P(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-016  RO-LISTA NORGE                                       
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041DF DD  DSN=&INDUT..W4405Q(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-017  RO-LISTA SPANIEN                                     
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041DG DD  DSN=&INDUT..W4405S(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-019  RO-LISTA SCHWEIZ                                     
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//W44041DH DD  DSN=&INDUT..W4405U(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-021  RO-LISTA BRASILIEN                                   
//             MGMTCLAS=&DEL2BKPC,SPACE=(6171,(2500,500),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//FILFIX   EXEC PGM=V16459,PARM='V164D0/3/'                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//IN       DD  DSN=&&W4405I,DISP=(OLD,DELETE,DELETE)                            
//************ W44041-009  RO-LISTA HOLLAND                                     
//*                                                                             
//UT       DD  DSN=&INDUT..W4405I(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-009  RO-LISTA HOLLAND NU OMGJORD TILL FB                  
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=27951),                          
//             SPACE=(27951,(2500,500),RLSE),                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//FILFIX2  EXEC PGM=V16459,PARM='V164D0/3/'                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//IN       DD  DSN=&&W4404E,DISP=(OLD,DELETE,DELETE)                            
//************ W44041-005  RO-LISTA ENGLAND                                     
//*                                                                             
//UT       DD  DSN=&INDUT..W4404E(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W44041-005  RO-LISTA ENGLAND NU OMGJORD TILL FB                  
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=27951),                          
//             SPACE=(27951,(2500,500),RLSE),                                   
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
