//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FOLLOW UP FILE VOR, 24 HOURS AND DAY (OBKR > 0)                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W440V4                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W4405V    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W440P05V PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W440..W440V4,                                             
//             INDUT=&W440..W440V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W440PD5V),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W4405V(+0),DISP=SHR                                  
//************ FIL FRÅN WDA6                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W4405V,DISP=(NEW,PASS,DELETE),                             
//************ HOPSORTERING ORDER - ARTIKEL                                     
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4405V   EXEC PGM=W4405V                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                    -- ABEND         
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W4405VD1 DD  DSN=&&W4405V,DISP=(OLD,DELETE,DELETE)                            
//************ HOPSORTERING ORDER - ARTIKEL                                     
//*                                                                             
//W4405VD2 DD  DSN=&INDUT..W4405X(+1),DISP=(NEW,CATLG,DELETE), -LIM(52)         
//************ VOR FOLLOW UP 24 HOUR (OBKR > 0), EXCEL ORIENTED                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W4405VD3 DD  DSN=&INDUT..W4405Y(+1),DISP=(NEW,CATLG,DELETE), -LIM(52)         
//************ VOR FOLLOW UP DAY (OBKR > 0), EXCEL ORIENTED                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
