//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            KOPIERAR VDIFIL FÖR BACKUPP                            *         
//*                                                                   *         
//*            PERIODICITET: SEKUND                                   *         
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W460P049 PROC INDIN=&WIN..W460S2,INDUT=&W460..W460S2                          
//*                                                                             
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W46050,DISP=(OLD,DELETE,KEEP)                        
//SYSUT2   DD  DSN=&INDUT..W46050(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//*            KOPIA AV VDIFIL TILL W460P050 (W460S2)                           
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),                            
//             SPACE=(6160,(500,50)),                                           
//             MGMTCLAS=&BACKUPC                                                
//*********************************************************************         
