//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLERA ORDERPOSTER                                                    
//*  SAMT SKRIVER ALLA ORDER PÅ MASTERFILEN                                     
//*                                                                             
//*  FREKVENS:     SEKUND               RTN W460S3                              
//*                                                                             
//*  ÅTERSTART:    W46005     NORMAL                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W460P305 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W460..W460S3,                                             
//             INDUT=&W460..W460S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46005   EXEC PGM=W46005                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W46005D1 DD  DSN=&INDIN..W46001(+0),DISP=SHR                                  
//************ ORDER IN FRÅN IMPORTÖR, VIA NOAC                                 
//************ VCOM ÖVERFÖRING                                                  
//*                                                                             
//W46005D3 DD  DSN=&INDUT..W46086(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RÄTT ORDER UT                                                    
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(100,50),RLSE)                    
//*                                                                             
//W46005D5 DD  DSN=&INDUT..W46088(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ MASTER                                                           
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(100,50),RLSE)                    
//*                                                                             
//W46005D6 DD  DSN=&INDUT..W46089(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FELAKTIGA POSTER                                                 
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(95,1),RLSE)                      
//*                                                                             
//W46005D7 DD  DSN=&INDUT..W4608S(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ KREDITTRANSAR TILL W418P001                                      
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(28,7),RLSE)                       
//*                                                                             
//W46005D8 DD  DSN=&INDUT..W4609S(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SUMMA RHD-TRANSAR TILL W460P145                                  
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(28,7),RLSE)                      
//*                                                                             
//W46005D9 DD  DSN=&INDUT..W46090(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ RHG- OCH RHH-TRANSAR FÅN VIPS                                    
//************ KUNGREG UPPDATERINGAR. VIDARE TILL W410P030                      
//             MGMTCLAS=&NOBACKUP,SPACE=(6160,(28,7),RLSE)                      
//*                                                                             
//W46005DA DD  DSN=&&W46091,DISP=(NEW,PASS,DELETE),                             
//************ RHM-TRANSAR FÅN VIPS                                             
//************ BYTES-TRANSAR TILL BYTESSYSTEMET                                 
//             MGMTCLAS=&BACKUPC,SPACE=(23436,(28,7),RLSE)                      
//*                                                                             
//W46005DB DD  DSN=&INDUT..W46012(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ RHN-TRANSAR FÅN VIPS                                             
//             MGMTCLAS=&NOBACKUP,SPACE=(6160,(28,7),RLSE)                      
//*                                                                             
//W46010   EXEC PGM=SORT                                                        
//SORTIN   DD  DSN=&&W46091,DISP=(OLD,DELETE,DELETE)                            
//************ BYTES-POSTER SORTERADE PÅ RAPPORTNR, DISTRIKT                    
//SORTOUT  DD  DSN=&INDUT..W46091(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//             MGMTCLAS=&NOBACKUP,SPACE=(23436,(28,7),RLSE)                     
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                   -- DISPLAY            
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W460PD05),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TOMDEL EXEC WEMPDEL,DSIN=&INDUT..W4608S(+1)                                   
//TOMDEL EXEC WEMPDEL,DSIN=&INDUT..W46091(+1)                                   
//*                                                                             
