//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄGGER UPP ORDERBEKRÄFTELSETRANSAR FÖR NDC VIPS ORDRAR                     
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W460S3                             
//*                                                                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W46015    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W460P315 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W460..W460S3,                                             
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W460PD15),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W46012(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W46012,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD INFIL                                                   
//         SPACE=(80,(10,330),RLSE),AVGREC=U                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46015   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W46015,W46015,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W46015D1 DD  DSN=&&W46012,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD INFIL                                                   
//*                                                                             
