//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W91042, W11604 OCH W33505                                          
//*  OCH SKAPAR ARTIKELFIL EFTER ATT HA RÄKNAT UT RETURNERBARHETEN              
//*  HOS ARTIKLAR.                                                              
//*                                                                             
//*  FREKVENS:     VECKA  RTN W461V1                                            
//*                                                                             
//*  ÅTERSTART:    W46119    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W116,                                                    
//             INDREG=&W910,                                                    
//             INDIN2=&W335..W461V1,                                            
//             INDUT=&W461..W461V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46119   EXEC PGM=V16459,PARM='W46119/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W46119D1 DD  DSN=&INDIN1..W11604(+0),DISP=SHR                                 
//************ ORDERTRÄFFS-FIL FRÅN RUTIN W261P1                                
//*                                                                             
//W46119D2 DD  DSN=&INDREG..W91042(+0),DISP=SHR                                 
//************ ARTIKELINFO FRÅN WDK6 OCH WDK7                                   
//*                                                                             
//W46119D3 DD  DSN=&INDIN2..W33505,DISP=SHR                                     
//************ SB FIL FRÅN WDC1                                                 
//*                                                                             
//W46119D4 DD  DSN=&INDUT..W46119(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKELINFO TILL W461J160 (BUYBACK-KOD MM)                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
