//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*         NORGE                                                               
//*  NOAC   IMPORTÖRSBEROENDE BEARBETNING                                       
//*         SKAPAR START OCH SLUT KORT                                          
//*                                                                             
//*  FREKVENS:         DAG    VECKA  BESTÄLLNING                                
//*                RTN W461D2 W461V1 W461B1                                     
//*                                                                             
//*  ÅTERSTART:    W46139     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P039 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=NULLFILE,                                                  
//             INDIN2=NULLFILE,                                                 
//             INDUT=NULLFILE                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46139   EXEC PGM=W46139                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46139D1 DD  DSN=&INDIN2..W476NO1,DISP=SHR                                    
//         DD  DSN=&INDIN..W46139,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//W46139D2 DD  DSN=&INDUT..W46159(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL VOLVO NORGE                                           
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
