//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NOAC NER-SYSTEM                                                            
//*  NUMRERING AV SERVICGRADSFIL                                                
//*                                                                             
//*  FREKVENS:     DAG    RTN W461D1                                            
//*                                                                             
//*  ÅTERSTART:    W46102     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D1,                                             
//             INDUT=&W461..W461D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46102   EXEC PGM=W46102                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46102D1 DD  DSN=&INDIN..W46118(+0),DISP=SHR                                  
//************ FAKTURAPOSTER TILL VIPS                                          
//*                                                                             
//W46102D2 DD  DSN=&INDUT..W46104(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SORTERAD OCH NUMRERAD FAKTURAPOSTFIL                             
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(2000,500),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
