//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TRANSACTIONS FROM VCAS TO THE BRASILIAN IMPORTER                           
//*                                                                             
//*  FREKVENS:         DAG    VECKA  BESTÄLLNING                                
//*                RNT W461D2 W461V1 W461B1                                     
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P0C7 PROC INDIN=&W461..W461D2                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//BRASIL   OUTPUT CLASS=B,FORMS=W001,DEST=(VOLCTA.R122)                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W46195(+0),DISP=SHR                                  
//SYSUT2   DD  SYSOUT=(,),OUTPUT=(*.BRASIL)                                     
