//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SERVICERADSINFO TILL IMPORTÖR                                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W461D1                                            
//*                                                                             
//*  ÅTERSTART:    W46106     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W092..W461D1,                                            
//             INDIN3=&W414..W461D1,                                            
//             INDUT=&W461..W461D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46106   EXEC PGM=W46106                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46106D1 DD  DSN=&INDIN2..W092ZP,DISP=SHR                                     
//************ SEVICEGRADSINFO TILL IMPORTÖR                                    
//         DD  DSN=&INDIN3..W4140G,DISP=SHR                                     
//************ WDR6 TRANSAR                                                     
//*                                                                             
//W46106D2 DD  DSN=&INDUT..W46109(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SERVIGRADSINFO MED SORTDEL                                       
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(10,3),RLSE)                       
//*                                                                             
//W46106D3 DD  DSN=&INDUT..W46110(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ POSTER TILL RS SERVICEGRADS UPPFÖLJNING                          
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(10,3),RLSE)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
