//*******************************************************                       
//*         KINA-C1                                                             
//*  NOAC   IMPORTÖRSBEROENDE BEARBETNING                                       
//*         SKAPAR START OCH SLUT KORT                                          
//*                                                                             
//*  FREKVENS:         DAG    VECKA                                             
//*                RTN W461D4 W461V1                                            
//*                                                                             
//*  ÅTERSTART:    W4613E     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *                   
//W461P03E PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D4,                                             
//             INDIN2=&W476..W461D4,                                            
//             INDUT=&W461..W461D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *                   
//W4613E   EXEC PGM=W4613E                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR               -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D2 DD  SYSOUT=*                                     -- POSTSUM          
//W4613ED1 DD  DSN=&INDIN2..W476CN2,DISP=SHR                                    
//         DD  DSN=&INDIN..W461CN1,DISP=SHR                                     
//*** ******INFIL                                                               
//*                                                                             
//W4613ED2 DD  DSN=&INDUT..W461CN4(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//*** ******UTFIL                                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *               
