//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*       UNGERN                                                                
//*  NOAC IMPORTÖRSBEROENDE BEARBETNING                                         
//*       SKAPAR START OCH SLUT KORT                                            
//*                                                                             
//*  FREKVENS:     DAG    VECKA  BESTÄLLNING                                    
//*            RNT W461D2 W461V1 W461B1                                         
//*                                                                             
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D2,                                             
//             INDIN2=&W476..W461D2,                                            
//             INDUT=&W461..W461D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46123   EXEC PGM=W46123                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR               -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46123D1 DD  DSN=&INDIN2..W476HU1,DISP=SHR                                    
//         DD  DSN=&INDIN..W46123,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//W46123D2 DD  DSN=&INDUT..W46143(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL UNGERN                                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
