//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*       PORTUGAL                                                              
//*  NOAC IMPORTÖRSBEROENDE BEARBETNING                                         
//*       SKAPAR START OCH SLUT KORT                                            
//*                                                                             
//*  FREKVENS:     VECKA  BESTÄLLNING                                           
//*            RNT W461V1 W461B1                                                
//*                                                                             
//*  ÅTERSTART:    W46134   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D1,                                             
//             INDUT=&W461..W461D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46134   EXEC PGM=W46134                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR               -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46134D1 DD  DSN=&INDIN..W4616N(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//W46134D2 DD  DSN=&INDUT..W46154(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL PORTUGAL                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(6160,(1800,500),RLSE)                  
//*                                                                             
//W46134D3 DD  DSN=&INDUT..W4615E(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL LOGGFIL OCH LISTA                                     
//             MGMTCLAS=&DEL2BKPC,SPACE=(6160,(1800,500),RLSE)                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
