//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W47920 OCH W44061 OCH SKRIVER UTFIL                                
//*                                                                             
//*  FREKVENS:     VECKA  RTN W461V1                                            
//*                                                                             
//*  ÅTERSTART:    W46108    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P008 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W479..W461V1,                                            
//             INDREG=&W440,                                                    
//             INDUT=&W461..W461V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46108   EXEC PGM=V16459,PARM='W46108/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W46108D1 DD  DSN=&INDIN1..W47920(+0),DISP=SHR                                 
//************ FIL MED RENSNINGSTRANSAR FRÅN W479P016                           
//*                                                                             
//W46108D2 DD  DSN=&INDREG..W44061(+0),DISP=SHR                                 
//************ SB FIL FRÅN RESTORDERREGISTER (W440P060)                         
//*                                                                             
//W46108D3 DD  DSN=&INDUT..W46108(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RENSNINGSTRANSAR TILL W461P020                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
