//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*         DANMARK                                                             
//*  NOAC   IMPORTÖRSBEROENDE BEARBETNING                                       
//*         SKAPAR START OCH SLUT KORT                                          
//*                                                                             
//*  FREKVENS:         DAG    VECKA  BESTÄLLNING                                
//*                RTN W461D2 W461V1 W461B1                                     
//*                                                                             
//*  ÅTERSTART:    W46140     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D2,                                             
//             INDIN2=&W476..W461D2,                                            
//             INDUT=&W461..W461D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46140   EXEC PGM=W46140                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46140D1 DD  DSN=&INDIN2..W476DK1,DISP=SHR                                    
//         DD  DSN=&INDIN..W46140,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//W46140D2 DD  DSN=&INDUT..W46163(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************* UTFIL TILL DANMARK                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
