//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NUMRERING AV ON-ORDER TRANSAKTIONER                                        
//*                                                                             
//*  FREKVENS:     DAG    RTN W461D1                                            
//*                                                                             
//*  ÅTERSTART:    W46163     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W092..W461D1,                                            
//             INDIN3=&W414..W461D1,                                            
//             INDUT=&W461..W461D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46163   EXEC PGM=W46163                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46163D1 DD  DSN=&INDIN2..W092X4,DISP=SHR                                     
//************ INPUT                                                            
//         DD  DSN=&INDIN3..W41409,DISP=SHR                                     
//************ WDR6 TRANSAR                                                     
//*                                                                             
//W46163D2 DD  DSN=&INDUT..W46164(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ NUMRERADE ON-ORDER TRANSAR                                       
//             MGMTCLAS=&DEL2BKPC,SPACE=(6233,(500,100),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
