//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NOAC NER-SYSTEM                                                            
//*  SUMMERING AV BRUTTOVIKT PER ORDER                                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W461D1                                            
//*                                                                             
//*  ÅTERSTART:    W46112     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=NONE,                                                      
//             INDUT=NONE                                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46112   EXEC PGM=W46112                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46112D1 DD  DSN=&INDIN..W46103(+0),DISP=SHR                                  
//************ FAKTURAPOSTER TILL VIPS                                          
//*                                                                             
//W46112D2 DD  DSN=&INDUT..W46118(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ OMSORTERAD OCH FIXAD FAKTURAPOSTFIL                              
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(2000,500),RLSE)                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
