//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TRANSACTIONS FROM VCAS TO THE PORTUGESE IMPORTER                           
//*                                                                             
//*  FREKVENS:         DAG    VECKA  BESTÄLLNING                                
//*                RNT W461D1 W461V1 W461B1                                     
//*                                                                             
//*  ÅTERSTART:    W46154   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P054 PROC INDIN=&W461..W461D1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W46154(+0),DISP=SHR                                  
//SYSUT2   DD  SYSOUT=(B,,W001),DEST=NJO00327                                   
