//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*          NOAC   KOMPLETTERING MED INFO FRÅN                                 
//*          URSPRUNGSBASEN (WDQ2)                                              
//*                                                                             
//*          FREKVENS:     DAG    RTN W461D1                                    
//*                                                                             
//*          ÅTERSTART:    W46110     NORMAL                                    
//*                                                                             
//*                        LÄSER   WDQ2                                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D1,                                             
//             INDUT=&W461..W461D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46110   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W46110,W46110,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,LRECL=6229,BLKSIZE=6233)                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46110D1 DD  DSN=&INDIN..W46104(+0),DISP=SHR                                  
//************ FAKTURAPOSTER                                                    
//*                                                                             
//         DD  DSN=&INDIN..W46107(+0),DISP=SHR                                  
//************ ORDERBEKRÄFTELSER                                                
//*                                                                             
//         DD  DSN=&INDIN..W46106(+0),DISP=SHR                                  
//************ BIPACKNINGSPOSTER                                                
//*                                                                             
//         DD  DSN=&INDIN..W46164(+0),DISP=SHR                                  
//************ ON ORDER TRANSAKTIONER                                           
//*                                                                             
//         DD  DSN=&INDIN..W46167(+0),DISP=SHR                                  
//************ BYPASS TRANSAKTIONER                                             
//*                                                                             
//W46110D2 DD  DSN=&INDUT..W46111(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERADE POSTER TILL VIPS                                   
//             MGMTCLAS=&BACKUPC,SPACE=(6233,(2000,500),RLSE)                   
//*                                                                             
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
