//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*         SCHWEIZ                                                             
//*  NOAC   IMPORTÖRSBEROENDE BEARBETNING                                       
//*         SKAPAR START OCH SLUT KORT                                          
//*                                                                             
//*  FREKVENS:         VECKA  BESTÄLLNING                                       
//*                RTN W461V1 W461B1                                            
//*                                                                             
//*  ÅTERSTART:    W46174     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D2,                                             
//             INDIN2=&W476..W461D2,                                            
//             INDUT=&W461..W461D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46174   EXEC PGM=W46174                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46174D1 DD  DSN=&INDIN2..W476CH2,DISP=SHR                                    
//         DD  DSN=&INDIN..W46174,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//W46174D2 DD  DSN=&INDUT..W46194(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL SCHWEIZ                                               
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
