//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*         AUSTRALIEN 7838                                                     
//*  NOAC   IMPORTÖRSBEROENDE BEARBETNING                                       
//*         SKAPAR START OCH SLUT KORT                                          
//*                                                                             
//*  FREKVENS:         DAG    VECKA  BESTÄLLNING                                
//*                RTN W461D4 W461V1 W461B1                                     
//*                                                                             
//*  ÅTERSTART:    W46180     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P080 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D4,                                             
//             INDIN2=&W476..W461D4,                                            
//             INDUT=&W461..W461D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46180   EXEC PGM=W46180                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46180D1 DD  DSN=&INDIN2..W476AU2,DISP=SHR                                    
//         DD  DSN=&INDIN..W46180,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//W46180D2 DD  DSN=&INDUT..W46185(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL AUSTRALIEN DISTR 7838                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
