//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*       JAPAN                                                                 
//*  NOAC IMPORTÖRSBEROENDE BEARBETNING                                         
//*       SKAPAR START OCH SLUT KORT                                            
//*                                                                             
//*  FREKVENS:     VECKA  BESTÄLLNING                                           
//*            RNT W461V1 W461B1                                                
//*                                                                             
//*  ÅTERSTART:    W46136   NORMAL                                              
//*                .                                                            
//*                DFUP   NORMAL                                                
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W461P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W461..W461D2,                                             
//             INDIN2=&W476..W461D2,                                            
//             INDUT=&W461..W461D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46136   EXEC PGM=W46136                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR               -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W46136D1 DD  DSN=&INDIN2..W476JP2,DISP=SHR                                    
//         DD  DSN=&INDIN..W46128,DISP=SHR                                      
//************ INFIL FRÅN W461P020 (DAG)                                        
//*                                                                             
//W46136D2 DD  DSN=&INDUT..W46156(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL JAPAN                                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W46136D3 DD  DSN=&INDUT..W4615G(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL TILL LOGGFIL OCH LISTA                                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
