//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BMP - UPPDATERAR PACKNINGSTRANSAR FöR pie PÅ WDP8                          
//*                                                                             
//*  FREKVENS:     DAG                  RTN W463S3                              
//*                                                                             
//*  ÅTERSTART:    W46352     KÖRS OM AV SYSTEMANSVARIG                         
//*                LÄSER      WDR4                                              
//*                UPDATERAR  WDP8 (OCH WDR4 FÖR CHKPOINT)                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P052 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W463..W463S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46352   EXEC PGM=DFSRRC00,                                                   
// PARM=('BMP,W46352,W46352,,,N00,,,,,&CPU,,,&IMS')                             
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                    -- POSTSUM           
//W46352D1 DD  DSN=&INDIN..W46336,DISP=SHR                                      
//************ PACKNINGSTRANS FRÅN PIE                                          
//*                                                                             
