//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERING DDGS-SALDO                                                     
//*                                                                             
//*                                                                             
//*  FREKVENS:     FLERA GÅNGER PER DAG  RTN W463S4                             
//*                                                                             
//*  ÅTERSTART:    W46341    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P041 PROC STPLIB=&INDRTE..LOAD,                                           
//*                                                                             
//             INDIN=&W463..W463S4,                                             
//             INDUT=&W463..W463S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46341   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W46341,W46341,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W46341D1 DD  DSN=&INDIN..W46343(+0),DISP=SHR                                  
//************ DDGS SALDOPSTER                                                  
//*                                                                             
//W46341D2 DD  DSN=&INDUT..W46344(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ KVITTOFIL TILL LEVERANTÖR VIA D&P                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
