//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SELEKTERAR FÖRSENADE NDC-/DDC-LEVERANSER TILL FIL                          
//*                                                                             
//*  FREKVENS:     VECKA     RTN W463D1                                         
//*                                                                             
//*  ÅTERSTART:    W46380    NORMAL                                             
//*                LÄSER     WDQ3 WDE4                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P080 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W463..W463D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46380   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W46380,W46380,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W46380D1 DD  DSN=&INDUT..W46380(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FÖRSENADE NDC RADER                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(27998,(3,3),RLSE)                      
//*                                                                             
//W46380D2 DD  DSN=&INDUT..W46382(+1),DISP=(NEW,CATLG,DELETE), -LIM(25)         
//************ FÖRSENADE DDC RADER                                              
//             MGMTCLAS=&DEL2BKPC,SPACE=(27998,(3,3),RLSE)                      
//*                                                                             
