//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER HELA WDR6 OCH SELEKTERAR DDGS-HÄNDELSER                              
//*  SKAPAR FILER FÖR RENSNING AV WDR6,                                         
//*  SAMT FÖR UPPFÖLJNING DDGS                                                  
//*                                                                             
//*  FREKVENS:     DAG       RTN W463D4                                         
//*                                                                             
//*  ÅTERSTART:    W46378    NORMAL (SB)                                        
//*                LÄSER     WDR6                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W463..W463D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46378   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W46378,W46378,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR6     INCLUDE MEMBER=WDR6                                                  
//*                                                                             
//W46378D1 DD  DSN=&INDUT..W46378(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ POSTER FÖR RENSNING AV WDR6                                      
//             SPACE=(227,(25,5),RLSE),AVGREC=K,                                
//             MGMTCLAS=&BACKUPC                                                
//W46378D2 DD  DSN=&INDUT..W46377(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ POSTER TILL UPPFÖLJNING DDGS                                     
//             SPACE=(200,(25,5),RLSE),AVGREC=K,                                
//             MGMTCLAS=&BACKUPC                                                
