//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VIPS CUSTUBER RECORDS TO DIRECT BUSINESS SUPLIER VIA                       
//*  IMS ADVANSYS                                                               
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W463V1                                         
//*                                                                             
//*  RESTART:      W46364      NORMAL                                           
//*                READS        WDB7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W463,                                                    
//             INDUT=&W463..W463V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46364   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W46364,W46364,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB7     INCLUDE MEMBER=WDB7                                                  
//*                                                                             
//W46364D1 DD  DSN=&INDREG..W46363(+0),DISP=SHR                                 
//************ SERIENUMBER FILE, FOR SENDING.                                   
//*                                                                             
//W46364D2 DD  DSN=&INDREG..W46363(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ SERIENUMBER FILE OUT                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W46364D3 DD  DSN=&INDUT..W46368(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ CUSTOMER RECORDS TO BE SENT VIA VCOM                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
