//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA PÅ INTERNA DISTIKT OCH SOFTWARE ORDER                                
//*                                                                             
//*  FREKVENS:     MÅNAD          RTN W463M1                                    
//*                                                                             
//*  ÅTERSTART:    W46337    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P037 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463M1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W463PD37),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W46338,DISP=SHR                                      
//************ FIL FRÅN PIE                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W46338,DISP=(NEW,PASS,DELETE),                             
//************ SORTAD PIE FIL                                                   
//         SPACE=(59,(5000,500),RLSE),AVGREC=U                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46337   EXEC PGM=V16459,PARM='W46337/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W46337D1 DD  DSN=&&W46338,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD INFIL                                                   
//*                                                                             
//W46337D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W46337  LISTA                                                    
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
