//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPPACKNING AV EDI (DESADV) TRANSAR DDGS.                                  
//*                                                                             
//*  FREKVENS:     DAG     RTN W463S9                                           
//*                                                                             
//*  ÅTERSTART:    W46355    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P055 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463S9,                                             
//             INDUT=&W463..W463S9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46355   EXEC PGM=W46355                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W46355D1 DD  DSN=&INDIN..W46355,DISP=SHR                                      
//************ EDI INHOUSE FORMAT                                               
//*                                                                             
//W46355D2 DD  DSN=&INDUT..W46356(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UPPACKAD EDIFIL                                                  
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//************ EDI-LOGG                                                         
//W46355D3 DD  DSN=&INDUT..W4635A(+1),                        -LIM(255)         
//             DISP=(NEW,CATLG,DELETE),                                         
//             SPACE=(200,(50,10),RLSE),AVGREC=K,                               
//             MGMTCLAS=&NOBACKUP                                               
