//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FELMAIL DDGS BRUTTOVIKT                                                    
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W463S9                             
//*                                                                             
//*  ÅTERSTART:    W4635C    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P05C PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463S9,                                             
//             INDUT=&W463..W463S9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4635C   EXEC PGM=W4635C                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W4635CD1 DD  DSN=&INDIN..W4635D(+0),DISP=SHR                                  
//************ JUSTERADE DDGS-KOLLI                                             
//*                                                                             
//W4635CD2 DD  DSN=&INDUT..W4635E(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ REDIGERAD MAILFIL TILL D&P                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
