//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER IN FELPOSTER OCH EDIPOSTER, TAR BORT ALLA                            
//*  FELAKTIGA PRODUKTIONSNUMMER                                                
//*                                                                             
//*  FREKVENS:     DAG     RTN W463S9                                           
//*                                                                             
//*  ÅTERSTART:    W46358    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P058 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463S9,                                             
//             INDUT=&W463..W463S9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46358   EXEC PGM=W46358                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W46358D1 DD  DSN=&INDIN..W46357(+0),DISP=SHR                                  
//************ INFIL-EDI                                                        
//*                                                                             
//W46358D2 DD  DSN=&INDIN..W46358(+0),DISP=SHR                                  
//************ INFIL-FELPOST                                                    
//*                                                                             
//W46358D3 DD  DSN=&INDUT..W46359(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL-EDI                                                        
//             SPACE=(986,(300,233),RLSE),AVGREC=U,                             
//             MGMTCLAS=&NOBACKUP                                               
//W46358D4 DD  DSN=&INDUT..W46354(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ UTFIL-FELPOSTER                                                  
//             SPACE=(986,(300,233),RLSE),AVGREC=U,                             
//             MGMTCLAS=&BACKUPC                                                
