//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DIRECT BUSINESS, CONTROL OF RECEIVED FILES. THE ROUTIN                     
//*  CAN BE STOPED AFTER THIS PROCEDURE, IF SER.ERROR OCCUR                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W463D6                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W46361    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P061 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W463,                                                    
//             INDIN=&W463..W463D6,                                             
//             INDUT=&W463..W463D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W463PD61),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W46361,DISP=SHR                                      
//************ BILLING TRANSAR                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W46361,DISP=(NEW,PASS,DELETE),                             
//************ SORTADE BILLING TRANSAR                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46361   EXEC PGM=W46361                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W46361D1 DD  DSN=&&W46361,DISP=(OLD,DELETE,DELETE)                            
//************ SORTADE BILLING TRANSAR                                          
//*                                                                             
//W46361D2 DD  DSN=&INDREG..W46362(+0),DISP=SHR                                 
//************ SERIENUMBER FOR DIRECT BUSINESS RECIEVED FILES.                  
//*                                                                             
//W46361D3 DD  DSN=&INDREG..W46362(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ SERIENUMBER, OUTPUT.                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W46361D4 DD  DSN=&INDUT..W46364(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ SERIENUMBER ERROR OR CORRUPTED FILES.                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W46361D5 DD  DSN=&INDUT..W46365(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ERROR RECORDS FOR RETURN TO IMS ADVANSYS                         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W46361D6 DD  DSN=&INDUT..W46366(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ CORRECT RECORDS FOR NEXT JOB                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
