//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DIRECT BUSINESS RECORDS ARE CONTROLLED AGAINST VIPS                        
//*  CUST. DB.                                                                  
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W463D6                                         
//*                                                                             
//*  RESTART:      W46362      NORMAL                                           
//*                READS        WDB7                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463D6,                                             
//             INDUT=&W463..W463D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46362   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W46362,W46362,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB7     INCLUDE MEMBER=WDB7                                                  
//*                                                                             
//W46362D1 DD  DSN=&INDIN..W46366(+0),DISP=SHR                                  
//************ RECORDS TO CONTROL AGAINST VIPS CUST DB                          
//*                                                                             
//W46362D2 DD  DSN=&INDUT..W46367(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ CORRECT RECORSD TO BE SENT TO SC.                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W46362D3 DD  DSN=&INDUT..W46365(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ ERROR RECORDS TO BE RETURNED TO IMS ADVANSYS                     
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
