//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄGGER UPP ANNULATIONSTRANSAR FÖR MJUKA ARTIKLAR                           
//*  PÅ DISPATCHERN.                                                            
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W463S6                             
//*                BATCHRUTIN            RTN W463D2                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W46382    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W463P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W463..W463S6,                                             
//             CPU=1                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W463PD82),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W46381(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W46381,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD INFIL                                                   
//         SPACE=(53,(10,330),RLSE),AVGREC=U                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W46382   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W46382,W46382,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W46382D1 DD  DSN=&&W46381,DISP=(OLD,PASS)                                     
//************ SORTERAD INFIL                                                   
//*                                                                             
