//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*   KOPIERA LEVERANSBESKED                                          *         
//*                                                                   *         
//*   PERIODICITET: DAILY        RTN W463S8                           *         
//*                                                                   *         
//*   ÅTERSTART:    NORMAL                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W463P08X PROC INDIN=&W463..W463S8,                                            
//             INDUT=&W463..W463S8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY    EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W46386(+0),DISP=SHR                                  
//************ LEVERANSBESKED                                        ***        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W46388(+1),                        -LIM(255)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ KOPIA LEVERANSBESKED, LOGG-POSTER                                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
