//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VCAS, PACKNINGSRAPPORTERING; EMBALLAGEPROFORMA               *         
//*                                                                   *         
//*      PERIODICITET: DAG   RTN W473D1                               *         
//*                                                                   *         
//*      ÅTERSTART:   NORMAL                                          *         
//*                                                                   *         
//*                   W47392 LÄSER WDB2                               *         
//*                                                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W473P092 PROC INDIN=&W473..W473D1,                                            
//             INDUT=&W473..W473D1,                                             
//             INDREG=&W473,                                                    
//             MBR=W47392,PSB=W47392,                                           
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47392  EXEC PGM=DFSRRC00,                                                    
//             PARM='&DBB,&MBR,&PSB,,00'                                        
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES           (ABEND)                      
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR               (DATKORT)          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        (DATKORT)          
//DATUT    DD  SYSOUT=*                                      (DATKORT)          
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//*                                                                             
//W47392D1 DD  DSN=&INDIN..W47390(+0),DISP=SHR                                  
//************** EMB-PROF TRANSAR SVERIGE KLASS 4                   ***         
//         DD  DSN=&INDIN..W47394(+0),DISP=SHR                                  
//************** EMB-PROF TRANSAR EXPORT                            ***         
//*                                                                             
//W47392D2 DD  DSN=&INDREG..W4739B(+0),DISP=SHR                                 
//************** NUMMERSERIE TILL EMB-PROFORMA                      ***         
//*                                                                             
//W47392D3 DD  DSN=&INDUT..W4739A(+1),                         -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************* EMB-PROF TRANSAR TILL VOLVO TRANSPORT  CDC         ***          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W47392D4 DD  DSN=&INDREG..W4739B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************** NUMMERSERIE TILL EMB-PROFORMA                      ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//WDB6     INCLUDE MEMBER=WDB6                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
