//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      RS, PACKNINGSRAPPORTERING: EMBALLAGEPROFORMA +               *         
//*                                 "PACKSEDEL"-LISTTRANSAR  SKAPAS   *         
//*                                                                   *         
//*      PERIODICITET: DAG    RTN W473D1                              *         
//*                                                                   *         
//*      ÅTERSTART:   NORMAL                                          *         
//*                                                                   *         
//*                   W47390 LÄSER WDE6 WDE4                          *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W473P090 PROC INDIN=&W092..W473D1,INDUT=&W473..W473D1,                        
//             MBR=W47390,PSB=W47390,                                           
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47390  EXEC PGM=DFSRRC00,                                                    
//             PARM='&DBB,&MBR,&PSB,,00'                                        
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VBS,LRECL=1400,BLKSIZE=1408,BUFNO=1)            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                             (POSTSUM)                   
//*                                                                             
//W47390D1 DD  DSN=&INDIN..W092ZW,DISP=SHR                                      
//************** FÄRDIGPACKADE ORDER SVERIGE KLASS 4                ***         
//*                                                                             
//W47390D3 DD  DSN=&INDUT..W47390(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** FIL MED EMBALLAGE-PROFORMA-POSTER-SV-KLASS4        ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
