//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO CONVERT TO XML FORMAT                                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W473D1                                         
//*                                                                             
//*  RESTART:      W47393    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W473P093 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W473..W473D1,                                             
//             INDUT=&WUT..W473D1                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47393   EXEC PGM=W47393                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47393D1 DD  DSN=&INDIN..W4739A(+0),DISP=SHR                                  
//************ INPUT FILE                                                       
//*                                                                             
//W47393D2 DD  DSN=&INDUT..W47393(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ OUTPUT FILE                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
