//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PACKNING KOLLI TILL SVENSKA ÅF                                             
//*  KOPIERING AV PACKNINGSINFO. FIL                                            
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W473S1                              
//*                                                                             
//*  ÅTERSTART:    W47301   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W473P002 PROC INDIN=&WUT..W473S1,INDUT=&W473..W473S1                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W47301(+0),DISP=SHR                                  
//SYSUT2   DD  DSN=&INDUT..W47302(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//*            KOPIA AV PACKNINGSINFO. FIL SVENSKA ÅF                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//************************************************************                  
