//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RS, PACKNINGSRAPPORTERING:PRINTNING EMBALLAGEPROFORMA                      
//*                                                                             
//*  FREKVENS:     DAG    RTN W473D1                                            
//*                                                                             
//*  ÅTERSTART:    W47396   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W473P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W473..W473D1,                                             
//             DEST1=&CPRINT                                                    
//W47396   EXEC PGM=V16459,PARM='W47396/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W47396D1 DD  DSN=&INDIN..W47398(+0),DISP=SHR                                  
//************ FRÅN W473P008, EMB-PROFORMA DC                                   
//*                                                                             
//*47396D3 DD  SYSOUT=(A,,8DUB),DEST=&DEST1                                     
//W47396D3 DD  DUMMY                                                            
//************ W47392-001  LISTA EMBALLAGEPROFORMA C1 (FORM = 8076 A-D)         
//*                                                                             
