//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  POSTER FÖR EMBALLAGE-PROFORMA EXPORT, SKAPAS                               
//*                                                                             
//*  FREKVENS:     DAG    RTN W473D1                                            
//*                                                                             
//*  ÅTERSTART:    W47394   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W473P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W473D1,                                             
//             INDUT=&W473..W473D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47394   EXEC PGM=W47394                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W47394D1 DD  DSN=&INDIN..W47628,DISP=SHR                                      
//************ ORDERIDENTITET EMBALLAGE-PROF, EXPORT                            
//*                                                                             
//W47394D2 DD  DSN=&INDUT..W47394(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ EMBALLAGE-PROF, EXPORT                                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
