//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR MÅNATLIG TULLISTA FÖR ALL EXPORT FRÅN SDC21 (NL)                    
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W475M1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W47551    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W475P051 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W475..W475M1,                                             
//             INDIN2=&W510..W475M1,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W475PD51),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W4758T,DISP=SHR                                      
//************ SDC21:S TULLFIL                                                  
//         DD  DSN=&INDIN2..W51046,DISP=SHR                                     
//************ HOLLÄNDSK TULLSUMMERING FRÅN EKONOMI (AVVIKELSER)                
//*                                                                             
//SORTOUT  DD  DSN=&&W4758T,DISP=(NEW,PASS,DELETE),                             
//************ TULLFIL SORTERAD PÅ STATNR                                       
//         SPACE=(6233,(50,10),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47551   EXEC PGM=V16459,PARM='W47551/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//OUT1  OUTPUT CLASS=A,FORMS=3803,FORMDEF=SLSR6C,PAGEDEF=SLSR6C                 
//*                                                                             
//W47551D1 DD  DSN=&&W4758T,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP TULLFIL SORTERAD PÅ STATNR                                  
//*                                                                             
//W47551D2 DD  SYSOUT=(,),OUTPUT=(*.OUT1),DEST=&DEST1                           
//************ W47551-001    LISTA PER STATNR                                   
//************ W47551-001NL  LISTA PER STATNR                                   
//*                                                                             
