//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR TULLISTA FÖR DISTRIKT 8032                                          
//*                                                                             
//*  FREKVENS:     MÅNAD     RTN W475M1                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W47549    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W475P049 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W510..W475M1,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W475PD43),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W51046,DISP=SHR                                     
//************ 8032:S AVVIKELSER FRÅN EKONOMI (SUPER-TRANS)                     
//*                                                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W47588,DISP=(NEW,PASS,DELETE),                             
//************ TULLFIL SORTERAD PÅ STATNR                                       
//         SPACE=(6233,(50,10),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47549   EXEC PGM=V16459,PARM='W47549/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//OUT1  OUTPUT CLASS=A,FORMS=3803,FORMDEF=SLSR6C,PAGEDEF=SLSR6C                 
//*                                                                             
//W47549D1 DD  DSN=&&W47588,DISP=(OLD,DELETE,DELETE)                            
//************ TEMP TULLFIL SORTERAD PÅ STATNR                                  
//*                                                                             
//W47549D2 DD  SYSOUT=(,),OUTPUT=(*.OUT1),DEST=&DEST1                           
//************ W47549-001   LISTA MED FAKTURASUM DIST 8032                      
//************ W47549-001NL LISTA MED FAKTURASUM DIST 8032                      
//*                                                                             
