//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *             
//*                                                                             
//*  LÄSER  FAKTURAFIL, SKAPAR FIL TILL INLEVERANS                              
//*  MED FAKTURERADE SATSER.                                                    
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W476S5                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W47692    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *             
//W476P092 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476S5,                                             
//             INDUT=&W476..W476S5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *             
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W476PD92),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W4765H,DISP=SHR                                      
//************ KOPIA AV FAKTURAFIL                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W4765H,DISP=(NEW,PASS,DELETE),                             
//***********  FAKTURAFIL, SORTERAD                                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * *                         
//W47692   EXEC PGM=W47692                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     --                  
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    --                  
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    --                  
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W47692D1 DD  DSN=&&W4765H,DISP=(OLD,DELETE,DELETE)                            
//************ FAKTURAFIL, SORTERAD                                             
//*                                                                             
//W47692D2 DD  DSN=&INDUT..W47692(+1),DISP=(NEW,CATLG,DELETE),                  
//************ FAKTURERADE SATSER, FIL TILL INLEVERANS                          
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
