//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TAR IN FIL FRÅN RUTIN W476ST OCH SKAPAR EN EDI-FIL MED KOLLIUPPG.          
//* TILL OLIKA TRANSPORTÖRER VIA AMTRIX TILL POSTEN IT.                         
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W476SE                             
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W47641    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476SE,                                             
//             INDUT=&W476..W476SE                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W476PD41),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47640,DISP=SHR                                      
//************ KOLLIUPPGIFTER FRÅN AVSL. SKEPPN.                                
//*                                                                             
//SORTOUT  DD  DSN=&&W47640,DISP=(NEW,PASS,DELETE),                             
//************ KOLLIUPPGIFTER, SORTERADE                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47641   EXEC PGM=W47641                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                    -- ABEND         
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W47641D1 DD  DSN=&&W47640,DISP=(OLD,DELETE,DELETE)                            
//************ KOLLIUPPGIFTER, SORTERADE                                        
//*                                                                             
//W47641D2 DD  DSN=&INDUT..W47641(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOLLIUPPGIFTER FÖR EDI ÖVERFÖRING TILL DIV. TRANSP.              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
