//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DHL KOLLIINFO                                                              
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W476SD                                         
//*                                                                             
//*  RESTART:      W47645      NORMAL                                           
//*                READS        WDR4 WDE6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W476..W476SD                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47645   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47645,W47645,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR4     INCLUDE MEMBER=WDR4                                                  
//WDE6     INCLUDE MEMBER=WDE6                                                  
//W47645D1 DD  DSN=&INDUT..W47645A(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)         
//************ EDI                                                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W47645D2 DD  DSN=&INDUT..W47645B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ DHL LISTA                                                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W47645D3 DD  DSN=&INDUT..W47645C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ RENSNINGS POSTER                                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
