//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DELETE OF KOLLIN SOM HAR FÅTT DHL KOLLIFLAGGA I PACKININGEN                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W476SD                                         
//*                                                                             
//*  RESTART:      W47646    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P046 PROC STPLIB=&INDRTE..LOAD,CPU=1,                                     
//             INDIN=&W476..W476SD                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47646   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W47646,W47646,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47646D1 DD  DSN=&INDIN..W47645C(+0),DISP=SHR                                 
//************ RENSNINGSFIL SOM SKAPAS I PGM W47645                             
//*                                                                             
