//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER TRANSAR FRÅN WDR7 OCH SKRIVER FILER                                  
//*        DEALER-FAKTUROR TILL VIPS                                            
//*                                                                             
//*  FREKVENS:     DAG    RTN W476V2                                            
//*                                                                             
//*  ÅTERSTART:    W47642                                                       
//*                LÄSER  WDR7                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W476..W476V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47642   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47642,W47642,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR7     INCLUDE MEMBER=WDR7                                                  
//*                                                                             
//W47642D1 DD  DSN=&INDUT..W47642(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PROFORMA-FAKTUROR USA TILL VIPS OSV.                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47642D2 DD  DSN=&INDUT..W47647(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ TRANSAR TILL WDR7-RENSNING                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
