//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PACKNINGSINFO TILL TRANSPORTÖRER                                           
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W476SP                           
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W4764P    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P04P PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476SP,                                             
//             INDUT=&W476..W476SP                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W476PD4P),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W4764O(+0),DISP=SHR                                  
//************ PACKNINGSINFO                                                    
//SORTOUT  DD  DSN=&&W4764O,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE D+K+O-PNR+KOLLI                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4764P   EXEC PGM=W4764P                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W4764PD1 DD  DSN=&&W4764O,DISP=(OLD,DELETE,DELETE)                            
//************ PACKNINGSINFO                                                    
//*                                                                             
//W4764PD2 DD  DSN=&INDUT..W4764P(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ PACKNINGSINFO TILL TRANSP.                                       
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
