//* * * * * * * * * * * * * * * * * * * * * * * * * * *                         
//*                                                                             
//*  KÖR ETT EPLUSPROGRAM                                                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W476DA                                            
//*                                                                             
//*  ÅTERSTART:    W47683   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * *                         
//*                                                                             
//W476P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476DA,                                             
//             INDUT=&W476..W476DA                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * *                         
//*                                                                             
//W47683   EXEC PGM=V16459,PARM='W47683/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W47683DZ DD  DSN=&INDIN..W4768Z,DISP=SHR                                      
//************ FIL FRÅN W4765100                                                
//*                                                                             
//W47683D1 DD  DSN=&INDUT..W47683(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ FIL TILL EXCEL                                                   
//*                                                                             
//             DCB=(RECFM=FB,LRECL=120,BLKSIZE=4000),                           
//             MGMTCLAS=&BACKUPC,SPACE=(4000,(10,10),RLSE)                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
