//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  SKAPAR FILER TILL RESPEKTIVE IMPORTÖR                            *         
//*                                                                   *         
//*  FREKVENS:         DAG                                            *         
//*                RTN W476S7                                         *         
//*                                                                   *         
//*  ÅTERSTART:    W47618     NORMAL                                  *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P118 PROC STPLIB=&INDRTE..LOAD,                                           
//             DSIN=&W476..W476S7.W4766B(+0),                                   
//             INDUT=&W476..W476S7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47618   EXEC PGM=W47618                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(0),DISP=SHR                -- DATKORT         
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        -- DATKORT         
//DATUT    DD  SYSOUT=*                                      -- DATKORT         
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W47618D1 DD  DSN=&DSIN,DISP=SHR                                               
//************                                                                  
//W47618D3 DD  DSN=&INDUT..W476IT7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL ITALIEN KORTFORMAT (27)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618D4 DD  DUMMY                                                            
//************ FIL TILL FINLAND KORTFORMAT (29)                                 
//*                                                                             
//W47618D5 DD  DUMMY                                                            
//************ FIL TILL BELGIEN KORTFORMAT (30)                                 
//*                                                                             
//W47618D6 DD  DSN=&INDUT..W476CH7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL SCHWEIZ DISTR 2078 KORTFORMAT (72)                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618D7 DD  DUMMY                                                            
//************ FIL TILL BRASIL DISTR ????  (2L)                                 
//*                                                                             
//W47618D8 DD  DSN=&INDUT..W476US7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL USA     KORTFORMAT. (38)                                
//************ SKAPAS ENBART I VECKORUTIN W461J120.                             
//************ I DAGLIGT JOBB W461J020 LIGGER DUMMY                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618D9 DD  DUMMY                                                            
//************ FIL TILL TYSKLAND KORTFORMAT (71)                                
//*                                                                             
//W47618DA DD  DSN=&INDUT..W476NL7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL HOLLAND KORTFORMAT (61)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DB DD  DSN=&INDUT..W476ES7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL SPANIEN KORTFORMAT (79)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DC DD  DSN=&INDUT..W476AT7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL ÖSTERRIKE    KORTFORMAT (68)                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DD DD  DUMMY                                                            
//************ FIL TILL SAUDI KORTFORMAT  (78)                                  
//*                                                                             
//W47618DE DD  DUMMY                                                            
//************ FIL TILL PERU KORTFORMAT (76)                                    
//*                                                                             
//W47618DF DD  DSN=&INDUT..W476FR7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL FRANKRIKE KORTFORMAT (73)                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DG DD  DSN=&INDUT..W476SE7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL VSBAB KORTFORMAT (70)                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DH DD  DUMMY                                                            
//************ FIL TILL DANMARK KORTFORMAT  (40)                                
//*                                                                             
//W47618DI DD  DUMMY                                                            
//************ FIL TILL NORGE KORTFORMAT (39)                                   
//*                                                                             
//W47618DJ DD  DSN=&INDUT..W476CH8(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL SCHWEIZ KORTFORMAT (74)                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DK DD  DUMMY                                                            
//************ FIL TILL BRASILIEN KORTFORMAT(75)                                
//*                                                                             
//W47618DL DD  DSN=&INDUT..W476AU7(+1),                       -LIM(20)          
//            DISP=(NEW,CATLG,DELETE),                                          
//************ FIL TILL AUSTRALIEN    KORTFORMAT DIST 7836 (31)                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DM DD  DSN=&INDUT..W476AU8(+1),                       -LIM(20)          
//            DISP=(NEW,CATLG,DELETE),                                          
//************ FIL TILL AUSTRALIEN    KORTFORMAT DIST 7838 (80)                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DN DD  DUMMY                                                            
//************ FIL TILL FINLAND-1091 KORTFORMAT (2Z)                            
//*                                                                             
//W47618DO DD  DUMMY                                                            
//************ FIL TILL TAIWAN    KORTFORMAT DIST 6221 (34)                     
//*                                                                             
//W47618DP DD  DSN=&INDUT..W476JP7(+1),                       -LIM(20)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL JAPAN     KORTFORMAT DIST 5222 (2H)                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DQ DD  DUMMY                                                            
//************ FIL TILL TAIWAN2   KORTFORMAT DIST 6222 (2A)                     
//*                                                                             
//W47618DS DD  DSN=&INDUT..W476JP8(+1),                       -LIM(20)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL JAPAN  KORTFORMAT DIST 5220 (28)                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DT DD  DSN=&INDUT..W476UK7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL ENGLAND NC KORTFORMAT DISTR 1378  (2B)                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DU DD  DUMMY                                                            
//************ FIL TILL POLEN   NC KORTFORMAT DISTR 2870 2878 (2C)              
//*                                                                             
//W47618DV DD  DSN=&INDUT..W476CA7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL CANADA  NC KORTFORMAT DISTR 7674 8751 (2D)              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DW DD  DSN=&INDUT..W476US8(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL USA  NC KORTFORMAT DISTR 7574 8741 8742 8743(2E)        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618DX DD  DUMMY                                                            
//************ FIL TILL KOREA  NC KORTFORMAT DISTR 6121 6124  (2F)              
//*                                                                             
//W47618DY DD  DUMMY                                                            
//************ FIL TILL PORTUGAL NC KORTFORMAT DISTR 1978 (2G)                  
//*                                                                             
//W47618DZ DD  DUMMY                                                            
//************ FIL TILL MEXICO DISTR ???? (2M)                                  
//*                                                                             
//W47618E1 DD  DUMMY                                                            
//************ FIL TILL MALAYSIA NC KORTFORMAT DISTR 6251 (2I)                  
//*                                                                             
//W47618E2 DD  DUMMY                                                            
//************ FIL TILL THAILAND NC KORTFORMAT DISTR 5619 (2J)                  
//*                                                                             
//W47618E3 DD  DSN=&INDUT..W476IR7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL IRLAND DISTR 1778 (2K)                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618E4 DD  DUMMY                                                            
//************ FIL TILL TURKIET DISTR 5811 (2N)                                 
//*                                                                             
//W47618E5 DD  DSN=&INDUT..W476RU7(+1),                        -LIM(20)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ FIL TILL RYSSLAND DISTR 2640                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47618E6 DD  DUMMY                                                            
//************ FIL TILL KINA DISTR  (CN1)                                       
//*                                                                             
//W47618E7 DD  DUMMY                                                            
//************ FIL TILL SYDAFRIKA DISTR  (ZA1)                                  
//*                                                                             
//W47618E8 DD  DUMMY                                                            
//************ FIL TILL PORTUGAL DISTR  (PT2)                                   
//*                                                                             
//W47618E9 DD  DUMMY                                                            
//************ FIL TILL KINA DISTR  (CN2)                                       
//*                                                                             
//W47618EA DD  DSN=&INDUT..W476IN7(+1),                       -LIM(20)          
//            DISP=(NEW,CATLG,DELETE),                                          
//************ FIL TILL INDIEN        KORTFORMAT DIST 6010 (26)                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//*                                                                             
//W47618EB DD  DUMMY                                                            
//************ FIL TILL TJECKIEN      KORTFORMAT DIST 2365 (22)                 
//*                                                                             
//W47618EC DD  DUMMY                                                            
//************ FIL TILL UNGERN        KORTFORMAT DIST 2364 (23)                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
