//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER TRANSAR FRÅN WDR7 OCH SKRIVER FILER                                  
//*                                                                             
//*  FREKVENS:     DAG    RTN W476D1                                            
//*                                                                             
//*  ÅTERSTART:    W47624                                                       
//*                LÄSER  WDR7                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P024 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W476..W476D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47624   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47624,W47624,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR7     INCLUDE MEMBER=WDR7                                                  
//WDE1     INCLUDE MEMBER=WDE1                                                  
//*                                                                             
//W47624D1 DD  DSN=&INDUT..W47624(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DIV. POSTTYPER (EXP, EMB, VR, BROKER)                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47624D2 DD  DSN=&INDUT..W47629B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ TRANSAR TILL WDR7-RENSNING                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
