//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STARTAS FRÅN BILD 4632  VIA SOP O SKAPAR EN UTFIL                          
//*  MED UPGIFTER FRÅN WDE1 OCH WDB2                                            
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W476ST                             
//*                                                                             
//*  ÅTERSTART:    W47640      NORMAL                                           
//*                LÄSER        WDE1 WDB2                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W476..W476ST                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47640   EXEC PGM=DFSRRC00,REGION=6M,                                         
//             PARM=('&DBB,W47640,W47640,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                    -- ABEND         
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDE1     INCLUDE MEMBER=WDE1                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//W47640D1 DD  DUMMY                                                            
//************ INDATA FRÅN BILD 4632 (OVERRIDE I JCL)                           
//*                                                                             
//W47640D2 DD  DSN=&INDUT..W47640(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INFO TILL DIV. TRANSP.                                           
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
