//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER SORTERAD FIL OCH PLOCKAR BORT DUBBLA POSTER                          
//*                                                                             
//*  FREKVENS:     DAG         RTN W476D7                                       
//*                                                                             
//*  ÅTERSTART:    W47653      NORMAL                                           
//*                LÄSER       W47653                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P053 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476D7,                                             
//             INDUT=&W476..W476D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47653S  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W476PD53),DISP=SHR                         
//*  PER (FAKT,DIST,KUND,ORDER,PRODNR,KOLLI,RAD,RECTYP)                         
//SORTIN   DD  DSN=&INDIN..W4765A,DISP=SHR                                      
//SORTOUT  DD  DSN=&&W4765A,DISP=(NEW,PASS,DELETE),                             
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47653   EXEC PGM=W47653                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47653D1 DD  DSN=&&W4765A,DISP=(OLD,DELETE,DELETE)                            
//************ INDATA FRÅN W4765100                                             
//*                                                                             
//W47653D2 DD  DSN=&INDUT..W47653(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DEALERFAKTUROR TILL VIPS                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
