//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSNING WDR4                                                              
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W476S4                                         
//*                                                                             
//*  RESTART:      W47644    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476S4,CPU=1                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47644   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W47644,W47644,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47644D1 DD  DSN=&INDIN..W47643B(+0),DISP=SHR                                 
//************ RENSNINGSPOSTER WDGX4504                                         
//*                                                                             
