//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR FILEN W47650                                                      
//*                                                                             
//*  FREKVENS:     DAG     RTN W476D5                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P048 PROC INDIN=&W476..W476D5,                                            
//             INDUT=&W476..W476D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W47650(+0),DISP=SHR                                  
//************ FAKTURAINFO                                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W47650C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURAINFO                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
