//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER TRANSAR FRÅN WDR4 OCH SKRIVER FILER                                  
//*        INVOICE INFO COD/IMP VIPS                                            
//*        SAMT FÖR UPPDATERING AV  WDK6/WDK7/WDL9                              
//*                                                                             
//*  FREKVENS:     DAG    RTN W476S5                                            
//*                                                                             
//*  ÅTERSTART:    W47668    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W476..W476S5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47668   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W47668,W47668,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W47668D1 DD  DSN=&INDUT..W47668(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INVOICE INFO COD / IMP                                           
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668D3 DD  DSN=&INDUT..W47670(+1),                         -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ INVOICE INFO POLEN                                               
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668D4 DD  DSN=&INDUT..W47656(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INVOICE INFO SCHWEIZ                                             
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668D5 DD  DSN=&INDUT..W4766A(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INVOICE INFO REFILL                                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47668D6 DD  DSN=&INDUT..W47674(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INVOICE INFO RETURER                                             
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668D7 DD  DSN=&INDUT..W47665(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INVOICE INFO TILL ARTIKEL-UPPDAT                                 
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668D8 DD  DSN=&INDUT..W4765H(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ INVOICE INFO FÖR SATSER TILL INLEV.                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47668D9 DD  DSN=&INDUT..W4766AR(+1),DISP=(NEW,CATLG,DELETE),                 
//************ INVOICE INFO ATT KONVERTERA TILL REFILL                          
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47668DA DD  DSN=&INDUT..W4766AS(+1),DISP=(NEW,CATLG,DELETE),                 
//************ INVOICE INFO ATT KONVERTERA TILL REFILL                          
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
