//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA                                                               
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W476SD                             
//*                                                                             
//*  ÅTERSTART:    W4764B    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P04B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W476..W476SD,                                             
//             DEST1=&QSE10399                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4764B   EXEC PGM=V16459,PARM='W4764B/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJOV1,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W4764BD1 DD  DSN=&INDIN..W47645B,DISP=SHR                                     
//************ FIL TILL TOTALLISTA                                              
//*                                                                             
//W4764BD2 DD  SYSOUT=(A,,2000),DEST=&DEST1                                     
//************ W4764B-001  TOTALLISTA-DHL MANIFEST                              
//*                                                                             
