//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER TRANSAR FRÅN WDR7 OCH SKRIVER FILER                                  
//*        DEALER-FAKTUROR TILL VIPS                                            
//*                                                                             
//*  FREKVENS:     DAG    RTN W476D5                                            
//*                                                                             
//*  ÅTERSTART:    W47650                                                       
//*                LÄSER  WDR7 ,WDR4                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W476P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W476..W476D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47650   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47650,W47650,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR7     INCLUDE MEMBER=WDR7                                                  
//*                                                                             
//WDR4     INCLUDE MEMBER=WDR4                                                  
//*                                                                             
//W47650D1 DD  DSN=&INDUT..W47650(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DEALER-FAKTUROR TILL VIPS OSV.                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47650D2 DD  DSN=&INDUT..W47629A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ TRANSAR TILL WDR7-RENSNING                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
