//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DOWNLOAD FOR CBS REPORTING SDC21 (SUPPLY TERMINAL IN)                      
//*                                                                             
//*  FREQUENCY:    MONTHLY                                                      
//*                                                                             
//*  RESTART  :              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W477P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W477M1,                                             
//             INDOUT=&W477..W477M1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47710   EXEC PGM=V16459,PARM='W47710/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//*                                                                             
//W47710D1 DD  DSN=&INDIN..W6117A(+0),DISP=SHR                                  
//************ SORTED FILE WITH RECEIPTS FROM SUPPLY TERM.                      
//*                                                                             
//W47710D2 DD  DSN=&INDOUT..W47710,DISP=(OLD,CATLG,DELETE)                      
//*            BLKSIZE=27904,                                                   
//*            MGMTCLAS=&BACKUPC,SPACE=(100,(10,5),RLSE)                        
//*                                                                             
//W47710D3 DD  DSN=&INDRTE..CONSTANT(XREFLAND),DISP=SHR                         
//*                                                                             
//W47710D4 DD  DSN=&INDRTE..CONSTANT(CBSVAR),DISP=SHR                           
//*                                                                             
