//* * * * *   * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      EFR - AVSTÄMNING                                             *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W478P077 PROC INDIN=&W478..W478V2,INDUT=&W478..W478V2,                        
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47884  EXEC PGM=W47884                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SORTMSG  DD  SYSOUT=*                                         (SORT)          
//SYSOUT   DD  SYSOUT=*                                      (DISPLAY)          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=*                                    (VID ABEND)          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//*                                                                             
//W47884D1 DD  DSN=&INDIN..W47880(+0),DISP=SHR                                  
//*                                                                             
//W47884D2 DD  DSN=&INDUT..W47884(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** SORTERAD OCH SUMMERAD EFR - DATA                   ***         
//             SPACE=(6220,(800,80),RLSE),                                      
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
