//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA MED ALLA VOR SVERIGE TILL VSBAB                               
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:    W47839   NORMAL                                              
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W478P039 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W479..W479V2,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47839   EXEC PGM=V16459,PARM='W47839/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD SYSOUT=*                                                          
//W47839D1 DD  DSN=&INDIN2..W47955(+0),DISP=SHR                                 
//************ FIL MED FAKTURERADE RADER (OBS VID OMKÖWNIG EFTER                
//************ W483V1 HETER FILEN W020.VAAVV.FAKTRAD)                           
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W47839D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W47839-001  LISTA KLASS 0 SVEIGE TEST DISTRIKT                   
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47839D3 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W47839-001  LISTA KLASS 2 SVEIGE TEST DISTRIKT                   
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
