//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FILER FöR UPPFöLJNING PER RFS.                                      
//*                                                                             
//*  FREKVENS:     DAG     RTN W478D2                                           
//*                                                                             
//*  ÅTERSTART:    W47840      NORMAL                                           
//*                LÄSER        WDQ3 WDE6 WDQ2                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W478P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W478..W478D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47840   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47840,W47840,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM16),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47840D1 DD  DSN=&INDUT..W47840(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TILL UPPFöLJNING PER PRC                                         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W47840D2 DD  DSN=&INDUT..W47841(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TILL UPPFöLJNING PER RFS                                         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W47840D3 DD  DSN=&INDUT..W47842(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ TILL UPPFöLJNING TILL D&P                                        
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
