//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTSKRIFT AV UPPFöLJNING:                                                   
//*  ORDER KLARA INNOM RäTT RFSDATUM PER TRP                                    
//*                                                                             
//*  FREKVENS:     VECKA     RTN W478V1                                         
//*                                                                             
//*  ÅTERSTART:    W47842    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W478P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W478..W478V1,                                             
//             INDUT=&W478..W478V1.DC61,                                        
//             INDUT2=&W478..W478V1.DC62,                                       
//             DEST1=LOCAL                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W478PD42),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47841,DISP=SHR                                      
//************ DAGFILER                                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W47842,DISP=(NEW,PASS,DELETE),                             
//************ SORTADE DAGFILER                                                 
//             SPACE=(48,(3,2),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47842   EXEC PGM=V16459,PARM='W47842/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W47842D1 DD  DSN=&&W47842,DISP=(OLD,DELETE,DELETE)                            
//************ DAGFILER                                                         
//*                                                                             
//W47842D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W47842-001  WECKOLISTA                                           
//W47842D3 DD  DSN=&INDUT..W47842(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//****************LISTA SOM UTFIL TILL D&P DC61                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W47842D4 DD  DSN=&INDUT2..W47842(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)        
//****************LISTA SOM UTFIL TILL D&P DC62                                 
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
