//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETERAR/SORTERAR FIL                                                   
//*                                                                             
//*  FREKVENS:     DAG     RTN W478D1                                           
//*                                                                             
//*  ÅTERSTART:    W47817    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W478P017 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W478..W478D1,                                             
//             INDUT=&W478..W478D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47817   EXEC PGM=W47817                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W47817D1 DD  DSN=&INDIN..W47815(+0),DISP=SHR                                  
//************ VOLVO ORDER TILL DAGLIG UPPFÖLJNINGSLISTA                        
//*                                                                             
//W47817D2 DD  DSN=&INDUT..W47817(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LISTA W47817-003 DAGLIG UPPFÖLJNINGSLISTA                        
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
