//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR RENSNINGSBARA ORDER MOT KUNDREGISTER AVSEENDE                      
//*  LIGGTID FÖR ORDERBEKRÄFTELSER.                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V3                                          
//*                                                                             
//*  ÅTERSTART:    W47917    NORMAL                                             
//*                LÄSER  WDB2                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P017 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V3,                                             
//             INDUT=&W479..W479V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD17),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47911(+0),DISP=SHR                                  
//************ ORDER SOM KAN RENSAS                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W4791B,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE ORDER (DISTR)                                          
//*            SPACE=(23464,(1,1),RLSE)                                         
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47917   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47917,W47917,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//W47917D1 DD  DSN=&&W4791B,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADE ORDER (DISTR)                                          
//*                                                                             
//W47917D2 DD  DSN=&INDUT..W47917(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ORDER SOM SKALL RENSAS             W479P013                      
//*            MGMTCLAS=&DEL2BKPC,SPACE=(23464,(1,1),RLSE)                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
