//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SAMLAR DELIVERY-NOTE UPPGIFTER SOM BLIVIT                                  
//*  FÖR GAMLA                                                                  
//*                                                                             
//*  FREKVENS:     DAG     RTN W479D3                                           
//*                                                                             
//*  ÅTERSTART:    W47926      NORMAL                                           
//*                LÄSER        WDQ5                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W479..W479D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47926   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47926,W47926,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDQ5     INCLUDE MEMBER=WDQ5                                                  
//*                                                                             
//W47926D1 DD  DSN=&INDUT..W47926(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DELIVERY-NOTE UPPGIFTER SOM SKALL TAS BORT                       
//             SPACE=(4,(5,1),RLSE),AVGREC=K,                                   
//             MGMTCLAS=&DEL2BKPC                                               
