//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER LISTOR, DEALERS MED SEN ORDERLÄGGNING,                             
//*  DC 61 OCH 62                                                               
//*                                                                             
//*  FREKVENS:     VECKA     RTN W479V2                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W4795P    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P05P PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V2,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD5P),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47952(+0),DISP=SHR                                  
//************ ORDER I ARBETE                                                   
//*                                                                             
//SORTOUT  DD  DSN=&&W47952,DISP=(NEW,PASS,DELETE),                             
//************ ORDRAR I ARBETE, SORT IDDC, IDDISTR, IDKUNDNR                    
//*        SPACE=(155,(20,10),RLSE),AVGREC=M                                    
//         SPACE=(155,(20,10),RLSE),AVGREC=K                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4795P   EXEC PGM=V16459,PARM='W4795P/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W4795PD1 DD  DSN=&&W47952,DISP=(OLD,DELETE,DELETE)                            
//************ ORDRAR I ARBETE, SORT IDDC, IDDISTR, IDKUNDNR                    
//*                                                                             
//W4795PD2 DD  SPACE=(16,(200,50),RLSE),AVGREC=K                                
//************ TEMPFIL, ORDERRADER MED KDORDKL = 1, DC61                        
//*                                                                             
//W4795PD3 DD  SPACE=(16,(200,50),RLSE),AVGREC=K                                
//************ TEMPFIL, ORDERRADER MED KDORDKL = 1, DC62                        
//*                                                                             
//W4795PD4 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W4795P-001  DEALERS MED SEN ORDERLÄGGNING, DC 61                 
//*                                                                             
//W4795PD5 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W4795P-002  DEALERS MED SEN ORDERLÄGGNING, DC 62                 
//*                                                                             
