//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE A NEW FILE WITH DEPT NUMBER                                         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W479M2                                         
//*                                                                             
//*  RESTART:      W47928    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P028 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W479..W479M2,                                             
//             INDUT=&W479..W479M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD28),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W4791A,DISP=SHR                                      
//************ ALL FILES OF W4791A FOR A MONTH FROM W47911                      
//*                                                                             
//SORTOUT  DD  DSN=&&W4791A,DISP=(NEW,PASS,DELETE),                             
//************ ELIMINATE DUPLICATES FROM ABOVE FILE                             
//             DATACLAS=PSEB,MGMTCLAS=&DEL2BKPC                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47928   EXEC PGM=V16459,PARM='W47928/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W47928D1 DD  DSN=&&W4791A,DISP=SHR                                            
//************ INPUT FROM W47911                                                
//*                                                                             
//W47928D2 DD  DSN=&INDIN..W47955A,DISP=SHR                                     
//************ INPUT FROM W47954                                                
//TEMP1    DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             MGMTCLAS=BACKUPC,DATACLAS=PSEB                                   
//TEMP2    DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             MGMTCLAS=BACKUPC,DATACLAS=PSEB                                   
//*                                                                             
//W47928D3 DD  DSN=&INDUT..W47928(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ OUTPUT FILE WITH DEPT NUMBER                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
