//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPIERAR EXTRACTET AV FAKTRAD TILL WXTR..FIL                               
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P059 PROC INDIN=&W479..W479V2,                                            
//             INDUT=&WXTR..W479V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W4795H(+0),DISP=SHR                                  
//************ FAKTRAD IN                                                       
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTRB0(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FAKTRAD EXTRACT UT                                               
//             SPACE=(13,(300,200),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
