//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W47955 (FAKTURERADE RADER) TILL NY FIL FVB                        
//*  WXTRV2, VCAS UPPF. MILJÖ.                                                  
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P057 PROC INDIN=&W479..W479V2,                                            
//             INDUT=&W479..W479V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W47955(+0),DISP=SHR                                  
//************ FAKTURERADE RADER IN, 'ORIGINAL'                                 
//************ SKAPAS I W479P054                                                
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W4795G(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FAKTURERADE RADER UT - KOPIA, FVB WXTRV2                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
