//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR ORDER I STATUS E.                                                   
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V3                                          
//*                                                                             
//*  ÅTERSTART:    W47918    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P018 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V3,                                             
//             DEST1=&CPRINT,DEST2=&R3130144,                                   
//             DEST3=&R3201681,DEST4=&QGB15008,                                 
//             DEST5=&RBE03773,DEST6=&QIT10024,                                 
//             DEST7=&QSE09012                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47918   EXEC PGM=V16459,PARM='W47918/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//*                                                                             
//W47918D1 DD  DSN=&INDIN..W47915(+0),DISP=SHR                                  
//************ FIL MED GAMLA ORDER                     W479P014                 
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W47918D2 DD  SYSOUT=(E,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W47918-001  LISTA ORDER I STATUS E  ALLA LAGER                   
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D3 DD  SYSOUT=(E,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ W47918-002  LISTA ORDER I STATUS E DC11                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D4 DD  SYSOUT=(A,,F001),DEST=&DEST2,OUTPUT=(*.A4LF),                    
//************ W47918-003  LISTA ORDER I STATUS E DC21                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D5 DD  SYSOUT=(E,,3803),DEST=&DEST3,OUTPUT=(*.A4LF),                    
//************ W47918-004  LISTA ORDER I STATUS E DC22                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D6 DD  SYSOUT=(E,,3803),DEST=&DEST4,OUTPUT=(*.A4LF),                    
//************ W47918-005  LISTA ORDER I STATUS E DC23                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D7 DD  SYSOUT=(E,,3803),DEST=&DEST5,OUTPUT=(*.A4LF),                    
//************ W47918-006  LISTA ORDER I STATUS E DC24                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D8 DD  SYSOUT=(E,,3803),DEST=&DEST6,OUTPUT=(*.A4LF),                    
//************ W47918-007  LISTA ORDER I STATUS E DC25                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W47918D9 DD  SYSOUT=(E,,3803),DEST=&DEST7,OUTPUT=(*.A4LF),                    
//************ W47918-008  LISTA ORDER I STATUS E DC26                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
