//* * * *** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR FILEN "PACKUNDERLAG, HISTORIK - RADER"                             
//*  MED DLB OCH KOMPLETTERAR DENNA                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:    W47956   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V2,                                             
//             INDIN2=&W011,                                                    
//             INDUT=&W479..W479V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47956   EXEC PGM=V16459,PARM='W47956/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//EZTVFM   DD  DATACLAS=PSEB,DCB=BLKSIZE=27968                                  
//*                                                                             
//SORTMSG  DD  SYSOUT=*                                                         
//SORTWK01 DD  DSN=&&AREA1,DISP=(OLD,PASS,DELETE)                               
//SORTWK02 DD  DSN=&&AREA2,DISP=(OLD,PASS,DELETE)                               
//SORTWK03 DD  DSN=&&AREA3,DISP=(OLD,PASS,DELETE)                               
//SORTWK04 DD  DSN=&&AREA4,DISP=(OLD,PASS,DELETE)                               
//SORTWK05 DD  DSN=&&AREA5,DISP=(OLD,PASS,DELETE)                               
//SORTWK06 DD  DSN=&&AREA6,DISP=(OLD,PASS,DELETE)                               
//*                                                                             
//*SORTFIL  DD  SPACE=(94,(5000,1800)),AVGREC=K                                 
//SORTFIL  DD  DATACLAS=PSEB                                                    
//*                                                                             
//W47956D1 DD  DSN=&INDIN..W47958(+0),DISP=SHR                                  
//************ PACKUNDERLAG, HISTORIK - RADER                                   
//*                                                                             
//W47956D2 DD  DSN=&INDIN2..W01172(+0),DISP=SHR                                 
//************ DAGLIGA LAGERBANDET                                              
//*                                                                             
//W47956D3 DD  DSN=&INDUT..W4795A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PACKUNDERLAG, HISTORIK - RADER                                   
//             MGMTCLAS=&DEL2BKPC,                                              
//             DATACLAS=PSEB                                                    
