//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR W47989 OCH MATCHAR DENNA MOT                                      
//*           W91042 SOM REDAN ÄR I RÄTT SEKVENS VARVID                         
//*  STANDARPRIS OCH SJÄLVKOST / ARTIKEL HÄNGS PÅ EFR-FIL                       
//*  UTFIL  -->  W47986                                                         
//*                                                                             
//*  FREKVENS:     DAGLIG   RTN W479D1                                          
//*                                                                             
//*  ÅTERSTART:    W47986   NORMAL                                              
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P086 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W910,                                                    
//             INDIN2=&W479..W479D1,                                            
//             INDUT=&W479..W479D1                                              
//*                                                                             
//SORT89   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479P861),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W47989(+0),DISP=SHR                                 
//************ EFR-INFO                                                         
//************ SORTERAS PÅ IDARTNR                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W47989,DISP=(NEW,PASS,DELETE),                             
//************ EFR-POSTER SORTERADE                                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47986   EXEC PGM=V16459,PARM='W47986/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,200))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W47986D1 DD  DSN=&INDIN1..W91042(+0),DISP=SHR                                 
//************ STANDARPRISER M.M                                                
//*                                                                             
//W47986D2 DD  DSN=&&W47989,DISP=(OLD,DELETE,DELETE)                            
//************ EFR-POSTER SORTERADE                                             
//*                                                                             
//W47986D3 DD  DSN=&&W47986,DISP=(NEW,PASS,DELETE),                             
//************ EFR-INFO MED STANDARDPRIS                                        
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT86   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479P862),DISP=SHR                         
//SORTIN   DD  DSN=&&W47986,DISP=(OLD,DELETE,DELETE)                            
//************ EFR-INFO MED STANDARDPRIS + SJÄLVKOST                            
//************ SORTERAS PÅ IDDISTR, IDKUNDNR, IDKUNDRF, IDDC, IDPRODNR          
//************             OCH IDPLKLST                                         
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W47986(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ EFR-POSTER SORTERADE OCH MED STDPRIS O SJÄLVKOST                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
