//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDE4 MED DLI (SEQUENCE BUFFERING)                                    
//*        WDE6 MED DLI                                                         
//*        WDQ2 MED DLI                                                         
//*        WDQ3 MED DLI                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:    W47950   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W479..W479V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47950   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47950,W47950,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDE4     INCLUDE MEMBER=WDE4                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDE6     INCLUDE MEMBER=WDE6                                                  
//W47950D2 DD  DSN=&INDUT..W47951(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ORDER-REGISTRERINGS-DATUM FÖR ALLA KUNDORDER                     
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W47950D3 DD  DSN=&INDUT..W47952(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TEMPORÄRFIL, EV ORDER I ARBETE                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47950D4 DD  DSN=&INDUT..W47954(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ TEMPORÄRFIL, EV FAKTURERADE RADER                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//W47950D5 DD  DSN=&INDUT..W47956(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ NOAC-RADER                                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47950D6 DD  DSN=&INDUT..W47958(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PACKUNDERLAG, HISTORIK - RADER                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47950D7 DD  DSN=&INDUT..W47959(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PACKUNDERLAG, HISTORIK - HUVUD                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W47950D8 DD  DSN=&INDUT..W4795C(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PACKADERADER, TILL FOLLOW UPP WEB                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
