//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NIL PICKS AND DEVIATIONS DAILY FOLLOW UP                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W479D4                                         
//*                                                                             
//*  RESTART:      W47930    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W479..W479D4,                                            
//             INDIN2=&W011..LDC,                                               
//             INDIN3=&W011..SDC,                                               
//             INDIN4=&W011..NDC,                                               
//             INDREG=&W413,                                                    
//             INDUT=&W479..W479D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47930   EXEC PGM=V16459,PARM='W47930/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//SORTWK01 DD  DSN=&AREA1,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//SORTWK02 DD  DSN=&AREA2,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//SORTWK03 DD  DSN=&AREA3,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//SORTWK04 DD  DSN=&AREA4,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//SORTWK05 DD  DSN=&AREA5,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//SORTWK06 DD  DSN=&AREA6,DISP=(NEW,PASS),STORCLAS=NONVIO,                      
//             SPACE=(CYL,300,,CONTIG)                                          
//*                                                                             
//W47930D1 DD  DSN=&INDIN1..W47923(+0),DISP=SHR                                 
//************ PACKRAD.                                                         
//*                                                                             
//W47930D2 DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDIN4..W01184(+0),DISP=SHR                                 
//************ PARTINFO.                                                        
//*                                                                             
//W47930D3 DD  DSN=&INDREG..W41302(+0),DISP=SHR                                 
//************ WDQ301.                                                          
//*                                                                             
//W47930D4 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD IN-PACKRADS-FIL.                               
//             DATACLAS=PSEB                                                    
//*                                                                             
//W47930D5 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD IN-SDCPARTS-FIL.                               
//             DATACLAS=PSEB                                                    
//*                                                                             
//W47930D6 DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR W47930-FIL                                              
//             SPACE=(96,(100,500),RLSE)                                        
//*                                                                             
//W47930D7 DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD W47930-FIL                                     
//             SPACE=(96,(100,500),RLSE)                                        
//*                                                                             
//W47930D8 DD  DSN=&&TEMP5,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD OCH KOMPLETTERAD W47930-FIL                    
//             SPACE=(96,(100,500),RLSE)                                        
//*                                                                             
//W47930D9 DD  DSN=&INDUT..W47930(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTPUT W47930                                                    
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
