//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MERGAR W47986 MED W47991 TILL PREEXTRAKT W47993                            
//*                                                                             
//*  FREKVENS:     DAGLIG   RTN W479D1                                          
//*                                                                             
//*  ÅTERSTART:           NORMAL                                                
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P093 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479D1,                                             
//             INDUT=&W479..W479D1                                              
//*                                                                             
//W47993   EXEC PGM=V16459,PARM='W47993/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,200))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W47993D1 DD DSN=&INDIN..W4795Q(+0),DISP=SHR                                   
//********** DAGLIG EFR                                                         
//W47993D2 DD DSN=&INDIN..W47991(+0),DISP=SHR                                   
//********** DAGLIG OKS                                                         
//W47993D3 DD DSN=&&W47993,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEB                                                    
//*                                                                             
//********** DAGLIG EFR OCH OKS MERGAD                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT93   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD93),DISP=SHR                         
//SORTIN   DD  DSN=&&W47993,DISP=(OLD,DELETE,DELETE)                            
//************ OKS- OCH EFR-INFO                                                
//************ SORTERAS PÅ IDDC, ARTNR                                          
//*                                                                             
//SORTOUT  DD DSN=&INDUT..W47993(+1),DISP=(NEW,CATLG,DELETE),   -LIM(1)         
//************ OKS- OCH EFR-INFO                                                
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
