//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRAKT FRÅN WXTR.FAKTRAD TILL FIL I EXCEL-FORMAT                          
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W479V2                                         
//*                                                                             
//*  RESTART:      W47963      NORMAL                                           
//*                READS        WDB2 WDB6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V2,                                             
//             INDUT=&W479..W479V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD63),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47965A(+0),DISP=SHR                                 
//************ VECKANS FAKTURERADE RADER                                        
//*                                                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W47963,DISP=(NEW,PASS,DELETE),                             
//************ VECKANS FAKTURERADE RADER SORTERAD                               
//************ IDDC IDKUNDNR, KDORDKL, IDORDNR5, IDKOLLI                        
//         SPACE=(6233,(50,10),RLSE),AVGREC=K                                   
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47963   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47963,W47963,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W47963D1 DD  DSN=&&W47963,DISP=(OLD,DELETE,DELETE)                            
//************ VECKANS FAKTURERADE RADER SORTERAD                               
//*                                                                             
//W47963D2 DD  DSN=&INDUT..W47968(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ VECKANS FAKTURERADE RADER EXTRAHERADE TILL EXCEL-FORMAT          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W47963D3 DD  DSN=&INDUT..W47968B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)        
//************ VECKANS FAKTURERADE RADER PER VECKA                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
