//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDE401,WDE420,WDE421 OCH SKAPAR TVÅ UTFILER                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W479D1                                            
//*                                                                             
//*  ÅTERSTART:    W47983    NORMAL                                             
//*                LÄSER  WDE4                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W479..W479D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47983   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47983,W47983,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDE4     INCLUDE MEMBER=WDE4                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//W47983D1 DD  DSN=&INDUT..W47922(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTFIL                                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W47983D2 DD  DSN=&INDUT..W47923(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTFIL                                                            
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47983D3 DD  DSN=&INDUT..W47923B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ UTFIL                                                            
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W47983D4 DD  DSN=&INDUT..W47983(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ REPORT RECORDS WITH ONLY WDE401 SEGMENT TO D&P                   
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
