//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FOLLOW UP FOR ODERS WITH STATUS 'E'                                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W479D4                                         
//*                                                                             
//*  RESTART:      W47940      NORMAL                                           
//*                W4794000    NORMAL                                           
//*                READS        WDQ2 WDQ4 WDQ1 WDA5 WDQ3                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P040 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDUT=&W479..W479D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47940   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47940,W47940,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//WDQ1     INCLUDE MEMBER=WDQ1                                                  
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//W47940D1 DD  DSN=&INDUT..W479401(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ OUTPUT FILE WITH ORDER STATUS 'E'                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
