//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER RENSNINGSPOSTER FRÅN WDR4                                          
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W479V4                                         
//*                                                                             
//*  RESTART:      W47921      NORMAL                                           
//*                READS        WDR4                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W479..W479V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47921   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47921,WDR4BL,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR4     INCLUDE MEMBER=WDR4                                                  
//W47921D1 DD  DSN=&INDUT..WDR44014(+1),                        -LIM(3)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ 4014-RENSNINGSPOSTER                                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W47921D2 DD  DSN=&INDUT..WDR44102(+1),                        -LIM(3)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ 4102-RENSNINGSPOSTER                                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W47921D3 DD  DSN=&INDUT..WDR44319(+1),                        -LIM(3)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ 4319-RENSNINGSPOSTER                                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
