//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W47922 MOT W47924 OCH                                              
//*  SKAPAR EN EFR-FIL                                                          
//*                                                                             
//*  FREKVENS:     DAGLIG   RTN W479D1                                          
//*                                                                             
//*  ÅTERSTART:    W47989   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P089 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479D1,                                             
//             INDUT=&W479..W479D1                                              
//*                                                                             
//SORT22   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479P891),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47922(+0),DISP=SHR                                  
//************ WDE4-POSTER                                                      
//************ SORTERAS PÅ IDDISTR,  IDKUNDNR, IDKUNDRF,                        
//************             IDPRODNR, IDPURAD                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W47922,DISP=(NEW,PASS,DELETE),                             
//************ WDE4-FIL NEDLÄST O SORTERAD                                      
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT24   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479P892),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W47924(+0),DISP=SHR                                  
//************ WDE6 NEDLÄST                                                     
//************ SORTERAS PÅ IDDISTR,  IDKUNDNR, IDKUNDRF,                        
//************             IDPRODNR, IDPURAD                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W47924,DISP=(NEW,PASS,DELETE),                             
//************ WDE6-FIL NEDLÄST O SORTERAD                                      
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47989   EXEC PGM=V16459,PARM='W47989/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,100))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W47989D1 DD  DSN=&&W47922,DISP=(OLD,DELETE,DELETE)                            
//************ WDE4-FIL NEDLÄST O SORTERAD                                      
//*                                                                             
//W47989D2 DD  DSN=&&W47924,DISP=(OLD,DELETE,DELETE)                            
//************ WDE6-FIL NEDLÄST O SORTERAD                                      
//*                                                                             
//W47989D3 DD  DSN=&INDUT..W47989(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ EFR-FIL DAGLIG                                                   
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
