//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR FAKTURERADE RADER MED MEDELVÄRDE I UTL.VALUTA PRAVCOST        
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V2                                          
//*                                                                             
//*  ÅTERSTART:    W4796500 NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P065 PROC STPLIB=&INDRTE..LOAD,                                           
//        INDINL=&W011..LDCTIME,                                                
//        INDINN=&W011..NDCTIME,                                                
//        INDIN=&WXTR,                                                          
//        INDUT=&W479..W479V2                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&INDINL..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDINN..W01184(+0),DISP=SHR                                 
//************ LDC- OCH NDC-LAGERBAND                                           
//*                                                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ HOPSORTERADE LAGERBAND                                           
//************ IDDC IDARTNR                                                     
//         SPACE=(6233,(50,10),RLSE),AVGREC=K                                   
//*                                                                             
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W479PD65),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..FAKTRAD(+0),DISP=SHR                                 
//************ VECKANS FAKTURERADE RADER                                        
//*                                                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W47965A,DISP=(NEW,PASS,DELETE),                            
//************ VECKANS FAKTURERADE RADER SORTERAD                               
//************ IDDC IDARTNR                                                     
//         SPACE=(6233,(50,10),RLSE),AVGREC=K                                   
//*                                                                             
//W47965   EXEC PGM=V16459,PARM='W47965/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(15000,2000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//W47965D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ HOPSORTERAT LAGERBAND LDC OCH NDC                                
//*                                                                             
//W47965D2 DD  DSN=&&W47965A,DISP=(OLD,DELETE,DELETE)                           
//************ FAKTURERADE RADER.                                               
//*                                                                             
//W47965D3 DD  DSN=&INDUT..W47965A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FAKTURERADE RADER NU MED PRAVCOST                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
