//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLERAR ORDER I STATUS "E",                                           
//*  SKRIVER RENSNINGSFIL ELLER LARMLISTA                                       
//*                                                                             
//*  FREKVENS:     VECKA    RTN W479V3                                          
//*                                                                             
//*  ÅTERSTART:    W47914   NORMAL                                              
//*                LÄSER  WDA5 WDQ1 WDQ2 WDQ3 WDQ4                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W479P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..W479V3,                                             
//             INDUT=&W479..W479V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W47914   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W47914,W47914,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDQ1     INCLUDE MEMBER=WDQ1                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDQ3     INCLUDE MEMBER=WDQ3                                                  
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//W47914D1 DD  DSN=&INDIN..W47916(+0),DISP=SHR                                  
//************ ORDER I STATUS "E"                 W479P011                      
//*                                                                             
//W47914D2 DD  DSN=&INDUT..W47914(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ RENSNINGSPOSTER                    W479P013                      
//             MGMTCLAS=&DEL2BKPC,SPACE=(23464,(1,1),RLSE)                      
//*                                                                             
//W47914D3 DD  DSN=&INDUT..W47915(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LARMPOSTER TILL ORDERKONTORET      W479P018                      
//             MGMTCLAS=&DEL2BKPC,SPACE=(23472,(1,1),RLSE)                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
