//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  READ W48323 CONTAINING INFO ABOUT TRANSPORTS AND EXTRACT                   
//*  WEEKS, MONTHS AND PERIODS ARE COMPUTED FROM DATES                          
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W483V2                                         
//*                                                                             
//*  RESTART:      W48325    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W483P025 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W483..W483V2,                                             
//             INDUT=&W483..W483V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48325   EXEC PGM=V16459,PARM='W48325/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W48325D1 DD  DSN=&INDIN..W48323(+0),DISP=SHR                                  
//************ EXTRACT FROM WDE6                                                
//*                                                                             
//W48325D2 DD  DSN=&INDUT..W48325(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ TRANSPORTATION REPORT DATA FOR TQ1TRPUP                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//*                                                                             
