//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*   DENNA PROCEDUR                                                  *         
//*   KOPIERAR  W479.W483V1.W47953(+0)                                *         
//*       TILL  W479.W483V1.EFRRAD(+1) ...                            *         
//*   Som sen renamas in i W261V1 för att skapa information om vilka  *         
//*   skrotbeordrade artiklar som ligger på EFR                       *         
//*                                                                   *         
//*   Det görs så här eftersom ...                                    *         
//*   W479.W483V1.W47953(+0)  renamas i W483V1RE                      *         
//*   till W020.V%AAVV.EFRRAD och denna får EJ renamas (historikfil)  *         
//*                                                   / Conny E       *         
//*                                                                   *         
//*   PERIODICITET: VECKA        RTN W483V1                           *         
//*                                                                   *         
//*   ÅTERSTART:    NORMAL                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W483P207 PROC INDIN=&W479..W483V1,                                            
//             INDUT=&W479..W483V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY    EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W47953(+0),DISP=SHR                                  
//************ ORDER I ARBETE  (Ursprungligen från W479V2)                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..EFRRAD(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ORDER I ARBETE  (Till W261V1)                                    
//             SPACE=(143,(250,50),RLSE),AVGREC=K,                              
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
