//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*   RENAMAR W428.W483V1.W42856(+0) TILL W020.KRED.W47970(+1)        *         
//*   DENNA LAGRAS I 106 GENERATIONER. ETT ÖNSKEMÅL FRÅN              *         
//*   GÖRAN ERIKSSON (PRODTEKN.) TILLS VI KOMMER PÅ NÅGOT BÄTTRE      *         
//*                                                                   *         
//*   PERIODICITET: VECKA        RTN W483V1                           *         
//*                                                                   *         
//*   ÅTERSTART:    NORMAL                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W483P206 PROC INDIN=&W428..W483V1,                                            
//             INDUT=&W020..KRED                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY    EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42856,DISP=SHR                                      
//**************  UTSUG UR KREDITERINGSBASEN WDA1                               
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W47970(+1),                        -LIM(106)         
//             DISP=(NEW,CATLG,DELETE),                                         
//**************  UTSUG UR KREDITERINGSBASEN WDA1                               
//             SPACE=(95,(5,2),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
