//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FILE TO AZURE DATALAKE IN DISPLAY FORMAT                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W483V2                                         
//*                                                                             
//*  RESTART:      W48326    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W483P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W483..W483V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48326   EXEC PGM=W48326                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W48326D1 DD  DSN=&INDIN..W48325(+0),DISP=SHR                                  
//************ INPUT FILE FROM W48325                                           
//*                                                                             
//W48326D2 DD  DSN=&&W48325X,DISP=(NEW,PASS,DELETE),                            
//************ INFO TO AZURE DATALAKE                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
