//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  RENSAR OCH LISTAR ARTIKLAR PÅ WDD8 SOM BLIVIGT RENSADE                     
//*  PÅ ARTIKELREGISTRET                                                        
//*                                                                             
//*  FREKVENS:     BESTÄLLNING  RTN W122B1                                      
//*                                                                             
//*  ÅTERSTART:    W48870       BACKOUT VIA SOP                                 
//*                UPPDATERAR  WDD8                                             
//*                LÄSER  WDK6                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W488P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W122..W122B1,                                             
//             INDUT=&W488..W122B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48870   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W48870,W48870,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DSN=&INDPLOG..W488P070(+1),                                      
//             DISP=(NEW,CATLG,CATLG),                                          
//             DCB=(RECFM=VB,LRECL=6229,BLKSIZE=27998,BUFNO=5),                 
//             MGMTCLAS=&EMID70,SPACE=(TRK,(100,100),RLSE)                      
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD8     INCLUDE MEMBER=WDD8                                                  
//W48870D1 DD  DSN=&INDIN..W12207(+0),DISP=SHR                                  
//************ RENSADE POSTER PÅ ARTIKELREGISTET                                
//W48870D2 DD  DSN=&INDUT..W48870(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ RENSADE POSTER PÅ BUFFERT REGISTRET                              
//             SPACE=(28,(1,9),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
