//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      HÖGLAGER: KORRIGERAR WDD8                                    *         
//*                                                                   *         
//*      PERIODICITET: BESTÄLLNING                                    *         
//*                                                                   *         
//*                    W48836   UPPDATERAR WDD8 & WDJ9                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W488P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W488..W488V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48836   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W48836,W48836,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W48836D1 DD  DSN=&INDIN..W48835(+0),DISP=SHR                                  
//************ KORRIGERINGSTRANSAR FRÅN PDP:N                                   
//*                                                                             
