//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR RENSADE POSTER FRÅN WDD8                                            
//*                                                                             
//*  FREKVENS:     VID ARTRENS  RTN W122B1                                      
//*                                                                             
//*  ÅTERSTART:    W48871    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W488P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W488..W122B1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48871   EXEC PGM=V16459,PARM='W48871/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W48871D1 DD  DSN=&INDIN..W48870(+0),DISP=SHR                                  
//************ FIL MED RENSADE POSTER                                           
//*                                                                             
//OUTD3 OUTPUT CLASS=6,FORMS=3803,DEST=&DEST1,                                  
//             PAGEDEF=SLS06C,FORMDEF=SLS06C                                    
//*                                                                             
//W48871D2 DD  SYSOUT=(,),OUTPUT=(*.OUTD3)                                      
//************ W48871-001  LISTA RENSADE POSTER                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
