//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*       SALDOUPPDATERING                                            *         
//*                                                                   *         
//*       PERIODICITET: 3 - 4 GGR PER DAG                             *         
//*                                                                   *         
//*       ÅTERSTART:    NORMAL                                        *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W488P020 PROC INDIN=&W488..W488S1,INDUT=&W488..W488S1,                        
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W48820  EXEC PGM=W48820                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=*                                      -- ABEND           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W48820D1 DD  DSN=&INDIN..W48819(+0),DISP=SHR                                  
//*************  POSTER FRÅN PDP:N                                              
//*                                                                             
//W48820D2 DD  DSN=&INDUT..W48821(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//*************  MELLANFIL FÖR DELSALDO                                         
//             SPACE=(6231,(25,25),RLSE),                                       
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
