//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*   HÖGLAGER UPPDATERING AV DELSALDO                                *         
//*   NEDSÄNDNING AV STARTKOMMANDO TILL PDP:N.                        *         
//*   PDP IORDNINGSTÄLLER EN FIL OCH SÄNDER UPP DEN TILL HOST         *         
//*   STARTAR PROCEDUR W488P020                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W488P018 PROC                                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY1   EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=&INDRTE..CONSTANT(W48818),DISP=SHR                           
//SYSUT2   DD  SYSOUT=(A,,STD),DEST=&HOGLAGER                                   
//SYSIN    DD  DUMMY                                                            
