//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ATT FRÅN DLB SÅLLA UT POSTER VARS SVENSKA BENÄMNING INNEHÅLLER             
//*  EN VISS STRÄNG.                                                            
//*                                                                             
//*  FREQUENCE:    BESTÄLLES VIA UPPFÖLJNINGSMILJÖN - VIOS                      
//*                                                                             
//*  RESTART:      W4XS12    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W4XSP012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..PARTINFO,                                           
//             INDUT=SAKNAS                                                     
//*                                                                             
//W4XS12   EXEC PGM=W4XS12                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W4XS12D1 DD  DUMMY                                                            
//************ SÖKBEGREPP FRÅN PANEL W4XS12 (VIOS)                              
//*                                                                             
//W4XS12D2 DD  DSN=&INDIN..WCDCDAY(+0),DISP=SHR                                 
//************ DLB                                                              
//*                                                                             
//W4XS12D3 DD  DSN=&INDUT..W4XS12.STD,DISP=(NEW,CATLG,DELETE),                  
//************ POSTER SOM MOTSVARAR SÖKBGREPPET                                 
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
