//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      REDOVISNINGEN                                                *         
//*                                                                   *         
//*      SAMLAR UPP VECKANS PEDAL-AVSTÄMNINGSTRANSAR ÅT               *         
//*      PERIODJOBB W510P172                                          *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P172 PROC INDIN=&W510..W500V1,                                            
//             INDUT=&W510..W500V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51068,DISP=SHR                                      
//************** VECKANS PEDAL-TRANSAR                              ***         
//         DD  DSN=&INDIN..W51081,DISP=SHR                                      
//************** VECKANS LEVA1-TRANSAR                              ***         
//         DD  DSN=&INDIN..W5106D,DISP=SHR                                      
//************** VECKANS AVSTÄMNINGS-TRANSAR                        ***         
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W51076(+1),DISP=(NEW,CATLG,DELETE), -LIM(09)         
//**************                                                    ***         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
