//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DETALJ-LISTA ÖVER DAGENS REDOVISNINGAR TILL SAP                     
//*  LISTAN LÄGGS SEDAN PÅ ON-DEMAND                                            
//*                                                                             
//*  FREKVENS:     DAG     RTN W510D4                                           
//*                                                                             
//*  ÅTERSTART:    W51074  NORMAL                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D4,                                             
//             INDUT=&W510..W510D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD74),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51075(+0),DISP=SHR                                  
//************ FIL MED DAGENS ALLA KONTERINGAR ÅT SAP                           
//*                                                                             
//SORTOUT  DD  DSN=&&W51075,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD KONTERINGS-FIL                                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51074   EXEC PGM=W51074                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W51074D1 DD  DSN=&&W51075,DISP=(OLD,DELETE,DELETE)                            
//************ FIL MED DAGENS ALLA KONTERINGAR ÅT SAP, SORTERADE                
//*                                                                             
//W51074D2 DD  DSN=&INDUT..W5107O(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W51074-001  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W51074D3 DD  DSN=&INDUT..W5107P(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W51074-002  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//*                                                                             
//W51074D4 DD  DSN=&INDUT..W5107Q(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W51074-003  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W51074D5 DD  DSN=&INDUT..W5107R(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W51074-004  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W51074D6 DD  DSN=&INDUT..W5107SA(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)        
//************ LINE DATA FILE TO SEND TO SNOWFLAKE                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
