//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FILE TO PROCAST (SPECIAL VEHICLES)                                         
//*                                                                             
//*  FREQUENCE:    ACCOUNT PERIOD (3 DAYS BEFORE END)  RTN W510D3               
//*                                                                             
//*  RESTART:      W51034    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W011,                                                    
//             INDUT=&WUT..W510D3                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51034   EXEC PGM=V16459,PARM='W51034/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W51034D1 DD  DSN=&INDREG..W01172(+0),DISP=SHR                                 
//************ DAILY PART FILE                                                  
//*                                                                             
//W51034D2 DD  DSN=&INDUT..W51034(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FILE TO PROCAST                                                  
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
