//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SUMMATRANS MED ANTAL SKICKADE VERIFIKAT TILL SAP I DAG              
//*                                                                             
//*  FREKVENS:     DAG  W510D5                                                  
//*                                                                             
//*  ÅTERSTART:    W51078    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D5,                                             
//             INDUT=&W510..W510D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51078   EXEC PGM=V16459,PARM='W51078/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W51078D1 DD  DSN=&INDIN..W51074(+0),DISP=SHR                                  
//************ DAGENS TRANSAR TILL SAP                                          
//*                                                                             
//W51078D2 DD  DSN=&INDUT..W51078(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ LIST-RAD MED SUMMA PÅ, SKRIVS UT I W500V1 OCH W500M1             
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
