//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SW TEXT IN FILES                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W510D4                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                W51092    NORMAL                                             
//*                          NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P092 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D4,                                             
//             INDUT=&W510..W510D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51071A(+0),DISP=SHR                                 
//************ INFILE W51071A                                                   
//*                                                                             
//SORTOUT  DD  DSN=&&W51071A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD INFIL W51071A                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51073A(+0),DISP=SHR                                 
//************ INFIL W51073A                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W51073A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD UTFIL W51073A                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51092   EXEC PGM=V16459,PARM='W51092/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W51092D1 DD  DSN=&&W51071A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED INFILE W51071                                             
//*                                                                             
//W51092D2 DD  DSN=&&W51073A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED INFILE W51073                                             
//*                                                                             
//W51092D3 DD  DSN=&&W51071B,DISP=(NEW,PASS,DELETE),                            
//************ OUTFILE W5107B                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51092D4 DD  DSN=&&W51073B,DISP=(NEW,PASS,DELETE),                            
//************ OUTFILE W51073B                                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT3    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD03),DISP=SHR                         
//SORTIN   DD  DSN=&&W51071B,DISP=(OLD,DELETE,DELETE)                           
//************ OUTFILE W51071B                                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W51071B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ OUTFILE W51071B                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT4    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD03),DISP=SHR                         
//SORTIN   DD  DSN=&&W51073B,DISP=(OLD,DELETE,DELETE)                           
//************ OUTFILE W51073B                                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W51073B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ OUTFILE W51073B                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
