//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SALES REPORT FOR AU AND JP                                                 
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W500M1                                       
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W51089    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P079 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W500M1,                                             
//             INDUT=&W510..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD89),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51066A,DISP=SHR                                     
//************ BOOKING EVENTS FILE FOR PREVIOUS MONTH                           
//*                                                                             
//SORTOUT  DD  DSN=&&W51066A,DISP=(NEW,PASS,DELETE),                            
//************ SORTED ON THE EVENTS                                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51089   EXEC PGM=W51089                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W51089D1 DD  DSN=&&W51066A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED ON THE DC                                                 
//*                                                                             
//W51089D2 DD  DSN=&INDUT..W51089(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ SALES REPORT FOR AU AND JP                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
