//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      SKAPA LEVA1-TRANSAR AV FILER FRÅN INLEVERANS                 *         
//*                                                                   *         
//*      PERIODICITET: DAG                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                    W51080 LÄSER WDH5, WDG2, WDL2, WDB2, WDB1      *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W510P080 PROC INDIN=&W510..W510D4,INDUT=&WUT..W510D4,                         
//             INDUT2=&W510..W510D4,                                            
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51080  EXEC PGM=DFSRRC00,                                                    
//             PARM=('&DBB,W51080,W51080,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//*DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                          
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*       UTSKRIFT AV RÄKNEVERK (POSTSUM)                   
//WDH5     INCLUDE MEMBER=WDH5                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDL2     INCLUDE MEMBER=WDL2                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//*                                                                             
//W51080D1 DD  DSN=&INDIN..W51079(+0),DISP=SHR                                  
//************** TRANSAR FRÅN INLEV. FÖR LEVA1                                  
//*                                                                             
//W51080D2 DD  DSN=&INDUT..W51080(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** FÄRDIGA LEVA1-TRANSAR (TYP 001-001)                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51080D3 DD  DSN=&INDUT2..W51081(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************** AVSTÄMNINGSTRANSAR                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
