//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER IN FILER FRÅN SAP R/3                                                
//*  POSTERNA FÖRDELAS PÅ TVÅ FILER, EN TILL RSREDO OCH EN TILL BILL-IT         
//*                                                                             
//*  FREKVENS:     DAGLIGEN  RTN W510D1                                         
//*                                                                             
//*  ÅTERSTART:    W51011    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D1,                                             
//             INDUT=&W510..W510D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51011   EXEC PGM=W51011                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51011D1 DD  DSN=&INDIN..W51010(+0),DISP=SHR                                  
//************ INFIL MED INFO IFRÅN SAP                                         
//*                                                                             
//W51011D2 DD  DSN=&INDUT..W51013(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ UTFIL MED SAP INFO KTO/KST/ANALYSNR/KUNDREG TILL BILLIT          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51011D3 DD  DSN=&INDUT..W51011(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//************ UTFIL MED RÄTTNINGSINFO FRÅN SAP TILL RSREDO                     
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
