//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL MED BACKNINGSTRANSAR FÖR MÅNADSSKIFTET                          
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W500M1                                          
//*                                                                             
//*  ÅTERSTART:    W51058    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W555..W500M1,                                            
//             INDIN2=&W510..W510D4,                                            
//             INDUT=&W510..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51058   EXEC PGM=V16459,PARM='W51058/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W51058D1 DD  DSN=&INDIN1..W55514(+0),DISP=SHR                                 
//************ ALLA SALDOÄNDRINGAR EFTER MIDNATT                                
//*                                                                             
//W51058D2 DD  DSN=&INDIN2..W5106N(+0),DISP=SHR                                 
//************ ALLA BOKFÖRINGSTRANSAR SOM BOKAS NÄSTA NATT                      
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ SORTERAD SALDO-ÄNDRINGSFIL                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ SORTERAD BOKNINGS-FIL                                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51058D3 DD  DSN=&INDUT..W51058(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ SALDOFIL, MED AKTUELLA BACKNINGSPOSTER                           
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
