//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AV FAKTURATRANSAR SKAPAS LABTRANSAR                                        
//*                                                                             
//*  FREKVENS:     DAG       RTN W510D2                                         
//*                                                                             
//*  ÅTERSTART:    W51030    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN3=&W476..W510D2,                                            
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W510..W510D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51029  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN3..W4768D,DISP=SHR                                     
//************** FAKTURAPOSTER TYP 94X 95X                           ***        
//*                                                                             
//SORTOUT  DD  DSN=&&W4768D,DISP=(NEW,PASS,DELETE),                             
//**************  SORTERAD FAKTURAFIL                               ***         
//             DATACLAS=PSEB                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD30),DISP=SHR                         
//*SORTERA 94X-POSTER PÅ ARTIKELNUMMER                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51030   EXEC PGM=W51030                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51030D1 DD  DSN=&&W4768D,DISP=(OLD,DELETE,DELETE)                            
//************ FAKTURAPOSTER TYP 94X 95X                                        
//*                                                                             
//W51030D2 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELREG.EXTRAKT                                               
//*                                                                             
//W51030D3 DD  DSN=&INDUT..W51031(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LAB-TRANSAR TYP A01 AX2 L02 A07 A09 L09 A15                      
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
