//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  READS THE VAT CODES FILE AND INSERTS/UPDATES INTO THE                      
//*  WDGX9309/10 SEGMENT                                                        
//*                                                                             
//*  FREKVENS:     DAG     RTN W510D6                                           
//*                                                                             
//*  ÅTERSTART:    W51017    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P017 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51017   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51017,W51017,,,N00,,,,,,,,&IMS')                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51017D1 DD  DSN=&INDIN..W51017(+0),DISP=SHR                                  
//************ INFILE VAT INFO                                                  
//*                                                                             
