//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FILER MED MÅNADENS SAPBOKNINGAR OCH SKAPAR                           
//*  EN PC-FIL FÖR AVSTÄMNING                                                   
//*                                                                             
//*  FREKVENS:     MÅNAD   RTN W500M1                                           
//*                                                                             
//*  ÅTERSTART:    W51075    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P075 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W500M1,                                             
//             INDUT=&W510..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51075   EXEC PGM=V16459,PARM='W51075/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W51075D1 DD  DSN=&INDIN..W51076,DISP=SHR                                      
//************ MÅNADENS PEDALPOSTER FÖR AVSTÄMNING                              
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL NR1                                                      
//             DATACLAS=PSEB                                                    
//*                                                                             
//W51075D2 DD  DSN=&INDUT..W51077(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PCFILEN                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
