//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      SORTERING                                                    *         
//*                                                                   *         
//*      PERIODICITET:   DAG                                          *         
//*                                                                   *         
//*      ÅTERSTART:      NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P06B PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W510..W510D2,                                            
//             INDIN2=&W510..W510D2,                                            
//             INDUT=&W510..W510D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510S1  EXEC PGM=SORT                                                         
//* SEKVENS= IDVERGL                                                            
//SORTIN   DD  DSN=&INDIN1..W51061C(+0),DISP=SHR                                
//************ FRÅN W51061                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W51061C,DISP=(NEW,PASS,DELETE),                            
//************ MELLANLAGRINGSFIL                                    ***         
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD6B),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510S2  EXEC PGM=SORT                                                         
//* SEKVENS= IDVERGL                                                            
//SORTIN   DD  DSN=&INDIN2..W51061A(+0),DISP=SHR                                
//************ FRÅN W51061                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W51061A,DISP=(NEW,PASS,DELETE),                            
//************ MELLANLAGRINGSFIL                                    ***         
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD6B),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W5106B  EXEC PGM=DFSRRC00,                                                    
//            PARM=('&DBB,W5106B,W5106B,,00')                                   
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                  (POSTSUM)              
//WDG2     INCLUDE MEMBER=WDG2                                                  
//*                                                                             
//W5106BD1 DD  DSN=&&W51061C,DISP=(OLD,DELETE,DELETE)                           
//************ MELLANLAGRINGSFIL                                                
//*                                                                             
//W5106BD2 DD  DSN=&&W51061A,DISP=(OLD,DELETE,DELETE)                           
//************ MELLANLAGRINGSFIL                                                
//*                                                                             
//W5106BD3 DD  DSN=&INDUT..W51061(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ VIDARE TILL W51063                                               
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W5106BD4 DD  DSN=&INDUT..W5106A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ TILLBAKA TILL WDR9                                               
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
