//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR VAROR PÅ VÄG I LEVA1 SYSTEMET SOM HÖR TILL                          
//*  FÖREGÅENDE PERIOD                                                          
//*                                                                             
//*  FREKVENS:     VECKA     RTN W500V1                                         
//*                                                                             
//*  ÅTERSTART:    W51083    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W500V1,                                             
//             INDUT=&W510..W500V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51083   EXEC PGM=V16459,PARM='W51083/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51083D1 DD  DSN=&INDIN..W51080,DISP=SHR                                      
//************ INFIL MED LEVA1 TRANSAR, 5 GENERATIONER                          
//*                                                                             
//W51083D2 DD  DSN=&INDUT..W51083(+1),                        -LIM(1)           
//             DISP=(NEW,CATLG,DELETE),                                         
//************ RAPPORT01  LISTA MED VAROR PÅ VÄG                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
