//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  CREATE W51027 VAT FILE                                        *            
//*                                                                  *          
//*  FREQUENCE:    DAILY     RTN W510D3                              *          
//*                                                                  *          
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P027 PROC INDIN=&W510..W510D3,                                            
//             INDUT=&W510..W510D3,                                             
//             INDREG2=&W011..&RTEGRP.,                                         
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT    EXEC PGM=SORT                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD27),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51067(+0),DISP=SHR                                  
//************** INFILE SORT                                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W51067,DISP=(NEW,PASS,DELETE),                             
//************** SORT PER ARTNR                                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51027   EXEC PGM=DFSRRC00,                                                   
//  PARM=('&DBB,W51027,W51027,,00')                                             
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                              -- POSTSUM          
//W51027D1 DD  DSN=&INDREG2..W01160(+0),DISP=SHR                                
//************** INPUT FILE W01160                                ***           
//*                                                                             
//W51027D2 DD  DSN=&&W51067,DISP=(OLD,PASS,DELETE)                              
//************** SORTED W51067 FILE                               ****          
//*                                                                             
//W51027D3 DD  DSN=&INDUT..W51049(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************** OUTPUT VAT FILE                       ***                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
