//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR FELPOSTFILEN MED EJ KOMPLETTA VERIFIKAT.                      
//*  KOMPLETTA VERIFIKAT GÅR VIDARE TILL KONTERINGEN.                           
//*                                                                             
//*  FREKVENS:     DAG     RTN W510D2                                           
//*                                                                             
//*  ÅTERSTART:    W51065    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P065 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D2,                                             
//             INDUT=&W510..W510D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51065   EXEC PGM=V16459,PARM='W51065/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(200,200))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W51065D1 DD  DSN=&INDIN..W5106R(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W5106F(+0),DISP=SHR                                  
//************ INFIL MED RÄTTPOSTER OCH FELPOSTER                               
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL MED SORTERADE RÄTTPOSTER OCH FELPOSTER                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//W51065D2 DD  DSN=&INDUT..W51062(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED FELPOSTER                                              
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W51065D3 DD  DSN=&INDUT..W5106V(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED RÄTTPOSTER                                             
//             DATACLAS=PSEB,MGMTCLAS=&NOBACKUP                                 
