//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      LAB, KOPIERAR ARTIKELSALDOFIL                                *         
//*                                                                   *         
//*      PERIODICITET: DAY                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P152 PROC INDIN=&W510..&RTEGRP.,INDUT=&W510..W560D1                       
//*                                                                             
//GENER1  EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51052(+0),DISP=SHR                                  
//************** SENASTE SALDOFILEN FÖR LAB                         ***         
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W51052(+1),DISP=(NEW,CATLG,DELETE), -LIM(03)         
//************** NY DAGFIL  FÖR LAB                                 ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
