//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR W510.W510D1.W51012C(0)                                            
//*                                                                             
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P010 PROC INDIN=&W510..W510D1,                                            
//             INDUT=&W510..W510D1                                              
//*                                                                             
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                   -- DISPLAY            
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD10),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51012C(+0),DISP=OLD                                 
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W51010(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//             DATACLAS=PSEB,MGMTCLAS=&BACKUP7                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
