//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      PEDAL, KOPIERAR ARTIKELSALDOFIL CDC                          *         
//*                                                                   *         
//*      PERIODICITET: DAY                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P152 PROC INDIN=&W510..&RTEGRP.,INDUT=&W510..W510D4                       
//*                                                                             
//GENER1  EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51053(+0),DISP=SHR                                  
//************** SENASTE SALDOFILEN FÖR PEDAL                       ***         
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W51053(+1),DISP=(NEW,CATLG,DELETE), -LIM(03)         
//************** NY DAGFIL  FÖR PEDAL                               ***         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
