//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      RÄTTNING AV KVEFRS, KVAKS, KVAKS-PAV, KVLS                   *         
//*      PERIODICITET: VID BEHOV. KÖRS AV SYSTEMAVDELNINGEN           *         
//*                                                                   *         
//*      ÅTERSTART: KÖRS OM AV SYSTEMANSVARIG                         *         
//*                                                                   *         
//*      UPPDATERAR     WDK7, WDK6, WDL9                              *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W510P091 PROC CPU=1,                                                          
//             INDIN=&W510..W510B3,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51091  EXEC PGM=DFSRRC00,                                                    
// PARM=('BMP,W51091,W51091,,,N00,,,,,&CPU,,,&IMS')                             
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W51091D1 DD  DSN=&INDIN..W51091(+0),DISP=SHR                                  
