//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA ÖVER MÅNADENS DIREKTLEVERANSBOKNINGAR                         
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W500M1                                          
//*                                                                             
//*  ÅTERSTART:    W51059    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P059 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W500M1,                                             
//             INDUT=&W510..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51059   EXEC PGM=V16459,PARM='W51059/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W51059D1 DD  DSN=&INDIN..W5106G,DISP=SHR                                      
//************ MÅNADENS DIREKTLEVERANSBOKNINGAR                                 
//W51059D2 DD  DSN=&INDUT..W51059(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ EXCEL ÖVER MÅNADENS DIREKTLEVERANSBOKNINGAR                      
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
