//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR DETALJLISTA ÖVER DAGENS LEVA1-TRANSAR TILL ON-DEMAND               
//*                                                                             
//*  FREKVENS:     DAG     RTN W510D5                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P182 PROC INDIN=&W510..W510D5,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP2)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51082,DISP=SHR                                      
//************** DAGENS EKONOMITRANSAR TILL ON-DEMAND              ***          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W51082-001 LISTA GRUNDBOKFÖRINGSTRANSAR TILL ON-DEM              
//*                                                                             
