//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*        FRAMSTÄLLER SALDOLISTA ALLA ART PÅ CDC MED SALDO           *         
//*                                                                   *         
//*        PERIODICITET: VECKA                                        *         
//*                                                                   *         
//*        ÅTERSTART:    NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W511P008 PROC INDREG=&W011,                                                   
//             STPLIB=&INDRTE..LOAD,                                            
//             INDUT=&W511..W500V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51108  EXEC PGM=W51108                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR                                
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSOUT   DD  SYSOUT=*                                                         
//W51108D1 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//**************   LAGERBAND IN                                     ***         
//*                                                                             
//W51108D2 DD  DSN=&INDUT..W51108(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************  SALDOLISTA CDC                                                  
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
