//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TAR FRAM LAGERBOKSFIL FÖR SDC 25 ITALIEN                                   
//*                                                                             
//*  FREKVENS:     VECKA     RTN W500V1                                         
//*                                                                             
//*  ÅTERSTART:    W51192    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W511P092 PROC INDIN=&W510..W500V1,                                            
//             INDREG=&W511,                                                    
//             INDUT=&WUT..W500V1,                                              
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51192   EXEC PGM=V16459,PARM='W51192/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(4000,4000))                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//SORTMSG  DD  SYSOUT=*                                                         
//W51192D1 DD  DSN=&INDIN..W51068,DISP=SHR                                      
//************ VECKANS SALDOHÄNDELSER PEDAL                                     
//*                                                                             
//W51192D2 DD  DSN=&INDIN..W51053(-1),DISP=SHR                                  
//************ EKONOMILAGERBANDET FRÅN FÖRRA VECKOBÖRJAN                        
//*                                                                             
//W51192D3 DD  DSN=&INDREG..W511NO(+0),DISP=SHR                                 
//************ DOKUMENTNUMMERFIL FÖR LAGERBOK SDC ITALIEN                       
//*                                                                             
//W51192D4 DD  DSN=&INDUT..W51194(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED LAGERBOKSTRANSAR FÖR SDC ITALIEN                         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W51192D5 DD  DSN=&INDREG..W511NO(+1),                        -LIM(3)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ DOKUMENTNUMMERFIL FÖR LAGERBOK SDC ITALIEN                       
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄRFIL TRANSFIL                                             
//             DATACLAS=PSEN                                                    
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR TRANSFIL KOMPL M FAKTURADATUM                           
//             DATACLAS=PSEN                                                    
//TPFIL3   DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR TRANSFIL KOMPL M FAKTURADATUM                           
//             DATACLAS=PSEN                                                    
//TPFIL4   DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL ITALIEN                                 
//             DATACLAS=PSEN                                                    
