//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VARULAGERVÄRDERING                                                         
//*                                                                             
//*  FREKVENS:     MÅNADSSLUT  RTN W500M2                                       
//*                                                                             
//*  ÅTERSTART:    W5124300  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P043 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W500M2,                                             
//             INDUT=&W512..W500M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51243   EXEC PGM=V16459,PARM='W51243/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51243D1 DD  DSN=&INDIN..W51239(+0),DISP=SHR                                  
//************ INFILEN                                                          
//*                                                                             
//W51243D2 DD  DSN=&INDUT..W51242(+1),                        -LIM(1)           
//             DISP=(NEW,CATLG,DELETE),                                         
//************ W51243-001  DETAILED REPORT                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51243D3 DD  DSN=&INDUT..W51243(+1),                        -LIM(1)           
//             DISP=(NEW,CATLG,DELETE),                                         
//************ W51242-002  SUMMARY REPORT                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
