//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES STOCK VALUE REPORT                                                 
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51282      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..LDC,                                               
//             INDIN2=&W011..NDC,                                               
//             INDIN3=&W011..SDC,                                               
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD61),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//************ LDC                                                              
//*                                                                             
//         DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ NDC                                                              
//*                                                                             
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ SDC                                                              
//*                                                                             
//************ WDK7 FILE                                                        
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ WDK7 FILE SORTED WITH IDARTNR                                    
//             DATACLAS=PSEB                                                    
//****************************************************************              
//W51282   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51282,W51282,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W51282D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ WDK6 EXTRACT FILE                                                
//*                                                                             
//W51282D2 DD  DSN=&INDUT..W51282(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ STOCK VALUE FILE                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
