//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*        LAGERVÄRDESANALYS                                          *         
//*                                                                   *         
//*        PERIODICITET: MÅNADSSLUT OCH ÅRSSKIFTE                     *         
//*                                                                   *         
//*        ÅTERSTART:    NORMAL                                       *         
//*                      W51202                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P002 PROC INDIN1=&W510..W510D4,                                           
//             INDIN2=&W510..W500M1,                                            
//             INDUT=&W512..W500M1,                                             
//             INDREG2=&W011..&RTEGRP.,                                         
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51201  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN1..W51053(+0),DISP=SHR                                 
//************** SALDOPOSTER FÖR ALLA DC EJ 11                                  
//         DD  DSN=&INDIN1..W51054(+0),DISP=SHR                                 
//************** SALDOPOSTER FÖR ALLA DC 11                                     
//         DD  DSN=&INDIN2..W51058(+0),DISP=SHR                                 
//************** SALDOFIL, BACKNING TILL MIDNATT                ***             
//*                                                                             
//SORTOUT  DD  DSN=&&W51054,DISP=(NEW,PASS,DELETE),                             
//************** SORTERADE SALDOPOSTER PER ARTNR                                
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD02),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51202  EXEC PGM=W51202                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                                         
//*                                                                             
//W51202D1 DD  DSN=&&W51054,DISP=(OLD,DELETE,DELETE)                            
//**************  SALDOTRANSAR FÖR ALLA DC, SORTERADE             ***           
//*                                                                             
//W51202D2 DD  DSN=&INDREG2..W01160(+0),DISP=SHR                                
//************** ARTIKELREGISTEREXTRAKT                           ***           
//*                                                                             
//W51202D3 DD  DSN=&INDUT..W51202(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//**************  FIL MED KALKYLPÅLÄGGSTOTALER                    ***           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
