//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE KITS PARTS SALES FILE                                               
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51299    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P099 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51299   EXEC PGM=V16459,PARM='W51299/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W51299D1 DD  DSN=&INDIN..W51298(+0),DISP=SHR                                  
//************ FILE WITH KITS PART AND PARTS IN KITS                            
//*                                                                             
//W51299D2 DD  DSN=&INDIN..W51295B(+0),DISP=SHR                                 
//************ VCCS SALES FILE                                                  
//*                                                                             
//TPFILE1  DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FOR SORTING VCCS SALES FILE                              
//             DATACLAS=PSEN                                                    
//TPFILE2  DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ SORTS OUTPUT FILE                                                
//             DATACLAS=PSEN                                                    
//W51299D3 DD  DSN=&INDUT..W51299(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ KITS PARTS SALES FILE                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
