//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES SCRAP REPORT                                                       
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51277    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W216..W512M2,                                            
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ CDC INFO                                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W01160,DISP=(NEW,PASS,DELETE),                             
//************ CDC INFO SORTED                                                  
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W21612(+0),DISP=SHR                                 
//************ INFILE                                                           
//*                                                                             
//SORTOUT  DD  DSN=&&W21612,DISP=(NEW,PASS,DELETE),                             
//************ INFILE SORTED                                                    
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51277   EXEC PGM=V16459,PARM='W51277/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W51277D1 DD  DSN=&&W01160,DISP=(OLD,DELETE,DELETE)                            
//************ K6 FILE                                                          
//*                                                                             
//W51277D2 DD  DSN=&&W21612,DISP=(OLD,DELETE,DELETE)                            
//************ COPY OF W21611 MERGE FILE                                        
//*                                                                             
//W51277D3 DD  DSN=&INDUT..W51277(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ SCRAP REPORT                                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
