//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT R30 FROM WDL6 FOR CHINESE AND US DC'S                              
//*                                                                             
//*  FREQUENCE:    MONTHLY   RTN W512M1                                         
//*                                                                             
//*  RESTART:      W51250    NORMAL                                             
//*                READS     WDL6                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W512..W512M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51250   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51250,W51250,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//*                                                                             
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W51250D1 DD  DSN=&INDUT..W51250(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ R30 FROM WDL6 FOR CHINESE DC'S AND US DC FROM 1441               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
