//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO CREATE EXCEL FILE FOR GIT CHINA USA                                     
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M1                                       
//*                                                                             
//*  RESTART:      W51255    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P055 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M1,                                             
//             INDUT=&W512..W512M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51255   EXEC PGM=V16459,PARM='W51255/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR            -- DATKORT            
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51255D1 DD  DSN=&INDIN..W51254(+0),DISP=SHR                                  
//************ GIT FILE FROM W512B2                                             
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERADE ARTIKEL                                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERADE ARTIKELSALDO-POSTER                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51255D2 DD  DSN=&INDUT..W51255(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ EXCEL FILE WITH GIT FOR CHINESE, US DC'S - SUMMARY               
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W51255D3 DD  DSN=&INDUT..W51256(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ EXCEL FILE WITH GIT FOR CHINESE, US DC'S - DETAILED              
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
