//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT KVRESS FROM W01184 AND W01160 FILES                                
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W51274    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDIN1=&W011..LDC,                                               
//             INDIN2=&W011..NDC,                                               
//             INDIN3=&W011..SDC,                                               
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD74),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//************ LDC                                                              
//         DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ NDC                                                              
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ SDC                                                              
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTED W01184 WITH IDARTNR                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD74),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ W01160 WDK6 EXTRACT FILE                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W01160,DISP=(NEW,PASS,DELETE),                             
//************ SORTED W01160 WITH IDARTNR                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51274   EXEC PGM=W51274                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W51274D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ SORTED W01184 WITH IDARTNR                                       
//*                                                                             
//W51274D2 DD  DSN=&&W01160,DISP=(OLD,DELETE,DELETE)                            
//************ SORTED W01160 WITH IDARTNR                                       
//*                                                                             
//W51274D3 DD  DSN=&INDUT..W51274A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ KVRESS EXTRACT FROM W01184 (WDK7 EXTRACT FILE)                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51274D4 DD  DSN=&INDUT..W51274B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ KVRESS EXTRACT FROM W01160 (WDK6 EXTRACT FILE)                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
