//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//* CHANGE THE ALPHANUMERIC PART NO TO NUMERIC                                  
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51295      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P095 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51295   EXEC PGM=W51295                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                  (POSTSUM)              
//*                                                                             
//************ VCCS RECROD FROM T01DLIN_ARC QTY AS PER DC                       
//W51295D1 DD  DSN=&INDIN..W51293D(+0),DISP=(SHR)                               
//*                                                                             
//W51295D2 DD  DSN=&INDIN..W51294D(+0),DISP=(SHR)                               
//************ NON-VCCS RECROD FROM T01DLIN_ARC QTY PER DC                      
//*                                                                             
//W51295D3 DD  DSN=&INDIN..W51295D(+0),DISP=(SHR)                               
//************ VCCS RECROD FROM T01DLIN_ARC QTY AS PER COMPANY                  
//*                                                                             
//W51295D4 DD  DSN=&INDIN..W51296D(+0),DISP=(SHR)                               
//************ NON-VCCS RECROD FROM T01DLIN_ARC QTY PER COMPANY                 
//*                                                                             
//W51295D5 DD  DSN=&INDUT..W51293B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ VCCS RECROD WHICH HAS NUMERIC PART NO                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51295D6 DD  DSN=&INDUT..W51294B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ NON-VCCS RECROD WHICH HAS NUMERIC PART NO                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51295D7 DD  DSN=&INDUT..W51295B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ VCCS RECROD WHICH HAS NUMERIC PART NO                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51295D8 DD  DSN=&INDUT..W51296B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ NON-VCCS RECROD WHICH HAS NUMERIC PART NO                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
