//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STOCK VALUE REPORT                                                         
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51283    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P083 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDREG=&W011..&RTEGRP.,                                          
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51283   EXEC PGM=V16459,PARM='W51283/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR                             
//DATUT    DD  SYSOUT=*                                                         
//W51283D1 DD  DSN=&INDIN..W51282(+0),DISP=SHR                                  
//************ STOCK VALUE FILE FROM W01184                                     
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51283D2 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ WDK6 EXTRACT FILE                                                
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL4   DD  DSN=&&TPFIL4,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51283D3 DD  DSN=&INDUT..W51283(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ STOCK VALUE REPORT DC FILE                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51283D4 DD  DSN=&INDUT..W51283A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ STOCK VALUE REPORT TOTAL FILE                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51283D5 DD  DSN=&INDUT..W51283B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ STOCK VALUE REPORT TOTAL FILE WITH DESCRIPTION                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
