//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CONVERT SEK TO CNY INR KRW                                                 
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M3                                       
//*                                                                             
//*  RESTART:      W51229      NORMAL                                           
//*                READS        WDG2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P029 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W512M3,                                             
//             INDIN1=&W515..W512M3,                                            
//             INDIN2=&W561..W512M3,                                            
//             INDUT=&W512..W512M3                                              
//* * * * * * * * * ** * * * * * * * * * * * * * * * * * * * * * * * *          
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD29),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W5706BC(+0),DISP=SHR                                 
//         DD  DSN=&INDIN1..W5156BC(+0),DISP=SHR                                
//         DD  DSN=&INDIN2..W5616BA(+0),DISP=SHR                                
//*                                                                             
//SORTOUT  DD  DSN=&&W5126B,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51229   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51229,W51229,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W51229D1 DD  DSN=&&W5126B,DISP=(OLD,DELETE,DELETE)                            
//************ R30 FROM WDL6                                                    
//*                                                                             
//W51229D2 DD  DSN=&INDUT..W51229(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SEK CONVERTED TO CNY KRW INR                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
