//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES OBSOLESCENCE DETAILED REPORT FOR SEPV                              
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51290    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT    EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W51284(+0),DISP=SHR                                  
//************** W51284 - INFILE                                                
//*                                                                             
//SORTOUT  DD  DSN=&&W51284,DISP=(NEW,PASS,DELETE),                             
//**************  SORTED W51284                                                 
//             DATACLAS=PSEB                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD90),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *             
//W51290   EXEC PGM=W51290                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51290D1 DD  DSN=&&W51284,DISP=(OLD,DELETE,DELETE)                            
//************ SORTED W51284 - INFILE                                           
//*                                                                             
//W51290D2 DD  DSN=&INDUT..W51290(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ CREATES OBSOLESCENCE DETAILED REPORT                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
