//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LYNK&CO NEW REPORT TO SHOW CURRENCY EFFECT FOR LYNK&CO                     
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W500M1                                       
//*                                                                             
//*  RESTART:      W51245      NORMAL                                           
//*                READS        WDK6 WDK7                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W500M1,                                             
//             INDUT=&W512..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51239(-1),DISP=SHR                                  
//************ CURRENT VALUE AND PROCUREMENT VALUE FOR PARTS                    
//************ PREVIOUS MONTH FILE                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W51239,DISP=(NEW,PASS,DELETE),                             
//************ SORTED FILE ON IDARTNR                                           
//         DATACLAS=PSEN                                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W011PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51239(+0),DISP=SHR                                  
//************ CURRENT VALUE AND PROCUREMENT VALUE FOR PARTS                    
//*                                                                             
//SORTOUT  DD  DSN=&&W51239N,DISP=(NEW,PASS,DELETE),                            
//************ SORTED FILE ON IDARTNR                                           
//         DATACLAS=PSEN                                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51245   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51245,W51245,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL2     INCLUDE MEMBER=WDL2                                                  
//W51245D1 DD  DSN=&&W51239,DISP=(OLD,DELETE,DELETE)                            
//************ CURRENT VALUE AND PROCUREMENT VALUE FOR PARTS                    
//************ PREVIOUS MONTH FILE                                              
//*                                                                             
//W51245D2 DD  DSN=&&W51239N,DISP=(OLD,DELETE,DELETE)                           
//************ CURRENT VALUE AND PROCUREMENT VALUE FOR PARTS                    
//*                                                                             
//W51245D3 DD  DSN=&INDIN..W51237(+0),DISP=SHR                                  
//************ COURSES FOR INVENTORY VALUATION                                  
//*                                                                             
//W51245D4 DD  DSN=&INDUT..W51245(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ UT FILE - LYNK&CO-CURRENCY EFFECT REPORT                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
