//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NEW OSCOLESCENCE FILE FOR SEPV (COMPANY CODE 57)                           
//*  WITH PART NO SPLIT PER OBSOLESCENCE GROUPS                                 
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51268    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//************ SORT FILE ON IDARTNR *********************************           
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD68),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51264B(+0),DISP=SHR                                 
//************ REMUNERATION                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W51264B,DISP=(NEW,PASS,DELETE),                            
//************ W51264 SORTED ON IDARTNR                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD68),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51266(+0),DISP=SHR                                  
//************ INTERNAL GIT INFO                                                
//*                                                                             
//SORTOUT  DD  DSN=&&W51266,DISP=(NEW,PASS,DELETE),                             
//************ W51266 SORTED ON DARTNR                                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//SORT03   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W512PD95),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51296F(+0),DISP=SHR                                 
//************ VCCS RECORDS AND QTY AS PER COMPANY                              
//*                                                                             
//SORTOUT  DD  DSN=&&W51296F,DISP=(NEW,PASS,DELETE),                            
//************ W51296F SORTED ON DARTNR                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W51268   EXEC PGM=W51268                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51268D1 DD  DSN=&&W51264B,DISP=SHR                                           
//************ PARTS STOCK FILE                                                 
//*                                                                             
//W51268D2 DD  DSN=&&W51266,DISP=SHR                                            
//************ GIT-INFO-FILE                                                    
//*                                                                             
//W51268D3 DD  DSN=&&W51296F,DISP=SHR                                           
//************ VCCS RECORDS AND QTY AS PER COMPANY                              
//*                                                                             
//W51268D4 DD  DSN=&INDUT..W51268(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//*********** OBSCOLESCENCE FILE FOR SEPV                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
