//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VARULAGERVÄRDERINGEN. ADDERA SAMMAN ARTIKELSALDON                          
//*                                                                             
//*  FREKVENS:   MÅNADSSLUT (4 DAGAR INNAN) W500M2                              
//*                                                                             
//*  ÅTERSTART:    W51234    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W510..W510D4,                                            
//             INDIN=&W512..W500M2,                                             
//             INDUT=&W512..W500M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51234   EXEC PGM=V16459,PARM='W51234/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W51234D1 DD  DSN=&INDIN..W51233(+0),DISP=SHR                                  
//************ PRIS- OCH SALDO-INFO FRÅN WDK6                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51234D2 DD  DSN=&INDIN1..W51053(+0),DISP=SHR                                 
//************ SALDOINFORMATION ALLA LAGER UTOM CDC O LAB                       
//         DD  DSN=&INDIN1..W51054(+0),DISP=SHR                                 
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51234D3 DD  DSN=&INDUT..W51235(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PRIS- OCH SALDO-INFO PER LAGER OCH ARTIKEL                       
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
