//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO CREATE EXCEL FILE FOR GIT SWEDEN                                        
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M1                                       
//*                                                                             
//*  RESTART:      W57052    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P052 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M1,                                             
//             INDREG=&W011,                                                    
//             INDUT=&W512..W512M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51252   EXEC PGM=V16459,PARM='W51252/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51252D1 DD  DSN=&INDIN..W51251(+0),DISP=SHR                                  
//************ GIT FILE FROM W51252 - R30                                       
//*                                                                             
//************ BACK-FIL BACKAR SALDO TILL MIDNATT                               
//*                                                                             
//W51252D2 DD  DSN=&INDREG..W01172(+0),DISP=SHR                                 
//************ ARTIKELUPPGIFTER FÖR CHINESE DC                                  
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERADE ARTIKEL                                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERADE                                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51252D3 DD  DSN=&INDUT..W51252(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ EXCEL FILE WITH GIT FOR CHINESE DC'S                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
