//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MERGE FILE FROM WF102500 AND WF102600                                      
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W512M2                                       
//*                                                                             
//*  RESTART:      W51227    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P027 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W512M2,                                             
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51227   EXEC PGM=V16459,PARM='W51227/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR            -- DATKORT            
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51227D1 DD  DSN=&INDIN..W51293(+0),DISP=SHR                                  
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER DC                 
//*                                                                             
//W51227D2 DD  DSN=&INDIN..W51294(+0),DISP=SHR                                  
//************ ONE YEAR OF NON-VCCS RECORDS PER DC                              
//*                                                                             
//W51227D3 DD  DSN=&INDIN..W51295(+0),DISP=SHR                                  
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER COMPANY            
//*                                                                             
//W51227D4 DD  DSN=&INDIN..W51296(+0),DISP=SHR                                  
//************ ONE YEAR OF NON-VCCS RECORDS PER COMPANY                         
//*                                                                             
//W51227D5 DD  DSN=&INDIN..W51293C(+0),DISP=SHR                                 
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER DC                 
//*                                                                             
//W51227D6 DD  DSN=&INDIN..W51294C(+0),DISP=SHR                                 
//************ ONE YEAR OF NON-VCCS RECORDS PER DC                              
//*                                                                             
//W51227D7 DD  DSN=&INDIN..W51295C(+0),DISP=SHR                                 
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER COMPANY            
//*                                                                             
//W51227D8 DD  DSN=&INDIN..W51296C(+0),DISP=SHR                                 
//************ ONE YEAR OF NON-VCCS RECORDS PER COMPANY                         
//*                                                                             
//W51227DA DD  DSN=&INDUT..W51293D(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER DC                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51227DB DD  DSN=&INDUT..W51294D(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ ONE YEAR OF NON-VCCS RECORDS PER DC                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51227DC DD  DSN=&INDUT..W51295D(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ ONE YEAR OF VCCS RECORDS FROM T01_DLINARC PER COMPANY            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51227DD DD  DSN=&INDUT..W51296D(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ ONE YEAR OF NON-VCCS RECORDS PER COMPANY                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
