//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VARULAGERVÄRDERINGEN.                                                      
//*                                                                             
//*  FREKVENS:     MÅNADSSLUT  RTN W500M1                                       
//*                                                                             
//*  ÅTERSTART:    W51238      NORMAL                                           
//*                LÄSER  WDF1 WDL2                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W512..W500M1,                                             
//             INDUT=&W512..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51238   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51238,W51238,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DSN=&INDRTE..CONSTANT(W512PD38),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDL2     INCLUDE MEMBER=WDL2                                                  
//W51238D1 DD  DSN=&INDIN..W51237(+0),DISP=SHR                                  
//************ KURSFIL                                                          
//*                                                                             
//W51238D2 DD  DSN=&INDIN..W51235(+0),DISP=SHR                                  
//************ PRIS- OCH SALDO-ONFO FÖR CENTRALA ARTIKLAR                       
//*                                                                             
//W51238D3 DD  DSN=&INDUT..W51239(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ NUVÄRDE OCH ANSKAFFNINGSVÄRDE FÖR CENTRALA ARTIKLAR              
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//W51238D4 DD  DSN=&INDUT..W51238(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ SOM W51239 MEN EXKLUSIVE SLATTAR                                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
