//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT R31 AND 310 FROM WDL6 FOR EXCLUDING NON VCC DC                     
//*                                                                             
//*  FREQUENCE:    MONTHLY   RTN W512M2                                         
//*                                                                             
//*  RESTART:      W5128J    NORMAL                                             
//*                READS     WDL6                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W512P08J PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W512..W512M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W5128J   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W5128J,W5128J,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//*                                                                             
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//W5128JD1 DD  DSN=&INDUT..W5128J(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ R31 AND 310 FROM WDL6                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
