//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//**********************************************************************        
//*PROGRAM    : ATT SUMMERA ARTIKLAR SOM ÄR KVAR ATT INVENTERA                  
//*             OCH SUMMERA FÖRRA VECKANS INVENTERINGAR                         
//*             OCH SUMMERA TOTALT ARTIKLAR SOM SKALL INVENTERAS                
//*                                                                             
//*INFIL1       W513.W513V1.W51343 - INV HISTORIK                               
//*             - ALLT SOM HAR INVENTERATS                                      
//*INFIL2       W513.W51372 - REGISTER                                          
//*             - ALLT SOM ÄR KVAR ATT INVENTERAS                               
//*INFIL3       W011.DCXX.W01184 LAGERBAND                                      
//*             - ALLA ARTIKLAR PÅ LDC,SDC,NDC                                  
//*  FREKVENS:     VECKA     RTN W513V1                                         
//*                                                                             
//*  ÅTERSTART:    W51396    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P096 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513V1,                                             
//             INDIN1=&W513,                                                    
//             INDREG=&W011,                                                    
//             INDUT=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51396   EXEC PGM=V16459,PARM='W51396/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51396D1 DD  DSN=&INDIN..W51343(+0),DISP=SHR                                  
//************ EKONOMI-ARTIKELSALDOFIL                                          
//*                                                                             
//W51396D2 DD  DSN=&INDIN1..W51372(+0),DISP=SHR                                 
//************ ALLA POSTER SOM SKA INVENTERAS I ÅR                              
//*                                                                             
//W51396D3 DD  DSN=&INDREG..LDC.W01184(+0),DISP=SHR                             
//************ ARTIKELEXTRAKT                                                   
//         DD  DSN=&INDREG..SDC.W01184(+0),DISP=SHR                             
//************ ARTIKELEXTRAKT                                                   
//         DD  DSN=&INDREG..NDC.W01184(+0),DISP=SHR                             
//************ ARTIKELEXTRAKT                                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL4   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL5   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL6   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL7   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL8   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR SORTFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51396D4 DD  DSN=&INDUT..W51396(+1),DISP=(NEW,CATLG,DELETE),  -LIM(10)        
//************  UTFIL MED SUMMERADE POSTER TILL ONDEMAND                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
