//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     VECKA   RTN W513V1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P04O PROC INDIN=&W513..W513V1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP6)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE1 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W513OA(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513OB(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513OC(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE2 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51317(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE3 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51313(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W51314(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
