//*********************************************************************         
//*                                                                   *         
//*  LISTNING AV URVALSREGISTRET FÖR CDC                              *         
//*                                                                   *         
//*  FREKVENS:     VECKA    RTN W513V1                                *         
//*                                                                   *         
//*  ÅTERSTART:    W51391   NORMAL                                    *         
//*                W51392   NORMAL                                    *         
//*                                                                   *         
//*********************************************************************         
//W513P092 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513,INDREG=&W011,                                        
//             INDUT=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51392   EXEC PGM=V16459,PARM='W51392/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51392D1 DD  DSN=&INDIN..W51372(+0),DISP=SHR                                  
//************ URVALSFIL ALLA DC                                                
//*                                                                             
//W51392D2 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND                                                
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR URVALSFIL CDC SORTERAD                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51392D3 DD  DSN=&INDUT..W513OA(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA W51392-001 URVALSREGISTRET FÖR INV GÖTEBORG                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
