//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL MED PERIODENS INVENTRINGAR OCH SKAPAR EN LISTA                   
//*                                                                             
//*  FREKVENS:     VECKA     RTN W513R1                                         
//*                                                                             
//*  ÅTERSTART:    W5136400  NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513R1,                                             
//             INDIN1=&W011,                                                    
//             INDUT=&W513..W513R1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51364   EXEC PGM=V16459,PARM='W51364/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//***VFM   DD  SPACE=(4096,(100,100))                                           
//EZTVFM   DD  DATACLAS=PSEB,DCB=BLKSIZE=27968                                  
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W51364D1 DD  DSN=&INDIN..W51360(+0),DISP=SHR                                  
//************ INFIL MED PERIODENS INVENTERADE ARTIKLAR                         
//*                                                                             
//W51364D2 DD  DSN=&INDIN1..W01177(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL SORTERAD INVENTERINGSFIL                                 
//         DATACLAS=PSEB                                                        
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL SORTERAD LAGERBANDSFIL                                   
//         DATACLAS=PSEB                                                        
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR LAGERBAND SUMMERAT                                   
//         DATACLAS=PSEB                                                        
//*                                                                             
//TPFIL4   DD  DSN=&&TPFIL4,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR INVENTERINGAR SUMMERADE                              
//         DATACLAS=PSEB                                                        
//*                                                                             
//W51364D3 DD  DSN=&INDUT..W513OK(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************  LISTA W51364-001 PER.INVENT PER LAG.OMR. TILL ONDEMAND          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
