//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DAP POSTER AV FIL MED JUSTERNINGAR SOM GJORS UNDER VECKAN           
//*                                                                             
//*  FREKVENS:     VECKOVIS  RTN W513V1                                         
//*                                                                             
//*  ÅTERSTART:    W51315    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P015 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51315   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51315,W51315,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51315D1 DD  DSN=&INDIN..W51315(+0),DISP=SHR                                  
//************ DAP FIL MED WEEKLY ADJUSTMENTS                                   
//*                                                                             
//W51315D2 DD  DSN=&INDIN..W51313(+0),DISP=SHR                                  
//************ FIL MED WEEKLY ADJUSTMENTS OMDEMAND UTSEENDE/LISTA               
//*                                                                             
