//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*        W513 INVENTERINGEN                                         *         
//*                                                                   *         
//*        PERIODICITET: REDOVISNINGSPERIOD                           *         
//*                                                                   *         
//*        ÅTERSTART:    NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W513P050 PROC INDIN=&W513..W513R1,                                            
//             INDUT=&W513..W513R1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51348  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W51326,DISP=SHR                                      
//**************                                                    ***         
//*                                                                             
//SORTOUT  DD  DSN=&&W51351,DISP=(NEW,PASS,DELETE),                             
//**************                                                    ***         
//             DATACLAS=PSEN                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W513PD05),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51350  EXEC PGM=W51350                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR                                
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//*                                                                             
//W51350D1 DD  DSN=&&W51351,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//*                                                                             
//W51350D2 DD  DSN=&INDUT..W513OD(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************* LISTA W51350-001 ANTALSMÄSSIGA JUSTERINGAR  ONDEMAND  *         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
