//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA FYSISK AVVIKELSE ÅT JAPAN, AUSTRALIEN                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W513D3                                           
//*                                                                             
//*  ÅTERSTART:    W51334    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&QJP20109,DEST2=&QAU10012,                                 
//             INDIN=&W513..W513D3,                                             
//             INDUT=&W513..W513D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51334   EXEC PGM=W51334                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W51334D1 DD  DSN=&INDIN..W51334,DISP=SHR                                      
//**************  LISTPOSTER                                        ***         
//*                                                                             
//OUT1 OUTPUT FORMDEF=SLS06C,PAGEDEF=SLS06C                                     
//*                                                                             
//W51334D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,                                     
//**************      LISTA W51334-361 JUSTERINGSRAPPORT DC 61      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51334D3 DD  SYSOUT=(A,,STD),DEST=&DEST2,                                     
//**************      LISTA W51334-362 JUSTERINGSRAPPORT DC 62      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//************                                                                  
//W51334D4 DD  DSN=&INDUT..W513O4(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************  FIL MED JUSTERINGSRAPPORTER NDC  TILL ONDEMAND                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
