//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDH7 MED SB                                                          
//*  LISTAR GJORDA INV.JUSTERING UNDER VECKAN                                   
//*                                                                             
//*  FREKVENS:     DAG      RTN W513D1                                          
//*                                                                             
//*  ÅTERSTART:    W51360   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P060 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51360   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51360,W51360,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDH7     INCLUDE MEMBER=WDH7                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W51360D1 DD  DSN=&INDUT..W51361(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ GJORDA INV.JUSTERINGAR UNDER VECKAN                              
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//W51360D2 DD  DSN=&INDUT..W51360(+1),DISP=(NEW,CATLG,DELETE), -LIM(05)         
//************ GJORDA INV.JUSTERINGAR UNDER VECKAN PÅ CDC                       
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
