//*********************************************************************         
//*                                                                   *         
//*  LISTNING AV URVALSREGISTRET FÖR ALLA SDC,NDC-PACIFIC/KINA, LDC   *         
//*                                                                   *         
//*  FREKVENS:     VECKA    RTN W513V1                                *         
//*                                                                   *         
//*  ÅTERSTART:    W51392   NORMAL                                    *         
//*                W51393   NORMAL                                    *         
//*                                                                   *         
//*********************************************************************         
//W513P093 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W011..&RTEGRP.,                                          
//             INDIN=&W513,                                                     
//             INDUT=&W513..W513V1,                                             
//             INDLDC=&W011..LDC,                                               
//             INDSDC=&W011..SDC,                                               
//             INDNDC=&W011..NDC,                                               
//             DEST1=&R3130144,DEST2=&R3130060,                                 
//             DEST4=&CPRINT,DEST5=&QIT10024,                                   
//             DEST6=&RSE77069,DEST7=&QJP20109,DEST8=&QAU10012                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51392   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W513PD92),DISP=SHR                         
//SORTIN   DD  DSN=&INDLDC..W01184(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND LDC                                            
//         DD  DSN=&INDSDC..W01184(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND SDC                                            
//         DD  DSN=&INDNDC..W01184(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND NDC                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD ARTIKELSALDOFIL                                         
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51393   EXEC PGM=V16459,PARM='W51393/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(4000,4000))                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51393D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ DAGLIGT LAGERBAND SDC:ERNA, SORTERADE                            
//*                                                                             
//W51393D2 DD  DSN=&INDIN..W51372(+0),DISP=SHR                                  
//************ URVALSFIL ALLA DC OSORTERAD                                      
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR URVALSFIL SORTERAD ALLA DC UTOM DC 11                   
//             DATACLAS=PSEN                                                    
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR INFOFIL                                                 
//             DATACLAS=PSEN                                                    
//TPFIL3   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR INFOFIL                                                 
//             DATACLAS=PSEN                                                    
//TPFIL4   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR INFOFIL                                                 
//             DATACLAS=PSEN                                                    
//TPFIL5   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR INFOFIL                                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51393D3 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ DAGLIGT LAGERBAND CDC                                            
//*                                                                             
//W51393D4 DD  SYSOUT=(A,,F001),DEST=&DEST1                                     
//************ LISTA W51393-021 URVALSREGISTRET FÖR SDC 21                      
//*                                                                             
//W51393D6 DD  SYSOUT=(A,,STD),DEST=&DEST4                                      
//************ LISTA W51393-024 URVALSREGISTRET FÖR SDC 24                      
//*                                                                             
//W51393D7 DD  SYSOUT=(A,,STD),DEST=&DEST5                                      
//************ LISTA W51393-025 URVALSREGISTRET FÖR SDC 25                      
//*                                                                             
//W51393D8 DD  SYSOUT=(A,,STD),DEST=&DEST6                                      
//************ LISTA W51393-026 URVALSREGISTRET FÖR SDC 26                      
//*                                                                             
//W51393D9 DD  SYSOUT=(A,,STD),DEST=&DEST7                                      
//************ LISTA W51393-061 URVALSREGISTRET FÖR SDC 61                      
//*                                                                             
//W51393DA DD  SYSOUT=(A,,STD),DEST=&DEST8                                      
//************ LISTA W51393-062 URVALSREGISTRET FÖR SDC 62                      
//*                                                                             
//W51393DW DD  DSN=&INDUT..W51394(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA W51393-0XX URVALSREGISTRET FÖR WEB-DC                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51393DE DD  DSN=&INDUT..W513OB(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FILE TO ONDEMAND                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51393DF DD  DSN=&INDUT..W51393(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FILE TO PCMILJÖ-EXCEL                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51393DG DD  SYSOUT=(A,,F001),DEST=&DEST2                                     
//************ LISTA W51393-091 URVALSREGISTRET FÖR DC 91 ET                    
//*                                                                             
//W51393DH DD  DSN=&INDUT..W51395(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA W51393-0XX FOR DC 4X                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
