//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA FYSISK AVVIKELSE ÅT CDC                                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W513D1                                           
//*                                                                             
//*  ÅTERSTART:    W51330    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513D1,                                             
//             INDUT=&W513..W513D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51330   EXEC PGM=W51330                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W51330D1 DD  DSN=&INDIN..W51330,DISP=SHR                                      
//**************  LISTPOSTER                                        ***         
//*                                                                             
//W51330D2 DD  DSN=&INDUT..W513O0(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************  LISTA W51330-001 JUSTERINGSRAPPORT CDC TILL ONDEMAND            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
