//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     VECKA   RTN W513R1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P05O PROC INDIN=&W513..W513R1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP6)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE1 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W513O7(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513O9(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//*                                                                             
//ICEGENE2 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51318(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ ACC ADJUST , INVENTERINGS LISTA W51318-011                       
//*                                                                             
