//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     DAG     RTN W513D1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P01O PROC INDIN=&W513..W513D1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP6)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W513O0(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513O1(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513O2(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513OG(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513O3(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W513O8(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//*                                                                             
