//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      INVENTERINGEN                                                *         
//*                                                                   *         
//*      SAMLAR UPP VECKANS LISTTRANSAR ÖVER INVENTERINGSJUSTERINGAR  *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    W51354   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P054 PROC INDIN=&W513..W513V1,                                            
//             INDUT=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W5132D1,DISP=SHR                                     
//************** VECKANS INVENTERINGSJUSTERINGAR                    ***         
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W51326(+1),DISP=(NEW,CATLG,DELETE), -LIM(03)         
//**************                                                    ***         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
