//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INVENTERINGEN, VECKORAPPORT                                                
//*                                                                             
//*  FREKVENS:     DAG                                                          
//*                                                                             
//*  ÅTERSTART:    W51398   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W513P098 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513D1,                                             
//             INDUT=&W513..W513D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51398   EXEC PGM=V16459,PARM='W51398/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//*                                                                             
//W51398D1 DD  DSN=&INDIN..W51397(+0),DISP=SHR                                  
//************ INVENTERINGSANMÄRKNINGAR                                         
//*                                                                             
//*                                                                             
//W51398D2 DD  DSN=&INDUT..W513O8(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************      LISTA W51398-001 INV.ANMÄRKNINGAR TILL ONDEMAND             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
