//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*                                                                             
//*  ÅTERSTART:    W51352    NORMAL  (BMP)                                      
//*  SKAPAR INVENTERINGINFO MED HJÄLP AV PARAMETRAR=URVAL                       
//*  FRÅN BILD 5311/5312                                                        
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W513S1                              
//*                                                                             
//*  ÅTERSTART:    W513J052 HAR PARAMETRAR MED FRÅN SOP. SÅ                     
//*                LÄNGE SOM MAN EJ GÖR END PÅ JOBBET I SOP                     
//*                KAN JOBBET ÅTERSTARTAS. VID END ÄR PARAMETRARNA              
//*                FÖRLORADE.                                                   
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P052 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W513..W513S1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51352   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51352,W51352,W51352T,,N00,,,,,&CPU,,,&IMS')                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51352D1 DD  DUMMY                                                            
//************ PARAMETRAR FRÅN BILD 5311/5312 (OVERRIDE I JCL)                  
//*                                                                             
//*                                                                             
//W51352D2 DD  DSN=&INDUT..W51352(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W51352-001  FIL FÖR MAILSÄNDNING                                 
//             MGMTCLAS=BACKUPC,DATACLAS=PSEB                                   
//*                                                                             
//*                                                                             
