//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      INVENTERING                                                  *         
//*                                                                   *         
//*      PERIODICITET: DAG                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL   BMP                                   *         
//*                                                                   *         
//*                    W51380 UPPDATERAR WDH1/WDK6                    *         
//*                           LÄSER      WDK7                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W513P080 PROC INDIN=&W111..W513D1,                                            
//             INDIN1=&W116..W513D1,                                            
//             INDIN2=&W116..W513D1,                                            
//             CPU=1,                                                           
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51380   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51380,W51380,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                    -- POSTSUM           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W51380D1 DD  DSN=&INDIN..W11121,DISP=SHR                                      
//************ POSTER FRÅN ERSÄTTNINGSSYSTEMET                                  
//         DD  DSN=&INDIN1..W11638,DISP=SHR                                     
//         DD  DSN=&INDIN2..W11668,DISP=SHR                                     
//         DD  DSN=&INDIN2..W1167C,DISP=SHR                                     
//         DD  DSN=&INDIN2..W1167C2,DISP=SHR                                    
//*                                                                             
