//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA FYSISK AVVIKELSE ÅT SDC EUROPA                                
//*                                                                             
//*  FREKVENS:     DAG     RTN W513D1                                           
//*                                                                             
//*  ÅTERSTART:    W51332    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P032 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&R3130144,DEST2=&QGB15007,DEST3=&CPRINT,                   
//             DEST4=&QIT10024,DEST5=&RSE77069,DEST6=&R3130060,                 
//             INDIN=&W513..W513D1,                                             
//             INDUT=&W513..W513D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51332   EXEC PGM=W51332                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W51332D1 DD  DSN=&INDIN..W51332,DISP=SHR                                      
//**************  LISTPOSTER                                        ***         
//*                                                                             
//W51332D2 DD  SYSOUT=(A,,F001),DEST=&DEST1,                                    
//**************      LISTA W51332-321 JUSTERINGSRAPPORT DC 21      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51332D3 DD  SYSOUT=(A,,STD),DEST=&DEST2,                                     
//**************      LISTA W51332-323 JUSTERINGSRAPPORT DC 23      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51332D4 DD  SYSOUT=(A,,STD),DEST=&DEST3,                                     
//**************      LISTA W51332-324 JUSTERINGSRAPPORT DC 24      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51332D5 DD  SYSOUT=(A,,STD),DEST=&DEST4,                                     
//**************      LISTA W51332-325 JUSTERINGSRAPPORT DC 25      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51332D6 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//**************      LISTA W51332-326 JUSTERINGSRAPPORT DC 26      ***         
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//************                                                                  
//W51332D7 DD  DSN=&INDUT..W513O2(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************  LISTA W51332-0XX JUSTERINGSRAPPORT SDC TILL ONDEMAND            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51332D8 DD  SYSOUT=(A,,F001),DEST=&DEST6,                                    
//************  LISTA W51332-391 JUSTERINGSRAPPORT DC 91-ET  ***                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51332D9 DD  DSN=&INDUT..W513OG(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************  LISTA W51332-091 JUSTERINGSRAPPORT DC 91-ET                     
//************  FOR ONDEMAND                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
