//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DAP POSTER AV FIL MED SELECTIONS REGISTRET FÖR INVENTERING          
//*                                                                             
//*  FREKVENS:     VECKOVIS  RTN W513V1                                         
//*                                                                             
//*  ÅTERSTART:    W51394    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P094 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W513..W513V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51394   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51394,W51394,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51394D1 DD  DSN=&INDIN..W51394(+0),DISP=SHR                                  
//************ DAP FIL MED POSTER KVAR PÅ INV KÖN                               
//W51394D2 DD  DSN=&INDIN..W51396(+0),DISP=SHR                                  
//************ DAP FIL MED POSTER KVAR PÅ INV KÖN + ANTAL INV ART               
//*                                                                             
