//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR GJORDA JUSTERINGAR UNDER VECKAN                                     
//*                                                                             
//*  FREKVENS:     VECKA    RTN W513V1                                          
//*                                                                             
//*  ÅTERSTART:    W51362   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513V1,                                             
//             INDREG=&W011,                                                    
//             DEST1=&R3130060,DEST2=&R3130144,                                 
//             DEST3=&QGB15007,DEST4=&CPRINT,DEST5=&QIT10024,                   
//             DEST6=&RSE77069,DEST7=&QJP20109,DEST8=&QAU10012                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51362   EXEC PGM=V16459,PARM='W51362/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51362D1 DD  DSN=&INDIN..W51361(+0),DISP=SHR                                  
//************ GJORDA JUSTERINGAR UNDER VECKAN CDC OCH SDC                      
//*                                                                             
//OUT1 OUTPUT FORMDEF=SLS06C,PAGEDEF=SLS06C                                     
//*                                                                             
//W51362D3 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51362D4 DD  SYSOUT=(A,,F001),DEST=&DEST2,                                    
//************ W51362-021  LISTA ÖVER VECKANS JUSTERINGAR SDC 21                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362D5 DD  SYSOUT=(A,,STD),DEST=&DEST3,                                     
//************ W51362-023  LISTA ÖVER VECKANS JUSTERINGAR SDC 23                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362D6 DD  SYSOUT=(A,,STD),DEST=&DEST4,                                     
//************ W51362-024  LISTA ÖVER VECKANS JUSTERINGAR SDC 24                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362D7 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//************ W51362-025  LISTA ÖVER VECKANS JUSTERINGAR SDC 25                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362D8 DD  SYSOUT=(A,,STD),DEST=&DEST6,                                     
//************ W51362-026  LISTA ÖVER VECKANS JUSTERINGAR SDC 26                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362D9 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ W51362-061  LISTA ÖVER VECKANS JUSTERINGAR SDC 61                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362DA DD  SYSOUT=(A,,STD),DEST=&DEST8,                                     
//************ W51362-062  LISTA ÖVER VECKANS JUSTERINGAR SDC 62                
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51362DB DD  SYSOUT=(A,,F001),DEST=&DEST1,                                    
//************ W51362-091  LISTA ÖVER VECKANS JUSTERINGAR DC 91 ET              
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
