//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄGGER UPP ARTIKLAR PÅ INVENTERINGSKÖN (WDH1)                              
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W513B1                              
//*                                                                             
//*  ÅTERSTART:    W51378    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W513,                                                     
//             DEST2=&R3130144,                                                 
//             DEST3=&QGB15007,                                                 
//             DEST4=&CPRINT,                                                   
//             DEST5=&QIT10024,                                                 
//             DEST6=&RSE77069,                                                 
//             DEST7=&R3130060                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51378   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W51378,W51378,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51378D1 DD  DSN=&INDIN..W51372(+0),DISP=SHR                                  
//************ ARTIKLAR KVAR ATT INVENTERA ALLA DC                              
//*                                                                             
//W51378D3 DD  SYSOUT=(A,,F001),DEST=&DEST2,                                    
//************ LISTA W51378-021 KVITTENS AV PRM-SDC21 FRÅN BILD 5305            
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51378D4 DD  SYSOUT=(A,,STD),DEST=&DEST3                                      
//************ LISTA W51378-023 KVITTENS AV PRM-SDC23 FRÅN BILD 5305            
//*                                                                             
//W51378D5 DD  SYSOUT=(A,,STD),DEST=&DEST4                                      
//************ LISTA W51378-024 KVITTENS AV PRM-SDC24 FRÅN BILD 5305            
//*                                                                             
//W51378D6 DD  SYSOUT=(A,,STD),DEST=&DEST5                                      
//************ LISTA W51378-025 KVITTENS AV PRM-SDC25 FRÅN BILD 5305            
//*                                                                             
//W51378D7 DD  SYSOUT=(A,,STD),DEST=&DEST6                                      
//************ LISTA W51378-026 KVITTENS AV PRM-SDC26 FRÅN BILD 5305            
//*                                                                             
//W51378D8 DD  SYSOUT=(A,,F001),DEST=&DEST7                                     
//************ LIST  W51378-091 FOR EXCHANGE TERMINAL (DC 91)   5305            
