//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INVENTERINGEN, JUSTERINGAR GJORDA UNDER ÅRET                               
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD                                           
//*                                                                             
//*  ÅTERSTART:    W51369   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W513P069 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W513R1,                                             
//             INDUT=&W513..W513R1,                                             
//             INDREG=&W011,                                                    
//             DEST2=&R3130144,                                                 
//             DEST4=&CPRINT,DEST5=&QIT10024,                                   
//             DEST6=&RSE77069,DEST7=&QJP20109,DEST8=&QAU10012,                 
//             DEST12=&R3130060,DEST13=&QGB15006                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51369   EXEC PGM=V16459,PARM='W51369/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//*****EZTVFM   DD  SPACE=(4096,(4000,400))                                     
//EZTVFM   DD  SPACE=(CYL,(500,500))                                            
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR                                
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//*                                                                             
//W51369D1 DD  DSN=&INDIN..W51369(+0),DISP=SHR                                  
//************ INVENTERINGSANMÄRKNINGAR ACK ÅR CDC OCH SDC                      
//*                                                                             
//W51369D2 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//TEMPFIL2 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//TEMPFIL3 DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//TEMPFIL4 DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//TEMPFIL5 DD  DSN=&&TEMP5,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//TEMPFIL6 DD  DSN=&&TEMP6,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//W51369D3 DD  DSN=&INDUT..W513O9(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W51369-001  LISTA W51369-001 INV.ANMÄRKNINGAR ACK ÅR             
//************ FÖR ALLA SDC:ER ( SVERIGE).TILL ONDEMAND                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//W51369D4 DD  SYSOUT=(A,,F001),DEST=&DEST2,                                    
//************ LISTA W51369-021 INV.ANM. ACK ÅR, DC 21                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369D6 DD  SYSOUT=(A,,STD),DEST=&DEST4,                                     
//************ LISTA W51369-024 INV.ANM. ACK ÅR, DC 24                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369D7 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//************ LISTA W51369-025 INV.ANM. ACK ÅR, DC 25                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369D8 DD  SYSOUT=(A,,STD),DEST=&DEST6,                                     
//************ LISTA W51369-026 INV.ANM. ACK ÅR, DC 26                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369D9 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//************ LISTA W51369-061 INV.ANM. ACK ÅR, DC 61                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369DA DD  SYSOUT=(A,,STD),DEST=&DEST8,                                     
//************ LISTA W51369-062 INV.ANM. ACK ÅR, DC 62                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369DW DD  DSN=&INDUT..W51370(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA W51369-0XX INV.ANM. ACK ÅR, WEBDC/1A/XX/XX                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51369DX DD  DSN=&INDUT..W51372(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA MANAGEMENT ACC ÅR, WEBDC/1A/XX/XX                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51369DE DD  SYSOUT=(A,,F001),DEST=&DEST12,                                   
//************ LISTA W51369-091 INV.ANM. ACK ÅR, DC 91 ET                       
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369DG DD  SYSOUT=(A,,STD),DEST=&DEST13,                                    
//************ LISTA W51369-03A INV.ANM. ACK ÅR, DC 3A                          
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//W51369DH DD  DSN=&INDUT..W51373(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LIST FOR US - DC 4X. SENT TO D&P. ACCUMULATED-ADJ                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
