//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     VECKA   RTN W513R1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W513P08O PROC INDIN=&W513..W513R1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAPA)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W513OK(+0),DISP=SHR                                  
//************ INFIL FRÅN W513P064                                              
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAPA  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//*                                                                             
