//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR W515.W515D1.W51512                                                
//*                                                                             
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W515P010 PROC INDIN=&W515..W515D1,                                            
//             INDUT=&W515..W515D1                                              
//*                                                                             
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                   -- DISPLAY            
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W515PD10),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W51512,DISP=OLD                                      
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W51510(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//             DATACLAS=PSEB,MGMTCLAS=&BACKUP7                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
