//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER IN ALLA PEDALHÄNDELSER PÅ FIL OCH KOMPLETTERAR DESSA                 
//*                                                                             
//*  FREKVENS:     DAG     RTN W515D2                                           
//*                                                                             
//*  ÅTERSTART:    W51560    NORMAL  (BATCH)                                    
//*                READS     WDK6                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W515P060 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W510..W515D2,                                            
//             INDIN2=&W418..W515D2,                                            
//             INDIN3=&W476..W515D2,                                            
//             INDUT=&W515..W515D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W515S1  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN1..W51042,DISP=SHR                                     
//************ INFIL-FAKTURA HÄNDELSER                                          
//         DD  DSN=&INDIN2..W41831,DISP=SHR                                     
//************ INFIL-KREDIT HÄNDELSER                                           
//         DD  DSN=&INDIN3..W4768F,DISP=SHR                                     
//************ INFIL-FAKTURA HÄNDELSER                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W51560,DISP=(NEW,PASS,DELETE),                             
//******** SORTERADE PÅ IDVERGL STIGANDE O IDARTNR FALLANDE                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W515PD60),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51560   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51560,W51560,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W51560D1 DD  DSN=&&W51560,DISP=(OLD,PASS,DELETE)                              
//************ SORTERADE PEDAL-HÄNDELSER                                        
//W51560D2 DD  DSN=&INDUT..W51561A(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)        
//************ KOMPLETTERADE PEDAL-HÄNDELSER                                    
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//W51560D3 DD  DSN=&INDUT..W51561C(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)        
//************ KOMPLETTERADE PEDAL-HÄNDELSER                                    
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
