//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER HÄNDELSEBAS FÖR KOMPLETTERING AV TRANSAR                             
//*                                                                             
//*  FREKVENS:     DAG     RTN W515D3                                           
//*                                                                             
//*  ÅTERSTART:    W51567      NORMAL                                           
//*                LÄSER        WDH5                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W515P067 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W515..W515D3,                                             
//             INDUT=&W515..W515D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51567   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W51567,W51567,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDH5     INCLUDE MEMBER=WDH5                                                  
//W51567D1 DD  DSN=&INDIN..W51566,DISP=SHR                                      
//************ SENASTE DYGNETS BOKNINGSHÄNDELSER                                
//*                                                                             
//W51567D2 DD  DSN=&INDUT..W51567(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ FIL MED ALLT SOM SKALL BOKAS I SAP                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51567D3 DD  DSN=&INDUT..W51569(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED LISTTRANSAR FÖR DIRLEV-LISTA                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
