//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  HANTERA SAP BEGRÄNSNINGAR PÅ 950 RADER                                     
//*                                                                             
//*  FREKVENS:               RTN W515D3                                         
//*                                                                             
//*  ÅTERSTART:    W51093    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W515P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W515..W515D3,                                             
//             INDUT=&W515..W515D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51571   EXEC PGM=W51571                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51571D1 DD  DSN=&INDIN..W51571B(+0),DISP=SHR                                 
//************ ARTIKELREG.EXTRAKT                                               
//*                                                                             
//W51571D2 DD  DSN=&INDUT..W51571(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ LARMLISTA                                                        
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
