//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FILER MED DAGENS SAPBOKNINGAR OCH SKAPAR EN FIL FÖR                  
//*  MÅNADS-AVSTÄMNING                                                          
//*                                                                             
//*  FREKVENS:     DAG    RTN W515D3                                            
//*                                                                             
//*  ÅTERSTART:    W51574    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W510P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W515..W515D3,                                             
//             INDIN2=&W011,                                                    
//             INDUT=&W515..W515D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51574   EXEC PGM=V16459,PARM='W51574/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W51574D1 DD  DSN=&INDIN..W51570(+0),DISP=SHR                                  
//************ DAGENS PEDALPOSTER FÖR AVSTÄMNING                                
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE AVSTÄMNINGSPOSTER                                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51574D2 DD  DSN=&INDIN2..W01172(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//W51574D3 DD  DSN=&INDUT..W51576(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PCFILEN                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
