//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VECKORAPPORTEN                                                             
//*                                                                             
//*  SAMMANSTÄLLNING AV GJORDA INVENTERINGAR UNDER VECKAN                       
//*                                                                             
//*  FREKVENS:     VECKA    RTN W517V1                                          
//*                                                                             
//*  ÅTERSTART:    W51738   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P038 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W517..W517V1,                                             
//             INDUT=&W517..W517V1,                                             
//            DEST5=LOCAL,                                                      
//             DEST7=&RSE77069,DEST9=&QAU10012                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51738   EXEC PGM=V16459,PARM='W51738/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51738D1 DD  DSN=&INDIN..W51741(+0),DISP=SHR                                  
//************ LAGER OCH FÖRSÄLJNING                                            
//*                                                                             
//W51738D2 DD  DSN=&INDUT..W517O1(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FILE TO ONDEMAND                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51738DW DD  DSN=&INDUT..W51738(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//**************    LISTOR FÖR WEB LDC-LAGER 1A/XX                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W51738D6 DD  SYSOUT=(A,,STD),DEST=&DEST5,                                     
//**************    LISTOR FÖR SDC-LAGER 24                                     
//             DCB=(RECFM=FBA,LRECL=129,BLKSIZE=129)                            
//W51738D8 DD  SYSOUT=(A,,STD),DEST=&DEST7,                                     
//**************    LISTOR FÖR SDC-LAGER 26                                     
//             DCB=(RECFM=FBA,LRECL=129,BLKSIZE=129)                            
//W51738D9 DD  DSN=&INDUT..W51738A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//**************    LISTOR FÖR NDC-LAGER 61                                     
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W51738DA DD  SYSOUT=(A,,STD),DEST=&DEST9,                                     
//**************    LISTOR FÖR NDC-LAGER 62                                     
//             DCB=(RECFM=FBA,LRECL=129,BLKSIZE=129)                            
//W51738DD DD  DSN=&INDUT..W51742(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FILE TO PCMILJÖ-EXCEL                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERADE ARTIKELSALDO-POSTER                        
//             DATACLAS=PSEB                                                    
