//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FILE TO AZURE DATALAKE IN DISPLAY FORMAT                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W517V1                                         
//*                                                                             
//*  RESTART:      W51719    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W517..W517V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51719   EXEC PGM=W51719                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W51719D1 DD  DSN=&INDIN..W51716X1(+0),DISP=SHR                                
//************ INPUT FROM W517P016                                              
//*                                                                             
//W51719D2 DD  DSN=&&W51716X,DISP=(NEW,PASS,DELETE),                            
//************ FILE TO AZURE DATALAKE                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
