//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MÅNADSRAPPORT FÖR VCCS (LIKNANDE SUMMOR SOM I RSREDO)                      
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W500M1                                          
//*                                                                             
//*  ÅTERSTART:    W51730   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W517..W500M1,                                             
//             INDUT=&W517..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51730   EXEC PGM=V16459,PARM='W51730/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(3000,3000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W51730D1 DD  DSN=&INDIN..W51713,DISP=SHR                                      
//************ MÅNADENS HÄNDELSER                                               
//         DD  DSN=&INDIN..W51709,DISP=SHR                                      
//************ MÅNADENS MANUELLA RÄTTNINGAR I SAP R/3                           
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL MED SORTERADE FAKT.RADER                            
//             DATACLAS=PSEB                                                    
//W51730D2 DD  DSN=&INDUT..W51730(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************** LISTAN SOM FIL                                     ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
