//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT MARKET 95                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W517V1                                         
//*                                                                             
//*  RESTART:      W51751    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P051 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W517..W517V1,                                             
//             INDUT=&W517..W517V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51751   EXEC PGM=V16459,PARM='W51751/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W51751D1 DD  DSN=&INDIN..W51741(+0),DISP=SHR                                  
//************ INPUT FILE                                                       
//*                                                                             
//W51751D2 DD  DSN=&INDUT..W51751(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FILE TO D&P                                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
