//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VECKORAPPORT                                                 *         
//*                                                                   *         
//*      SKAPAR FIL TILL RSREDO VAROR I KARANTÄN (DC 13, FEJKAT)      *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    W51715   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W517P015 PROC INDREG=&W011,                                                   
//             INDIN1=&W488..W488S3,                                            
//             INDUT=&W517..W517V1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51715  EXEC PGM=W51715                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR  (DATKORT)                     
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR  TKORT)                   
//DATUT    DD  SYSOUT=*                             (DATKORT)                   
//V16247D3 DD  SYSOUT=*                             (POSTSUM)                   
//*                                                                             
//W51715D1 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************** VECKOLAGERBANDET                                   ***         
//*                                                                             
//W51715D2 DD  DSN=&INDIN1..W48881(+0),DISP=SHR                                 
//************** BUFFERTSALDOFIL                                    ***         
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ SORTERAT URVAL BUFFERSALDOFIL                                    
//             DATACLAS=PSEB                                                    
//*                                                                             
//W51715D3 DD  DSN=&INDUT..W51715(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************** UTFIL CTX W51716, KARANTÄN MED FEJKAT DC = 13     ***          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
