//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VECKORAPPORTEN (RSREDO)                                      *         
//*      RENSAR ÄLDSTA ÅRETS TRANSAR PÅ RSREDOS MASTERFIL             *         
//*                                                                   *         
//*      PERIODICITET: ÅRSSLUT WYR001                                 *         
//*                                                                   *         
//*      ÅTERSTART:    W51717   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W517P017 PROC INDREG=&W517,                                                   
//             INDUT=&W517..RENS,                                               
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51717  EXEC PGM=W51717                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR      (DATKORT)                 
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR  DATKORT)                 
//DATUT    DD  SYSOUT=*                               (DATKORT)                 
//*                                                                             
//W51717D1 DD  DSN=&INDREG..W51717(+0),DISP=SHR                                 
//************** GAMMAL RSREDO-MASTERFIL                            ***         
//*                                                                             
//W51717D2 DD  DSN=&INDREG..W51717(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)        
//************** NY RENSAD RSREDO MASTERFIL                         ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W51717D3 DD  DSN=&INDUT..W51717(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************** KÖRNINGENS RENSADE POSTER                          ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
