//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  VECKORAPPORT PV                                                            
//*                                                                             
//*  EXTRAHERING AV INFO TILL VECKORAPPORTEN PÅ TERMINAL                        
//*                                                                             
//*  FREKVENS:     VECKA    RTN W517V1                                          
//*                                                                             
//*  ÅTERSTART:    W51721   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W517..W517V1,                                             
//             INDUT=&W517..W517V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51721   EXEC PGM=W51721                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W51721D1 DD  DSN=&INDIN..W51741(+0),DISP=SHR                                  
//************ VECKORAPPORTEN                                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEN                                                    
//*                                                                             
//W51721D3 DD  DSN=&INDUT..W51721(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ FSG UTFALL FRÅN VECKORAPPORT                                     
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W51721D4 DD  DSN=&INDUT..W51722(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************ AK/LS/EFR/SUOKS UTFALL FRÅN VECKORAPPORT                         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
