//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VECKORAPPORTEN                                               *         
//*      UPPDATERAR REGISTRET W517.W51717                             *         
//*                                                                   *         
//*      PERIODICITET: ÅR (WYR001)                                    *         
//*                                                                   *         
//*      ÅTERSTART:    W51725   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P025 PROC INDIN=&W517..WYR001,INDREG=&W517                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51725  EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDREG..W51717(+0),DISP=SHR                                 
//************** VECKORAPPORTSREGISTRET                             ***         
//         DD  DSN=&INDIN..W51716(+0),DISP=SHR                                  
//************** VECKANS LAGERVÄRDE OCH ORDEKÖVÄRDE TYP RW9         ***         
//*                                                                             
//SYSUT2   DD  DSN=&INDREG..W51717(+1),                        -LIM(03)         
//             DISP=(NEW,CATLG,DELETE),                                         
//**************                                                    ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
