//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     DAG     RTN W517V1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W517P01O PROC INDIN=&W517..W517V1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP6)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W517O1(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP6  UTFIL, SPARAS 3 ÅR I ONDEMAND                              
//*                                                                             
