//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      VECKORAPPORT                                                 *         
//*                                                                   *         
//*      KOMPLETTERAR LAGERVÄRDESTRANSAR MED STANDARDPRIS OCH PSLAG   *         
//*      SAMT SUMMERAR DÄREFTER PER DC OCH PRODUKTSLAG                *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    W51716   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W517P016 PROC INDIN=&W517..W517V1,                                            
//             INDIN1=&W611..W517V1,                                            
//             INDIN2=&W612..W517V1,                                            
//             INDREG=&W011,                                                    
//             INDUT=&W517..W517V1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W51716  EXEC PGM=W51716                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR      (DATKORT)                 
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR  DATKORT)                 
//DATUT    DD  SYSOUT=*                               (DATKORT)                 
//V16247D3 DD  SYSOUT=*                               (POSTSUM)                 
//*                                                                             
//W51716D1 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************** LAGERBANDET CDC                                    ***         
//*                                                                             
//W51716D2 DD  DSN=&INDIN..W51712(+0),DISP=SHR                                  
//************** LAGERVÄRDESTRANSAR ALLA DC:N                       ***         
//         DD  DSN=&INDIN..W51715(+0),DISP=SHR                                  
//************** LAGERVÄRDESTRANSAR KARANTÄN DC = 13                ***         
//         DD  DSN=&INDIN..W51718(+0),DISP=SHR                                  
//************** LAGERV.TRANSAR ÅF-RET USA CANADA FÖR AK-SALDOT     ***         
//         DD  DSN=&INDIN1..W61164,DISP=SHR                                     
//************** LAGERV.TRANSAR FRÅN INLEVHISTORIK CDC FÖR AK-SALDOT **         
//         DD  DSN=&INDIN2..W61270,DISP=SHR                                     
//************** LAGERV.TRANSAR FRÅN INLEVHISTORIK SDC FÖR AK-SALDOT **         
//*                                                                             
//W51716D3 DD  DSN=&INDUT..W51716(+1),DISP=(NEW,CATLG,DELETE), -LIM(01)         
//************** ARTIKEL-SALDO-TRANSAR FÖR SUMMERING                ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//W51716D4 DD  DSN=&INDUT..W51716X1(+1),                       -LIM(01)         
//*************ARTIKEL-SALDO-TRANSAR FÖR SUMMERING TILL AZURE DATALAKE          
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ SORTERAD BUFFERSALDOFIL PER ARTNR                                
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ SORTERAD BUFFERSALDOFIL PER DC OCH PRODUKTSLAG                   
//             DATACLAS=PSEB                                                    
