//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR V.A.T. LISTA TILL ONDEMAND                                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W522M1                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W522P122 PROC INDIN=&W522..W522M1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,VAT?)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W52222(+0),DISP=SHR                                  
//************ VAT-TRANSAR TILL ON-DEMAND                                       
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W52222-001 VAT LISTA TILL ON-DEMAND                              
//*                                                                             
