//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISTRIBUTES FILE WITH VAT DATA TO D-A-P                                    
//*                                                                             
//*  FREQUENCE:    PERIOD    RTN W522M1                                         
//*                                                                             
//*  RESTART:      W52242    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W522P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W522..W522M1,                                             
//             INDUT=&W522..W522M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W52242S EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W52202(+0),DISP=SHR                                  
//************** VAT FILE                                           ***         
//*                                                                             
//SORTOUT  DD  DSN=&&W52242,DISP=(NEW,PASS,DELETE),                             
//************** OUTPUT TEMP FILE WITH SORTED VAT DATA              ***         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W522PD42),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W52242   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W52242,W52242,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//************** TEMP FILE WITH SORTED VAT DATA                     ***         
//W52242D1 DD  DSN=&&W52242,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//************** FILE FOR EMAIL THROUGH DAP                    ***              
//W52242D2 DD  DSN=&INDUT..W52242(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             DATACLAS=PSEB,MGMTCLAS=&BACKUP7                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
