//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES INT-FILE TO DIFFERENT COUNTRIES                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W522D1                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W52273      NORMAL                                           
//*                READS        WDG2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W522P073 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//             INDIN=&W522..W522D1,                                             
//             INDUT=&W522..W522D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W52273   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W52273,W52273,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//WDG2     INCLUDE MEMBER=WDG2                                                  
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//W52273D1 DD  DSN=&INDIN..W52271(+0),DISP=SHR                                  
//************ INT FILE                                                         
//*                                                                             
//W52273D2 DD  DSN=&INDUT..W52273A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ INT REPORT                                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
