//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR VAT-POSTER TILL HOLLAND                                           
//*                                                                             
//*  FREKVENS:     MÅNAD   RTN W522M1                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W522P013 PROC INDIN=&W522..W522M1,                                            
//             INDUT=&W477..W522M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W52223(+0),DISP=SHR                                  
//************** SPARAD VAT-INFO                                   ***          
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W477VNL(+1),DISP=(NEW,CATLG,DELETE), -LIM(5)         
//************** VAT-POSTER      HOLLAND                           ***          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
