//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES CUSTOMS-FILE TO VOLVO LOGISTICS                                    
//*                                                                             
//*  FREQUENCE:    WEEK        RTN W522V1                                       
//*                                                                             
//*  RESTART:      W52251                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W522P051 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W522..W522V1,                                             
//             INDUT=&W522..W522V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W52251   EXEC PGM=W52251                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W52251D1 DD  DSN=&INDIN..W52204(+0),DISP=SHR                                  
//************ INFIL MED MED CUSTOMS INFO                                       
//*                                                                             
//W52251D2 DD  DSN=&INDUT..W52251(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED CUSTOMS INFO TILL VOLVO LOGISTICS                      
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
