//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BERÄKNA KDVTH                                                              
//*                                                                             
//*  FREKVENS:     VECKOVIS W540V1 OCH ÅRSSLUT WYR001                           
//*                                                                             
//*  ÅTERSTART:    W54030   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W540P030 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W540..W540V1,                                             
//             INDUT=&W540..W540V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54030   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W54030,W54030,,00')                                  
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//IGZSRTCD DD  DSN=&INDRTE..CONSTANT(W540PD30),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6G1     INCLUDE MEMBER=W6G1                                                  
//W54030D1 DD  DSN=&INDIN..W54031(+0),DISP=SHR                                  
//************ ARTIKELREGISTEREXTRAKT FRÅN W540P031                             
//*                                                                             
//W54030D2 DD  DSN=&INDUT..W54030(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL TILL W540 (VTH) FÖR UPPD. AV KDVTH                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
