//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL W54023 MED LAGERVÄRDESÄNDRING PER DC OCH KDPRODSL                
//*  OCH SKAPAR LAGERAVSTÄMNINGSLISTA.                                          
//*                                                                             
//*  FREKVENS:     ÅR      RTN WYR001                                           
//*                                                                             
//*  ÅTERSTART:    W54023    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W540P023 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W540..WYR001,                                             
//             INDIN2=&W510..W510D4,                                            
//             INDIN3=&W011..QASE,                                              
//             INDUT=&W540..WYR001                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54023   EXEC PGM=V16459,PARM='W54023/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W54023D1 DD  DSN=&INDIN..W54023(+0),DISP=SHR                                  
//************ INFIL MED SUMMERADE  SALDON PER DC OCH KDPRODSL                  
//*                                                                             
//W54023D2 DD  DSN=&INDIN2..W51053(+0),DISP=SHR                                 
//         DD  DSN=&INDIN2..W51054(+0),DISP=SHR                                 
//************ SALDOFILER FÖR ALLA DC UTOM USA O CANADA                         
//*                                                                             
//W54023D3 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ NYTT LAGERBAND                                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL                                                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W54023D4 DD  DSN=&INDUT..W54023A(+1),DISP=(NEW,CATLG,DELETE),                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
