//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÅRLIGA PRISÄNDRINGAR PÅ ARTREG AV STD SJK PRINK OCH                        
//*  PÅLÄGG                                                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN WYR001                                         
//*                                                                             
//*  RESTART:      W54020    NORMAL  (BMP)                                      
//*                MAKE SURE THE GSAM FILE W54020(0) IS CREATED                 
//*                PROPERLY.                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W540P020 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W551..WYR001,                                            
//             INDIN=&W540..WYR001,                                             
//             INDUT=&W540..WYR001                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54020   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W54020,W54020,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR                                
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//W54020D1 DD  DSN=&INDIN2..W55138(+0),DISP=SHR                                 
//************ PRIS-ÄNDRINGAR FRÅN SPIS                                         
//*                                                                             
//W54020D2 DD  DSN=&INDIN..W54020(+0),DISP=SHR                                  
//************ RESTART FILE (GSAM FILE FROM INTERRUPTED JOB)                    
//*                                                                             
//WDS1G    DD  DSN=&INDUT..W54020(+1),DISP=(NEW,CATLG,CATLG), -LIM(1)           
//************ KONTERINGSPOSTER AV FÖRÄNDRING PER ARTIKEL/CLAGER                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
