//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W54020 OCH SUMMARAR PEDALTRANSAR PER DC OCH PRODUKTSLAG              
//*                                                                             
//*  FREKVENS:     EN GÅNG PER ÅR RTN WYR001                                    
//*                                                                             
//*  ÅTERSTART:    W54022    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W540P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W540..WYR001,                                             
//             INDUT=&W540..WYR001                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54022   EXEC PGM=V16459,PARM='W54022/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W54022D1 DD  DSN=&INDIN..W54020(+0),DISP=SHR                                  
//************ INFIL MED LAGERFÖRÄNDRING PER ARTNR OCH DC                       
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD FIL PÅ DC OCH KDPRODSL                                  
//             DATACLAS=PSEB                                                    
//*                                                                             
//W54022D2 DD  DSN=&INDUT..W54022(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ UTFIL MED SUMMERADE PEDALTRANSAR (WDR9-TRANSAR)                  
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W54022D3 DD  DSN=&INDUT..W54023(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ UTFIL MED SUMMERADE LAGERFÖRÄNDRINGAR PER DC OCH PRODSL          
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
