//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      DIFFERENSLISTOR I FAKTURERINGEN                              *         
//*                                                                   *         
//*      PERIODICITET: VECKA                                          *         
//*                                                                   *         
//*      ÅTERSTART:    W54110   NORMAL                                *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W541P010 PROC INDIN=&W541..W500V1,INDUT=&W541..W500V1,                        
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54110  EXEC PGM=W54110                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      (DISPLAY)          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                         (SORT)          
//IGZSRTCD DD  DSN=&INDRTE..CONSTANT(W541PD10),DISP=SHR                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR             (DATKORT)          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR        (DATKORT)          
//DATUT    DD  SYSOUT=*                                      (DATKORT)          
//V16247D3 DD  SYSOUT=*                                      (POSTSUM)          
//*                                                                             
//W54110D1 DD  DSN=&INDIN..W54105,DISP=SHR                                      
//*                                                                             
//W54110D2 DD  DSN=&INDUT..W54110(+1),DISP=(NEW,CATLG,DELETE),                  
//************* W54110-001    REPORT FILE                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
