//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FAKT.EKONOMITRANSAR PÅ GAMMALT FORMAT UR                            
//*  PEDAL-FIL                                                                  
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W510D3                                         
//*                                                                             
//*  RESTART:      W54105      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W541P005 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..W510D3,                                             
//             INDUT=&W541..W510D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W54105   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W54105,W54105,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W54105D1 DD  DSN=&INDIN..W51067,DISP=SHR                                      
//************ TRANSAR FRÅN PEDAL                                               
//*                                                                             
//W54105D2 DD  DSN=&INDUT..W54105(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ FAKTURAPOSTER TYP 942 OCH 950                                    
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
