//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR ANALYS-LISTA VID ÅRSSLUT                                            
//*                                                                             
//*  FREKVENS:            RTN W551B1                                            
//*                                                                             
//*  ÅTERSTART:    W55175    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P075 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W551..W551B1,                                            
//             INDIN2=&W551..WYR001,                                            
//             INDIN3=&W510..W510D4,                                            
//             INDREG=&W011,                                                    
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55175   EXEC PGM=V16459,PARM='W55175/8/'                                     
//OUT1     OUTPUT FORMDEF=SPS06C,PAGEDEF=SPS06C                                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(5000,5000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W55175D1 DD  DSN=&INDIN1..W55160(+0),DISP=SHR                                 
//************ SPIS-ANALYSFIL FRÅN SENASTE W551B1-KÖRNINGEN                     
//*                                                                             
//W55175D2 DD  DSN=&INDIN2..W55102(+0),DISP=SHR                                 
//************ SPIS ÅRS-FIL FRÅN FÖREG. ÅRSSKIFTE                               
//*                                                                             
//W55175D3 DD  DSN=&INDIN3..W51053(+0),DISP=SHR                                 
//         DD  DSN=&INDIN3..W51054(+0),DISP=SHR                                 
//************ SALDOFILER ALLA DC UTOM USA OCH CANADA                           
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55175D4 DD  DSN=&INDUT..W55175A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W55175-001 ANALYS AV KOMMANDE PRISER / PRODUKTSLAG               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W55175D5 DD  DSN=&INDUT..W55175B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W55175-002  KONTROLL-LISTA EJ JÄMFÖRBARA ARTIKLAR/PRODSL         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W55175D6 DD  DSN=&INDUT..W55175C(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W55175-003  ANALYS AV KOMMANDE PRISER / TOTALT                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W55175D7 DD  DSN=&INDREG..W01172(+0),DISP=SHR                                 
//************ ARTIKELREG EXTRAKT MED NYTT STDPRIS                              
