//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SPIS                                                                       
//*                                                                             
//*  MATCHAR PRISFIL MED SPIS-BAS-FIL                                           
//*  SKAPAR LADDTRANSAR TILL SPIS-BASEN WDC6                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W551B1                                      
//*                                                                             
//*  ÅTERSTART:    W55158    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P058 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55158   EXEC PGM=V16459,PARM='W55158/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W55158D1 DD  DSN=&INDIN..W55156(+0),DISP=SHR                                  
//************ PRISFIL FRÅN W551P056                                            
//*                                                                             
//W55158D2 DD  DSN=&INDIN..W55147(+0),DISP=SHR                                  
//************ UTDRAG UR SPIS-BASEN (WDC6)                                      
//*                                                                             
//W55158D3 DD  DSN=&INDUT..W55158(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LADDTRANSAR SAMT UNDERLAG FÖR ANALYS                             
//             DATACLAS=PSEN,MGMTCLAS=BACKUPC                                   
//W55158D4 DD  DSN=&INDUT..W55158R(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ FILE TO CHECK DIFF OFF THE GENERATION OF FILES                   
//             DATACLAS=PSEN,MGMTCLAS=BACKUPC                                   
//W55158D5 DD  DSN=&INDUT..W55158F(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ REPORT W55158-001 FEL OCH KONTROLL LISTA                         
//             DATACLAS=PSEN,MGMTCLAS=BACKUPC                                   
