//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER STANDARDPRIS I SEK  TILL MARKNADSBOLAGETS VALUTA                     
//*  OMRÄKNAR MED ÅRSVALUTA.                                                    
//*                                                                             
//*  FREKVENS:     DAG     RTN W551B6                                           
//*                                                                             
//*  ÅTERSTART:    W551B6      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P067 PROC STPLIB=&INDRTE..LOAD,                                           
//             TYP=SAKNAS,                                                      
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55167   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55167,W55167,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//W55167D1 DD  DSN=&INDRTE..CONSTANT(W551&TYP),DISP=SHR                         
//************ TYP AV MARKNADSBOLAG                                             
//*                                                                             
//W55167D2 DD  DSN=&INDIN..W55161(+0),DISP=SHR                                  
//************ FIL FRÅN W55160                                                  
//*                                                                             
//W55167D3 DD  DSN=&INDUT..W55167(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SAMMA SOM D2 MED UTBYTT STDPRIS FÖR MARKNADSBOLAG                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
