//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  D&P REPORT W55181-001                                                      
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W551B8                                         
//*                                                                             
//*  RESTART:      W55181    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P081 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B8,                                             
//             INDIN2=&WXTR..PARTINFO,                                          
//             INDUT=&W551..W551B8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55181   EXEC PGM=V16459,PARM='W55181/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55181D1 DD  DSN=&INDIN..W55180(+0),DISP=SHR                                  
//************ W55178 FILE                                                      
//*                                                                             
//W55181D2 DD  DSN=&INDIN2..WCDCDAY(+0),DISP=SHR                                
//************ CDC PARTS INFO                                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL4   DD  DSN=&&TPFIL4,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//W55181D3 DD  DSN=&INDUT..W55181(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ W55181-001 D&P                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
