//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPY FILES FOR W551B1                                                      
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W551B7                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P013 PROC INDIN=&W551..W551B7,                                            
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W55105(+0),DISP=SHR                                  
//************ FILE FROM W551B7                                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W55105(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ COPIED FILE FOR W551B1                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W55114(+0),DISP=SHR                                  
//************ FILE FROM W551B7                                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W55114(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ COPIED FILE FOR W551B1                                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
