//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TULLFAKTOR, LÄSER OMFORMAD EXCEL-FIL FRÅN TULLFAKTOR-ANSVARIG              
//*              OCH UPPDATERAR PULS ALLA LEVERANTÖRER PÅ WDF1                  
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W551B9                                     
//*                                                                             
//*  ÅTERSTART:    W55116    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P016 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W553..W551B9,                                             
//             INDUT=&W551..W551B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55116   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W55116,W55116,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W55116D1 DD  DSN=&INDIN..W55307(+0),DISP=SHR                                  
//************ INFIL, COBOLANPASSADE EXCELPOSTER FRÅN ANSVARIG                  
//*                                                                             
//W55116D2 DD  DSN=&INDUT..W55144X(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UTFIL MED FEL POSTER                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
