//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SPIS                                                                       
//*                                                                             
//*  KOMPLETTERAR PRISFIL MED SATS-ARTIKEL UPPGIFTER                            
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W551B1                                      
//*                                                                             
//*  ÅTERSTART:    W55156    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55156   EXEC PGM=V16459,PARM='W55156/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//W55156D1 DD  DSN=&INDIN..W55155(+0),DISP=SHR                                  
//************ PRISFIL FRÅN W551P055                                            
//*                                                                             
//W55156D2 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ PRISFIL KOMPLETTERAD UTRÄKNAD PRINK-KOM                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55156D3 DD  DSN=&INDIN..W55146(+0),DISP=SHR                                  
//************ SATS-REGISTER FIL FRÅN W551P046                                  
//*                                                                             
//W55156D4 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ PRISFIL KOMPL. MED PRINK-KOM OCH FLIART                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55156D5 DD  DSN=&&TEMP3,DISP=(NEW,PASS,DELETE),                              
//************ SAMTLIGA ARTIKLAR INGÅENDE I SATS MED PRINK-KOM                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55156D6 DD  DSN=&&TEMP4,DISP=(NEW,PASS,DELETE),                              
//************ SATSARTIKLAR (INGI-ART SUMMERADE)                                
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55156D7 DD  DSN=&INDUT..W55156(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PRISFIL KOMPLETTERAD MED SATS-ARTIKEL UPPGIFTER                  
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
