//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STANDARD PRICE CHANGES LIST                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W551B1                                         
//*                                                                             
//*  RESTART:      W55171    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55171   EXEC PGM=V16459,PARM='W55171/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55171D1 DD  DSN=&INDIN..W55158(+0),DISP=SHR                                  
//************ FROM W551J058                                                    
//*                                                                             
//W55171D2 DD  DSN=&INDUT..W55171(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ D&P REPORT - W55171-001                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
