//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDF1 MWD SB SKAPAR FIL MED TULLFAKTOR PER                            
//*  LEVERANTÖR.                                                                
//*                                                                             
//*  FREKVENS:     BESTÄLLNING RTN W551B1                                       
//*                                                                             
//*  ÅTERSTART:    W55144      NORMAL                                           
//*                LÄSER  WDF1                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55144   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55144,W55144,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDF1     INCLUDE MEMBER=WDF1                                                  
//W55144D1 DD  DSN=&INDUT..W55144(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED TULLFAKTOR                                               
//*            SPACE=(17,(5,1),RLSE),AVGREC=K,                                  
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=BACKUPC                                                 
