//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADD-PROGRAM FÖR SPIS DATABAS (WDC6)                                       
//*  ANVÄNDER BMC-UTILITY LOADPLUS/EP                                           
//*                                                                             
//*  FREKVENS:     BESTÄLLES                                                    
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P059 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W551..W551B1                                             
//W55159   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55159,WDC6LD,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//BMCPRINT DD  SYSOUT=*                                                         
//BMCMSG   DD  SYSOUT=*                                      -- DISPLAY         
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DFSURWF1 DD  DSN=&&DFSURWF1,DISP=(NEW,PASS,DELETE),                           
//             SPACE=(TRK,(20,20),RLSE),                                        
//             DCB=(BLKSIZE=27998,BUFNO=5)                                      
//IEFRDER  DD  DUMMY,DCB=(RECFM=VBS,LRECL=1400,BLKSIZE=1408,BUFNO=1)            
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//*                                                                             
//WDC6     INCLUDE MEMBER=WDC6                                                  
//*DC6AK   DD  DSN=&INDBAS..WDC6AK,DISP=SHR                                     
//*                                                                             
//W55159D1 DD  DSN=&INDIN2..W55122(+0),DISP=SHR                                 
//************ LADDPOSTER FÖR WDC6                                              
