//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR W55142 MED W55143 OCH HÄMTAR INFO FRÅN                             
//*  BEHOVSMODULEN.                                                             
//*                                                                             
//*  FREQUENCE:    BESTÄLLNING  RTN W551B1                                      
//*                                                                             
//*  RESTART:      W55150      NORMAL                                           
//*                READS  ARTC ARTM                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55150   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55150,W55150,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDP3     INCLUDE MEMBER=WDP3                                                  
//W55150D1 DD  DSN=&INDIN..W55149(+0),DISP=SHR                                  
//************ ARTIKELINFO                                                      
//*                                                                             
//W55150D2 DD  DSN=&INDIN..W55143(+0),DISP=SHR                                  
//************ LEVERANTÖR INFO                                                  
//*                                                                             
//W55150D3 DD  DSN=&INDUT..W55150(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ SPIS BASPOSTER                                                   
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//W55150D4 DD  DSN=&INDUT..W55151(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PREL POSTER                                                      
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
