//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KALKYLPÅLÄGG SATS-FAKTORFIL                                                
//*                                                                             
//*  FREKVENS:     BEST   RTN W551B7                                            
//*                                                                             
//*  ÅTERSTART:    W55102   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W551..W551B1,                                            
//             INDIN2=&W551..W551B7,                                            
//             INDUT=&W551..W551B7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTPR1  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W55146(+0),DISP=SHR                                 
//************ SATSSTRUKTURFIL FRÅN W551P046                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W55146,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD SATSSTRUKTURFIL                                         
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55102   EXEC PGM=V16459,PARM='W55102/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W55102D1 DD  DSN=&&W55146,DISP=(OLD,DELETE,DELETE)                            
//************ SATSSTRUKTURFIL FRÅN SORTEN                                      
//*                                                                             
//W55102D2 DD  DSN=&INDIN2..W55159(+0),DISP=SHR                                 
//************ ARTIKELINFORMATION SORTIMENT SOM I SPIS                          
//*                                                                             
//W55102D3 DD  DSN=&INDUT..W55103(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FAKTORFIL                                                        
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL3 DD  DSN=&&TEMP3,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL4 DD  DSN=&&TEMP4,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL5 DD  DSN=&&TEMP5,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TEMPFIL6 DD  DSN=&&TEMP6,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55102D4 DD  DSN=&INDUT..W55102A(+1),DISP=(NEW,CATLG,DELETE),                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
