//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INFREIGHT FACTOR CHANGE LIST                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W551B8                                         
//*                                                                             
//*  RESTART:      W55184    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P084 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B8,                                             
//             INDUT=&W551..W551B8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55184   EXEC PGM=V16459,PARM='W55184/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55184D1 DD  DSN=&INDIN..W55183(+0),DISP=SHR                                  
//************ WDF1 DATA                                                        
//*                                                                             
//W55184D2 DD  DSN=&INDUT..W55184(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ D&P - W55184-001                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
