//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AVSTÄMNINGSLISTOR FÖR PRISSÄTTNING AV KALKYLPÅLÄGG                         
//*                                                                             
//*  FREQUENCE:    BESTÄLLES RTN W551B7                                         
//*                                                                             
//*  RESTART:      W55176    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P076 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B7,                                             
//             INDUT=&W551..W551B7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55176   EXEC PGM=V16459,PARM='W55176/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55176D1 DD  DSN=&INDIN..W55105(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W55114(+0),DISP=SHR                                  
//************ KALKYLPÅLÄGG                                                     
//*                                                                             
//W55176D2 DD  DSN=&INDIN..W55159(+0),DISP=SHR                                  
//************ ARTIKELINFORMATION SORTIMENT SOM I SPIS                          
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55176D3 DD  DSN=&INDUT..W55176(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ REPORT W55176-001                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
