//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCH FILES W55158 AND W55121 AND USE CURRENCY VALUE FROM W55145           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W551B1                                         
//*                                                                             
//*  RESTART:      W55122    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W551..W551B1,                                             
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTVA1  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5B),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W55145(+0),DISP=SHR                                  
//************ CURRENCY FILE FROM W551P044                                      
//*                                                                             
//SORTOUT  DD  DSN=&&VALUT1,DISP=(NEW,PASS,DELETE),                             
//************ CURRENCY FILE SORTED ON KDVALISO,TIAA D                          
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTVA2  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5C),DISP=SHR                         
//SORTIN   DD  DSN=&&VALUT1,DISP=(OLD,DELETE,DELETE)                            
//************ CURRENCY FILE SORTED ON KDVALISO,TIAA D                          
//*                                                                             
//SORTOUT  DD  DSN=&&VALUTA,DISP=(NEW,PASS,DELETE),                             
//************ CURRENCY FILE WITH ONE POST PER KDVALISO                         
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *               
//W55122   EXEC PGM=V16459,PARM='W55122/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55122D1 DD  DSN=&INDIN..W55121(+0),DISP=SHR                                  
//************ INFILE W55121                                                    
//*                                                                             
//W55122D2 DD  DSN=&INDIN..W55158(+0),DISP=SHR                                  
//************ INFILE W55158                                                    
//*                                                                             
//W55122D3 DD  DSN=&&VALUTA,DISP=(OLD,DELETE,DELETE)                            
//************ INFILE CURRENCY FILE                                             
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FOR SORTED W55121                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FOR SORTED W55158                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FOR SORTED W55121 WITH KDVALISO                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55122D4 DD  DSN=&INDUT..W55122(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UT FILE                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
