//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER VALUTAREG. OCH SKAPAR EN UTFIL.                                      
//*                                                                             
//*  FREKVENS:     BESTÄLLNING  RTN W551B1                                      
//*                                                                             
//*  ÅTERSTART:    W55145      NORMAL                                           
//*                LÄSER  WDG2                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P045 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55145   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55145,W55145,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//*        DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//*DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                   
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W55145D1 DD  DSN=&INDUT..W55145(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED VALUTA INFORMATION.                                      
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
