//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR PRISFILEN MED HEMTAGNINGSFAKTOR (WDF1)                        
//*  OCH VALUTA-KURS (WDR2).                                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W551B1                                      
//*                                                                             
//*  ÅTERSTART:    W55154    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P054 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W551..W551B1,                                            
//             INDUT=&W551..W551B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTPR1  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5A),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W55150(+0),DISP=SHR                                 
//************ PRISFIL FRÅN W551P050 SORTERAD PÅ ARTIKELNUMMER                  
//*                                                                             
//SORTOUT  DD  DSN=&&PRIS,DISP=(NEW,PASS,DELETE),                               
//************ PRISFIL SORTERAD PÅ LEVERANTÖR                                   
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTVA1  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5B),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W55145(+0),DISP=SHR                                 
//************ VALUTA-FIL FRÅN W551P044                                         
//*                                                                             
//SORTOUT  DD  DSN=&&VALUT1,DISP=(NEW,PASS,DELETE),                             
//************ VALUTA FIL SORTERAD PÅ KDVALISO,TIAA D                           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTVA2  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5C),DISP=SHR                         
//SORTIN   DD  DSN=&&VALUT1,DISP=(OLD,DELETE,DELETE)                            
//************ VALUTA FIL SORTERAD PÅ KDVALISO,TIAA D                           
//*                                                                             
//SORTOUT  DD  DSN=&&VALUTA,DISP=(NEW,PASS,DELETE),                             
//************ VALUTA FIL MED ENDAST EN POST PER KDVALISO                       
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55154   EXEC PGM=V16459,PARM='W55154/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(2000,2000))                                         
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W55154D1 DD  DSN=&&PRIS,DISP=(OLD,DELETE,DELETE)                              
//************ VALUTA FIL SORTERAD PÅ KDVALISO,TIAA                             
//*                                                                             
//W55154D2 DD  DSN=&INDIN1..W55144(+0),DISP=SHR                                 
//************ LEVERANTÖRS UPPGIFTER (HEMTAGNINGSFAKTORN)                       
//*                                                                             
//W55154D3 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ PRISFIL KOMPLETTERAD MED HEMTAGNINGSFAKTORN                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55154D5 DD  DSN=&INDUT..W55154F(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W55454-001 FELLISTA FRÅN LEVERANTÖRSREGISTRET                    
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W55154D6 DD  DSN=&&VALUTA,DISP=(OLD,DELETE,DELETE)                            
//************ FELLISTA FRÅN MATCH MED LEVERANTÖRSREGISTRET                     
//*                                                                             
//W55154D7 DD  DSN=&&W55154,DISP=(NEW,PASS,DELETE),                             
//************ PRISFIL KOMPLETTERAD MED HEMTAGNINGSFAKTOR + VALUTA              
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55154D8 DD  DSN=&INDUT..W55154G(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ W55154-002  FELLISTA FRÅN MATCH MED VALUTA-FILEN                 
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTPR2  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W551PD5D),DISP=SHR                         
//SORTIN   DD  DSN=&&W55154,DISP=(OLD,DELETE,DELETE)                            
//************ FELLISTA FRÅN MATCH MED VALUTA-FILEN                             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W55154(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOMPLETTERADE PRISFILEN SORTERAD PÅ ARTIKELNUMMER                
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
