//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  AVSTÄMNINGSLISTOR FÖR PRISSÄTTNING AV KALKYLPÅLÄGG                         
//*                                                                             
//*  FREQUENCE:    ORDERED   RTN W551B5                                         
//*                                                                             
//*  RESTART:      W55177    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W551P077 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN1=&WXTR..PARTINFO,                                          
//             INDIN2=&W551..W551B1,                                            
//             INDUT=&W551..W551B5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55177   EXEC PGM=V16459,PARM='W55177/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W55177D1 DD  DSN=&INDIN1..WCDCDAY(+0),DISP=SHR                                
//************ KALKYLPÅLÄGG                                                     
//*                                                                             
//W55177D2 DD  DSN=&INDIN2..W55159(+0),DISP=SHR                                 
//************ ARTIKELINFORMATION SORTIMENT SOM I SPIS                          
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMP FILE                                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//W55177D3 DD  DSN=&INDUT..W55177(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ REPORT W55177-001                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
