//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE FILE FROM WEB INTO W553B4                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W553B4                                         
//*                                                                             
//*  RESTART:      W55307    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W553P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W553..W553B4,                                             
//             INDUT=&W553..W553B4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55307   EXEC PGM=W55307                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//*                                                                             
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W55307D1 DD  DSN=&INDIN..CSV.W55307(+1),DISP=SHR                              
//************ INFREIGHT FACTOR FILE FROM WEB-SITE (UNIX)                       
//************ READS THE (+1) WHILE THE FILE IS CREATED                         
//************ IN THE SAME JOB AS THIS ALLOCATION.                              
//*                                                                             
//W55307D2 DD  DSN=&INDUT..W55307(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ ADJUSTED  FILE TO W553B4                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W55307D3 DD  DSN=&INDUT..W55307F(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)         
//************ ERROR FILE W55307-001                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
