//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STD/SJK  LISTA BORTPLOCKADE PRISRADER                                      
//*                                                                             
//*  FREKVENS:     VECKA    RTN W553V1                                          
//*                                                                             
//*  ÅTERSTART:    W55329   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W553P029 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W553..W553V1,                                             
//             INDUT=&W553..W553V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55329   EXEC PGM=V16459,PARM='W55329/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W55329D1 DD  DSN=&INDIN..W55324(+0),DISP=SHR                                  
//************ VECKANS PRISÄNDRINGSHÄNDELSER                                    
//*                                                                             
//W55329D2 DD  DSN=&INDUT..W55329(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W51074-001  LISTA R25:OR TILL ONDEMAND                           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
