//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE FILE FROM WEB INTO W553D1                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W553B1                                         
//*                                                                             
//*  RESTART:      W55301    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W553P001 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W553..W553B1,                                             
//             INDUT=&W553..W553B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55301   EXEC PGM=W55301                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//*                                                                             
//SYSOUT   DD DSN=&INDUT..W55302(+1),DISP=(NEW,CATLG,DELETE),   -LIM(10)        
//***********   ALL ERRORS DISPLAYED AND LISTED WITH MAIL   -- DISPLAY          
//          RECFM=FB,LRECL=80,                                                  
//          MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                     
//*                                                                             
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//*                                                                             
//W55301D1 DD  DSN=&INDIN..CSV.W55301(+1),DISP=SHR                              
//************ CLASSIC PARTS PRICE FILE FROM WEB-SITE (UNIX)                    
//************ READS THE (+1) WHILE THE FILE IS CREATED                         
//************ IN THE SAME JOB AS THIS ALLOCATION.                              
//*                                                                             
//W55301D2 DD  DSN=&INDUT..W55301(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ ADJUSTED PRICE FILE TO W553D1                                    
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
