//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR PRISÄNDRINGSLISTOR TILL ON-DEMAND ISTÄLLET FÖR LISTOR              
//*  W55327-001,W55328-001,W55329-001,W55330-001,W55332-001                     
//*                                                                             
//*  FREKVENS:     VECKA   RTN W553V1                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W553P031 PROC INDIN=&W553..W553V1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP4)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W55327(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W55328(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W55329(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W55330(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W55332(+0),DISP=SHR                                  
//************** VECKAN PRISÄNDRINGSTRANSAR TILL ON-DEMAND                      
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W55327-001 LISTA MED PRISÄNDRINGAR TILL ON-DEMND                 
//*                                                                             
