//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KONTROLLERAR TRANSAR FRÅN PV-INKÖP                                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W553B2                                           
//*                                                                             
//*  ÅTERSTART:    W55313      NORMAL                                           
//*                LÄSER  WDK6 WDF1 WDG2                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W553P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W553..W553B2,                                             
//             INDUT=&W553..W553B2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55313   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55313,W55312,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDP3     INCLUDE MEMBER=WDP3                                                  
//W55313D1 DD  DSN=&INDIN..W55302,DISP=SHR                                      
//************ FIL MED PRISFÖRÄNDRINGAR FRÅN EXCEL                              
//*                                                                             
//W55313D2 DD  DSN=&INDUT..W55313A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W55313A  FELLISTA VCC W55312-001 REPORT                          
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//W55313D3 DD  DSN=&INDUT..W55313B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W55313B  REPORT FÖR MPP-DISPATCHERPROGRAMMET W55312-002          
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W55313D4 DD  DSN=&INDUT..W55313(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ GODKÄNDA POSTER FÖR MPP-DISPATCHERPROGRAMMET                     
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
