//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER PARAMETERFILERNA, SORTERAR DESSA OCH DUBBLETT-                       
//*  ELIMINERAR, MATCHAR EMOT INNEVARANDE-/FÖREGÅENDE ÅR                        
//*                                                                             
//*  FREKVENS:     DAGLIG        RTN W555B1                                     
//*                                                                             
//*  ÅTERSTART:    W55507    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W555..W555B1,                                            
//             INDIN2=&W555..W555V1,                                            
//             INDIN3=&W555..W555Y1,                                            
//             INDUT=&W555..W555B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55507   EXEC PGM=W55507                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W55507D1 DD  DSN=&INDIN1..W55504(0),DISP=SHR                                  
//************ PARAMETRAR                                                       
//*                                                                             
//W55507D2 DD  DSN=&INDIN2..W55501,DISP=SHR                                     
//************ INNEVARANDE ÅR (PÅ DISK, EN FIL PER VECKA)                       
//*                                                                             
//W55507D3 DD  DSN=&INDIN3..W55501,DISP=SHR                                     
//************ FÖREGÅENDE ÅR (PÅ DISK, EN FIL PER VECKA)                        
//*                                                                             
//W55507D4 DD  DSN=&INDUT..W55507(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ BESTÄLLDA ARTIKLAR                                               
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
