//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NER URVAL AV SOL-BASEN PÅ FIL (SENASTE TIMMENS UPPDATERING)          
//*                                                                             
//*  FREKVENS:     MÅNAD     RTN W500M1                                         
//*                                                                             
//*  ÅTERSTART:    W55514      NORMAL                                           
//*                LÄSER       WDL9 (SALDO-UPD-LOGGBASEN)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W510..&RTEGRP.,                                           
//             INDUT=&W555..W500M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55514   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W55514,W55514,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL9     INCLUDE MEMBER=WDL9                                                  
//*                                                                             
//W55514D1 DD  DSN=&INDIN..W51054(+0),DISP=SHR                                  
//************ SENASTE SALDOUPPGIFTER FRÅN WDK6                                 
//*                                                                             
//W55514D2 DD  DSN=&INDUT..W55514(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ NYA MÅNADENS FÖRSTA UPPDATERINGAR                                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
