//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÅRSKIFTESRUTIN SKAPAR TOMFIL FÖR ATT KÖRA PÅ UNDER KOMMANDE VECKA          
//*                                                                             
//*  FREKVENS:     ÅRLIG     RTN W555Y1                                         
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P008 PROC INDUT=&W555..W555V1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555TOM  EXEC PGM=V16266,PARM='DD'                                            
//DD1      DD  DSN=&INDUT..W55501(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ "NY" ÅRETS FIL (LÄGGER UPP TOMFIL)                               
//             DCB=(RECFM=FB,LRECL=116,BLKSIZE=116),                            
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=BACKUPC                                                 
