//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  STARTAS FRÅN BILD 5161 OCH GÖR EN UTFIL W55504                             
//*                                                                             
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W555B1                              
//*                                                                             
//*  ÅTERSTART:    W55504    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P004 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDUT=&W555..W555B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55504   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W55504,W55504,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W55504D1 DD  DSN=&INDUT..W55504(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ BESTÄLLDA ARTIKLAR ATT SELEKTERAS FÖR UPPLÄGG                    
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
