//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER RENSNINGSPOSTER OCH TAR BORT MOTSVARANDE PÅ WDL9                     
//*                                                                             
//*  FREKVENS:     DAG       RTN W555D2                                         
//*                                                                             
//*  ÅTERSTART:    W55503    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P103 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=8,                                                           
//             INDIN=&W555..W555D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55503   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W55503,W55503,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W55503D1 DD  DSN=&INDIN..W55512(+0),DISP=SHR                                  
//************ INFIL W475-SUM-POSTER FÖR BORTTAG                                
//         DD  DSN=&INDIN..W55511(+0),DISP=SHR                                  
//************ INFIL W475-SUM-POSTER DUBBLETTER FÖR BORTTAG                     
