//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER INFIL W55507 OCH UPPDATERAR WDL9 MED BESTÄLLDA SALDOPOSTER           
//*                                                                             
//*  FREKVENS:     DAGLIG        RTN W555B1                                     
//*                                                                             
//*  ÅTERSTART:    W55505    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W555P005 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=2,                                                           
//             INDIN=&W555..W555B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W55505   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W55505,W55505,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W55505D1 DD  DSN=&INDIN..W55507(+0),DISP=SHR                                  
//************ BESTÄLLDA POSTER ATT LÄGGAS UPP PÅ WDL9                          
