//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LIST YEARLY 'AGING REPORT' FOR ATLANTA (DC 42)                             
//*        ON FILES, FOR SENDING VIA VCOM                                       
//*                                                                             
//*  FREKVENS:     YEAR W560Y3                                                  
//*                                                                             
//*  RESTART:      W56085    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P085 PROC INDIN=&W560..W560Y3,                                            
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDIN2=&W510..W560Y3,                                            
//             INDUT1=&W560..W560Y3,                                            
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56085   EXEC PGM=V16459,PARM='W56085/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//SORTMSG  DD  SYSOUT=*                                                         
//W56085D1 DD  DSN=&INDIN2..W51052(-1),DISP=SHR                                 
//************ NDC-SALDOREGISTER FRÅN NÄST SENASTE ÅRSSKIFTET                   
//*                                                                             
//W56085D2 DD  DSN=&INDIN2..W51052(+0),DISP=SHR                                 
//************ NDC-SALDOREGISTER FRÅN SENASTE ÅRSSKIFTET                        
//*                                                                             
//W56085D3 DD  DSN=&INDIN1..W01160(+0),DISP=SHR                                 
//************ FIL MED WDK6-EXTRAKT                                ***          
//*                                                                             
//W56085D4 DD  DSN=&INDIN1..W01174(+0),DISP=SHR                                 
//************ FIL MED ARTIKELBENÄMNINGAR                                       
//*                                                                             
//W56085D5 DD  DSN=&INDIN..W56019,DISP=SHR                                      
//************ FIL MED GÅGNA ÅRETS ALLA LAB-TRANSAR                ***          
//*                                                                             
//W56085D6 DD  DSN=&&TEMP42,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56085-042 AGING REPORT                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFILTO  DD  DSN=&&TEMPTO,DISP=(NEW,DELETE,DELETE),                           
//************ NDC-SALDOREGISTER FRÅN FÖRRA ÅRSSKIFTET, SORTERAT                
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFILTN  DD  DSN=&&TEMPTN,DISP=(NEW,DELETE,DELETE),                           
//************ NDC-SALDOREGISTER FRÅN SENASTE ÅRSSKIFTET, SORTERAT              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL                                         
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL + KDPSSLOC O REKSIFF                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL + KDPSSLOC O REKSIFF + BEART-US         
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL4   DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//************ GÅGNA ÅRETS LABTRANSAR FORMERADE MED 3 BELOPP                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL5   DD  DSN=&&TEMP5,DISP=(NEW,DELETE,DELETE),                            
//************ GÅGNA ÅRETS LABTRANSAR SUMMERADE PER ARTIKEL OCH DC              
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    KOPIERAR LISTAN PÅ FIL FÖR LAB FÖR ATT                         *         
//*    VCOM EJ KLARAR ATT HANTERA FILER MED FBA (SKALL VARA FB)       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56086  EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&TEMP42,DISP=(OLD,DELETE,DELETE)                            
//************** LISTA AGING REPORT FOR ATLANTA DC 42           ***             
//*                                                                             
//SYSUT2   DD  DSN=&INDUT1..W56085(+1),                        -LIM(03)         
//             DISP=(NEW,CATLG,DELETE),                                         
//*********** LISTFIL  W56085-042 AGING REPORT FOR ATLANTA                      
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
