//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTTRANSAR TILL USA-LAB:S ÅRLIGA LIFO-LISTOR                       
//*                                                                             
//*  FREKVENS:     ÅRSRUTIN  RTN W560Y4                                         
//*                                                                             
//*  ÅTERSTART:    W56074    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560P074 PROC INDIN=&W510..W560R1,                                            
//             INDREG=&W011,                                                    
//             INDUT=&W560..W560Y4,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56074   EXEC PGM=V16459,PARM='W56074/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//W56074D1 DD  DSN=&INDREG..W01172(+0),DISP=SHR                                 
//************ ARTIKELREGISTERUTDRAG WDK6                                       
//*                                                                             
//W56074D2 DD  DSN=&INDIN..W51052(+0),DISP=SHR                                  
//************ EXTRAKTFIL MED ARTIKELINFO FRÅN WDK7 MED SALDON BL.A.            
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD WDK7-FIL                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD ÅRSINVENTARIE-FIL LAB                          
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56074D3 DD  DSN=&INDUT..W56074(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTTRASAR                                                       
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
