//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ALL TRANSACTIONS TO LAB BEFORE DUBBEL-EXCHANGE                             
//*                                                                             
//*  FREKVENS:     DAILY                                                        
//*                RTN W560D1                                                   
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560P019 PROC INDIN=&W510..W560D1,                                            
//             INDUT=&W560..W560D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER1  EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W51031,DISP=SHR                                      
//************ LABPOSTER FRÅN FAKT. TYP A01,AX2,A07,A09,A15,L02,L09             
//         DD  DSN=&INDIN..W51033,DISP=SHR                                      
//************ LABPOSTER FRÅN KRED. A04 A05 L05 A12                             
//         DD  DSN=&INDIN..W51040,DISP=SHR                                      
//************ LABPOSTER FRÅN INLEVERANS OCH ÖVRIGT                             
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W56019(+1),DISP=(NEW,CATLG,DELETE), -LIM(09)         
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
//*                                                                             
//SYSIN    DD  DUMMY                                                            
