//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      INVENTERING - NDC, LISTOR                                    *         
//*                                                                   *         
//*      PERIODICITET: DAG                                            *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P043 PROC INDIN2=&W513..W560D1,                                           
//             INDUT=&W560..W560D1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56043  EXEC PGM=W56043                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W56043D1 DD  DSN=&INDIN2..W5134N,DISP=SHR                                     
//**************  LISTPOSTER                                        ***         
//*                                                                             
//W56043D2 DD  DSN=&INDUT..W56043(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//**************      LISTA W56043 FYSISK AVVIKELSE NDC-NA          ***         
