//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      KURANSGRUPPERING                                             *         
//*                                                                   *         
//*      PERIODICITET:   MÅNADSSLUT                                   *         
//*                                                                   *         
//*      ÅTERSTART:      NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P052 PROC INDIN=&W560..W560M1,                                            
//             INDUT=&W560..W560M1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56052  EXEC PGM=W56052                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                  (POSTSUM)              
//*                                                                             
//W56052D1 DD  DSN=&INDIN..W56051,DISP=SHR                                      
//************ KURANSSALDO-FIL                                                  
//*                                                                             
//W56052D2 DD  DSN=&INDUT..W56052S(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UTFIL SELFLIFE                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W56052D3 DD  DSN=&INDUT..W56052K(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ UTFIL KGR                                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
