//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      MATCH WDK7 AND WDK6 PARTS                                    *         
//*                                                                   *         
//*      PERIODICITET:   MÅNADSSLUT                                   *         
//*                                                                   *         
//*      ÅTERSTART:      NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W011..NDC,                                               
//             INDIN2=&W011..W011S1,                                            
//             INDUT=&W560..W560M1                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT CORRECT NDC FROM NDC FILE                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT84   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ DC FROM JCL                                                      
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56050  EXEC PGM=W56050                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                  (POSTSUM)              
//*                                                                             
//W56050D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ LAGERBANDSINFORMATION                                            
//*                                                                             
//W56050D2 DD  DSN=&&W01184,DISP=(OLD,PASS,DELETE)                              
//************ LAGERSALDO FÖR DC                                                
//*                                                                             
//W56050D3 DD  DSN=&INDUT..W56050(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ FIL FÖR LISTNING AV KURANSGRP.REGLER                             
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
