//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES D&P LIST FOR PARTS WITH PHYSICAL DEVIATION                         
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W560D1                                         
//*                                                                             
//*  RESTART:      W56071    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W513..W560D1,                                             
//             INDUT=&W560..W560D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W560PD71),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W5134N,DISP=SHR                                      
//************ ALL GENS OF W5134N FROM W510D2                                   
//*                                                                             
//SORTOUT  DD  DSN=&&W5134N,DISP=(NEW,PASS,DELETE),                             
//************ SORTED W5134N                                                    
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56071   EXEC PGM=V16459,PARM='W56071/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W56071D1 DD  DSN=&&W5134N,DISP=(OLD,DELETE,DELETE)                            
//************ W5134N FROM W510D2                                               
//*                                                                             
//W56071D2 DD  DSN=&INDUT..W56071(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ D&P LIST PARTS-DEV                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
