//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR ÅRSFIL TILL USA:S INVENTERING                                       
//*                                                                             
//*  FREKVENS:     ÅRSRUTIN  RTN W560Y1                                         
//*                                                                             
//*  ÅTERSTART:    W56062    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P062 PROC INDREG=&W011..&RTEGRP.,                                         
//             INDIN=&W011..NDC,                                                
//             INDIN3=&W510..W560D1,                                            
//             INDUT=&W560..W560Y1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT FROM NDC FILE                                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WSORT1  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//************** LAGERBAND W01184                                               
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//**************  SORTED RECORDS                                                
//             DATACLAS=PSEN                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W560PD01),DISP=SHR                         
//*SORTERA W01184 PÅ ARTIKELNUMMER OCH DC                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56062   EXEC PGM=V16459,PARM='W56062/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W56062D1 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ EXTRAKTFIL MED ARTIKELINFO FRÅN WDK6                             
//*                                                                             
//W56062D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ EXTRAKTFILER MED ARTIKELINFO FRÅN WDK7 EJ AVST.BARA SALDO        
//*                                                                             
//W56062D3 DD  DSN=&INDIN3..W51052(+0),DISP=SHR                                 
//************ EXTRAKTFIL MED ARTIKELINFO FRÅN WDK7 MED AVST.BARA SALDON        
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELFIL K7 SORTERAD                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ ÅRSINV.FIL UTAN SALDON                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ LAB-LAGERBAND FÖR SORTERING                                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56062D4 DD  DSN=&INDUT..W56062(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ÅRSINVENTERINGS FIL MED SALDON                                   
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
