//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LIST 'MONTLY SALES AND TRANSACTION REPORTS'                                
//*        PÅ FILER FÖR ÖVERSÄNDNING MED VCOM                                   
//*  LIST 'DAILY ERROR PARTS' PÅ FIL FÖR MEMO/API                               
//*                                                                             
//*  FREKVENS:     ACCOUNTING PERIOD                                            
//*                                                                             
//*  RESTART:      W56049    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560P249 PROC INDIN=&W560..W560R1,                                            
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDIN2=&W510..W560R1,                                            
//             INDUT=&W560..W560R1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56049   EXEC PGM=V16459,PARM='W56049/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//SORTMSG  DD  SYSOUT=*                                                         
//W56049D1 DD  DSN=&INDIN2..W51052(-1),DISP=SHR                                 
//************ NDC-SALDOREGISTER FRÅN FÖRRA KÖRNINGEN                           
//*                                                                             
//W56049D2 DD  DSN=&INDIN2..W51052(+0),DISP=SHR                                 
//************ NDC-SALDOREGISTER FRÅN DENNA KÖRNINGEN                           
//*                                                                             
//W56049D3 DD  DSN=&INDIN1..W01160(+0),DISP=SHR                                 
//************ FIL ME WDK6-EXTRAKT                                 ***          
//*                                                                             
//W56049D4 DD  DSN=&INDIN1..W01174(+0),DISP=SHR                                 
//************ FIL MED ARTIKELBENAMNINGAR                                       
//*                                                                             
//W56049D5 DD  DSN=&INDIN..W56019,DISP=SHR                                      
//************ FIL MED KÖROMGÅNGENS ALLA LAB-TRANSAR               ***          
//*                                                                             
//TPFILTO  DD  DSN=&&TEMPTO,DISP=(NEW,DELETE,DELETE),                           
//************ TEMPORÄR ARTIKELFIL, OLD SORTERAD                                
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFILTN  DD  DSN=&&TEMPTN,DISP=(NEW,DELETE,DELETE),                           
//************ TEMPORÄR ARTIKELFIL, NEW SORTERAD                                
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL                                         
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL + KDPSSLOC O REKSIFF                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL3   DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELSALDOFIL + BEART-US                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL4   DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//************ PERIODENS LABTRANSAR FORMERADE MED 3 BELOPP                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL5   DD  DSN=&&TEMP5,DISP=(NEW,DELETE,DELETE),                            
//************ PERIODENS LABTRANSAR SUMMERADE PER ARTIKEL OCH DC                
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56049D6 DD  DSN=&&TEMP41,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-041 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56049D7 DD  DSN=&&TEMP42,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-042 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56049D8 DD  DSN=&&TEMP43,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-043 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56049D9 DD  DSN=&&TEMP51,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-051 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56049DC DD  DSN=&&TEMP44,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-044 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//W56049DD DD  DSN=&&TEMP45,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-045 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//W56049DE DD  DSN=&&TEMP46,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-046 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56049DF DD  DSN=&&TEMP47,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-047 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56049D0 DD  DSN=&&TEMPDC,DISP=(NEW,PASS,DELETE),                             
//************** LISTA W56049-047 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    KOPIERAR LISTOR PÅ FILER FÖR LAB FÖR ATT                       *         
//*    VCOM EJ KLARAR ATT HANTERA FILER MED FBA (SKALL VARA FB)       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56041  EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&TEMPDC,DISP=(OLD,DELETE,DELETE)                            
//****LISTA MONTLY SALES AND TRANSACTION DC 41,42,43,45,46,47,51*******         
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W56050(+1),                        -LIM(03)          
//             DISP=(NEW,CATLG,DELETE),                                         
//*********** LISTFIL  W56050-041 MONTLY SALES AND TRANSACTION REPORT           
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
