//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SALDO TILL NDC NA E-COMMERCE                                        
//*                                                                             
//*  FREKVENS:     DAGRUTIN  RTN W560D1                                         
//*                                                                             
//*  ÅTERSTART:    W56056    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P062 PROC INDREG=&W011..&RTEGRP.,                                         
//             INDIN=&W011..NDC,                                                
//             INDUT=&W560..W560D1,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT NDC NA FROM NDC FILE                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WSORT1  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W01184(+0),DISP=SHR                                  
//************** LAGERBAND W01184                                               
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//**************  SORTED NDC NA RECORDS                                         
//             DATACLAS=PSEN                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W560PD81),DISP=SHR                         
//*SORTERA W01184 PÅ ARTIKELNUMMER OCH DC                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56056   EXEC PGM=V16459,PARM='W56056/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W56056D1 DD  DSN=&INDREG..W01160(+0),DISP=SHR                                 
//************ EXTRAKTFIL MED ARTIKELINFO FRÅN WDK6                             
//*                                                                             
//W56056D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ EXTRAKTFILER MED ARTIKELINFO FRÅN WDK7                           
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR ARTIKELFIL K7 SORTERAD                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56056D3 DD  DSN=&INDUT..W56056(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ ÅRSINVENTERINGS FIL MED SALDON                                   
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
