//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR ÅRSINVENTARIUM, OCH TOTALLISTA FÖR LAB                              
//*                                                                             
//*  FREKVENS:     ÅRSRUTIN  RTN W560Y4                                         
//*                                                                             
//*  ÅTERSTART:    W56077    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W560P077 PROC INDIN=&W560..W560Y4,                                            
//             INDIN1=&W011..&RTEGRP.,                                          
//             INDIN2=&W560,                                                    
//             INDUT1=&W560..W560Y4,                                            
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56077   EXEC PGM=V16459,PARM='W56077/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,4000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//W56077D1 DD  DSN=&INDIN..W56065(+0),DISP=SHR                                  
//************ FIL MED INLEVERANSHISTORIK (WDL6)                                
//*                                                                             
//W56077D2 DD  DSN=&INDIN1..W01174(+0),DISP=SHR                                 
//************ FIL MED ARTIKELBENÄMNINGAR (WDD3)                                
//*                                                                             
//W56077D3 DD  DSN=&INDIN2..W56099(+0),DISP=SHR                                 
//************ FIL MED FUNKTIONSGRUPPSBENÄMNINGAR                               
//*                                                                             
//TPFIL01  DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR INLEVERANSFIL SORTERAD PÅ ARTIKELNR                     
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL02  DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR INLEVERANSFIL SORTERAD PÅ FUNKTIONSGRUPP                
//             DATACLAS=PSEN                                                    
//*                                                                             
//W56077D4 DD  DSN=&&TEMP77A,DISP=(NEW,PASS,DELETE),                            
//************** LISTA W56077-001 LIFO IN TRANSIT, DETAIL ALL DC                
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    KOPIERAR LISTORNA PÅ FIL ÅT LAB FÖR ATT                        *         
//*    VCOM EJ KLARAR ATT HANTERA FILER MED FBA (SKALL VARA FB)       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560GEN EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&TEMP77A,DISP=(OLD,DELETE,DELETE)                           
//************** LIST LIFO IN TRANSIT, DETAIL AND SUMMARY          ***          
//*                                                                             
//SYSUT2   DD  DSN=&INDUT1..W56077(+1),                        -LIM(03)         
//             DISP=(NEW,CATLG,DELETE),                                         
//*********** LISTFILE W56077-001, -041, -042, -043                             
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
