//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR GJORDA JUSTERINGAR UNDER VECKAN                                     
//*                                                                             
//*  FREKVENS:     VECKA    RTN W560V1                                          
//*                                                                             
//*  ÅTERSTART:    W56047   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W560P047 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W560..W560V1,                                             
//             INDUT=&W560..W560V1,                                             
//             INDREG=&W011..NDC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT NDC-NA FROM NDC FILE                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W020PD11),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG..W01184(+0),DISP=SHR                                 
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTAT LAGERBAND FRÅN NDC:ERNA                                   
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56047   EXEC PGM=V16459,PARM='W56047/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W56047D1 DD  DSN=&INDIN..W56046(+0),DISP=SHR                                  
//************ GJORDA JUSTERINGAR UNDER VECKAN CDC OCH SDC                      
//*                                                                             
//W56047D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ LAGERBAND FÖR LAB                                                
//*                                                                             
//TEMPSORT DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL1 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPFIL2 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//TEMPART  DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//W56047D3 DD  DSN=&INDUT..W56047(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ D&P LIST WEEKLY-ADJ FOR NDC-NA                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
