//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR DETALJLISTA ÖVER DAGENS REDOVISNINGAR (SOM GÅR TILL SAP),          
//*  TILL ON-DEMAND.TRANSAKTIONERNA GÄLLER FAKTURERING OCH KREDITERING          
//*                                                                             
//*  FREKVENS:     DAG     RTN W561D4                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P080 PROC INDIN=&W561..W561D4,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SPN5)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W5617O(+0),DISP=SHR                                  
//************** DAGENS EKONOMITRANSAR TILL ON-DEMAND              ***          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W56180-001 LISTA GRUNDBOKFÖRINGSTRANSAR TILL ON-DEM              
//*                                                                             
