//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DAILY REFILL REPORT FOR USA                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W561D3                                         
//*                                                                             
//*  RESTART:      W56178    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W561..W561D3,                                             
//             INDUT=&W561..W561D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W561PD78),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W56177(+0),DISP=SHR                                  
//************ SORTS W56177  WITH INVOICE NUMBER                                
//*                                                                             
//SORTOUT  DD  DSN=&&W56177,DISP=(NEW,PASS,DELETE),                             
//************ SORTED W56177 LATEST SAP EVENTS                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56178   EXEC PGM=V16459,PARM='W56178/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W56178D1 DD  DSN=&INDIN..W56177(+0),DISP=SHR                                  
//************ INPUT FILE                                                       
//*                                                                             
//W56178D2 DD  DSN=&INDUT..W56178(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DAILY REFILL REPORT FOR USA                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
