//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DETALJ-LISTA ÖVER DAGENS REDOVISNINGAR TILL SAP                     
//*  LISTAN LÄGGS SEDAN PÅ ON-DEMAND                                            
//*                                                                             
//*  FREKVENS:     DAG     RTN W561D3                                           
//*                                                                             
//*  ÅTERSTART:    W56173  NORMAL                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P073 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W561..W561D3,                                             
//             INDUT=&W561..W561D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W510PD74),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W56175(+0),DISP=SHR                                  
//************ FIL MED DAGENS ALLA KONTERINGAR ÅT SAP                           
//*                                                                             
//SORTOUT  DD  DSN=&&W56175,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD KONTERINGS-FIL                                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56173   EXEC PGM=W56173                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W56173D1 DD  DSN=&&W56175,DISP=(OLD,DELETE,DELETE)                            
//************ FIL MED DAGENS ALLA KONTERINGAR ÅT SAP, SORTERADE                
//*                                                                             
//W56173D2 DD  DSN=&INDUT..W5617O(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W56173-001  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W56173D3 DD  DSN=&INDUT..W5617P(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W56173-002  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W56173D4 DD  DSN=&INDUT..W5617Q(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W56173-003  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W56173D5 DD  DSN=&INDUT..W5617R(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W56173-004  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             DATACLAS=PSEB                                                    
//W56173D6 DD  DSN=&INDUT..W5617S(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LINE DATA FILE TO SEND TO SNOWFLAKE                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
