//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DAILY REFILL REPORT REQUESTED BU USA                                       
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W561D3                                         
//*                                                                             
//*  RESTART:      W56177      NORMAL                                           
//*                READS        WDG2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W561..W561D3,                                             
//             INDUT=&W561..W561D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W561PD66),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W56166(+0),DISP=SHR                                  
//************ SORTS W56166 FILE WITH KDEKNIVA                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W56166,DISP=(NEW,PASS,DELETE),                             
//************ SORTED W56166 FILE WITH KDEKNIVA                                 
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56177   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W56177,W56177,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W56177D1 DD  DSN=&&W56166,DISP=(OLD,DELETE,DELETE)                            
//************ LATEST DYNAMIC BOOKING EVENTS                                    
//*                                                                             
//W56177D2 DD  DSN=&INDUT..W56177(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DAILY REFILL REPORT FOR USA                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
