//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  HANTERA SAP BEGRÄNSNINGAR PÅ 950 RADER                                     
//*                                                                             
//*  FREKVENS:               RTN W561D3                                         
//*                                                                             
//*  ÅTERSTART:    W51093    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W561..W561D3,                                             
//             INDUT=&W561..W561D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56171   EXEC PGM=W56171                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W56171D1 DD  DSN=&INDIN..W56171B(+0),DISP=SHR                                 
//************ ARTIKELREG.EXTRAKT                                               
//*                                                                             
//W56171D2 DD  DSN=&INDUT..W56171(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ LARMLISTA                                                        
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
