//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      AGGREGERING AV FAKTURARADER/MERGE ÖVRIGA SAP-POSTER          *         
//*                                                                   *         
//*      PERIODICITET: DAG    RTN W561D3                              *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P072 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W561..W561D3,                                             
//             INDUT=&W561..W561D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56172   EXEC PGM=V16459,PARM='W56172/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//***VFM   DD  SPACE=(4096,(10000,5000))                                        
//EZTVFM   DD  DATACLAS=PSEB,DCB=BLKSIZE=27968                                  
//SORTMSG  DD  SYSOUT=*                                                         
//W56172D1 DD  DSN=&INDIN..W56171(+0),DISP=SHR                                  
//************ ÖVRIGA TRANSAR TILL SAP                                          
//*                                                                             
//W56172D2 DD  DSN=&INDIN..W56172(+0),DISP=SHR                                  
//************ FAKTURARADER SOM SKALL SUMMERAS                                  
//*                                                                             
//W56172D3 DD  DSN=&INDIN..W56173(+0),DISP=SHR                                  
//************ FAKTURAHUVUDEN                                                   
//*                                                                             
//W56172D4 DD  DSN=&INDUT..W56174(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL MED SORTERADE SAP-TRANSAR                                  
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEB                                 
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL MED SORTERADE FAKT.RADER                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPORÄR FIL FÖR SORTERING AV ALLA SAP-POSTERNA                  
//             DATACLAS=PSEB                                                    
