//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES .CSV FILE FOR RECEIVED GOODS  FOR US AND CN                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W561D5                                         
//*                                                                             
//*  RESTART:      W56133      NORMAL                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W561P033 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W561..W561D5,                                            
//             INDIN2=&W011..NDCTIME,                                           
//             INDUT=&W561..W561D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W561PD07),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W56131(+0),DISP=SHR                                 
//************ W56134 INFILE FOR SORT                                           
//*                                                                             
//SORTOUT  DD  DSN=&&W56131,DISP=(NEW,PASS,DELETE),                             
//************ W56134 INFILE SORTED                                             
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W56133   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W56133,W56133,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDC2     INCLUDE MEMBER=WDC2                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//W56133D1 DD  DSN=&&W56131,DISP=(OLD,DELETE,DELETE)                            
//************ EXTRACT OF WDL6 DATABASE                                         
//*                                                                             
//W56133D2 DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ EXTRACT OF WDK7 DATABASE                                         
//*                                                                             
//W56133D3 DD  DSN=&INDIN2..W01184(-1),DISP=SHR                                 
//************ PREVIOUS EXTRACT VERSION OF WDK7                                 
//*                                                                             
//W56133D4 DD  DSN=&INDUT..W56135(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ RECEIVED GOODS REPORT FOR US AND CN TO D&P                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
