//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DETALJ-LISTA ÖVER DAGENS REDOVISNINGAR TILL SAP                     
//*  LISTAN LÄGGS SEDAN PÅ ON-DEMAND                                            
//*                                                                             
//*  FREKVENS:     DAG     RTN W570D3                                           
//*                                                                             
//*  ÅTERSTART:    W57027  NORMAL                                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P027 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD21),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57055(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57035(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57095(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57025(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57015(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57043(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57055B(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57055M(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57055Z(+0),DISP=SHR                                 
//************ INPUT FILE                                                       
//*                                                                             
//SORTOUT  DD  DSN=&&W57026A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD KONTERINGS-FIL                                          
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57027   EXEC PGM=W57027                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W57027D1 DD  DSN=&&W57026A,DISP=(OLD,DELETE,DELETE)                           
//************ FIL MED DAGENS ALLA KONTERINGAR ÅT SAP, SORTERADE                
//*                                                                             
//W57027D2 DD  DSN=&INDUT..W5702O(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W57027-001  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W57027D3 DD  DSN=&INDUT..W5702P(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W57027-002  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W57027D4 DD  DSN=&INDUT..W5702Q(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W57027-003  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W57027D5 DD  DSN=&INDUT..W5702R(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ W57027-004  LISTA GRUNDBOKFÖRINGSTRANSAR TILL SAP/R3             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W57027D6 DD  DSN=&INDUT..W5702S(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LINE DATA FILE TO SEND TO SNOWFLAKE                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
