//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR DETALJLISTA ÖVER DAGENS REDOVISNINGAR (SOM GÅR TILL SAP),          
//*  TILL ON-DEMAND.TRANSAKTIONERNA GÄLLER ÖVRIGA TRANSAR.                      
//*                                                                             
//*  FREKVENS:     DAG     RTN W570D4                                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P081 PROC INDIN=&W570..W570D4,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SPN3)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W5707P(+0),DISP=SHR                                  
//************** DAGENS EKONOMITRANSAR TILL ON-DEMAND              ***          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ W57081-001 LISTA GRUNDBOKFÖRINGSTRANSAR TILL ON-DEM              
//*                                                                             
