//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  HANTERA SAP BEGRÄNSNINGAR PÅ 950 RADER                                     
//*                                                                             
//*  FREKVENS:               RTN W570D3                                         
//*                                                                             
//*  ÅTERSTART:    W51093    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P071 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570S1  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W57071B(+0),DISP=SHR                                 
//************ ARTIKELREG.EXTRAKT                                               
//*                                                                             
//SORTOUT  DD  DSN=&&W57071B,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD71),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57071   EXEC PGM=W57071                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W57071D1 DD  DSN=&&W57071B,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED FILE                                                      
//*                                                                             
//W57071D2 DD  DSN=&INDUT..W57071(+1),DISP=(NEW,CATLG,DELETE), -LIM(9)          
//************ LARMLISTA                                                        
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
