//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SW TEXT IN FILES                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W570D3                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                W57069    NORMAL                                             
//*                          NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P069 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57071A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57091A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57051A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57031A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57021A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57041A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57011A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57051B(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57051M(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57051Z(+0),DISP=SHR                                 
//************ INFILE                                                           
//*                                                                             
//SORTOUT  DD  DSN=&&W57071A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD INFIL W57071A                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57073A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57093A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57053A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57033A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57023A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57043A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57013A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57053B(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57053M(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57053Z(+0),DISP=SHR                                 
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W57073A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD UTFIL W57073A                                           
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57069   EXEC PGM=V16459,PARM='W57069/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W57069D1 DD  DSN=&&W57071A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED INFILE W57071                                             
//*                                                                             
//W57069D2 DD  DSN=&&W57073A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED INFILE W57073                                             
//*                                                                             
//W57069D3 DD  DSN=&&W57071B,DISP=(NEW,PASS,DELETE),                            
//************ OUTFILE W5707B                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//W57069D4 DD  DSN=&&W57073B,DISP=(NEW,PASS,DELETE),                            
//************ OUTFILE W57073B                                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT3    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD03),DISP=SHR                         
//SORTIN   DD  DSN=&&W57071B,DISP=(OLD,DELETE,DELETE)                           
//************ OUTFILE W57071B                                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W57071B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ OUTFILE W57071B                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT4    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD03),DISP=SHR                         
//SORTIN   DD  DSN=&&W57073B,DISP=(OLD,DELETE,DELETE)                           
//************ OUTFILE W57073B                                                  
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W57073B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ OUTFILE W57073B                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
