//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CHINA/US INBOUND LIST                                                      
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W570M3                                       
//*                                                                             
//*  RESTART:      W57088    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P088 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570M3,                                             
//             INDUT=&W570..W570M3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57088   EXEC PGM=V16459,PARM='W57088/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W57088D1 DD  DSN=&INDIN..W57087(+0),DISP=SHR                                  
//************ VALID INBOUNDS FOR CHINA/US                                      
//*                                                                             
//W57088D2 DD  DSN=&INDUT..W57088(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ CHINA INBOUND LIST                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W57088D3 DD  DSN=&INDUT..W57088A(+1),                                         
//             DISP=(NEW,CATLG,DELETE),                        -LIM(1)          
//************ US INBOUND LIST                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
