//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GET STOCK BALANCE AND AVERAGE COST                                         
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W570M3                                       
//*                                                                             
//*  RESTART:      W57087    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P087 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570M3,                                             
//             INDIN2=&W011..NDC,                                               
//             INDUT=&W570..W570M3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57087   EXEC PGM=V16459,PARM='W57087/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W57087D1 DD  DSN=&INDIN..W57086(+0),DISP=SHR                                  
//************ VALID INBOUNDS                                                   
//*                                                                             
//W57087D2 DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ WDK7 DATA                                                        
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//W57087D3 DD  DSN=&INDUT..W57087(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ STOCK BALANCE AND AVG. COST                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
