//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SW TEXT IN FILES                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W570D3                                         
//*                                                                             
//*  RESTART:      W57070    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57072A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57092A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57052A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57032A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57022A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57042A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57012A(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57052B(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57052M(+0),DISP=SHR                                 
//         DD  DSN=&INDIN..W57052Z(+0),DISP=SHR                                 
//************ INFILE                                                           
//*                                                                             
//SORTOUT  DD  DSN=&&W57072A,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD INFIL W57072A                                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57070   EXEC PGM=W57070                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W57070D1 DD  DSN=&&W57072A,DISP=(OLD,DELETE,DELETE)                           
//************ SORTED INFILE W57072                                             
//*                                                                             
//W57070D2 DD  DSN=&INDIN..W57073B(+0),DISP=SHR                                 
//************ SORTED INFILE W57073                                             
//*                                                                             
//W57070D3 DD  DSN=&&W57072,DISP=(NEW,PASS,DELETE),                             
//************ OUTFILE W57072                                                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//W57070D4 DD  DSN=&INDUT..W57073(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTFILE W57073                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT3    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD02),DISP=SHR                         
//SORTIN   DD  DSN=&&W57072,DISP=(OLD,DELETE,DELETE)                            
//************ OUTFILE W57072                                                   
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W57072(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTFILE W57072                                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
