//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SELECT UNIQUE PARTS FROM W01185                                            
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W570M2                                       
//*                                                                             
//*  RESTART:      W5704G    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P04G PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W500V1,                                             
//             INDIN2=&W011..NDC,                                               
//             INDUT=&W570..W570M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W5704G   EXEC PGM=V16459,PARM='W5704G/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W5704GD1 DD  DSN=&INDIN..W5105C(+0),DISP=SHR                                  
//************ SORTED W5105C WITH XDC-NON-VCC-OWNED                             
//*                                                                             
//W5704GD2 DD  DSN=&INDIN2..W01185(+0),DISP=SHR                                 
//************ W01185 FILE                                                      
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMP FILE                                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMP FILE                                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
//W5704GD3 DD  DSN=&INDUT..W5704G(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UNIQUE PARTS FROM W01185                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
