//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PEDAL, KONTROLLERAR EK-POSTER MOT KONTROLLBAS WDH5                         
//*                                                                             
//*  FREKVENS:     DAG     RTN W570D2                                           
//*                                                                             
//*  ÅTERSTART:    W57062      NORMAL                                           
//*                LÄSER        WDH5                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D2,                                             
//             INDUT=&W570..W570D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570S3  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W57062(+0),DISP=SHR                                  
//************ OSORTERADE EKONOMISKA HÄNDELSEPOSTER                             
//SORTOUT  DD  DSN=&&W57062,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE EKONOMISKA HÄNDELSEPOSTER                              
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD62),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57062   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W57062,W57062,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR                                  
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR                           
//DATUT    DD  SYSOUT=*                                                         
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDH5     INCLUDE MEMBER=WDH5                                                  
//WDG2     INCLUDE MEMBER=WDG2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//W57062D1 DD  DSN=&&W57062,DISP=(OLD,PASS,DELETE)                              
//************ SORTERADE EKONOMISKA HÄNDELSEPOSTER                              
//W57062D2 DD  DSN=&INDUT..W5706V(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL KORREKTA POSTER                                            
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//W57062D3 DD  DSN=&INDUT..W57065(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ FELPOSTER MED KOMMENTARER, ATT LÄGGAS PÅ WDR8                    
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
