//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATING THE LIST OF RECORD SENDING TO SAP FROM ALL THE MARKET             
//*                                                                             
//*  FREKVENS:     DAG     RTN W570D4                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D4,                                             
//             INDUT=&W570..W570D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD14),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57074(+0),DISP=SHR                                  
//************ FILE FOR CHINA MARKET                                            
//         DD  DSN=&INDIN..W57084(+0),DISP=SHR                                  
//************ FILE FOR ALL NON VCC MARKET                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W57014S,DISP=(NEW,PASS,DELETE),                            
//************ SORT FILE FOR ALL THE MARKET                                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57014   EXEC PGM=W57014                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W57014D1 DD  DSN=&&W57014S,DISP=(OLD,DELETE,DELETE)                           
//************ SORT FILE FOR ALL THE MARKET CONTAINS REC FOR SAP                
//*                                                                             
//W57014D2 DD  DSN=&INDUT..W57014(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ W57014-001  LIST OF RECORD SENT TO SAP                           
//             DATACLAS=PSEB                                                    
