//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MERGE EMB, FRAKT, FORS FOR MALAYSIA                                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W570D3                                         
//*                                                                             
//*  RESTART:      W57029    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P029 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD29),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57067(+0),DISP=SHR                                  
//************ W57067 FILE                                                      
//*                                                                             
//SORTOF01 DD  DSN=&&W57067S1,DISP=(NEW,PASS,DELETE),                           
//************ EMB,FRAKT,FORS EXTRACTED                                         
//             DATACLAS=PSEN                                                    
//*                                                                             
//SORTOF02 DD  DSN=&&W57067S2,DISP=(NEW,PASS,DELETE),                           
//************ REST OF THE LEVELS AND EVENTS                                    
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57029   EXEC PGM=W57029                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W57029D1 DD  DSN=&&W57067S1,DISP=(OLD,DELETE,DELETE)                          
//************ W57067 FILE WITH EMB,FORS,FRAKT                                  
//*                                                                             
//W57029D2 DD  DSN=&&W57067M,DISP=(NEW,PASS,DELETE),                            
//************ MERGED FILE                                                      
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//COPY1   EXEC PGM=ICEGENER                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&W57067M,DISP=(OLD,DELETE,DELETE)                           
//************ MERGED FILE                                                      
//         DD  DSN=&&W57067S2,DISP=(OLD,DELETE,DELETE)                          
//************ REST OF THE LEVELS                                               
//SYSUT2   DD  DSN=&INDUT..W57067A(+1),                        -LIM(1)          
//             DISP=(NEW,CATLG,DELETE),                                         
//************ W57067 DATA TO BE USED IN W570P028                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
