//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GET PRODUCT GROUP                                                          
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W570M3                                       
//*                                                                             
//*  RESTART:      W57086    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P086 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570M3,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W570..W570M3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57086   EXEC PGM=V16459,PARM='W57086/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W57086D1 DD  DSN=&INDIN..W57085(+0),DISP=SHR                                  
//************ VALID INBOUNDS                                                   
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,DELETE,DELETE),                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//W57086D2 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ WDK6 DATA                                                        
//*                                                                             
//W57086D3 DD  DSN=&INDUT..W57086(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ INBOUNDS WITH PRODUCT GROUP                                      
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
