//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NER URVAL AV SOL-BASEN PÅ FIL (SENASTE TIMMENS UPPDATERING)          
//*                                                                             
//*  FREKVENS:     MÅNAD     RTN W570M2                                         
//*                                                                             
//*  ÅTERSTART:    W57040      NORMAL                                           
//*                LÄSER       WDL9                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W500V1,                                             
//             INDUT=&W570..W570M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57040   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W57040,W57040,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL9     INCLUDE MEMBER=WDL9                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//*                                                                             
//W57040D1 DD  DSN=&INDIN..W5105C(+0),DISP=SHR                                  
//************ SENASTE SALDOUPPGIFTER FRÅN WDK7 - XDC-NON-VCC                   
//*                                                                             
//W57040D2 DD  DSN=&INDUT..W57040(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ NYA MÅNADENS FÖRSTA UPPDATERINGAR                                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
