//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR W570.W570D1.W57012                                                
//*                                                                             
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P010 PROC INDIN=&W570..W570D1,                                            
//             INDUT=&W570..W570D1                                              
//*                                                                             
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                   -- DISPLAY            
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD10),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W57012,DISP=OLD                                      
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W57010(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//             DATACLAS=PSEB,MGMTCLAS=&BACKUP7                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
