//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR FELPOSTFILEN MED EJ KOMPLETTA VERIFIKAT.                      
//*  KOMPLETTA VERIFIKAT GÅR VIDARE TILL KONTERINGEN.                           
//*                                                                             
//*  FREKVENS:     DAG     RTN W570D2                                           
//*                                                                             
//*  ÅTERSTART:    W57063    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P063 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D2,                                             
//             INDUT=&W570..W570D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57063  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W57064(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57065(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W57063,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD63),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57063   EXEC PGM=V16459,PARM='W57063/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(200,200))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W57063D1 DD  DSN=&&W57063,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL MED RÄTTPOSTER OCH FELPOSTER                               
//*                                                                             
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL MED SORTERADE RÄTTPOSTER OCH FELPOSTER                   
//             DATACLAS=PSEB                                                    
//*                                                                             
//W57063D2 DD  DSN=&INDUT..W57066(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED RÄTTPOSTER                                             
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//W57063D3 DD  DSN=&INDUT..W5706F(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ UTFIL MED FELPOSTER                                              
//             DATACLAS=PSEB,MGMTCLAS=&BACKUPC                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..W57066(+1),DISP=SHR                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W57066A(+1),                        -LIM(99)         
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
