//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SUMMATRANS MED ANTAL SKICKADE VERIFIKAT TILL SAP I DAG              
//*                                                                             
//*  FREKVENS:     DAG  W570D4                                                  
//*                                                                             
//*  ÅTERSTART:    W57082    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D4,                                             
//             INDUT=&W570..W570D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57082   EXEC PGM=V16459,PARM='W57082/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W57082D1 DD  DSN=&INDIN..W57074(+0),DISP=SHR                                  
//************ DAGENS TRANSAR TILL SAP                                          
//*                                                                             
//W57082D2 DD  DSN=&INDUT..W57082(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ LIST-RAD MED SUMMA PÅ                                            
//             DATACLAS=PSEN,MGMTCLAS=&NOBACKUP                                 
