//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      AGGREGERING AV FAKTURARADER/MERGE ÖVRIGA SAP-POSTER          *         
//*                                                                   *         
//*      PERIODICITET: DAG    RTN W570D3                              *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P084 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W570..W570D3,                                             
//             INDUT=&W570..W570D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570S1  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W57072(+0),DISP=SHR                                  
//*                                                                             
//VBOUT    DD  DSN=&&W57072P,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD82),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570S2  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&INDIN..W57073(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W57071(+0),DISP=SHR                                  
//         DD  DSN=&&W57072P,DISP=(OLD,DELETE,DELETE)                           
//*                                                                             
//SORTOUT  DD  DSN=&&W57073Q,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD81),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57084   EXEC PGM=W57084                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  DATACLAS=PSEB,DCB=BLKSIZE=27968                                  
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W57084D1 DD  DSN=&&W57073Q,DISP=(OLD,DELETE,DELETE),                          
//             DATACLAS=PSEB                                                    
//W57084D5 DD  DSN=&&W57084A,DISP=(NEW,PASS,DELETE),                            
//             DATACLAS=PSEB                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570S3  EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&&W57084A,DISP=(OLD,DELETE,DELETE)                           
//*                                                                             
//SORTOF1  DD  DSN=&INDUT..W57074(+1),DISP=(NEW,CATLG,DELETE),                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//* * * * * SEND DATA WITH CHINA RECORDS TO VCOM  * * * * * * * * * * *         
//SORTOF2  DD  DSN=&INDUT..W57084(+1),DISP=(NEW,CATLG,DELETE),                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//* * * * * SEND DATA WITH AE,KR,TR,MY RECORDS TO SAP * * * * * * * * *         
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD84),DISP=SHR                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
