//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES FILE WITH VALID INBOUNDS FOR PREVIOUS MONTH                        
//*  FOR CHINA/US                                                               
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN W570M3                                       
//*                                                                             
//*  RESTART:      W57085      NORMAL                                           
//*                READS        WDL6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W570P085 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W570..W570M3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57085   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W57085,W57085,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//W57085D1 DD  DSN=&&W57085,DISP=(NEW,PASS,DELETE),                             
//************ VALID INBOUNDS                                                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W570PD85),DISP=SHR                         
//SORTIN   DD  DSN=&&W57085,DISP=(OLD,DELETE,DELETE)                            
//************ VALID INBOUNDS                                                   
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W57085(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ SORTED FILE WITH DUPLICATES ELIMINATED                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
