//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  READS WDB6 AND W01184/W01160/W01174 FILES. CREATES A                       
//*  FILE WITH DC'S THAT HAVE OPTED FOR ACS.                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W571D1                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W57101    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W571P001 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011..&RTEGRP.,                                           
//             INDIN2=&W011..LDC,                                               
//             INDIN3=&W011..NDC,                                               
//             INDIN4=&W011..SDC,                                               
//             INDUT=&W571..W571D1                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ LDC                                                              
//*                                                                             
//         DD  DSN=&INDIN3..W01184(+0),DISP=SHR                                 
//************ NDC                                                              
//*                                                                             
//         DD  DSN=&INDIN4..W01184(+0),DISP=SHR                                 
//************ SDC                                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTED FILE ON IDDC AND IDARTNR                                  
//         DATACLAS=PSEN                                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57101   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W57101,W57101,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//W57101D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ FILE SORTED ON IDDC & IDARTNR                                    
//*                                                                             
//W57101D2 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ W01160 FILE                                                      
//*                                                                             
//W57101D3 DD  DSN=&INDIN..W01174(+0),DISP=SHR                                  
//************ W01174                                                           
//*                                                                             
//W57101D4 DD  DSN=&INDUT..W57101.TEMP,                                         
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//SORT02   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W571PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDUT..W57101.TEMP,DISP=(OLD,DELETE,DELETE)                 
//SORTOUT  DD  DSN=&INDUT..W57101(+1),                           -LIM(3)        
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SORTED FILE ON IDDC AND IDARTNR                                  
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
