//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES INVENTORY DOWNLOAD SELECTION - EXCLUDED PARTS                      
//*  LIST                                                                       
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W571B1                                         
//*                                                                             
//*  RESTART:      W57107      NORMAL                                           
//*                READS        WDB6 WDD8 WDR2                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W571P007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W571..W571D1,                                             
//             INDIN2=&W571..W571B1,                                            
//             INDUT=&W571..W571B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57107   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W57107,W57107,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDD8     INCLUDE MEMBER=WDD8                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//************ DC VALUE                                                         
//W57107D1 DD  DSN=&INDIN2..W57102.DC(+0),DISP=SHR                              
//*                                                                             
//************ LIST OF DC'S THAT HAVE OPTED FOR ACS                             
//W57107D2 DD  DSN=&INDIN..W57101(+0),DISP=SHR                                  
//*                                                                             
//************ EXCLUDED PARTS REPORT TO BE SENT TO D&P                          
//W57107D3 DD  DSN=&INDUT..W57107A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//************ EXCLUDED PARTS REPORT TO BE SENT TO D&P                          
//W57107D4 DD  DSN=&INDUT..W57107B(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//************ EXCLUDED PARTS REPORT TO BE SENT TO D&P                          
//W57107D5 DD  DSN=&INDUT..W57107C(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//************ EXCLUDED PARTS REPORT TO BE SENT TO D&P                          
//W57107D6 DD  DSN=&INDUT..W57107D(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//************ EXCLUDED PARTS REPORT TO BE SENT TO D&P                          
//W57107D7 DD  DSN=&INDUT..W57107E(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
