//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXECUTES A BMP PGM THAT SIMULATES AND DOWNLOADS THE                        
//*  INVENTORY SELECTION REPORT. DATA IS SENT TO D&P.                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W571B1                                         
//*                                                                             
//*  RESTART:      W57102    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W571P002 PROC STPLIB=&INDRTE..LOAD,                                           
//             CPU=1,                                                           
//             INDIN=&W571..W571D1,                                             
//             INDUT=&W571..W571B1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57102   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W57102,W57102,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//************ FILE WITH LIST OF DC'S THAT HAVE OPTED FOR ACS                   
//W57102D1 DD  DSN=&INDIN..W57101(+0),DISP=SHR                                  
//************ FILE WITH THE DC VALUE                                           
//W57102D2 DD  DSN=&INDUT..W57102.DC(+1),                    -LIM(1)            
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN                                                    
//*                                                                             
