//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ADD BUFFER BALANCE FROM WDD8                                               
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W571B3                                         
//*                                                                             
//*  RESTART:      W57105    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W571P005 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             CPU=1,                                                           
//             INDIN=&W571..W571B3,                                             
//             INDUT=&W571..W571B3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W57105   EXEC PGM=DFSRRC00,                                                   
//            PARM=('BMP,W57105,W57105,,,N00,,,,,&CPU,,,&IMS')                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W57105D1 DD  DSN=&INDIN..W57104(+0),DISP=SHR                                  
//************ WDJ701 SEGMENT DATA                                              
//*                                                                             
//W57105D2 DD  DSN=&INDUT..W57105(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ INCLUDES BUFFER BALANCE FROM WDD8                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
