//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTAR BELÄGGNING                                                          
//*                                                                             
//*  FREKVENS:     DAG      RTN W611D5                                          
//*                                                                             
//*  ÅTERSTART:    W61156    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P156 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611D5,                                             
//             INDUT=&W611..W611D5,                                             
//             INDIN2=&W930,                                                    
//             DEST1=&CPRINT,                                                   
//             KONST=W611DC7X                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61156   EXEC PGM=V16459,PARM='W61156/8/'                                     
//STDCP    OUTPUT DEST=&DEST1,FORMDEF=SLSR6C,PAGEDEF=SLSR6C                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61156D1 DD  DSN=&INDIN..W61150(+0),DISP=SHR                                  
//************ BELÄGGNINGSFIL                                                   
//*                                                                             
//W61156D2 DD  DUMMY                                                            
//W61156D3 DD  DUMMY                                                            
//W61156D4 DD  DUMMY                                                            
//W61156D5 DD  DUMMY                                                            
//W61156D6 DD  DUMMY                                                            
//W61156D7 DD  DUMMY                                                            
//W61156D8 DD  DSN=&INDUT..W61151(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ W61156-002 INBOUND DAILY FOLLOW UP FOR NDC-CN                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61156DA DD  DSN=&INDRTE..CONSTANT(&KONST),DISP=SHR                           
//************ CONSTANT FOR PROCESSING CHINA NDC'S                              
//*                                                                             
//W61156DB DD  DSN=&INDIN2..W93001(+0),DISP=SHR                                 
//************ EXCHANGE RATES                                                   
//*                                                                             
