//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR INLEVERANS-INFO FRÅN CARPAC  (WDL2 WDK6)                        
//*                                                                             
//*  FREKVENS:     (FIX)                                                        
//*                                                                             
//*  ÅTERSTART:    W61106            (BMP)                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*      OBS   VID ABEND: DELETE SAMTLIGA BEHANDLADE                            
//*            POSTER PÅ INPUTFILEN FRAM TILL SISTA CHKP                        
//*                                                                             
//*            NÄSTA POST: SE DISPLAY                                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P004 PROC STPLIB=&W..CARP.LOAD,                                           
//             CPU=1,                                                           
//             INDIN2=&W802..CARP                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61106   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61106,W61104,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61106D1 DD  DSN=&INDIN2..LEVFEL,DISP=SHR                                     
//*********FIX FIL FRÅN CARPAC (INLEV )                                         
//*                                                                             
//W61106D2 DD  DSN=&INDRTE..CONSTANT(LEVNRCAR),DISP=SHR                         
//************ KONVERTERINGSTABELL IDLEVNR CARPAC                               
//*                                                                             
