//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR MAILFIL                                                             
//*                                                                             
//*  FREKVENS:     VECKA     RTN W611V3                                         
//*                                                                             
//*  ÅTERSTART:    W61163    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P063 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W611..W611V3,                                             
//             INDUT=&W611..W611V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61163   EXEC PGM=V16459,PARM='W61163/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61163D1 DD  DSN=&INDIN..W61160A(+0),DISP=SHR                                 
//************ XXX                                                              
//*                                                                             
//W61163D2 DD  DSN=&INDUT..W61163A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ XX                                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
