//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER AVISERINGSFIL TILL VIOS                                            
//*                                                                             
//*  FREKVENS:     DAG    RTN W611V1                                            
//*                                                                             
//*  ÅTERSTART:    W61133    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P033 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611D1,                                             
//             INDUT=&W611..W611V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61133   EXEC PGM=V16459,PARM='W61133/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61133D1 DD  DSN=&INDIN..W61120(+0),DISP=SHR                                  
//************ AVISERINGSFIL FRÅN W6D1                                          
//*                                                                             
//W61133D2 DD  DSN=&INDUT..W61133(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ AVISERINGSFIL                                                    
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
