//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR CD-ARTIKLAR/DC MOT REFILLORDRAR OCH SKRIVER LISTA ÖVER             
//*  GODSANDEL SOM PLOCKATS FRÅN CD-LAGER.                                      
//*                                                                             
//*  FREKVENS:     VECKA     RTN W611V3                                         
//*                                                                             
//*  ÅTERSTART:    W61187    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P087 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611V3,                                             
//             INDUT=&W611..W611V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61187   EXEC PGM=V16459,PARM='W61187/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61187D1 DD  DSN=&INDIN..W61138(+0),DISP=SHR                                  
//************ CD-ART+DC                                                        
//*                                                                             
//W61187D2 DD  DSN=&INDIN..W61139(+0),DISP=SHR                                  
//************ ORDERRADER                                                       
//*                                                                             
//W61187D3 DD  DSN=&INDUT..W61187(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ LISTA                                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
