//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BINNAT UNDER VECKAN FÖR NDC:ERNA                                           
//*                                                                             
//*  FREKVENS:     VECKA     RTN W611V1                                         
//*                                                                             
//*  ÅTERSTART:    W61177    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P077 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611V1,                                             
//             INDUT=&W611..W611V1,                                             
//             INDIN2=&W930                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61177   EXEC PGM=V16459,PARM='W61177/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W61177D1 DD  DSN=&INDIN2..W93001(+0),DISP=SHR                                 
//************ VALUTA-KURSER                                                    
//*                                                                             
//W61177D2 DD  DSN=&INDIN..W61110B(+0),DISP=SHR                                 
//************ INFO FRÅN W6D1                                                   
//*                                                                             
//W61177D3 DD  DSN=&INDUT..W61177B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W61177-004  BINNAT/WEEK NDC-NA OCH NDC-PACIFIC                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
