//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INTRASTAT-POSTER TILL VOLVO TRANSPORT                                      
//*                                                                             
//*  FREKVENS:     MÅNAD    RTN W611M1                                          
//*                                                                             
//*  ÅTERSTART:    W61172    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P072 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611M1,                                             
//             INDIN2=&W418..W611M1,                                            
//             INDUT=&WUT..W611M1                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61172   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61172,W61172,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W61172D1 DD  DSN=&INDIN..W61171(+0),DISP=SHR                                  
//         DD  DSN=&INDIN2..W41848,DISP=SHR                                     
//************                                                                  
//*                                                                             
//W61172D2 DD  DSN=&INDUT..W61172(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ INTRASTAT-POSTER TILL VOLVO TRANSPORT                            
//             SPACE=(99,(100,33),RLSE),AVGREC=K,                               
//             MGMTCLAS=&BACKUPC                                                
