//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR AK LISTA TVÄRS FLÖDET JAPAN/AUSTRALIEN/INDIEN                       
//*                                                                             
//*  FREKVENS:     DAG    RTN W611D5                                            
//*                                                                             
//*  ÅTERSTART:    W61174    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P074 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611D5,                                             
//             DEST1=&CPRINT,                                                   
//             INDUT=&W611..W611D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61174   EXEC PGM=V16459,PARM='W61174/8/'                                     
//STDCP    OUTPUT DEST=&DEST1,FORMDEF=SLSR6C,PAGEDEF=SLSR6C                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W61174D1 DD  DSN=&INDIN..W61110(+0),DISP=SHR                                  
//************ AK REGISTRET                                                     
//*                                                                             
//W61174D2 DD  DUMMY                                                            
//W61174D3 DD  DUMMY                                                            
//W61174D4 DD  SYSOUT=(A,,3803),OUTPUT=*.STDCP                                  
//************ W61174-003  AK LISTA JAPAN                                       
//W61174D5 DD  DSN=&INDUT..W61174A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W61174-004  AK LISTA AUSTRALIA                                   
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W61174D6 DD  DUMMY                                                            
//*                                                                             
//W61174D7 DD  DSN=&INDUT..W61174I(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W61174-006  AK LISTA INDIEN                                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//W61174D8 DD  DUMMY                                                            
//W61174D9 DD  DSN=&INDUT..W61174D(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ W61174-008  AK LISTA DUBAI                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
