//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  MATCH TWO FILES WITH NETWEIGHT INFO FROM KDP AND                           
//*  CREATE AN OUTPUT FILE WITH TODAYS CHANGES FOR WDK212.                      
//*                                                                             
//*  FREQUENCE:    ORDERED    RTN W611S9                                        
//*                                                                             
//*  RESTART:      W61109     NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611S9,                                             
//             INDUT=&W611..W611S9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61109   EXEC PGM=V16459,PARM='W61109/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61109D1 DD  DSN=&INDIN..W611081(+0),DISP=SHR                                 
//************ NETWEIGHT FILE FROM KDP (VALID TO UPDATE WDK212)                 
//W61109D2 DD  DSN=&INDIN..W611081(-1),DISP=SHR                                 
//************ NETWEIGHT FILE FROM KDP (VALID TO UPDATE WDK212)                 
//W61109D3 DD  DSN=&INDUT..W61109(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ TODAYS CHANGES OF NETWEIGHT TO UPDATE WDK212                     
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
