//* *   * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*         PRODUCERAR MOTTAGNINGSRAPPORTLISTA                        *         
//*                                                                   *         
//*         PERIODICITET: VECKA                                       *         
//*                                                                   *         
//*         ÅTERSTART:   NORMAL                                       *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W611P095 PROC INDIN2=&W092..W100V2,                                           
//             INDUT=&W611..W100V2,                                             
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61195  EXEC PGM=W61195                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IGZSRTCD DD  DUMMY                                                            
//SORTMSG  DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//W61195D1 DD  DSN=&INDIN2..W09291,DISP=SHR                                     
//**************  DAGLIG FIL                                        ***         
//*                                                                             
//W61195D2 DD  DSN=&INDUT..W61195(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//**************  VECKO-FIL                                         ***         
//             SPACE=(6231,(180,60),RLSE),                                      
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//A4LF OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                     
//*                                                                             
//W61195D3 DD  DUMMY,DCB=BLKSIZE=121                                            
//**1195D3 DD  SYSOUT=(A,,3803),DEST=&DEST2,OUTPUT=(*.A4LF)                     
//************** LISTA W61195-001 OCH LISTA W61195-002              ***         
//*                                                                             
//V16247D3 DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
