//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTSKRIFT AV LOGGADE R34-TRANSAR                                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN W611V1                                          
//*                                                                             
//*  ÅTERSTART:    W61124    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P024 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611V1,                                             
//             INDUT=&W611..W611V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61124   EXEC PGM=V16459,PARM='W61124/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W61124D1 DD  DSN=&INDIN..W61121(+0),DISP=SHR                                  
//************ R34-TRANSAR  (SORTERAS I PROGRAMMET)                             
//*                                                                             
//W61124D2 DD  DSN=&INDUT..W61124(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTA W61124-XX FOR NDC-NA                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
