//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER STD PRIS MOT BESTÄLLNINGS PRIS FÖR NDC                               
//*                                                                             
//*  FREKVENS:     DAG         RTN W611D4                                       
//*                                                                             
//*  ÅTERSTART:    W61149      NORMAL                                           
//*                LÄSER        WDK6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P049 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611D4,                                             
//             INDUT=&W611..W611D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61149   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61149,W61149,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W61149D1 DD  DSN=&INDIN..W61110(+0),DISP=SHR                                  
//************ FIL MED INLEVERANSREGISTER INFO                                  
//*                                                                             
//W61149D2 DD  DSN=&INDUT..W61110B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FIL MED BYTT PRIS                                                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
