//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR INLEVERANS INFO MED VLB FÖR VIDARE                                 
//*  BEHANLIG AV VALUTA INFO                                                    
//*                                                                             
//*  FREQUENCE:    PLANNING PERIOD    RTN W611P1                                
//*                                                                             
//*  RESTART:      W61136    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611P1,                                             
//             INDIN2=&W011,                                                    
//             INDUT=&W611..W611P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61136   EXEC PGM=V16459,PARM='W61136/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//W61136D1 DD  DSN=&INDIN..W61135(+0),DISP=SHR                                  
//************ INLEVERANS HISTORIK                                              
//*                                                                             
//W61136D2 DD  DSN=&INDIN2..W01177(0),DISP=SHR                                  
//************ VLB                                                              
//*                                                                             
//W61136D3 DD  DSN=&INDUT..W61136(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED LEVNR PKOD OCH SUARTSTD                                  
//             SPACE=(11,(8,4),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
