//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTSKRIFT AV LOGGADE R34-TRANSAR TILL ONDEMAND...                           
//*                                                                             
//*  FREKVENS:     VECKA    RTN W611V1                                          
//*                                                                             
//*  ÅTERSTART:    W61125    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P025 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611V1,                                             
//             INDUT=&W611..W611V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W611PD25),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61121(+0),DISP=SHR                                  
//************ SORTERING AV LOGGADE R34-TRANSAR                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W61121,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE R34-TRANSAR                                            
//         SPACE=(46,(1,1),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61125   EXEC PGM=V16459,PARM='W61125/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//************                                                                  
//W61125D1 DD  DSN=&&W61121,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERADE R34-TRANSAR                                            
//*                                                                             
//************                                                                  
//W61125D2 DD  DSN=&INDUT..W611O1(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FILE TO ONDEMAND LOGGADE R34 TRANSAR                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//************                                                                  
//W61125D3 DD  DSN=&INDUT..W611O1A(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************ FILE TO SNOWFLAKE LOGGADE R34 TRANSAR                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
