//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BYTER FÖR NDC:ERNA UT STANDARDPRIS MOT BESTÄLLNINGSPRIS.                   
//*                                                                             
//*  FREKVENS:     VECKA       RTN W611V1                                       
//*                                                                             
//*  ÅTERSTART:    W61157      NORMAL                                           
//*                LÄSER        WDK6 W6D1                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P057 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611D1,                                             
//             INDUT=&W611..W611V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61157   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61157,W61157,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W6D1     INCLUDE MEMBER=W6D1                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W61157D1 DD  DSN=&INDIN..W61140(+0),DISP=SHR                                  
//************ GFDSG                                                            
//*                                                                             
//W61157D2 DD  DSN=&INDUT..W61140B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ FDSA                                                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
