//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE WDR551 FOR PART NUMBERS WHOES GATE(ADINPORT)                        
//*  IS CHANGED                                                                 
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W611D7                                         
//*                                                                             
//*  RESTART:      W6118G    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P08G PROC STPLIB=&INDRTE..LOAD,                                           
//*                                                                             
//             INDIN=&W611..W611D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6118G   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W6118G,W6118G,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6118GD1 DD  DSN=&INDIN..W6118C(+0),DISP=SHR                                  
//************ PART NUMBERS WITH NEW GATE VALUES                                
//*                                                                             
