//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKICKAR PRIO INFO TILL HL (PDP'N)                                          
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG    RTN W611S3                              
//*                                                                             
//*  ÅTERSTART:    W61113      NORMAL                                           
//*                LÄSER  W6D1                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WUT..W611S3                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61113   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61113,W61113,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6D1     INCLUDE MEMBER=W6D1                                                  
//W61113D1 DD  DSN=&INDUT..W61113(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PRIO INFO TILL HL                                                
//             SPACE=(36,(100,300),RLSE),AVGREC=U,                              
//             MGMTCLAS=&DEL2BKPC                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
