//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO CALCULATE NEW GATE FOR PART NUMBERS                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W611D7                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                W6118E      NORMAL                                           
//*                READS        WDT2 WDK6                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P08E PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W611..W611D7,                                            
//             INDUT=&W611..W611D7                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W611PD8E),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W6118H(+0),DISP=SHR                                 
//************ SORT FILES ON IDARTNR AND REMOVE DUPLICATES                      
//*                                                                             
//         DD  DSN=&INDIN1..W6118D(+0),DISP=SHR                                 
//************ SORT ON IDARTNE AND REMOVE DUPLICATES                            
//*                                                                             
//SORTOUT  DD  DSN=&&TEMP,DISP=(NEW,PASS,DELETE),                               
//************ SORTED FILE ON BEFT                                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6118E   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W6118E,W6118E,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//WDT2     INCLUDE MEMBER=WDT2                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W6118ED1 DD  DSN=&&TEMP,DISP=(OLD,PASS,DELETE)                                
//************ SORT ON IDARTNR AND REMOVE DUPLICATES                            
//*                                                                             
//W6118ED2 DD  DSN=&INDUT..W6118E(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ PART NUMBERS WITH NEW GATE                                       
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
