//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL MED CD-MÄRKTA ARTIKLAR MED ERSÄTTNINGSKOD.                      
//*                                                                             
//*  FREQUENCE:    WEEK      RTN W611V3                                         
//*                                                                             
//*  RESTART:      W61114    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W611..W611V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61114   EXEC PGM=V16459,PARM='W61114/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61114D1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ LAGERBAND                                                        
//*                                                                             
//W61114D2 DD  DSN=&INDUT..W61114(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ CD-ART MED ERS-KOD                                               
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
