//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EPLUSPROGRAM SOM SKRIVER UT AVVIKELSELISTA                                 
//*                                                                             
//*  FREKVENS:     DAG    RTN W611D1                                            
//*                                                                             
//*  ÅTERSTART:    W61118    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P031 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..W611D1,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61118   EXEC PGM=V16459,PARM='W61118/8/'                                     
//STDCP    OUTPUT DEST=&DEST1,FORMDEF=SLSR6C,PAGEDEF=SLSR6C                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W61118D1 DD  DSN=&INDIN..W61110(+0),DISP=SHR                                  
//************ INLEVERANSFIL FRÅN W6D1                                          
//*                                                                             
//W61118D2 DD  SYSOUT=(A,,3803),OUTPUT=*.STDCP                                  
//************ W61118-001  AVVIKELSELISTA FÖR CDC I GBG                         
//*                                                                             
//W61118D3 DD  SYSOUT=(A,,F001)                                                 
//************ W61118-002  AVVIKELSELISTA FÖR SUPPL.TERM. I BORN                
//*            PRINTER DESTINATION I EXPRESSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
