//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SB-LÄSNING AV WDK3                                                         
//*                                                                             
//*  FREKVENS:     VECKA     RTN W611V2                                         
//*                                                                             
//*  ÅTERSTART:    W61142      NORMAL                                           
//*                LÄSER        WDK3                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT2=&W611..W611V2                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61142   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61142,W61142,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK3     INCLUDE MEMBER=WDK3                                                  
//W61142D1 DD  DSN=&INDUT2..W61142(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ EXTRAKT AV ALLA RÖTTER PÅ WDK3                                   
//             SPACE=(28,(55,6),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&DEL2BKPC                                               
//W61142D2 DD  DSN=&INDUT2..W611ME(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ TEXTFIL FÖR MEMOSEND                                             
//             SPACE=(80,(1,1),RLSE),                                           
//             MGMTCLAS=&NOBACKUP                                               
