//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA MED ARTIKLAR SOM EJ HAR NÅGOT BEHOV                                  
//*  INOM 10 ANTAL DAGAR                                                        
//*                                                                             
//*  FREQUENCE:    WEEK      RTN W611V3                                         
//*                                                                             
//*  RESTART:      W61166    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P066 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W611..W611V3,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61166   EXEC PGM=V16459,PARM='W61166/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61166D1 DD  DSN=&INDIN..W61148(+0),DISP=SHR                                  
//************ FIL FRÅN PGM W6114800                                            
//*                                                                             
//W61166D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF)                     
//************ W61166-001  LISTA MED ARTIKLAR SOM EJ HAR BEHOV INOM X DA        
//*                                                                             
