//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ÖVERFÖRING AV FILER TILL ONDEMAND                                          
//*                                                                             
//*  FREKVENS:     DAG     RTN W611V1                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W611P01O PROC INDIN=&W611..W611V1,                                            
//             DEST1=&ONDEM,                                                    
//             SOUT1='(A,,SAP5)'                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W611O1(+0),DISP=SHR                                  
//************ INFILER                                                          
//*                                                                             
//SYSUT2   DD  SYSOUT=&SOUT1,DEST=&DEST1                                        
//************ SAP5  UTFIL, SPARAS 10 ÅR I ONDEMAND                             
//*                                                                             
