//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  NDC NEDLÄSNING WDR3                                                        
//*                                                                             
//*  FREKVENS:     DAG         RTN W612D3                                       
//*                                                                             
//*  ÅTERSTART:    W61236      NORMAL                                           
//*                LÄSER       WDR3                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61236   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61236,W61236,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR3     INCLUDE MEMBER=WDR3                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W61236D1 DD  DSN=&INDUT..W61238(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ NDC NYA ART I FAKTURA                                            
//             SPACE=(23,(1,33),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W61236D2 DD  DSN=&INDUT..W61237(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ BORTTAG                                                          
//             SPACE=(227,(1,3),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
