//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DATABAS UPPDATERINGAR                                                      
//*                                                                             
//*  FREKVENS:     VECKA     RTN W612V3                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W61270      NORMAL                                           
//*                LÄSER        WDK6 WDK7 WDD3                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P070 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612V3,                                             
//             INDUT=&W612..W612V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD70),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61263(+0),DISP=SHR                                  
//************ PASSED ETA'S                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W61263,DISP=(NEW,PASS,DELETE),                             
//************ SORTED PASSED ETA'S                                              
//         SPACE=(30,(1,1),RLSE),AVGREC=U                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61270   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61270,W61270,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W61270D1 DD  DSN=&&W61263,DISP=(OLD,DELETE,DELETE)                            
//************ SORTED PASSED ETA'S                                              
//*                                                                             
//W61270D2 DD  DSN=&INDUT..W61267(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERADE PASSED ETA'S                                       
//             SPACE=(65,(1,1),RLSE),AVGREC=U,                                  
//             MGMTCLAS=&BACKUPC                                                
