//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CALCULATE PROPOSED ETA.                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612DB                                         
//*                                                                             
//*  RESTART:      W61229      NORMAL                                           
//*                READS        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P029 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612DB,                                             
//             INDUT=&W612..W612DB                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61229   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61229,W61229,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W61229D1 DD  DSN=&INDIN..W612281(+0),DISP=SHR                                 
//************ INPUT FILE WITH ALL SEA CONTAINER FLOWS                          
//************ (RECEIVING AND SENDING DC).                                      
//*                                                                             
//W61229D2 DD  DSN=&INDIN..W612282(+0),DISP=SHR                                 
//************ INPUT FILE WITH ETA-POD-DEP DATES.                               
//*                                                                             
//W61229D3 DD  DSN=&INDUT..W61229(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ OUTPUT FILE WITH PROPOSED ETA.                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
