//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DAILY BINNING PRODUCTIVITY REPORT                                          
//*                                                                             
//*  FREKVENS:     DAG       RTN W612D7                                         
//*                                                                             
//*  ÅTERSTART:    W61209    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D7,                                             
//             INDUT=&W612..W612D7,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61209   EXEC PGM=V16459,PARM='W61209/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61209D1 DD  DSN=&INDIN..W61208(+0),DISP=SHR                                  
//************ FIL FRÅN W612P008                                                
//*                                                                             
//W61209D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61209-001 DC23                                                  
//*                                                                             
//W61209D3 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61209-002 DC41                                                  
//*                                                                             
//W61209D4 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61209-003 DC42                                                  
//*                                                                             
//W61209D5 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61209-004 DC43                                                  
//*                                                                             
//W61209D6 DD  DSN=&INDUT..W61209(+1),                      --LIM(1)            
//************ W61209-005 FOLLOW UP REPORT TO D&P FOR ALL WEB DC                
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61209D7 DD  DSN=&INDUT..W6120A(+1),                      --LIM(1)            
//************ W61209-011 DC 11 TO D&P                                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61209D8 DD  DSN=&INDUT..W61209(+1),                     --LIM(1)             
//************ W61209-006 FOLLOW UP REPORT TO D&P FOR ALL WEB DC                
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
