//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INLÄSNING AV INLEV-HIST                                                    
//*                                                                             
//*                                                                             
//*  FREKVENS:     VECKA       RTN W612V3                                       
//*                                                                             
//*  ÅTERSTART:    W61264      NORMAL                                           
//*                LÄSER        WDL6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P064 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61264   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61264,W61264,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W61264D1 DD  DSN=&INDUT..W61262(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ R30 INOM 4 VECKOR                                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//W61264D2 DD  DSN=&INDUT..W61263(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************     PASSERADE                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//W61264D3 DD  DSN=&INDUT..W61264(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INLAGDA                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//W61264D4 DD  DSN=&INDUT..W61265(+1),DISP=(NEW,CATLG,DELETE),  -LIM(9)         
//************ INLAGDA                                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//W61264D5 DD  DSN=&INDUT..W61270(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SRS INFORMATION (R32 & 310:OR)                                   
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEB                                 
