//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SELECT CONTAINERS (FREIGHT BY BOAT) WHERE WE SHOULD                        
//*  CALL PROJECT44 TO GET ETA INFO.                                            
//*  ALSO CREATE AND SEND FILE TO DATALAKE.                                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612DB                                         
//*                                                                             
//*  RESTART:      W61221      NORMAL                                           
//*                READS        WDR5 WDM7 WDQ2 WDR1                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612DB                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61221   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61221,W61221,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM1K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR5     INCLUDE MEMBER=WDR5                                                  
//WDM7     INCLUDE MEMBER=WDM7                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDR1     INCLUDE MEMBER=WDR1                                                  
//W61221D1 DD  DSN=&INDUT..W612211(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ CONTAINERS TO SEND TO PROJECT44 WITH KEY BOOKING NO              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W61221D2 DD  DSN=&INDUT..W612212(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ CONTAINERS TO SEND TO PROJECT44 WITH KEY CONTAINER NO            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W61221D3 DD  DSN=&INDUT..W612213(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ CONTAINERS TO SEND TO PROJECT44 WITH SHIPMENT ID.                
//************ CER TRANSACTION WHEN P44 SHOULD STOP SEND PUSHEVENTS.            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W61221D4 DD  DSN=&INDUT..W612214(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WDGX6302 INFO TO AZURE DATALAKE                                  
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
