//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  BINNING PRODUCTIVITY REPORT WEEK                                           
//*                                                                             
//*  FREKVENS:     WEEK      RTN W612V9                                         
//*                                                                             
//*  ÅTERSTART:    W61262    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P062 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612V9,                                             
//             INDUT=&W612..W612V9,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61262   EXEC PGM=V16459,PARM='W61262/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61262D1 DD  DSN=&INDIN..W61268(+0),DISP=SHR                                  
//************ FIL FRÅN W612P108                                                
//*                                                                             
//W61262D3 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61262-002 DC41                                                  
//*                                                                             
//W61262D5 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61262-004 DC43                                                  
//*                                                                             
//W61262D6 DD  DSN=&INDUT..W61262(+1),                      --LIM(1)            
//************ W61262-005 FOLLOW UP REPORT TO D&P FOR ALL WEB DC                
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61262D7 DD  DSN=&INDUT..W61263(+1),                      --LIM(1)            
//************ W61262-011 DC 11 TO D&P                                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
