//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL AVVIKELSE REFILL CDC-NDC                                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612D2                                         
//*                                                                             
//*  RESTART:      W61225    NORMAL                                             
//*                READS     WDD3 WDK7                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P025 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D2,                                             
//             INDUT=&W612..W612D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD25),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61221(+0),DISP=SHR                                  
//************ LEV.ANM CDC                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W61221,DISP=(NEW,PASS,DELETE),                             
//************ LEV.ANM CDC SORTERAD                                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61225   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61225,W61225,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//W61225D1 DD  DSN=&&W61221,DISP=(OLD,DELETE,DELETE)                            
//************ LEV.ANM SORTERAD                                                 
//*                                                                             
//W61225D2 DD  DSN=&INDUT..W61222(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ SAMMANSLAGN. LEV.ANM                                             
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//W61225D3 DD  DSN=&INDUT..W61228(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ DISCREPANCY DC71 TO DC11                                         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
