//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR BINNINGLIST                                                         
//*                                                                             
//*  FREKVENS:     DAG       RTN W612S4                                         
//*                                                                             
//*  ÅTERSTART:    W61234    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612S4,                                             
//             DEST1=&QSE09012                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61243   EXEC PGM=W61243                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61243D1 DD  DSN=&INDIN..W61242(0),DISP=SHR                                   
//************ LISTFIL                                                          
//*                                                                             
//W61243D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61243-001  BINNINGLIST                                          
//*                                                                             
//W61243D3 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61243-002  QUAL NOTE                                            
//*                                                                             
