//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTAN ARTIKLAR MED AK PÅ VÄG MER ÄN EN VECKA.                      
//*                                                                             
//*  FREKVENS:     VECKA    RTN W612D1                                          
//*                                                                             
//*  ÅTERSTART:    W61206    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P006 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61206   EXEC PGM=V16459,PARM='W61206/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61206D1 DD  DSN=&INDIN..W61204(+0),DISP=SHR                                  
//************ ARTIKLAR MED AK PÅ VÄG MER ÄN EN VECKA                           
//*                                                                             
//W61206D2 DD  SYSOUT=A                                                         
//************ LISTAN ARTIKLAR PÅ VÄG MER ÄN EN VECKA                           
//************ ROUTAS TILL LOKAL SKRIVARE I RESP SDC                            
//*                                                                             
