//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTLISTA LEDTIDER, DAILY AK FOLLOW-UP                                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W612D5                                           
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W61260      NORMAL                                           
//*                LÄSER        WDB6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P060 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D5,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD60),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61256(+0),DISP=SHR                                  
//************ INFIL FRÅN W612J054                                              
//*                                                                             
//SORTOUT  DD  DSN=&&W61256,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD PÅ IDDC                                                 
//         SPACE=(63,(5,3),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61260   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61260,W61260,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W61260D1 DD  DSN=&&W61256,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD PÅ IDDC                                                 
//*                                                                             
//W61260D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61260-001  UTLISTA, DAILY AK FOLLOW-UP                          
//*                                                                             
