//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER FIL W612PP MED URVAL                                                 
//*  FRÅN BILD 6302                                                             
//*                                                                             
//*  FREKVENS:     DAG         RTN W612S4                                       
//*                                                                             
//*  ÅTERSTART:    W61242      NORMAL                                           
//*                LÄSER       WDL6 WDL6A WDK7 WDK6 WDD3 WDR5 W6D2              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P042 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612S4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61242   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61242,W61242,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDR5     INCLUDE MEMBER=WDR5                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W6D2     INCLUDE MEMBER=W6D2                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//W61242D1 DD  DUMMY                                                            
//************ INDATA FRÅN BILD 6302(OVERRIDE I JCL)                            
//*                                                                             
//W61242D2 DD  DSN=&INDUT..W61242(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LISTFIL                                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
