//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UNDERLAG BINNING PRODUCTIVITY REPORT                                
//*                                                                             
//*  FREQUENCE:    WEEK      RTN W612V9                                         
//*                                                                             
//*  RESTART:      W61208    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P108 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612V9,                                             
//             INDUT=&W612..W612V9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD08),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61261(+0),DISP=SHR                                  
//************ NEDLÄST WDL6                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W61261,DISP=(NEW,PASS,DELETE),                             
//************ NEDLÄST WDL6 SORTERAD                                            
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61208   EXEC PGM=W61208                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61208D1 DD  DSN=&&W61261,DISP=(OLD,DELETE,DELETE)                            
//************ NEDLÄST WDL6 SORTERAD                                            
//*                                                                             
//W61208D2 DD  DSN=&INDUT..W61268(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ SUMMERING FÖR BINNING PRODUCTIVITY REPORT                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
