//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER STRECKKODS ETIKETTER                                               
//*                                                                             
//*  FREKVENS:     FLERA GGR PER DAG     RTN W612S3, W418S1, W413S2             
//*                                                                             
//*  ÅTERSTART:    W61241    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612S3,                                             
//             DEST1=&QUS05920,                                                 
//             DEST2=&QUS05649,                                                 
//             DEST3=&RUS05693                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61241   EXEC PGM=W61241                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61241D1 DD  DSN=&INDIN..W61241(0),DISP=SHR                                   
//************ FIL MED ARTIKLAR SOM SKALL SKRIVAS UT                            
//*                                                                             
//W61241D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61241-001  ETIKETTER TILL DC41                                  
//*                                                                             
//W61241D3 DD  SYSOUT=(A,,STD),DEST=&DEST2                                      
//************ W61241-001  ETIKETTER TILL DC42                                  
//*                                                                             
//W61241D4 DD  SYSOUT=(A,,STD),DEST=&DEST3                                      
//************ W61241-001  ETIKETTER TILL DC43                                  
//*                                                                             
