//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER LISTOR PÅ ARTIKLAR SOM BEHÖVER FYLLAS PÅ                           
//*  PÅ PLATS.  (JPN/AUS)                                                       
//*                                                                             
//*  FREKVENS:     DAG     RTN W612D5                                           
//*                                                                             
//*  ÅTERSTART:    W61296    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P096 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&CPRINT,                                                   
//             INDIN1=&W488..W488S3,                                            
//             INDIN2=&W011..NDC,                                               
//             INDIN3=&W011..&RTEGRP,                                           
//             INDREG=&W011,                                                    
//             INDUT=&W612..W612D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* EXTRACT DC 61,62,AND NDC-CN FROM NDC FILE                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..W01184(+0),DISP=SHR                                 
//************ LAGERBAND FRÅN NDC:ERNA                                          
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTAT LAGERBAND FRÅN NDC:ERNA DC 61,62,NDC-CN                   
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61296   EXEC PGM=V16459,PARM='W61296/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W61296D1 DD  DSN=&INDIN1..W48881(+0),DISP=SHR                                 
//************ BUFFERTFIL                                                       
//*                                                                             
//W61296D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ UTDRAG UR WDK7                                                   
//*                                                                             
//W61296D3 DD  DSN=&INDIN3..W01174(+0),DISP=SHR                                 
//************ BENÄMNINGSREGISTER                                               
//*                                                                             
//W61296D4 DD  DSN=&&W612961,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(41,(200,50),RLSE),AVGREC=K                                
//************ TEMPFIL, SELEKTERAD BUFFERTFIL                                   
//*                                                                             
//W61296D5 DD  DSN=&&W612962,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(11,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, SUMMERAD BUFFERT FIL                                    
//*                                                                             
//W61296D6 DD  DSN=&&W612963,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(38,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, FIL MED DE ARTIKLAR SOM SKA UT PÅ LISTA                 
//*                                                                             
//W61296D7 DD  DSN=&&W612964,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(65,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, SAMMA SOM D6 KOMPLETTERAT MED US- OCH CN-BEN            
//*                                                                             
//W61296D8 DD  DSN=&&W612965,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(42,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, SAMMA SOM D4 KOMPLEMENTERAT MED SORTBEGREPP             
//*                                                                             
//W61296D9 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ LAGERBAND, W11160                                                
//*                                                                             
//W61296D0 DD  DSN=&&W612966,DISP=(NEW,PASS,DELETE),                            
//             SPACE=(65,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, D7 MED EMBALLAGEARTIKLAR BORTSELEKTERADE                
//*                                                                             
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//*                                                                             
//W61296DA DD  DUMMY                                                            
//************ LIST BIN FILL DC 41 RUTHERFORD I W612P096                        
//W61296DC DD  DUMMY                                                            
//************ LIST BIN FILL DC 43 LOS ANGELES                                  
//W61296DD DD  DUMMY                                                            
//************ LIST BIN FILL CANADA                                             
//W61296DE DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ LIST BIN FILL JAPAN                                              
//W61296DF DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ LIST BIN FILL AUSTRALIEN                                         
//W61296DG DD  DSN=&INDUT..W61296(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ LIST BIN FILL CHINA -> W61296-007                                
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61296DH DD  DSN=&&W612964A,DISP=(NEW,PASS,DELETE),                           
//             SPACE=(65,(50,10),RLSE),AVGREC=K                                 
//************ TEMPFIL, SAMMA SOM D6 KOMPLETTERAD MED US-BEÄMNING               
//*                                                                             
//W61296DI DD  DSN=&INDREG..W01171(+0),DISP=SHR                                 
//************ BENÄMNINGSREGISTER (KINESISK TEXT)                               
