//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  INLÄSNING AV INLEV-HIST                                                    
//*  TRE UTFILER SKAPAS                                                         
//*                                                                             
//*  FREKVENS:     DAG         RTN W612D4                                       
//*                                                                             
//*  ÅTERSTART:    W61250      NORMAL                                           
//*                LÄSER        WDL6                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612D4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61250   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61250,W61250,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//W61250D1 DD  DSN=&INDUT..W61251(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ALLA PT=310                                                      
//             SPACE=(42,(1,3),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//W61250D3 DD  DSN=&INDUT..W61253(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ R30 & R32                                                        
//             SPACE=(81,(3,4),RLSE),AVGREC=K,                                  
//             MGMTCLAS=&DEL2BKPC                                               
//W61250D4 DD  DSN=&INDUT..W6125B(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INFO TO ÄT TOT LISTA                                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W61250D5 DD  DSN=&&W61250X1,DISP=(NEW,PASS,DELETE),                           
//************ FILE TO DATA-LINK - R32                                          
//             DATACLAS=PSEB                                                    
//W61250D6 DD  DSN=&&W61250X2,DISP=(NEW,PASS,DELETE),                           
//************ FILE TO DATA-LINK - NOT R32                                      
//             DATACLAS=PSEB                                                    
