//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTLISTA LEDTIDER, WEEKLY "REFILL AK" MANAGEMENT FOLLOW-UP                  
//*                                                                             
//*  FREKVENS:     VECKA     RTN W612V3                                         
//*                                                                             
//*  ÅTERSTART:    SORT        NORMAL                                           
//*                W6127G      NORMAL                                           
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P07G PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD7G),DISP=SHR                         
//*                                                                             
//SORTIN   DD  DSN=&INDIN..W6127F(+0),DISP=SHR                                  
//************ INDATA FRÅN W612J07F                                             
//*                                                                             
//SORTOUT  DD  DSN=&&W6127G,DISP=(NEW,PASS,DELETE),                             
//************ INDATA SORTERAT PÅ FÖRETAG                                       
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6127G   EXEC PGM=DFSRRC00,                                                   
//             PARM=('BMP,W6127G,W6127G,,,N00,,,,,&CPU,,,&IMS')                 
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     (POSTSUM)           
//*                                                                             
//W6127GD1 DD  DSN=&&W6127G,DISP=(OLD,DELETE,DELETE)                            
//************ DATA SORTERAT PÅ FÖRETAG (IDFTG)                                 
//*                                                                             
