//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTLISTA "GOODS IN TRANSIT"                                                 
//*                                                                             
//*  FREKVENS:     VECKA     RTN W612V3                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W61268    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P068 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612V3,                                             
//             INDUT=&W612..W612V3.DC61,                                        
//             INDUT2=&W612..W612V3.DC11,                                       
//             INDUT3=&W612..W612V3,                                            
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD68),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61266(+0),DISP=SHR                                  
//************ FIL FRÅN W61266                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W61266,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAT DC, FAKTURA, ORDER, KOLLI                               
//         SPACE=(48,(10,10),RLSE),AVGREC=K                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61268   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61268,W61268,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61268D1 DD  DSN=&&W61266,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAT DC, FAKTURA, ORDER, KOLLI                               
//*                                                                             
//W61268D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61288-001  UTLISTA "GOODS IN TRANSIT"                           
//*                                                                             
//W61268D3 DD  DSN=&INDUT..W61268(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)         
//****************LISTA SOM UTFIL TILL D&P DC61                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61268D4 DD  DSN=&INDUT2..W61268(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)        
//****************LISTA SOM UTFIL TILL D&P DC11                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61268D5 DD  DSN=&INDUT3..W61268(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)        
//****************FOLLOW UP REPORT TO D&P                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61268D6 DD  DSN=&INDUT3..W61269(+1),DISP=(NEW,CATLG,DELETE),  -LIM(5)        
//****************MANAGEMENT FOLLOW UP REPORT TO D&P                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
