//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CHANGES PART LOCATION TO ZERO AFTER AUTO-RETURNED                          
//*  PARTS FROM LDC                                                             
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612D8                                         
//*                                                                             
//*  RESTART:      W61298    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P098 PROC STPLIB=&INDRTE..LOAD,CPU=1,                                     
//             INDIN=&W612..W612D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61298   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61298,W61298,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61298D1 DD  DSN=&INDIN..W61297(+0),DISP=SHR                                  
//************ INFIL, PARTS WHICH LOCATION SHOULD BE ZEROED                     
//*                                                                             
