//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER UT SKAMLISTA MED ARTIKLAR MED AK I SDC.                            
//*                                                                             
//*  FREKVENS:     DAG    RTN W612D1                                            
//*                                                                             
//*  ÅTERSTART:    W61204    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P004 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61204   EXEC PGM=V16459,PARM='W61204/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61204D1 DD  DSN=&INDIN..W61202(+0),DISP=SHR                                  
//************ FIL MED ARTIKLAR MED AK I SDC                                    
//*                                                                             
//W61204D2 DD  SYSOUT=(A,,STD)                                                  
//************ SKAMLISTA MED ARTIKLAR MED AK SDC                                
//************ ROUTAS TILL LOKAL SKRIVARE I RESP SDC                            
//*                                                                             
