//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATES WDGX6302 WITH CHANGES OF                                           
//*  PROPOSED AND EXISTING ETA.                                                 
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612DB                                         
//*                                                                             
//*  RESTART:      W6122A    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P02A PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612DB                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6122A   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W6122A,W6122A,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W6122AD1 DD  DSN=&INDIN..W61229(+0),DISP=SHR                                  
//************ INPUT FILE WITH PROPOSED AND EXISTING ETA.                       
//*                                                                             
