//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATE LOCATION EXTRACT                                                    
//*                                                                             
//*  FREQUENCE:    ORDERED     RTN W612M1                                       
//*                                                                             
//*  RESTART:      W61290      NORMAL                                           
//*                READS        WDJ8                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61290   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61290,W61290,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES        -- ABEND             
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES        -- ABEND             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDJ8     INCLUDE MEMBER=WDJ8                                                  
//*                                                                             
//W61290D1 DD  DSN=&INDUT..W61290(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LOCATION EXTRACT                                                 
//             SPACE=(37,(500,166),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
