//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  OVERVIEW OF OPEN DC LOCATIONS                                              
//*                                                                             
//*  FREQUENCE:    ORDERED     RTN W612Q1                                       
//*                                                                             
//*  RESTART:      W61219    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P019 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&QSE09012,                                                 
//             INDIN=&W011,                                                     
//             INDIN2=&W488..W488S3,                                            
//             INDIN3=&W612..W612Q1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61219   EXEC PGM=V16459,PARM='W61219/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(900,800))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61219D1 DD  DSN=&INDIN..SDC.W01184(+0),DISP=SHR                              
//         DD  DSN=&INDIN..NDC.W01184(+0),DISP=SHR                              
//************ PART FILE NDC/SDC WITH PRIME LOCATION                            
//*                                                                             
//W61219D2 DD DSN=&INDIN2..W48881(+0),DISP=SHR                                  
//************ PART FILE WITH BUFFER LOCATION                                   
//*                                                                             
//W61219D3 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ MERGE FILE  (D1 & D2 EXCL. "ICKE PLATSSATTA ART.")               
//         SPACE=(11,(500,250),RLSE),AVGREC=K                                   
//*                                                                             
//W61219D4 DD  DSN=&INDIN3..W61218(+0),DISP=SHR                                 
//************ LOCATION FILE                                                    
//*                                                                             
//W61219D5 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ MATCHED FILE WITH SWITCH (FREE LOC / TAKEN LOC)                  
//         SPACE=(52,(500,250),RLSE),AVGREC=K                                   
//*                                                                             
//W61219D6 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61219-001 OVERVIEW OF OPEN DC LOCATIONS                         
