//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES A FILE OF WDJ911 SEGMENTS MATCHING CERTAIN                         
//*  CONDITIONS.                                                                
//*  SB PROGRAM - READS ALL WDJ9 SEGMENTS                                       
//*                                                                             
//*  FREQUENCE:    YEARLY     RTN W612Y1                                        
//*                                                                             
//*  RESTART:      W61291      NORMAL                                           
//*                READS        WDJ9                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P091 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612Y1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61291   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61291,W61291,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDJ9     INCLUDE MEMBER=WDJ9                                                  
//W61291D1 DD  DSN=&INDUT..W61291(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ WDJ911 SEGMENT KEYS                                              
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
