//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LEVERANS ANMÄRKNING NDC - REFILL/TRANSFER/EXPORT                           
//*                                                                             
//*  FREKVENS:     DAG         RTN W612D2                                       
//*                                                                             
//*  ÅTERSTART:    W61222      NORMAL                                           
//*                LÄSER       WDR5                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61222   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61222,W61222,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR5     INCLUDE MEMBER=WDR5                                                  
//W61222D1 DD  DSN=&INDUT..W61221(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LEV ANM CDC-NDC                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//W61222D2 DD  DSN=&INDUT..W61223(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LEV ANM TRANSFER                                                 
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//W61222D3 DD  DSN=&INDUT..W61224(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ HTR 6305 DELEATE                                                 
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
