//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR LISTA TRANSFER DEVIATION NDC                                        
//*                                                                             
//*  FREKVENS:     DAG       RTN W612D2                                         
//*                                                                             
//*  ÅTERSTART:    W61226    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612D3,                                             
//             INDUT=&W612..W612D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD26),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61223,DISP=SHR                                      
//************ LEV ANM NDC                                                      
//*                                                                             
//SORTOUT  DD  DSN=&&W61223,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD W61223                                                  
//         SPACE=(43,(1,33),RLSE),AVGREC=K                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61226   EXEC PGM=W61226                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61226D1 DD  DSN=&&W61223,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD W61223                                                  
//*                                                                             
//W61226D2 DD  DSN=&INDUT..W61226(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ TRANSFER DEVIATION NDC                                           
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
