//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PROGRAMMET SKRIVER 'REALLOCATION LIST' IFRÅN FIL                           
//*  W61214:                                                                    
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W612R3                            
//*                                                                             
//*  ÅTERSTART:    W61216    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P016 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612R3,                                             
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61216   EXEC PGM=V16459,PARM='W61216/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61216D1 DD  DSN=&INDIN..W61217(+0),DISP=SHR                                  
//************ INFIL MED KOMPLETT INFO FÖR 'REALLOCATION LIST'                  
//*                                                                             
//W61216D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61216-001  REALLOCATION LIST                                    
//*                                                                             
