//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR UTLISTA PÅ FLYGLEVERANSER                                           
//*                                                                             
//*  FREKVENS:     DAG         RTN W612D5                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W61256    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P056 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&CPRINT,                                                   
//             INDIN=&W612..W612D5,                                             
//             INDUT=&W612..W612D5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD56),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61254(+0),DISP=SHR                                  
//************                                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&W61254,DISP=(NEW,PASS,DELETE),                             
//************ INDATA                                                           
//         SPACE=(39,(1,1),RLSE),AVGREC=K                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61256   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61256,W61256,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//WDK7     INCLUDE MEMBER=WDK7                                                  
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//A4LF  OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                                    
//************ A4 LANDSCAPE, SINGLE SIDE, RASTER  (FOLDED PAPER)                
//W61256D1 DD  DSN=&&W61254,DISP=(OLD,DELETE,DELETE)                            
//************ INFIL                                                            
//W61256D2 DD  SYSOUT=(A,,STD),DEST=&DEST1,OUTPUT=(*.A4LF)                      
//************ W61256-001  FÖRVÄNTADE FLYGLEVERANSER                            
//W61256D3 DD  DSN=&INDUT..W61257(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//************ W61256-002  FÖRVÄNTADE FLYGLEVERANSER FOLOWUP                    
//W61256D4 DD  DSN=&INDUT..W61258(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//************ W61256-003  FÖRVÄNTADE FLYGLEVERANSER MANAGEMENT FOLOWUP         
//W61256D5 DD  DSN=&INDUT..W6125A(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//************ W61256-001  FÖRVÄNTADE FLYGLEVERANSER VIA D&P                    
//*                                                                             
