//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LDC NEDLÄSNING WDR3                                                        
//*                                                                             
//*  FREKVENS:     DAG         RTN W612D6                                       
//*                                                                             
//*  ÅTERSTART:    W61247      NORMAL                                           
//*                LÄSER       WDR3 WDK6                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P047 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W612..W612D6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61247   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61247,W61247,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR3     INCLUDE MEMBER=WDR3                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDE4     INCLUDE MEMBER=WDE4                                                  
//W61247D1 DD  DSN=&INDUT..W61247(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LDC AVVIKELSE                                                    
//             SPACE=(63,(1,33),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W61247D2 DD  DSN=&INDUT..W61248(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ BORTTAG                                                          
//             SPACE=(227,(1,3),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W61247D3 DD  DSN=&INDUT..W6121F(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ LDC AVVIKELSE                                                    
//             SPACE=(63,(1,33),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
//W61247D4 DD  DSN=&INDUT..W6124S(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ SKROTAVVIKELSER                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
