//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR DAGLIGA W4140S GENERATIONER TILL EN VECKOFIL                      
//*                                                                             
//*  FREQUENCE:  VECKA       RTN W612VA                                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612  PROC INDIN=&W414..W612VA,                                               
//           INDIN2=&W612..W612VA,                                              
//           INDUT=&W612..W612VA                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE1 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W4140S,DISP=SHR                                      
//************ SKROT-ORDERRADER                                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W4140SV(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)        
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
//************                                                                  
//ICEGENE2 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN2..W6124S,DISP=SHR                                     
//************ SKROT-AVVIKELSER                                                 
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..W6124SV(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)        
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
//*                                                                             
