//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REMOVED PARTS LOCATION FOR LDC RETURNED PARTS                              
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W612D8                                         
//*                                                                             
//*  RESTART:      W61297    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P097 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011,                                                     
//             INDUT=&W612..W612D8                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61297   EXEC PGM=V16459,PARM='W61297/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//************ LDC-LAGERBAND                                                    
//W61297D1 DD  DSN=&INDIN..LDC.W01184(+0),DISP=SHR                              
//*                                                                             
//W61297D2 DD  DSN=&INDUT..W61297(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ LDC PARTS THAT SHALL HEVE THEIR LOCATIONS DELETED                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
