//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERING AV W61213 MED INFO IFRÅN WDL6 & WDD3                         
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W612R3                            
//*                                                                             
//*  ÅTERSTART:    W61214      NORMAL                                           
//*                LÄSER        WDL6 WDD3                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P014 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W612..W612R3,                                             
//             INDUT=&W612..W612R3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61214   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61214,W61214,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDL6     INCLUDE MEMBER=WDL6                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W61214D1 DD  DSN=&INDIN..W61213(+0),DISP=SHR                                  
//************ INFIL MED LAGERPLATSFREKVENSINFORMATION (MYSIGT ORD)             
//*                                                                             
//W61214D2 DD  DSN=&INDUT..W61217(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL KOMPLETTERAD MED BEART & TIDIGARE LAGERPLATSINFO           
//             SPACE=(72,(500,250),RLSE),AVGREC=K,                              
//             MGMTCLAS=&DEL2BKPC                                               
