//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR W01184-FILERNA (NDC) MED BUYER                                
//*  FRÅN W01160                                                                
//*                                                                             
//*  FREKVENS:     VECKA     RTN W612V4                                         
//*                                                                             
//*  ÅTERSTART:    W61278    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W612P078 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&W011,                                                    
//             INDIN3=&W011..W011S1,                                            
//             INDUT=&W612..W612V4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT01   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD79),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..LDC.W01184(+0),DISP=SHR                             
//************ LDC EXTRACT FROM WDK7                                            
//*                                                                             
//SORTOUT  DD  DSN=&&W01184L,DISP=(NEW,PASS,DELETE),                            
//************ FILTERED FOR CHINA LDC'S                                         
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W612PD78),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN2..NDC.W01184(+0),DISP=SHR                             
//************ UTDRAG UR WDK7                                                   
//         DD  DSN=&&W01184L,DISP=(OLD,DELETE,DELETE)                           
//************ EXTRACT OF CHINA LDC'S FROM WDK7                                 
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD / ARTIKELNUMMER                                         
//         DATACLAS=PSEN                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61278   EXEC PGM=V16459,PARM='W61278/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61278D1 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ UTDRAG UR WDK7                                                   
//*                                                                             
//W61278D2 DD  DSN=&INDIN3..W01160(+0),DISP=SHR                                 
//************ UTDRAG UR WDK6                                                   
//*                                                                             
//W61278D3 DD  DSN=&INDUT..W61278(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ DELAR AV W01184 KOMPLETTERAD MED BUYER                           
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
