//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  READ W61322 FILE AND DELETE FROM WDT101 SEGMENT                            
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W613V3                                         
//*                                                                             
//*  RESTART:      W6132500  NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W613P025 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//*                                                                             
//             INDIN=&W613..W613V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6132500 EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61325,W61325,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61325D1 DD  DSN=&INDIN..W61322(+0),DISP=SHR                                  
//************ APPROVED SEGMENTS TO BE DELETED FROM WDT1                        
//*                                                                             
