//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO INSERT THE RECORDS INTO WDT1. THE INPUT FILE IS                         
//*  FROM W6132900                                                              
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W613S2                           
//*                                                                             
//*  RESTART:   W6132600     NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W613P126 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W613..W613S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6132600 EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61326,W61326,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61326D1 DD  DSN=&INDIN..W61329(+0),DISP=SHR                                  
//************ SEGMENTS TO BE INSERTED INTO WDT1 - PICKING AREA                 
//*                                                                             
