//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  READ WDT101 AND CREATE OUTPUT FILES BASED ON                               
//*  THE STATUS CODES                                                           
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W613V3                                         
//*                                                                             
//*  RESTART:      W6132200    NORMAL                                           
//*                READS        WDT1                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W613P022 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDUT=&W613..W613V3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W6132200 EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61322,W61322,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDT1     INCLUDE MEMBER=WDT1                                                  
//W61322D1 DD  DSN=&INDUT..W61322(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ ALL SEGMENTS WITH STATUS CODE AS 'A'                             
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W61322D2 DD  DSN=&INDUT..W61323(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FILE WITH ELEMENTS IN W6132301                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W61322D3 DD  DSN=&INDUT..W61324(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FILE WITH ELEMENTS IN W6132401                                   
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
