//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  TO PRINT REPLENISHMENT PROPODALS FROM 6164                                 
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W613S3                           
//*                                                                             
//*  RESTART:      W61328      NORMAL                                           
//*                READS        WDT1 WDTA WDTB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W613P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             DEST1=&DEST1                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61328   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61328,W61328,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDT1     INCLUDE MEMBER=WDT1                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//W61328D1 DD  DUMMY                                                            
//************ INDATA FROM 6164 (OVERRIDE IN JCL)                               
//*                                                                             
//W61328D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61234-001  PRINT FROM MPP 6164 SCREEN                           
//*                                                                             
