//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  KVALITET                                                                   
//*                                                                             
//*  FREKVENS:     ORDER     RTN W614S2                                         
//*                                                                             
//*  ÅTERSTART:    W61421    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W614P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W614..W614S2,                                             
//             INDUT=&W614..W614S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61421   EXEC PGM=V16459,PARM='W61421/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=(D,,DUMP),DEST=QSE09012,HOLD=YES                           
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=F1ST00.CONSTANT(NORMAL),DISP=SHR         -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//*                                                                             
//W61421D1 DD  DSN=&INDIN..W61420(+0),DISP=SHR                                  
//************ FIL FRÅN W614P020                                                
//*                                                                             
//W61421D2 DD  DSN=&INDUT..W61421(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ MEMOFIL                                                          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
