//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKRIVER LISTA KVALITETS SPÄRRADE ARTIKLAR                                  
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W614S1                           
//*                                                                             
//*  RESTART:      W61413    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W614P013 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W614..W614S1,                                             
//             DEST1=LOCAL                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61413   EXEC PGM=V16459,PARM='W61413/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//W61413D1 DD  DSN=&INDIN..W61412(+0),DISP=SHR                                  
//************ LISTFIL                                                          
//*                                                                             
//W61413D2 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61413-001                                                       
//*                                                                             
//W61413D3 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ W61413-002                                                       
//*                                                                             
