//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR W61530 OCH W61532, MATCHAR DESSA OCH SKRIVER W61534.              
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W615V1                            
//*                                                                             
//*  ÅTERSTART:    W61534    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W615..W615V1,                                             
//             INDUT=&W615..W615V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61534   EXEC PGM=V16459,PARM='W61534/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(CYL,(10,10))                                              
//SORTMSG  DD  SYSOUT=*                                                         
//W61534D1 DD  DSN=&INDIN..W61530(+0),DISP=SHR                                  
//************ INFIL MED LAGERPLATSINFO IFRÅN WDK7:                             
//*                                                                             
//TEMP1    DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ TEMPFIL MED SORTERAD DATA IFRÅN OVANSTÅENDE:                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//W61534D3 DD  DSN=&INDIN..W61532(+0),DISP=SHR                                  
//************ INFIL MED LAGERPLATSINFO IFRÅN WDJ8 OCH 'RELOCATION              
//************ PARAMETRAR' IFRÅN WDR2:                                          
//*                                                                             
//TEMP2    DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ TEMPFIL MED SORTERAD DATA IFRÅN OVANSTÅENDE:                     
//             DATACLAS=PSEB                                                    
//*                                                                             
//W61534D5 DD  DSN=&INDUT..W61534(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL MED ARTIKLAR IFRÅN OVAN FILER SOM UPPFYLLER                
//************ 'REALLOCATION RULES'                                             
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
//*                                                                             
//SORTWK01 DD  DATACLAS=PSB                                                     
//SORTWK02 DD  DATACLAS=PSB                                                     
//SORTWK03 DD  DATACLAS=PSB                                                     
//SORTWK04 DD  DATACLAS=PSB                                                     
