//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER IN FIL MED ARTIKEL POSTER OCH UPPDATERAR                             
//*  WDR2 BASEN                                                                 
//*                                                                             
//*  FREKVENS:     DAG     RTN W615D1                                           
//*                                                                             
//*  ÅTERSTART:    W61553    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P053 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//*                                                                             
//             INDIN=&W615..W615D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61553   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W61553,W61553,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W61553D1 DD  DSN=&INDIN..W61552(+0),DISP=SHR                                  
//************ INFIL MED POSTER SOM HAR LAGERPLATS/KVPLATS/KVANTART             
//*                                                                             
