//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SB-LÄSNING AV WDJ8 SAMT LÄSNING AV WDR2. EN UTFIL W61540                   
//*                                                                             
//*  FREKVENS:     PERIOD  RTN W615Q1                                           
//*                                                                             
//*  ÅTERSTART:    W61540      NORMAL                                           
//*                LÄSER        WDJ8                                            
//*                LÄSER        WDR2                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P040 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W615..W615Q1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61540   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61540,W61540,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDJ8     INCLUDE MEMBER=WDJ8                                                  
//WDR2     INCLUDE MEMBER=WDR2                                                  
//*                                                                             
//W61540D1 DD  DSN=&INDUT..W61540(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL MED LAGERPLATSINFO SAMT FREKVENS OCH LAGRINGSINFO          
//             SPACE=(50,(600,100),RLSE),AVGREC=K,                              
//             MGMTCLAS=&BACKUPC                                                
