//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERING AV W61534 MED INFO IFRÅN WDL6 & WDD3                         
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD     RTN W615V1                            
//*                                                                             
//*  ÅTERSTART:    W61536      NORMAL                                           
//*                LÄSER        WDL6 WDD3                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W615..W615V1,                                             
//             INDUT=&W615..W615V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61536   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W61536,W61536,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM1K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM2K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM8K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDJ9     INCLUDE MEMBER=WDJ9                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//W61536D1 DD  DSN=&INDIN..W61534(+0),DISP=SHR                                  
//************ INFIL MED LAGERPLATSFREKVENSINFORMATION (MYSIGT ORD)             
//*                                                                             
//W61536D2 DD  DSN=&INDUT..W61536(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL KOMPLETTERAD MED BEART & TIDIGARE LAGERPLATSINFO           
//             SPACE=(80,(500,250),RLSE),AVGREC=K,                              
//             MGMTCLAS=&DEL2BKPC                                               
