//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER W479.W479DV1.W47922                                                  
//*                                                                             
//*  FREKVENS:     VECKA     RTN W615V1                                         
//*                                                                             
//*  ÅTERSTART:    W61531    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P031 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR,                                                     
//             INDUT=&W615..W615V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615     EXEC PGM=V16459,PARM='W61531/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR             -- DATKORT           
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR      -- DATKORT           
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W61531D1 DD  DSN=&INDIN..PACKRAD(+0),DISP=SHR                                 
//************ WXTR-PACKRAD EXTRAKT                                             
//*                                                                             
//W61531D2 DD  DSN=&INDUT..W61531(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ UTFIL                                                            
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
