//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORTERAR WXTR-PACKRAD PA IDARTNR OCH SUMMERAR                              
//*  ANTAL PLOCK MM.                                                            
//*                                                                             
//*  FREKVENS:     VECKA     RTN W615V1                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                W61533    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W615P033 PROC STPLIB=&INDRTE..LOAD,                                           
//*      TA BORT STPLIB OM INGET STEG FÖRUTOM SORT                              
//             INDIN=&W615..W615V1,                                             
//             INDUT=&W615..W615V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W615PD33),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W61531(+0),DISP=SHR                                  
//************ VECKANS PACKADE RADER                                            
//*                                                                             
//SORTOUT  DD  DSN=&&SORTERAD,DISP=(NEW,PASS,DELETE),                           
//************ SORTERAD PÅ ARTIKELNUMMER                                        
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W61533   EXEC PGM=V16459,PARM='W61533/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W61533D1 DD  DSN=&&SORTERAD,DISP=(OLD,DELETE,DELETE)                          
//************ SORTERAD PÅ ARTIKELNUMMER                                        
//*                                                                             
//W61533D2 DD  DSN=&INDUT..W61533(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ ANTAL PLOCK MM.                                                  
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
