//W6D1V    DD   DSN=&INDBAS..W6D1V,DISP=SHR                                     
//W6D1AK   DD   DSN=&INDBAS..W6D1AK,DISP=SHR                                    
//W6D1BK   DD   DSN=&INDBAS..W6D1BK,DISP=SHR                                    
//W6D1CK   DD   DSN=&INDBAS..W6D1CK,DISP=SHR                                    
//W6D1DK   DD   DSN=&INDBAS..W6D1DK,DISP=SHR                                    
//W6D1EK   DD   DSN=&INDBAS..W6D1EK,DISP=SHR                                    
//W6D1FK   DD   DSN=&INDBAS..W6D1FK,DISP=SHR                                    
//W6D1GK   DD   DSN=&INDBAS..W6D1GK,DISP=SHR                                    
//W6D1HK   DD   DSN=&INDBAS..W6D1HK,DISP=SHR                                    
//W6D1IK   DD   DSN=&INDBAS..W6D1IK,DISP=SHR                                    
