//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PURCHASE PLANNING REPORT- BRISTLISA                                        
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W810D2                                         
//*                                                                             
//*  RESTART:      W81011    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W810P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W225..W810D2,                                            
//             INDIN2=&WXTR..PARTINFO,                                          
//             INDIN3=&W440,                                                    
//             INDIN4=&W611..W810D2,                                            
//             INDUT=&W810..W810D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W81011   EXEC PGM=V16459,PARM='W81011/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//W81011D1 DD  DSN=&INDIN1..W22502A(+0),DISP=SHR                                
//         DD  DSN=&INDIN1..W22502A(-1),DISP=SHR                                
//************ CANCELLED RADAR FRI-SUN  (2 GENERATIONER)                        
//*                                                                             
//W81011D2 DD  DSN=&INDIN1..W22502A(+0),DISP=SHR                                
//************ CANCELLED RADAR WEEKDAY  (1 GENERATION)                          
//*                                                                             
//W81011D3 DD  DSN=&INDIN2..WCDCDAY(+0),DISP=SHR                                
//************ CDC-INFO-FILE                                                    
//*                                                                             
//W81011D4 DD  DSN=&INDIN3..W44061(+0),DISP=SHR                                 
//************ ESTORDER-FILEN (ANVÄNDS AV LINJEN)                               
//*                                                                             
//W81011D5 DD  DSN=&INDIN4..W61110A(+0),DISP=SHR                                
//************ IN-DELIVERY FILE                                                 
//*                                                                             
//W81011D6 DD  DSN=&INDUT..W81011(+1),DISP=(NEW,CATLG,DELETE),                  
//************ BRISLISTA                                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
