//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PACKED LINES FOLLOW UP WEEKLY..                                            
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W810D2                                         
//*                                                                             
//*  RESTART:      W81013    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W810P113 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..W810D2,                                             
//             INDUT=&W810..W810D2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W81013   EXEC PGM=V16459,PARM='W81013/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W81013D1 DD  DSN=&INDIN..PACKRAD(+0),DISP=SHR                                 
//************ CANCELLED RADAR WEEKLY                                           
//*                                                                             
//W81013D2 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ SORTED IN-PACKRADS-FIL.                                          
//             DATACLAS=PSEB                                                    
//*                                                                             
//W81013D3 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD IN-PACKRADS-FIL.                               
//             DATACLAS=PSEB                                                    
//*                                                                             
//W81013D4 DD  DSN=&INDUT..W81014(+1),DISP=(NEW,CATLG,DELETE),                  
//************ PICKER LINES REPORT PER DC                                       
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
