//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA VSOP INPUT FILE                                                      
//*                                                                             
//*  FREKVENS:     STARTAS AV ANV.     RTN WVSOP                                
//*                                                                             
//*  ÅTERSTART:    W85005   NORMAL                                              
//*                .                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W850P002 PROC STPLIB=&INDRTE..LOAD                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W85005   EXEC PGM=V16459,PARM='W85005/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(1000,500))                                          
//W85005D1 DD  DSN=&&W85003,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//W85005D2 DD  DSN=&&W85005,DISP=(NEW,PASS,DELETE),                             
//************ PASSFIL TILL W850P007                                            
//             DCB=(RECFM=FB,LRECL=189,BLKSIZE=6048),                           
//             SPACE=(6048,(1000,200),RLSE)                                     
//*                                                                             
//W85005D3 DD  DSN=&&W85010,DISP=(NEW,PASS,DELETE),                             
//************ VSOP INPUT FILE                                                  
//             DCB=(RECFM=FB,LRECL=189,BLKSIZE=6048),                           
//             SPACE=(6048,(1000,200),RLSE)                                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
