//*********************************************************************         
//*                                                                   *         
//*          FRAMSTÄLLNING AV V.S.O.P INPUT FILE                      *         
//*                                                                   *         
//*          PERIODICITET:  STARTAS AV AVD. 31100                     *         
//*                                                                   *         
//*          ÅTERSTART:     NORMAL                                    *         
//*                                                                   *         
//*********************************************************************         
//*                                                                             
//W850P001 PROC DSIN=NULLFILE,INDIN=&W850,                                      
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W85002  EXEC PGM=W85002                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//W85002D0 DD  DDNAME=KTNN1                                                     
//************** STYRPARAMETRAR FRÅN JCL                            ***         
//*                                                                             
//W85002D1 DD  DSN=&DSIN,DISP=(OLD,KEEP,KEEP)                                   
//************** IMPORTER-FILEN                                     ***         
//*                                                                             
//W85002D2 DD  DUMMY,DCB=BLKSIZE=1520                                           
//************** VR-FILEN                                           ***         
//*                                                                             
//W85002D3 DD  DSN=&INDIN..W85004(+0),DISP=(OLD,KEEP,KEEP)                      
//************** RS-FILEN                                           ***         
//*                                                                             
//W85002D4 DD  DSN=&&W85003,DISP=(NEW,PASS,DELETE),                             
//************** V.S.O.P INPUT FILE                                 ***         
//             SPACE=(6048,(625,562),RLSE)                                      
//*                                                                             
//*                                                                             
//W85002D5 DD  SYSOUT=*,                                                        
//             DCB=(RECFM=VBA,LRECL=125,BLKSIZE=129)                            
//************** LISTA W85002-010,-020,-030,-040 KONTROLL-LISTOR    ***         
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
