//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FIL MED ARTIKELINFO TILL VR                                         
//*                                                                             
//*  FREKVENS:     VECKA  RTN W91054                                            
//*                                                                             
//*  ÅTERSTART:    W91054    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P054 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W910,                                                    
//             INDUT=&W910..W91054                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91054   EXEC PGM=W91054                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91054D1 DD  DSN=&INDREG..W91042(+0),DISP=SHR                                 
//************ FIL MED ARTIKELINFO                                              
//*                                                                             
//W91054D2 DD  DSN=&INDUT..W91052(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED ARTIKELINFO TILL VR                                      
//             MGMTCLAS=&BACKUPC,SPACE=(213,(200,33),RLSE),AVGREC=K             
//*                                                                             
//W91054D3 DD  DSN=&INDUT..W91043(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FIL MED ARTIKELINFO TILL PGM W91041                              
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
