//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UTSUG  CROSSINDEX (WDF5)                                                   
//*                                                                             
//*  FREKVENS:     REDOVISNINGSPERIOD    RTN W91044                             
//*                                                                             
//*  ÅTERSTART:    W91044   NORMAL                                              
//*                                                                             
//*                SORT   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P044 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W910                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91044   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W91044,W91044,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//WDF5     INCLUDE MEMBER=WDF5                                                  
//W91044D1 DD  DSN=&&W91044,DISP=(NEW,PASS,DELETE),                             
//************ UTSUG CROSSINDEX (WDF5)                                          
//             SPACE=(27988,(1000,500),RLSE)                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W910PD44),DISP=SHR                         
//SORTIN   DD  DSN=&&W91044,DISP=(OLD,PASS,DELETE)                              
//************ OSORTERAD FILE FRÅN CROSSINDEX                                   
//*                                                                             
//SORTOUT  DD  DSN=&INDREG..W91044(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ SORTERAD FILE FRÅN CROSSINDEX                                    
//             SPACE=(27998,(1000,500),RLSE),                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
