//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHAR ARTIKELFIL MED BENÄMNINGAR TILL GGC                                
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD     RTN W910P2                              
//*                                                                             
//*  ÅTERSTART:    W91088    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P088 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910..W910P2,                                             
//             INDIN2=&W011..&RTEGRP.,                                          
//             INDUT=&W910..W910P2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91088   EXEC PGM=W91088                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91088Z1 DD  DSN=&INDIN2..W01160(+0),DISP=SHR                                 
//************ ARTIKELREGISTER                                                  
//*                                                                             
//W91088Z2 DD  DSN=&INDIN..W91087(+0),DISP=SHR                                  
//************ BENÄMNINGAR                                                      
//*                                                                             
//W91088D1 DD  DSN=&INDUT..W91088(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FIL MED BENÄMNINGAR TILL GGC                                     
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//* SPLIT THE ABOVE FILE INTO MULTIPLE FILES SO THAT EACH INDIVIDUAL  *         
//* FILE IS LESS THAN 3MB!                                            *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//FILESPLT EXEC PGM=ICEMAN                                                      
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&INDUT..W91088(+1),DISP=SHR                                  
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W910PD88),DISP=SHR                         
//*                                                                             
//OUT1     DD  DSN=&INDUT..W910A1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT2     DD  DSN=&INDUT..W910A2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT3     DD  DSN=&INDUT..W910A3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT4     DD  DSN=&INDUT..W910A4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT5     DD  DSN=&INDUT..W910A5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT6     DD  DSN=&INDUT..W910A6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT7     DD  DSN=&INDUT..W910A7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT8     DD  DSN=&INDUT..W910A8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT9     DD  DSN=&INDUT..W910A9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT10    DD  DSN=&INDUT..W910B1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT11    DD  DSN=&INDUT..W910B2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT12    DD  DSN=&INDUT..W910B3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT13    DD  DSN=&INDUT..W910B4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT14    DD  DSN=&INDUT..W910B5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT15    DD  DSN=&INDUT..W910B6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT16    DD  DSN=&INDUT..W910B7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT17    DD  DSN=&INDUT..W910B8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT18    DD  DSN=&INDUT..W910B9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT19    DD  DSN=&INDUT..W910C1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT20    DD  DSN=&INDUT..W910C2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT21    DD  DSN=&INDUT..W910C3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT22    DD  DSN=&INDUT..W910C4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT23    DD  DSN=&INDUT..W910C5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT24    DD  DSN=&INDUT..W910C6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT25    DD  DSN=&INDUT..W910C7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT26    DD  DSN=&INDUT..W910C8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT27    DD  DSN=&INDUT..W910C9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT28    DD  DSN=&INDUT..W910D1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT29    DD  DSN=&INDUT..W910D2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT30    DD  DSN=&INDUT..W910D3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT31    DD  DSN=&INDUT..W910D4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT32    DD  DSN=&INDUT..W910D5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT33    DD  DSN=&INDUT..W910D6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT34    DD  DSN=&INDUT..W910D7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT35    DD  DSN=&INDUT..W910D8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT36    DD  DSN=&INDUT..W910D9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT37    DD  DSN=&INDUT..W910E1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT38    DD  DSN=&INDUT..W910E2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT39    DD  DSN=&INDUT..W910E3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT40    DD  DSN=&INDUT..W910E4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT41    DD  DSN=&INDUT..W910E5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT42    DD  DSN=&INDUT..W910E6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT43    DD  DSN=&INDUT..W910E7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT44    DD  DSN=&INDUT..W910E8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT45    DD  DSN=&INDUT..W910E9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT46    DD  DSN=&INDUT..W910F1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT47    DD  DSN=&INDUT..W910F2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT48    DD  DSN=&INDUT..W910F3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT49    DD  DSN=&INDUT..W910F4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT50    DD  DSN=&INDUT..W910F5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT51    DD  DSN=&INDUT..W910F6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT52    DD  DSN=&INDUT..W910F7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT53    DD  DSN=&INDUT..W910F8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT54    DD  DSN=&INDUT..W910F9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT55    DD  DSN=&INDUT..W910G1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT56    DD  DSN=&INDUT..W910G2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT57    DD  DSN=&INDUT..W910G3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT58    DD  DSN=&INDUT..W910G4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT59    DD  DSN=&INDUT..W910G5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT60    DD  DSN=&INDUT..W910G6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT61    DD  DSN=&INDUT..W910G7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT62    DD  DSN=&INDUT..W910G8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT63    DD  DSN=&INDUT..W910G9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT64    DD  DSN=&INDUT..W910H1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT65    DD  DSN=&INDUT..W910H2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT66    DD  DSN=&INDUT..W910H3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT67    DD  DSN=&INDUT..W910H4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT68    DD  DSN=&INDUT..W910H5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT69    DD  DSN=&INDUT..W910H6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT70    DD  DSN=&INDUT..W910H7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT71    DD  DSN=&INDUT..W910H8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT72    DD  DSN=&INDUT..W910H9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT73    DD  DSN=&INDUT..W910I1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT74    DD  DSN=&INDUT..W910I2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT75    DD  DSN=&INDUT..W910I3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT76    DD  DSN=&INDUT..W910I4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT77    DD  DSN=&INDUT..W910I5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT78    DD  DSN=&INDUT..W910I6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT79    DD  DSN=&INDUT..W910I7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT80    DD  DSN=&INDUT..W910I8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT81    DD  DSN=&INDUT..W910I9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT82    DD  DSN=&INDUT..W910J1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT83    DD  DSN=&INDUT..W910J2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT84    DD  DSN=&INDUT..W910J3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT85    DD  DSN=&INDUT..W910J4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT86    DD  DSN=&INDUT..W910J5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT87    DD  DSN=&INDUT..W910J6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT88    DD  DSN=&INDUT..W910J7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT89    DD  DSN=&INDUT..W910J8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT90    DD  DSN=&INDUT..W910J9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT91    DD  DSN=&INDUT..W910K1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT92    DD  DSN=&INDUT..W910K2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT93    DD  DSN=&INDUT..W910K3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT94    DD  DSN=&INDUT..W910K4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT95    DD  DSN=&INDUT..W910K5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT96    DD  DSN=&INDUT..W910K6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT97    DD  DSN=&INDUT..W910K7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT98    DD  DSN=&INDUT..W910K8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT99    DD  DSN=&INDUT..W910K9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT100   DD  DSN=&INDUT..W910L1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT101   DD  DSN=&INDUT..W910L2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT102   DD  DSN=&INDUT..W910L3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT103   DD  DSN=&INDUT..W910L4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT104   DD  DSN=&INDUT..W910L5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT105   DD  DSN=&INDUT..W910L6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT106   DD  DSN=&INDUT..W910L7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT107   DD  DSN=&INDUT..W910L8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT108   DD  DSN=&INDUT..W910L9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT109   DD  DSN=&INDUT..W910M1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT110   DD  DSN=&INDUT..W910M2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT111   DD  DSN=&INDUT..W910M3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT112   DD  DSN=&INDUT..W910M4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT113   DD  DSN=&INDUT..W910M5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT114   DD  DSN=&INDUT..W910M6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT115   DD  DSN=&INDUT..W910M7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT116   DD  DSN=&INDUT..W910M8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT117   DD  DSN=&INDUT..W910M9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT118   DD  DSN=&INDUT..W910N1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT119   DD  DSN=&INDUT..W910N2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT120   DD  DSN=&INDUT..W910N3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT121   DD  DSN=&INDUT..W910N4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT122   DD  DSN=&INDUT..W910N5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT123   DD  DSN=&INDUT..W910N6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT124   DD  DSN=&INDUT..W910N7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT125   DD  DSN=&INDUT..W910N8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT126   DD  DSN=&INDUT..W910N9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT127   DD  DSN=&INDUT..W910O1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT128   DD  DSN=&INDUT..W910O2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT129   DD  DSN=&INDUT..W910O3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT130   DD  DSN=&INDUT..W910O4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT131   DD  DSN=&INDUT..W910O5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT132   DD  DSN=&INDUT..W910O6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT133   DD  DSN=&INDUT..W910O7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT134   DD  DSN=&INDUT..W910O8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT135   DD  DSN=&INDUT..W910O9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT136   DD  DSN=&INDUT..W910P1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT137   DD  DSN=&INDUT..W910P2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT138   DD  DSN=&INDUT..W910P3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT139   DD  DSN=&INDUT..W910P4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT140   DD  DSN=&INDUT..W910P5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT141   DD  DSN=&INDUT..W910P6(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT142   DD  DSN=&INDUT..W910P7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT143   DD  DSN=&INDUT..W910P8(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT144   DD  DSN=&INDUT..W910P9(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT145   DD  DSN=&INDUT..W910Q1(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT146   DD  DSN=&INDUT..W910Q2(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT147   DD  DSN=&INDUT..W910Q3(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT148   DD  DSN=&INDUT..W910Q4(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
//OUT149   DD  DSN=&INDUT..W910Q5(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
