//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EXTRAKT UR VLB ÅT PENTA                                             
//*                                                                             
//*  FREKVENS:     VECKA    RTN W100V1                                          
//*                                                                             
//*  ÅTERSTART:    W91010   NORMAL                                              
//*                                                                             
//*                DFUP   NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W011,                                                    
//             INDUT=&W910..W100V1                                              
//**           INDUT='WUT.W100V1'                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91010   EXEC PGM=V16459,PARM='W91010/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//W91010D1 DD  DSN=&INDREG..W01177(+0),DISP=SHR                                 
//************ VECKOLAGERBAND                                                   
//*                                                                             
//W91010D2 DD  DSN=&INDUT..W91010(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ EXTRAHERAT VECKOLAGERBAND FÖR PENTA                              
//             MGMTCLAS=&BACKUPC,SPACE=(6228,(360,50),RLSE)                     
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
