//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  JÄMFÖR MED TIDIGARE DAGLIG FIL                                             
//*                                                                             
//*  FREKVENS:     DAG     RTN W910D3                                           
//*                                                                             
//*  ÅTERSTART:    W91024    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P024 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910..W910D3,                                             
//             INDUT=&W910..W910D3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91024   EXEC PGM=W91024                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91024D1 DD  DSN=&INDIN..W91024(+0),DISP=SHR                                  
//************ DAGENS UTDRAG                                                    
//*                                                                             
//W91024D2 DD  DSN=&INDIN..W91024(-1),DISP=SHR                                  
//************ FÖREGÅENDE UTDRAG                                                
//*                                                                             
//W91024D3 DD  DSN=&INDUT..W91025(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ FÖRÄNDRING SEDAN FÖREGÅENDE                                      
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
