//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER WDN6 MED SB                                                          
//*  SKAPAR FIL MED ARTIKLAR OCH EMBLEM                                         
//*                                                                             
//*  FREKVENS:     PROGRAM PERIOD        RTN W910P1                             
//*                                                                             
//*  ÅTERSTART:    W91028   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&W910                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91028   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W91028,W91028,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM),DISP=SHR                             
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//*                                                                             
//WDN6     INCLUDE MEMBER=WDN6                                                  
//*                                                                             
//W91028D1 DD  DSN=&INDUT..W91028(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ARTIKLAR MED EMBLEM                                              
//************ SPACE=(6233,(5000,500),RLSE),  "PSEN" FIXAR DETTA                
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
