//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*       AVSTÄMNING ORDERLÄGE RS - VR , SKAPA FIL                    *         
//*       M.H.A  WDE4,WDE6, W44061                                    *         
//*                                                                   *         
//*  FREKVENS:  BESTÄLLNING            RTN W910B4                     *         
//*                                                                   *         
//*  ÅTERSTART: W91036  NORMAL                                        *         
//*             W91039  NORMAL                                        *         
//*             GENER   NORMAL                                        *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W910P036 PROC INDREG=&W440,INDUT2=&WUT..W910B4,                               
//             STPLIB=&INDRTE..LOAD,INDIN=&W910..W910B4                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91036   EXEC PGM=W91036                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91036D1 DD  DSN=&INDREG..W44061(+0),DISP=SHR                                 
//************ WDA5 PÅ SEKVENSFIL                                               
//*                                                                             
//W91036D2 DD  DSN=&&W91036,DISP=(NEW,PASS,DELETE),                             
//************ VR-TRANSAR                                                       
//             SPACE=(23452,(8,8),RLSE)                                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91039   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W91039,W91039,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=&INDRTE.DYN.LOAD,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(OSAM8K),DISP=SHR                           
//         DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91039D1 DD  DSN=&&W91038,DISP=(NEW,PASS,DELETE),                             
//************ VR-TRANSAR FRÅN ORDERREGISTRET WDE4                              
//             SPACE=(23452,(15,8),RLSE)                                        
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GENER   EXEC PGM=V16459,PARM='ICEGENER/8/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&&W91036,DISP=(OLD,PASS)                                     
//         DD  DSN=&INDIN..W91037(+0),DISP=SHR                                  
//         DD  DSN=&&W91038,DISP=(OLD,PASS)                                     
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..W91036(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************** AVSTÄMNING ORDERLÄGE  RS - VR   SAMMANSLAGEN FIL   ***         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
