//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FASTSTÄLLER VILKA PPMS-POSTER SOM ÄNDRATS ELLER                            
//*  TILLKOMMIT SEDAN SENASTE KÖRNING OCH SKICKAR DESSA TILL PPMS.              
//*                                                                             
//*  FREKVENS:     DAILY     RTN W910D2                                         
//*                                                                             
//*  ÅTERSTART:    W91021    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P021 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W910..W910D2,                                            
//             INDUT=&WUT..W910D2                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91021   EXEC PGM=V16459,PARM='W91021/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W91021D1 DD  DSN=&INDREG..W91020(+0),DISP=SHR                                 
//************ DEN NYA ARTIKELINFOFILEN                                         
//*                                                                             
//W91021D2 DD  DSN=&INDREG..W91020(-1),DISP=SHR                                 
//************ SAMMA FIL FRÅN FÖRRA KÖRNINGEN                                   
//*                                                                             
//W91021D3 DD  DSN=&INDUT..W91021(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ NYA/FÖRÄNDRADE ARTIKELINFO TILL PPMS                             
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&DEL2BKPC                                               
