//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR FILER TILL REGRESS                                                  
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W910P1                                     
//*                                                                             
//*  ÅTERSTART:    W91081    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P081 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN2=&WXTR..PARTINFO,                                          
//             INDIN3=&W011..&RTEGRP.,                                          
//             INDUT=&W910..W910P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91081   EXEC PGM=V16459,PARM='W91081/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(CYL,(100,100))                                            
//SORTMSG  DD  SYSOUT=*                                                         
//W91081D1 DD  DSN=&INDIN2..WCDCDAY(+0),DISP=SHR                                
//************ PARTINFO                                                         
//W91081D2 DD  DSN=&INDIN3..W01161(+0),DISP=SHR                                 
//************ LAGERBAND MED PRISER                                             
//W91081D3 DD  DSN=&INDUT..W91082(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED ARTIKELNUMMER                                            
//             DATACLAS=PSEN,MGMTCLAS=&DEL2BKPC                                 
//W91081D4 DD  DSN=&INDUT..W91081(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LEVERANTÖRS FIL                                                  
//             DATACLAS=PSEN,MGMTCLAS=&DEL2BKPC                                 
//TPFIL1   DD  DSN=&&TPFIL1,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERING AV QS4-POSTER                              
//             DATACLAS=PSEN                                                    
//TPFIL2   DD  DSN=&&TPFIL2,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERING AV QS3-POSTER                              
//             DATACLAS=PSEN                                                    
//TPFIL3   DD  DSN=&&TPFIL3,DISP=(NEW,PASS,DELETE),                             
//************ TEMPFIL FÖR SORTERING AV RADPRISER                               
//             DATACLAS=PSEN                                                    
