//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COMPARE GENERATON +0 AND GENERATON +1 AND WRITE                            
//*  CHANGES TO FILE W91059.                                                    
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W91054                                         
//*                                                                             
//*  RESTART:      W91059    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P059 PROC STPLIB=&INDRTE..LOAD, -- TA EV BORT KOMMA                       
//             INDIN=&W910..W91054,                                             
//             INDUT=&W910..W91054                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91059   EXEC PGM=V16459,PARM='W91059/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W91059D1 DD  DSN=&INDIN..W91051(+0),DISP=SHR                                  
//************ INPUT W91051(+0)                                                 
//*                                                                             
//W91059D2 DD  DSN=&INDIN..W91051(-1),DISP=SHR                                  
//************ INPUT W91051(-1)                                                 
//*                                                                             
//W91059D3 DD  DSN=&INDUT..W91059(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTPUT W91059                                                    
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
