//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ETA LOGGING VALIDATION                                                     
//*                                                                             
//*                                                                             
//*  CALLS W911SLDO,W911ETD MODULES AND COMPARE THEIR RESULTS                   
//*                                                                             
//*  FREQUENCE: WILL BE ORDERED WHEN NEEDED.                                    
//*                                                                             
//*  RESTART: W91091    NORMAL                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P091 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=SAKNAS,                                                    
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91091   EXEC PGM=DFSRRC00,                                                   
//  PARM=('DBB,W91091,W91091,,00')                                              
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDA5     INCLUDE MEMBER=WDA5                                                  
//WDA6     INCLUDE MEMBER=WDA6                                                  
//WDB1     INCLUDE MEMBER=WDB1                                                  
//WDB2     INCLUDE MEMBER=WDB2                                                  
//WDB3     INCLUDE MEMBER=WDB3                                                  
//WDB5     INCLUDE MEMBER=WDB5                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WDC1     INCLUDE MEMBER=WDC1                                                  
//WDD3     INCLUDE MEMBER=WDD3                                                  
//WDD7     INCLUDE MEMBER=WDD7                                                  
//WDD9     INCLUDE MEMBER=WDD9                                                  
//WDF1     INCLUDE MEMBER=WDF1                                                  
//WDF2     INCLUDE MEMBER=WDF2                                                  
//WDF8     INCLUDE MEMBER=WDF8                                                  
//WDG6     INCLUDE MEMBER=WDG6                                                  
//WDK6     INCLUDE MEMBER=WDK6                                                  
//WDK7     INCLUDE MEMBER=WDK7                                                  
//WDK9     INCLUDE MEMBER=WDK9                                                  
//WDL6     INCLUDE MEMBER=WDL6                                                  
//WDP7     INCLUDE MEMBER=WDP7                                                  
//WDQ2     INCLUDE MEMBER=WDQ2                                                  
//WDQ4     INCLUDE MEMBER=WDQ4                                                  
//WDR1     INCLUDE MEMBER=WDR1                                                  
//WDR6     INCLUDE MEMBER=WDR6                                                  
//*                                                                             
//W91091D1 DD  DSN=&INDIN..W91091,DISP=SHR                                      
//************ INPUT FILE WITH DIFFERENT PART NUMBERS,DISTRICT,CUSTOMER         
//W91091D2 DD  DSN=&INDUT..W91092A(+1),DISP=(NEW,CATLG,DELETE),                 
//************ OUTPUT FILE WITH RESULT FROM W911SLDO                            
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//W91091D3 DD  DSN=&INDUT..W91092B(+1),DISP=(NEW,CATLG,DELETE),                 
//************ OUTPUT FILE WITH RESULT FROM W911ETD                             
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
//**********************************************************************        
//*COMPARE FILES FOR TIDISPIN (DC AVAILABLE DATE),LEVDC (DELIVERING DC),        
//*ORDBEK ( ORDER CONFIRMATION ) AND CAPTURE THE MISMATCHED RECORDS             
//**********************************************************************        
//SORT      EXEC PGM=SORT                                                       
//SYSOUT    DD SYSOUT=*                                                         
//SORTJNF1  DD DSN=&INDUT..W91092A(+1),DISP=SHR                                 
//SORTJNF2  DD DSN=&INDUT..W91092B(+1),DISP=SHR                                 
//SYSIN     DD DSN=&INDRTE..CONSTANT(W910PD91),DISP=SHR                         
//SORTOUT   DD DSN=&INDUT..W91092C(+1),DISP=(NEW,CATLG,DELETE),                 
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
