//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MERGE                                                                      
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W91054                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P043 PROC INDIN=&W910..W91054,                                            
//             INDUT=&WUT..W91054                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W910PD43),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W91041(+0),DISP=SHR                                  
//         DD  DSN=&INDIN..W91059(+0),DISP=SHR                                  
//************ INFILE                                                           
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..W91058(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ OUTPUT W91058                                                    
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEB                                 
//*                                                                             
