//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  JÄMFÖR DENNA VECKAS LAGERBAND MED FÖRRA.                                   
//*  FÖRÄNDRINGAR  GÅR TILL VOLVO TRANSPORT                                     
//*                                                                             
//*  FREKVENS:     VECKA        RTN W910V2                                      
//*                                                                             
//*  ÅTERSTART:    W91060    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P060 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W011,                                                     
//             INDIN2=&W011,                                                    
//             INDUT=&WUT..W910V2                                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91060   EXEC PGM=W91060                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W91060D1 DD  DSN=&INDIN..W01177(+0),DISP=SHR                                  
//************ LAGERBAND DENNA VECKA                                            
//*                                                                             
//W91060D2 DD  DSN=&INDIN2..W01177(-1),DISP=SHR                                 
//************ LAGERBAND FÖRRA VECKAN                                           
//*                                                                             
//W91060D3 DD  DSN=&INDUT..W91061(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ DIFFERES LAGERBAND                                               
//             SPACE=(150,(10,63),RLSE),AVGREC=K,                               
//             MGMTCLAS=&BACKUPC                                                
