//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LÄSER NED LEV-BAS UPPGIFTER TILL INFIL                                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES     RTN W910P1                                     
//*                                                                             
//*  ÅTERSTART:    W91082      NORMAL                                           
//*                LÄSER        WDF1                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P082 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W910..W910P1,                                             
//             INDUT=&W910..W910P1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91082   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,W91082,W91082,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM2K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDF1     INCLUDE MEMBER=WDF1                                                  
//W91082D1 DD  DSN=&INDIN..W91081(+0),DISP=SHR                                  
//************ LEVNR                                                            
//*                                                                             
//W91082D2 DD  DSN=&INDUT..W91083(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ LEVNR MED ADDRESSER                                              
//             SPACE=(214,(1,3),RLSE),AVGREC=K,                                 
//             MGMTCLAS=&BACKUPC                                                
