//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FASTSTÄLLER EN FIL MED KINESISKA BENÄMNINGAR TILL VR.                      
//*                                                                             
//*  FREKVENS:     WEEK      RTN W91054                                         
//*                                                                             
//*  ÅTERSTART:    W91055    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W910P055 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&WUT..W91054,                                             
//             INDIN2=&W011..&RTEGRP,                                           
//             INDUT=&W910..W91054                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W91055   EXEC PGM=V16459,PARM='W91055/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W91055D1 DD  DSN=&INDIN1..W91054(+0),DISP=SHR                                 
//************ FIL MED URVAL AV ARTNR TILL VR                                   
//*                                                                             
//W91055D2 DD  DSN=&INDIN2..W01178(+0),DISP=SHR                                 
//************ FIL MED KINESISKA BENÄMNINGAR                                    
//*                                                                             
//W91055D3 DD  DSN=&INDUT..W91055(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ FIL MED KINESISKA BENÄMNINGAR TILL VR                            
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=NOBACKUP                                                
