//********************************************************************          
//***                                                              ***          
//***          FRAMSTÄLLNING AV FILE TILL  P V                     ***          
//***                                                              ***          
//*** FREKVENS:   VECKA           RTN W91050                       ***          
//***                                                              ***          
//*** ÅTERSTART:  NORMAL                                           ***          
//***                                                              ***          
//********************************************************************          
//W910P050 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&W910,INDUT=&WUT..W91050                                  
//W91050  EXEC PGM=W91050                                                       
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W91050D1 DD  DSN=&INDREG..W91042(+0),DISP=SHR                                 
//*                                                                             
//W91050D2 DD  DSN=&INDUT..W91050(+1),DISP=(NEW,CATLG,DELETE),                  
//             SPACE=(6210,(1500,500),RLSE),                                    
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//W91050D3 DD  DSN=&INDUT..W91090(+1),DISP=(NEW,CATLG,DELETE),                  
//             SPACE=(94,(150,30),RLSE),AVGREC=K,                               
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
