//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPDATE WDG2 WITH CURRENCY INFO.                                            
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN W930S3                           
//*                                                                             
//*  RESTART:      W93007    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W930P007 PROC STPLIB=&INDRTE..LOAD,                                           
//*                                                                             
//             INDIN2=&WF10..W930S3,                                            
//             INDUT=&W930..W930S3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W93007   EXEC PGM=DFSRRC00,                                                   
//  PARM=('BMP,W93007,W93007,,,N00,,,,,&CPU,,,&IMS')                            
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W93007D1 DD  DSN=&INDIN2..WF1023(+0),DISP=SHR                                 
//************ INPUT FILE                                                       
//*                                                                             
//W93007D2 DD  DSN=&INDUT..W93007(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ OUTPUT FILE TO D&P                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W93007D3 DD  DSN=&INDUT..W93008(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)          
//************ OUTPUT FILE TO D&P                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
