//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRINT AUDIT REPORT FROM SOP MESSAGE LOG                                    
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W970V2                                         
//*                                                                             
//*  RESTART:      W97043    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P043 PROC STPLIB=&INDRTE..LOAD,YYWW=9901,                                 
//             INDIN=&W970..W970V2,                                             
//             INDUT=&W970..W970V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W97043   EXEC PGM=V16459,PARM='W97043/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//W97043D1 DD  DSN=&INDIN..W97041S.YYWW&YYWW,DISP=SHR                           
//************ SOP MESSAGE DATA                                                 
//*                                                                             
//W97043D2 DD  DSN=&INDUT..W97043.YYWW&YYWW,                                    
//             DISP=(NEW,CATLG,DELETE),                                         
//************ W97043-001  MANUAL SCHEDULING REPORT                             
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
