//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PLOCKAR UT INFO UR TRANS-REGLER                                            
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W970B9                                      
//*                                                                             
//*  ÅTERSTART:    W97026    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W970..W970B9,                                             
//             INDUT=&W970..W970B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(W970PD26),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..W97022(+0),DISP=SHR                                  
//************ FIL MED ALLA ANALYSERADE REGLER I V2:AN                          
//*                                                                             
//SORTOUT  DD  DSN=&&W97022S,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD FIL                                                     
//         SPACE=(80,(500,40),RLSE),AVGREC=U                                    
//*                                                                             
//W97026   EXEC PGM=W97026                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W97026D1 DD  DSN=&&MEMBLIST,DISP=(OLD,DELETE,DELETE)                          
//************ FIL MED ALLA ACF2-MEDLEMMAR                                      
//*                                                                             
//W97026D2 DD  DSN=&&W97022S,DISP=(OLD,DELETE,DELETE)                           
//************ SORTERAD FIL MED ALLA ANALYSERADE REGLER I V2:AN                 
//*                                                                             
//W97026D3 DD  DSN=&INDIN..TRANSV2(0),DISP=SHR                                  
//************ FIL MED ALLA TRANSBESKRIVNINGAR SOM LIGGER I GENI                
//*                                                                             
//W97026D4 DD  DSN=&INDUT..W97026(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED REGLER                                                   
//             SPACE=(30,(80,40),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
