//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PLOCKAR UT INFO UR USER-FIL                                                
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W970B9                                      
//*                                                                             
//*  ÅTERSTART:    W97024    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P024 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W970..W970B1,                                             
//             INDUT=&W970..W970B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W97024   EXEC PGM=W97024                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W97024D1 DD  DSN=&INDIN..W97001(0),DISP=SHR                                   
//************ FIL MED USERS                                                    
//*                                                                             
//W97024D2 DD  DSN=&INDUT..W97024(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED LV-USERS                                                 
//             SPACE=(60,(80,40),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//W97024D3 DD  DSN=&INDUT..W97025(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED PV-USERS                                                 
//             SPACE=(60,(80,40),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
