//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PLOCKAR UT INFO UR TRANS-REGLER I V2:AN                                    
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN W970B9                                      
//*                                                                             
//*  ÅTERSTART:    W97022    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDACF2=&W970..WV2.ACF2,                                         
//             INDIN=&W970..W970B9,                                             
//             INDUT=&W970..W970B9                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W97022   EXEC PGM=W97022                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W97022D1 DD  DSN=&&MEMBLIST,DISP=(OLD,DELETE,DELETE)                          
//************ FIL MED ALLA ACF2-MEDLEMMAR                                      
//*                                                                             
//W97022D2 DD  DSN=&INDIN..TRANSAR(0),DISP=SHR                                  
//************ FIL MED ALLA TRANSBESKRIVNINGAR SOM LIGGER I GENI                
//*                                                                             
//W97022D3 DD  DSN=&INDIN..TRANSV2(0),DISP=SHR                                  
//************ FIL MED ALLA MSC-TRANSAR I V2                                    
//*                                                                             
//W97022D4 DD  DSN=&INDUT..W97022(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ FIL MED LV-REGLER                                                
//             SPACE=(30,(80,40),RLSE),AVGREC=K,                                
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//RACF2DD  DD  DSN=&INDACF2..RESOURCE,DISP=SHR                                  
//************ ACF2-BIBLIOTEK                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
