//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRACT ACF2 WARNINGS AND SOP MESSAGES                                     
//*  FROM OPER LOGS FOR ONE WEEK                                                
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W970V2                                         
//*                                                                             
//*  RESTART:      W97041    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P041 PROC STPLIB=&INDRTE..LOAD,                                           
//             YYWW=9901,                                                       
//             YYYY1=20XX,MMDD1=MM01,                                           
//             YYYY2=20XX,MMDD2=MM02,                                           
//             YYYY3=20XX,MMDD3=MM03,                                           
//             YYYY4=20XX,MMDD4=MM04,                                           
//             YYYY5=20XX,MMDD5=MM05,                                           
//             YYYY6=20XX,MMDD6=MM06,                                           
//             YYYY7=20XX,MMDD7=MM07,                                           
//             INDUT=&W970..W970V2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W97041   EXEC PGM=W97041                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W97041D1 DD  DSN=F1SYV2.OPERLOG.Y&YYYY1..MMDD&MMDD1,DISP=SHR                  
//************ OPER LOG FILES                                                   
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY2..MMDD&MMDD2,DISP=SHR                  
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY3..MMDD&MMDD3,DISP=SHR                  
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY4..MMDD&MMDD4,DISP=SHR                  
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY5..MMDD&MMDD5,DISP=SHR                  
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY6..MMDD&MMDD6,DISP=SHR                  
//         DD  DSN=F1SYV2.OPERLOG.Y&YYYY7..MMDD&MMDD7,DISP=SHR                  
//*                                                                             
//W97041D2 DD  DSN=&INDUT..W97041A.YYWW&YYWW,                                   
//************ ACF2 LOG ENTRIES                                                 
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//W97041D3 DD  DSN=&INDUT..W97041S.YYWW&YYWW,                                   
//************ SOP MESSAGE ENTRIES                                              
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
