//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EDIT ACCESS LIST REPORT USING DATA FROM ACFLST COMMAND                     
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W970B3                                         
//*                                                                             
//*  RESTART:      W97034    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W970P034 PROC STPLIB=&INDRTE..LOAD                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W97034   EXEC PGM=V16459,PARM='W97034/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W97034D1 DD  DSN=&&RPTIN,DISP=(OLD,DELETE,DELETE)                             
//************ ACCESS LIST DATA FROM ACFLST REXX COMMAND                        
//*                                                                             
//W97034D2 DD  DSN=&&RPTOUT,DISP=(NEW,PASS,DELETE),                             
//************ EDITED ACCESS LIST REPORT                                        
//             DATACLAS=PSEN                                                    
//*                                                                             
