//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     GAMMAL PROCEDUR.                                 *         
//*                  ERSATT AV W980PIMS                               *         
//*                                                                   *         
//*    ANSVARIG:     9231                                             *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W980PIMF PROC                                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO     EXEC PGM=IEFBR14                                                      
//SYSTSIN  DD  DUMMY                                                            
