//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     ANVÄNDS FÖR ATT KÖRA KOMMANDO W980JIMF SOM       *         
//*                  TRIGGAR KLOCKSLAGSSTYRDA SOP-PROCESSER.          *         
//*                                                                   *         
//*    ANSVARIG:     9231                                             *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//W980PIMS PROC STPLIB=&INDRTE..LOAD                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO     EXEC PGM=IKJEFT01,DYNAMNBR=50,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//         DD  DSN=SYS2.F1TS00.LOAD,DISP=SHR                                    
//SYSHELP  DD  DUMMY                                                            
//SYSPROC  DD  DSN=&INDRTE..EXEC,DISP=SHR                                       
//         DD  DSN=&INDLIB2..EXEC,DISP=SHR                                      
//         DD  DSN=&INDLIB3..EXEC,DISP=SHR                                      
//         DD  DSN=&INDGRND..EXEC,DISP=SHR                                      
//         DD  DSN=SYS2.F1TS00.EXEC,DISP=SHR                                    
//         DD  DSN=&INDRTE..CLIST,DISP=SHR                                      
//         DD  DSN=&INDLIB2..CLIST,DISP=SHR                                     
//         DD  DSN=&INDLIB3..CLIST,DISP=SHR                                     
//         DD  DSN=&INDGRND..CLIST,DISP=SHR                                     
//         DD  DSN=SYS2.F1TS00.CLIST,DISP=SHR                                   
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND   EXEC PGM=ABEND,COND=(4,GE,TSO),PARM='1234567890123456'                
