//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SUGER UT DESCRIPTION-SEKTION FRÅN ALLA MEDLEMMAR                           
//*  AV TYP ROUTINE OCH TRANSACTION                                             
//*                                                                             
//*  FREKVENS:     PLANERINGSPERIOD    RTN W980P1                               
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W980P070 PROC INDUT=&W980..W980P1                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//DMR     EXEC PGM=MPR00,REGION=2048K                                           
//STEPLIB  DD DSN=F1DAV1.DMR.LOAD,DISP=SHR                                      
//MPOUT    DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//PROD     DD DSN=&INDGRND..INDEX,DISP=SHR                                      
//PRODD    DD DSN=&INDGRND..DATA,DISP=SHR                                       
//PRODS    DD DSN=&INDGRND..DMSOURCE,DISP=SHR                                   
//PRODE    DD DSN=&INDGRND..RECOVER,DISP=SHR                                    
//PRODJ    DD DSN=&INDGRND..LOG,DISP=SHR                                        
//MPAID    DD DSN=F1DAV1.MPAID,DISP=SHR                                         
//MPIN     DD DSN=&INDRTE..CONSTANT(W98070DM),DISP=SHR                          
//MAILDD   DD DSN=&INDUT..W98070,DISP=(NEW,CATLG,DELETE),                       
//           DCB=(RECFM=VB,LRECL=84,BLKSIZE=23436),                             
//           SPACE=(TRK,(80,20),RLSE),MGMTCLAS=NOBACKUP                         
