//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT ABEND LOGS WITH CSV FORMAT                                          
//*                                                                             
//*  FREQUENCE:    DAILY     RTN W980V1                                         
//*                                                                             
//*  RESTART:      W98090    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W980P090 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W980..W980V1,                                             
//             INDUT=&W980..W980V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W98090   EXEC PGM=W98090                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W98090D1 DD  DSN=&INDIN..W98032(+0),DISP=SHR                                  
//************ WEEKS ABEND DATA                                                 
//*                                                                             
//W98090D2 DD  DSN=&INDUT..W98032A(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WEEKLY CSV FILE-1                                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//*                                                                             
//W98090D3 DD  DSN=&INDUT..W98032B(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WEEKLY CSV FILE-2                                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//*                                                                             
//W98090D4 DD  DSN=&INDUT..W98032C(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ WEEKLY CSV FILE-3                                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
