//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SENDS PROBLEM-CASE TO SCOPUS                                               
//*                                                                             
//*  FREKVENS:     INTERMITTENT                                                 
//*                                                                             
//*  ÅTERSTART:    W98026    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W980P026 PROC STPLIB=&INDRTE..LOAD,                                           
//             GROUP=TEST                                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W98026   EXEC PGM=W98026,PARM='&GROUP'                                        
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//W98026D1 DD  DUMMY                                                            
//************ PARAMETERS ARE SET IN JCL                                        
//*                                                                             
