//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  PRINT WEEKLY ABEND REPORT                                                  
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN W980V1                                         
//*                                                                             
//*  RESTART:      W98028    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W980P028 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W980..W980V1,                                             
//             INDUT=&W980..W980V1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W98028   EXEC PGM=V16459,PARM='W98028/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//W98028D1 DD  DSN=&INDIN..W98032(+0),DISP=SHR                                  
//************ THIS WEEKS ABEND DATA                                            
//*                                                                             
//W98028D2 DD  DSN=&INDUT..W98028(+1),DISP=(MOD,CATLG,DELETE), -LIM(52)         
//************ WEEKLY REPORT                                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
