//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SOTERAR OCH MATCHAR NY KDP-FIL MOT DEN FÖRRA OCH SKAPA                     
//*  R NY UPPDATFIL MED NYTT DATAELEMENT FLANNULL                               
//*                                                                             
//*  FREKVENS:     DAG     RTN WB01D1                                           
//*                                                                             
//*  LÄSER:        WDK6                                                         
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                          NORMAL                                             
//*                WB1122    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WB11P022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WB01..WB01D1,                                             
//             INDUT=&WB01..WB01D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTNYA  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WB11PD22),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WB0120(+0),DISP=SHR                                  
//************ NYA KDP-FILEN                                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WB1120N(+1),DISP=(NEW,PASS,DELETE), -LIM(20)         
//************ NYA KDP-FILEN SORTAT PÅ IDARTNR                                  
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//SORTGAM  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WB11PD22),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WB0120(-1),DISP=SHR                                  
//************ FÖRRA MOTTAGNA KDP-FILEN                                         
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WB1120G(+1),DISP=(NEW,PASS,DELETE), -LIM(20)         
//************ FÖRRA KDP-FILEN SORTAD PÅ IDARTNR                                
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WB1122   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,WB1122,WB1122,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(OSAM4K),DISP=SHR                           
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDK6     INCLUDE MEMBER=WDK6                                                  
//*                                                                             
//WB1122D1 DD  DSN=&INDUT..WB1120N(+1),DISP=(OLD,CATLG,DELETE)                  
//************ FÖRRA KDP-FILEN SORTAD PÅ IDARTNR                                
//*                                                                             
//WB1122D2 DD  DSN=&INDUT..WB1120G(+1),DISP=(OLD,CATLG,DELETE)                  
//************ FÖRRA KDP-FILEN SORTAD PÅ IDARTNR                                
//*                                                                             
//WB1122D3 DD  DSN=&INDUT..WB1122(+1),DISP=(NEW,CATLG,DELETE), -LIM(50)         
//************ NYA UPPDATFILEN                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
