//WDA3V    DD   DSN=&INDBAS..WDA3V,DISP=SHR                                     
//WDA3AK   DD   DSN=&INDBAS..WDA3AK,DISP=SHR                                    
//WDA3BK   DD   DSN=&INDBAS..WDA3BK,DISP=SHR                                    
//WDA3CK   DD   DSN=&INDBAS..WDA3CK,DISP=SHR                                    
//WDA3DK   DD   DSN=&INDBAS..WDA3DK,DISP=SHR                                    
//WDA3EK   DD   DSN=&INDBAS..WDA3EK,DISP=SHR                                    
//WDA3FK   DD   DSN=&INDBAS..WDA3FK,DISP=SHR                                    
//WDA3GK   DD   DSN=&INDBAS..WDA3GK,DISP=SHR                                    
//WDA3HK   DD   DSN=&INDBAS..WDA3HK,DISP=SHR                                    
//WDA3IK   DD   DSN=&INDBAS..WDA3IK,DISP=SHR                                    
