//WDA5K    DD   DSN=&INDBAS..WDA5K,DISP=SHR                                     
//WDA5AK   DD   DSN=&INDBAS..WDA5AK,DISP=SHR                                    
//WDA5BK   DD   DSN=&INDBAS..WDA5BK,DISP=SHR                                    
//WDA5CK   DD   DSN=&INDBAS..WDA5CK,DISP=SHR                                    
//WDA5DK   DD   DSN=&INDBAS..WDA5DK,DISP=SHR                                    
//WDA5EK   DD   DSN=&INDBAS..WDA5EK,DISP=SHR                                    
