//WDA6V    DD   DSN=&INDBAS..WDA6V,DISP=SHR                                     
//WDA6AK   DD   DSN=&INDBAS..WDA6AK,DISP=SHR                                    
//WDA6BK   DD   DSN=&INDBAS..WDA6BK,DISP=SHR                                    
//WDA6CK   DD   DSN=&INDBAS..WDA6CK,DISP=SHR                                    
//WDA6DK   DD   DSN=&INDBAS..WDA6DK,DISP=SHR                                    
//WDA6EK   DD   DSN=&INDBAS..WDA6EK,DISP=SHR                                    
//WDA6FK   DD   DSN=&INDBAS..WDA6FK,DISP=SHR                                    
//WDA6GK   DD   DSN=&INDBAS..WDA6GK,DISP=SHR                                    
//WDA6HK   DD   DSN=&INDBAS..WDA6HK,DISP=SHR                                    
//WDA6IK   DD   DSN=&INDBAS..WDA6IK,DISP=SHR                                    
//WDA6JK   DD   DSN=&INDBAS..WDA6JK,DISP=SHR                                    
//WDA6KK   DD   DSN=&INDBAS..WDA6KK,DISP=SHR                                    
//WDA6LK   DD   DSN=&INDBAS..WDA6LK,DISP=SHR                                    
//WDA6MK   DD   DSN=&INDBAS..WDA6MK,DISP=SHR                                    
