//WDA7K    DD   DSN=&INDBAS..WDA7K,DISP=SHR                                     
//WDA7AK   DD   DSN=&INDBAS..WDA7AK,DISP=SHR                                    
