//WDA8V    DD   DSN=&INDBAS..WDA8V,DISP=SHR                                     
//WDA8AK   DD   DSN=&INDBAS..WDA8AK,DISP=SHR                                    
//WDA8BK   DD   DSN=&INDBAS..WDA8BK,DISP=SHR                                    
