//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPLÄGGNING AV DATUMKORT I RS DATUMKORTS-FIL                               
//*                                                                             
//*  ETT ELLER FLERA DATUMKORT LÄSES FRÅN SYSIN, OCH STOPPAS IN                 
//*  PÅ RÄTT PLATS I DATUMKORTS-FILEN.                                          
//*  FÖRÅLDRADE DATUMKORT RENSAS FRÅN DATUMKORTS-FILEN.                         
//*  (SYSIN-KORTEN MÅSTE VARA SORTERADE I STIGANDE SEKVENS)                     
//*                                                                             
//*  SYMBOLISKA PARAMETERN IOCSDAT KAN ANVÄNDAS PÅ FÖLJANDE SÄTT:               
//*                                                                             
//*  IOCSDAT=XXXXX (DEFAULT) IOCSDATUM (KOL 76-80) GENERERAS AV                 
//*                PROGRAMMET FRÅN DAGENS DATUM. KOL 73-80 I                    
//*                SYSIN-KORTEN ANVÄNDS EJ.                                     
//*  IOCSDAT=ÅÅDDD (DVS ETT VETTIGT NUMERISKT DATUM)                            
//*                DET DATUM SOM ANGES ANVÄNDS. KOL 73-80 I                     
//*                SYSIN-KORTEN ANVÄNDS EJ.                                     
//*  IOCSDAT=SYSIN DET VÄRDE SOM STÅR I SYSIN-KORTEN ANVÄNDS.                   
//*                ÄVEN KOL 73-75 KAN DÅ INNEHÅLLA DATA.                        
//*                                                                             
//*  FREKVENS:     ANVÄNDS I RUTINER SOM HAR SPECIAL-DATUMKORT                  
//*                VID UPPSTARTEN AV DAG-KÖRNINGARNA                            
//*                SAMT I BÖRJAN AV NATTBATCHEN                                 
//*                                                                             
//*  ÅTERSTART:    W03002   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDATUM   PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG=&INDRTE.,                                                 
//             IOCSDAT=XXXXX                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W03002   EXEC PGM=W03002,PARM=&IOCSDAT                                        
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                      -- DISPLAY         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                      -- POSTSUM         
//W03002D1 DD  DSN=&INDREG..DATUM(+0),DISP=SHR                                  
//************ GAMMAL DATUMKORTS-FIL                                            
//*                                                                             
//W03002D2 DD  DDNAME=SYSIN                                                     
//************ DATUMKORT ATT LÄGGA UPP                                          
//*                                                                             
//W03002D3 DD  DSN=&INDREG..DATUM(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ NY DATUMKORTS-FIL                                                
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),                              
//             MGMTCLAS=&BACKUPC,SPACE=(80,(1,1),RLSE)                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
