//WDB1K    DD   DSN=&INDBAS..WDB1K,DISP=SHR                                     
//WDB1AK   DD   DSN=&INDBAS..WDB1AK,DISP=SHR                                    
//WDB1BK   DD   DSN=&INDBAS..WDB1BK,DISP=SHR                                    
