//WDB6V    DD   DSN=&INDBAS..WDB6V,DISP=SHR                                     
//WDB6AK   DD   DSN=&INDBAS..WDB6AK,DISP=SHR                                    
