//WDB7K    DD   DSN=&INDBAS..WDB7K,DISP=SHR                                     
//WDB7AK   DD   DSN=&INDBAS..WDB7AK,DISP=SHR                                    
