//WDC1V    DD   DSN=&INDBAS..WDC1V,DISP=SHR                                     
//WDC1AK   DD   DSN=&INDBAS..WDC1AK,DISP=SHR                                    
