//WDC6V    DD   DSN=&INDBAS..WDC6V,DISP=SHR                                     
//WDC6AK   DD   DSN=&INDBAS..WDC6AK,DISP=SHR                                    
