//WDC9K    DD   DSN=&INDBAS..WDC9K,DISP=SHR                                     
//WDC9AK   DD   DSN=&INDBAS..WDC9AK,DISP=SHR                                    
