//WDD3V    DD   DSN=&INDBAS..WDD3V,DISP=SHR                                     
//WDD3AK   DD   DSN=&INDBAS..WDD3AK,DISP=SHR                                    
//WDD3BK   DD   DSN=&INDBAS..WDD3BK,DISP=SHR                                    
