//WDD4K    DD   DSN=&INDBAS..WDD4K,DISP=SHR                                     
//WDD4AK   DD   DSN=&INDBAS..WDD4AK,DISP=SHR                                    
