//WDD8V    DD   DSN=&INDBAS..WDD8V,DISP=SHR                                     
//WDD8AK   DD   DSN=&INDBAS..WDD8AK,DISP=SHR                                    
//WDD8BK   DD   DSN=&INDBAS..WDD8BK,DISP=SHR                                    
