//WDDLT0 PROC PSB=,GROUP=TEST,PROJ=W                                            
//*********************************************************************         
//*                                                                   *         
//*      **    R D D L T 0  **                                        *         
//*                                                                   *         
//*      DFSDDLT0, EN VERSION AV VOLVO DATAS PROC MEN DEN HAR DBRC-   *         
//*      KONTROL FÖR PD90                                             *         
//*      KONTROLKORT FÖR DFSDDLT0 VIA SYSIN                           *         
//*                                                                   *         
//*                              MAINTAINED BY DEPT 30652             *         
//*                                                                   *         
//*********************************************************************         
//GO     EXEC  PGM=DFSRRC00,                                                    
//         PARM='DLI,DFSDDLT0,&PSB,,00'                                         
//*        PARM='DLI,DFSDDLT0,&PSB,,00,,,,,,,,,Y'                               
//STEPLIB  DD  DSN=F1IMV1.&GROUP..USERLIB,DISP=SHR                              
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&PROJ..&GROUP..PSBLIB,DISP=SHR                               
//         DD  DSN=&PROJ..&GROUP..DBDLIB,DISP=SHR                               
//IMSACB   DD  DSN=&PROJ..&GROUP..ACBLIB,DISP=SHR                               
//IEFRDER  DD  DSN=,SPACE=(CYL,(15,5),RLSE)                                     
//DFSVSAMP DD  DSN=F1IMV1.PROD.CONSTANT(VVIMSBUF),DISP=SHR                      
//PRINTDD  DD  SYSOUT=*                                                         
