//WDE1V    DD   DSN=&INDBAS..WDE1V,DISP=SHR                                     
//WDE1AK   DD   DSN=&INDBAS..WDE1AK,DISP=SHR                                    
//WDE1BK   DD   DSN=&INDBAS..WDE1BK,DISP=SHR                                    
