//WDE3K    DD   DSN=&INDBAS..WDE3K,DISP=SHR                                     
//WDE3AK   DD   DSN=&INDBAS..WDE3AK,DISP=SHR                                    
//WDE3BK   DD   DSN=&INDBAS..WDE3BK,DISP=SHR                                    
