//WDE4V    DD   DSN=&INDBAS..WDE4V,DISP=SHR                                     
//WDE4AK   DD   DSN=&INDBAS..WDE4AK,DISP=SHR                                    
//WDE4BK   DD   DSN=&INDBAS..WDE4BK,DISP=SHR                                    
//WDE4CK   DD   DSN=&INDBAS..WDE4CK,DISP=SHR                                    
//WDE4DK   DD   DSN=&INDBAS..WDE4DK,DISP=SHR                                    
//WDE4EK   DD   DSN=&INDBAS..WDE4EK,DISP=SHR                                    
//WDE4FK   DD   DSN=&INDBAS..WDE4FK,DISP=SHR                                    
