//WDE7V    DD   DSN=&INDBAS..WDE7V,DISP=SHR                                     
//WDE7AK   DD   DSN=&INDBAS..WDE7AK,DISP=SHR                                    
//WDE7BK   DD   DSN=&INDBAS..WDE7BK,DISP=SHR                                    
//WDE7CK   DD   DSN=&INDBAS..WDE7CK,DISP=SHR                                    
