//WDF1V    DD   DSN=&INDBAS..WDF1V,DISP=SHR                                     
//WDF1AK   DD   DSN=&INDBAS..WDF1AK,DISP=SHR                                    
