//WDF3V    DD   DSN=&INDBAS..WDF3V,DISP=SHR                                     
//WDF3AK   DD   DSN=&INDBAS..WDF3AK,DISP=SHR                                    
