//WDF5V    DD   DSN=&INDBAS..WDF5V,DISP=SHR                                     
//WDF5AK   DD   DSN=&INDBAS..WDF5AK,DISP=SHR                                    
//WDF5BK   DD   DSN=&INDBAS..WDF5BK,DISP=SHR                                    
