//WDF6V    DD   DSN=&INDBAS..WDF6V,DISP=SHR                                     
//WDF6AK   DD   DSN=&INDBAS..WDF6AK,DISP=SHR                                    
