//WDF7V    DD   DSN=&INDBAS..WDF7V,DISP=SHR                                     
//WDF7AK   DD   DSN=&INDBAS..WDF7AK,DISP=SHR                                    
