//WDF8V    DD   DSN=&INDBAS..WDF8V,DISP=SHR                                     
//WDF8AK   DD   DSN=&INDBAS..WDF8AK,DISP=SHR                                    
//WDF8BK   DD   DSN=&INDBAS..WDF8BK,DISP=SHR                                    
//WDF8CK   DD   DSN=&INDBAS..WDF8CK,DISP=SHR                                    
