//WDG8V    DD   DSN=&INDBAS..WDG8V,DISP=SHR                                     
//WDG8AK   DD   DSN=&INDBAS..WDG8AK,DISP=SHR                                    
