//WDJ7K    DD   DSN=&INDBAS..WDJ7K,DISP=SHR                                     
//WDJ7AK   DD   DSN=&INDBAS..WDJ7AK,DISP=SHR                                    
//WDJ7BK   DD   DSN=&INDBAS..WDJ7BK,DISP=SHR                                    
//WDJ7CK   DD   DSN=&INDBAS..WDJ7CK,DISP=SHR                                    
//WDJ7DK   DD   DSN=&INDBAS..WDJ7DK,DISP=SHR                                    
//WDJ7EK   DD   DSN=&INDBAS..WDJ7EK,DISP=SHR                                    
//WDJ7FK   DD   DSN=&INDBAS..WDJ7FK,DISP=SHR                                    
