//WDK6V    DD   DSN=&INDBAS..WDK6V,DISP=SHR                                     
//WDK6AK   DD   DSN=&INDBAS..WDK6AK,DISP=SHR                                    
//WDK6BK   DD   DSN=&INDBAS..WDK6BK,DISP=SHR                                    
//WDK6CK   DD   DSN=&INDBAS..WDK6CK,DISP=SHR                                    
//WDK6DK   DD   DSN=&INDBAS..WDK6DK,DISP=SHR                                    
//WDK6EK   DD   DSN=&INDBAS..WDK6EK,DISP=SHR                                    
//WDK6FK   DD   DSN=&INDBAS..WDK6FK,DISP=SHR                                    
//WDK6GK   DD   DSN=&INDBAS..WDK6GK,DISP=SHR                                    
//WDK6HK   DD   DSN=&INDBAS..WDK6HK,DISP=SHR                                    
