//WDL5V    DD   DSN=&INDBAS..WDL5V,DISP=SHR                                     
//WDL5AK   DD   DSN=&INDBAS..WDL5AK,DISP=SHR                                    
