//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*        SPECIAL-PROCEDUR FÖR DBRC-UTILITY                                    
//*                                                                             
//*        ÅTERSTART: IMS-TEKNIK                                                
//*                                                                             
//*                                            ANSV. AVD. IMS-TEKNIK            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WDLIDBRC PROC INDABE=&INDRTE                                                  
//DBRC    EXEC PGM=DSPURX00                                                     
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDABE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,GE,DBRC),PARM='1234567890123456'               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
