//WDM2V    DD   DSN=&INDBAS..WDM2V,DISP=SHR                                     
//WDM2AK   DD   DSN=&INDBAS..WDM2AK,DISP=SHR                                    
