//WDM6V    DD   DSN=&INDBAS..WDM6V,DISP=SHR                                     
//WDM6AK   DD   DSN=&INDBAS..WDM6AK,DISP=SHR                                    
//WDM6BK   DD   DSN=&INDBAS..WDM6BK,DISP=SHR                                    
//WDM6CK   DD   DSN=&INDBAS..WDM6CK,DISP=SHR                                    
//WDM6DK   DD   DSN=&INDBAS..WDM6DK,DISP=SHR                                    
//WDM6EK   DD   DSN=&INDBAS..WDM6EK,DISP=SHR                                    
