//WDM7K    DD   DSN=&INDBAS..WDM7K,DISP=SHR                                     
//WDM7AK   DD   DSN=&INDBAS..WDM7AK,DISP=SHR                                    
//WDM7BK   DD   DSN=&INDBAS..WDM7BK,DISP=SHR                                    
