//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LETA EFTER FELMEDDELANDE I SYTSOUT:EN                                      
//*  FRÅN DATA MANAGER                                                          
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV5                                      
//*                                                                             
//*  ÅTERSTART:    WDMR36    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP036 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV5,                                             
//             CLASS=A,                                                         
//             FORMS=3803,                                                      
//             DEST1=&CPRINT                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR36   EXEC PGM=V16459,PARM='WDMR36/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//WDMR36D1 DD  DSN=&INDIN..WDMR35(+0),DISP=SHR                                  
//************ DATA MANAGER SYSOUT                                              
//*                                                                             
//A4LF         OUTPUT FORMDEF=SLSR6C,PAGEDEF=SLSR6C                             
//*                                                                             
//WDMR36D2 DD  SYSOUT=(&CLASS,,&FORMS),DEST=&DEST1,OUTPUT=(*.A4LF),             
//************ WDMR36-001  FELLISTA                                             
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
