//*********************************************************************         
//*                                                                   *         
//* PROCEDURE TO RUN DATAMANAGER UNLOAD                               *         
//*                                                                   *         
//*********************************************************************         
//WDMRUNLO PROC USER=W,DICT=PROD,                                               
//             MGMTCLAS=&BACKUPC,CYLPRM=200,CYLSEC=50                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//UNLOAD  EXEC PGM=MPR00                                                        
//STEPLIB   DD DSN=F1DAV1.DMR.LOAD,DISP=SHR                                     
//MPAID     DD DSN=F1DAV1.MPAID,DISP=SHR                                        
//MPOUT     DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DICT      DD DSN=&USER..&DICT..INDEX,DISP=SHR                                 
//DICTD     DD DSN=&USER..&DICT..DATA,DISP=SHR                                  
//DICTS     DD DSN=&USER..&DICT..DMSOURCE,DISP=SHR                              
//DICTE     DD DSN=&USER..&DICT..RECOVER,DISP=SHR                               
//DICTJ     DD DSN=&USER..&DICT..LOG,DISP=SHR                                   
//DICTV     DD DSN=&USER..&DICT..DMUNLOAD(+1),          BACKUP   BACKUP         
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=&MGMTCLAS,                                              
//             SPACE=(CYL,(&CYLPRM,&CYLSEC),RLSE)                               
//MPIN      DD DSN=&INDRTE..CONSTANT(WDMRUNLO),DISP=SHR                         
//          DD DDNAME=SYSIN                                                     
