//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SORT AV PROCEDURFIL                                                        
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV1                                      
//*                                                                             
//*  ÅTERSTART:    WDMR07    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV1,                                             
//             INDUT=&WDMR..WDMRV1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR07   EXEC PGM=V16459,PARM='WDMR07/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//WDMR07D1 DD  DSN=&INDIN..WDMR0B(+0),DISP=SHR                                  
//************ INFIL                                                            
//*                                                                             
//WDMR07D2 DD  DSN=&INDUT..WDMR07(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,SPACE=(80,(400,100),RLSE),AVGREC=U             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
