//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA LADDFILER FÖR DATA MANAGER                                           
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV5                                      
//*                                                                             
//*  ÅTERSTART:    WDMR34    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP034 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV5,                                             
//             INDUT=&WDMR..WDMRV5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR34   EXEC PGM=WDMR34                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDMR34D1 DD  DSN=&INDIN..WDMR33(+0),DISP=SHR                                  
//************ LADDMODULER                                                      
//*                                                                             
//WDMR34D2 DD  DSN=&INDUT..WDMR34(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LADDFIL TILL DATA MANAGER                                        
//             MGMTCLAS=DEL2,                                                   
//             SPACE=(80,(23000,1000),RLSE),AVGREC=U                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
