//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR DATAMANAGER MED INFO OM ETT PROGRAM                             
//*  SAMT DESS FILER                                                            
//*                                                                             
//*  FREKVENS:     MED REXX DMRCOBFE                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP02B PROC                                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//DMR     EXEC PGM=MPR00                                                        
//STEPLIB  DD  DSN=F1DAV1.DMR.LOAD,DISP=SHR                                     
//MPOUT    DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//MPAID    DD  DSN=F1DAV1.MPAID,DISP=SHR                                        
//DICT     DD  DSN=W.PROD.INDEX,DISP=SHR                                        
//DICTD    DD  DSN=W.PROD.DATA,DISP=SHR                                         
//DICTS    DD  DSN=W.PROD.DMSOURCE,DISP=SHR                                     
//DICTE    DD  DSN=W.PROD.RECOVER,DISP=SHR                                      
//DICTJ    DD  DSN=W.PROD.LOG,DISP=SHR                                          
//MPIN     DD  DSN=&&TEMP2,DISP=(OLD,DELETE,DELETE)                             
