//*********************************************************************         
//*                                                                   *         
//* PROCEDURE TO RUN DATAMANAGER LOG ARCHIVE AND LOG SWITCH           *         
//*                                                                   *         
//*********************************************************************         
//WDMRARCH PROC USER=W,DICT=PROD,                                               
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ARCHIVE EXEC PGM=MPR00                                                        
//STEPLIB   DD DSN=F1DAV1.DMR.LOAD,DISP=SHR                                     
//MPAID     DD DSN=F1DAV1.MPAID,DISP=SHR                                        
//MPOUT     DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DICT      DD DSN=&USER..&DICT..INDEX,DISP=SHR                                 
//DICTD     DD DSN=&USER..&DICT..DATA,DISP=SHR                                  
//DICTS     DD DSN=&USER..&DICT..DMSOURCE,DISP=SHR                              
//DICTE     DD DSN=&USER..&DICT..RECOVER,DISP=SHR                               
//DICTJ     DD DSN=&USER..&DICT..LOG,DISP=SHR                                   
//DICTG     DD DSN=&USER..&DICT..ARCHLOG(+0),DISP=OLD        OLD LOG IN         
//DICTH     DD DSN=&USER..&DICT..ARCHLOG(+1),               NEW LOG OUT         
//             DISP=(NEW,CATLG,CATLG),                                          
//             MGMTCLAS=&MGMTCLAS,SPACE=(CYL,(5,5),RLSE)                        
//MPIN      DD DSN=&INDRTE..CONSTANT(WDMRARCH),DISP=SHR                         
//          DD DDNAME=SYSIN                                                     
