//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHA PROCEDURER                                                          
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV1                                      
//*                                                                             
//*  ÅTERSTART:    WDMR11    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV1,                                             
//             INDUT=&WDMR..WDMRV1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR11   EXEC PGM=V16459,PARM='WDMR11/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//WDMR11D1 DD  DSN=&INDIN..WDMR06(+0),DISP=SHR                                  
//************ NY PROCEDURFIL                                                   
//*                                                                             
//WDMR11D2 DD  DSN=&INDIN..WDMRO1(+0),DISP=SHR                                  
//************ GAMMAL PROCEDURFIL                                               
//*                                                                             
//SORTFIL  DD  DSN=&&SORT,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPFIL FÖR SORTERING                                            
//             SPACE=(81,(6000,2000),RLSE),AVGREC=U                             
//*                                                                             
//STYRFIL  DD  DSN=&&STYR,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPFIL MED UPPMÄRKTA POSTER                                     
//             SPACE=(81,(6000,2000),RLSE),AVGREC=U                             
//*                                                                             
//WDMR11D5 DD  DSN=&INDUT..WDMR11(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PROCEDURER SOM SKALL UPPDATERAS                                  
//             MGMTCLAS=DEL2,SPACE=(81,(6000,2000),RLSE),AVGREC=U               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
