//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDA DATA MANAGER                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN WDMRV3                                          
//*                                                                             
//*  ÅTERSTART:    DMR       NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP067 PROC INDIN=&WDMR..WDMRV3,                                            
//             INDUT=&WDMR..WDMRV3,                                             
//             DMR=W.PROD,                                                      
//             MPAID=F1DAV1.MPAID,                                              
//             STPLIB=F1DAV1.DMR.LOAD                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//DMR     EXEC PGM=MPR00,REGION=4096K                                           
//STEPLIB   DD DSN=&STPLIB.,DISP=SHR                                            
//MPOUT     DD DSN=&INDUT..WDMR67(+1),DISP=(NEW,CATLG,DELETE), -LIM(04)         
//             MGMTCLAS=&BACKUPC,BLKSIZE=23476,                                 
//             SPACE=(130,(500,500),RLSE),AVGREC=K                              
//SYSUDUMP  DD SYSOUT=*                                                         
//PROD   DD DSN=&DMR..INDEX,DISP=SHR                                            
//PRODD  DD DSN=&DMR..DATA,DISP=SHR                                             
//PRODS  DD DSN=&DMR..DMSOURCE,DISP=SHR                                         
//PRODE  DD DSN=&DMR..RECOVER,DISP=SHR                                          
//PRODJ  DD DSN=&DMR..LOG,DISP=SHR                                              
//MPAID  DD DSN=&MPAID.,DISP=SHR                                                
//MPIN   DD DDNAME=SYSIN                                                        
//SYSIN  DD DSN=&INDRTE..CONSTANT(WDMRLON),DISP=SHR                             
//       DD DSN=&INDIN..WDMR66(+0),DISP=OLD                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
