//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHA PROCEDURER                                                          
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV1                                      
//*                                                                             
//*  ÅTERSTART:    WDMR12    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP012 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV1,                                             
//             INDUT=&WDMR..WDMRV1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR12   EXEC PGM=V16459,PARM='WDMR12/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//WDMR12D1 DD  DSN=&INDIN..WDMR07(+0),DISP=SHR                                  
//************ NY JOBBFIL                                                       
//*                                                                             
//WDMR12D2 DD  DSN=&INDIN..WDMRO2(+0),DISP=SHR                                  
//************ GAMMAL JOBB                                                      
//*                                                                             
//SORTFIL  DD  DSN=&&SORT,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPFIL FÖR SORTERING                                            
//             SPACE=(81,(400,100),RLSE),AVGREC=U                               
//*                                                                             
//STYRFIL  DD  DSN=&&STYR,DISP=(NEW,DELETE,DELETE),                             
//************ TEMPFIL MED UPPMÄRKTA POSTER                                     
//             SPACE=(81,(400,100),RLSE),AVGREC=U                               
//*                                                                             
//WDMR12D5 DD  DSN=&INDUT..WDMR12(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ JOB-STEP SOM SKALL UPPDATERAS                                    
//             MGMTCLAS=DEL2,                                                   
//             SPACE=(81,(400,100),RLSE),AVGREC=U                               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
