//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHA JCL OCH EXD-DATA FRÅN DENNA VECKAN MED                              
//*  FÖRRA VECKANS DATA                                                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN WDMRV2                                          
//*                                                                             
//*  ÅTERSTART:    WDMR43    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP043 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV2,                                             
//             INDUT=&WDMR..WDMRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR43   EXEC PGM=WDMR43                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDMR43D1 DD  DSN=&INDIN..WDMR42(-1),DISP=SHR                                  
//************ FÖRRA VECKANS JOBB-EXEC INFO                                     
//*                                                                             
//WDMR43D2 DD  DSN=&INDIN..WDMR42(+0),DISP=SHR                                  
//************ DENNA VECKANS JOBB-EXEC INFO                                     
//*                                                                             
//WDMR43D3 DD  DSN=&INDIN..WDMR40(-1),DISP=SHR                                  
//************ FÖRRA VECKANS EXPRESS-DELIVERY INFO                              
//*                                                                             
//WDMR43D4 DD  DSN=&INDIN..WDMR40(+0),DISP=SHR                                  
//************ DENNA VECKANS EXPRESS-DELIVERY INFO                              
//*                                                                             
//WDMR43D5 DD  DSN=&INDUT..WDMR43(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ INFO OM ÄNDRADE JOBB (DMR-INPUT)                                 
//             MGMTCLAS=DEL2,SPACE=(23457,(3,100),RLSE)                         
//*                                                                             
//WDMR43D6 DD  DSN=&INDUT..WDMR44(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOMPLETTERAD INFO OM RAPPORTER                                   
//             MGMTCLAS=DEL2,SPACE=(23440,(3,5),RLSE)                           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
