//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FÖDNING AV DATAMANAGER MED INFO OM RAPPORTER I EXD                         
//*                                                                             
//*  FREKVENS:     VECKA    RTN WDMRV2                                          
//*                                                                             
//*  ÅTERSTART:    SORT      NORMAL                                             
//*                WDMR46    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP046 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV2,                                             
//             INDUT=&WDMR..WDMRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WDMRPD46),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WDMR44(+0),DISP=SHR                                  
//************ SENASTE INFO OM RAPPORTER                                        
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WDMR45(+1),DISP=(NEW,PASS,DELETE),   -LIM(3)         
//************ SORTERAD RAPPORT-INFO                                            
//             MGMTCLAS=&BACKUPC,SPACE=(23450,(5,5),RLSE)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR46   EXEC PGM=WDMR46                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDMR46D1 DD  DSN=&INDIN..WDMR45(+0),DISP=SHR                                  
//************ FÖRRA VECKANS SORTERADE RAPPORT-INFO                             
//*                                                                             
//WDMR46D2 DD  DSN=&INDUT..WDMR45(+1),DISP=(OLD,CATLG,DELETE)                   
//************ DENNA VECKANS SORTERADE RAPPORT-INFO                             
//*                                                                             
//WDMR46D3 DD  DSN=&INDUT..WDMR46(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ ÄNDRADE RAPPORTER                                                
//             MGMTCLAS=DEL2,SPACE=(23440,(2,100),RLSE)                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
