//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR DATAMANAGER MED INFO OM ETT PROGRAM                             
//*  SAMT DESS FILER                                                            
//*                                                                             
//*  FREKVENS:     VID KOMPILERING AV ETT PROGRAM                               
//*                                                                             
//*  ÅTERSTART:   NORMAL                                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRPASM PROC                                                                 
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//DMRASMUP EXEC PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                               
//ISPPROF  DD DSN=&&PROF,DISP=(NEW,DELETE),                                     
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),                               
//          SPACE=(6160,(5,,5))                                                 
//SYSHELP  DD DUMMY                                                             
//SYSPROC  DD DSN=W.ISPF.EXEC,DISP=SHR                                          
//         DD DSN=W.ISPF.CLIST,DISP=SHR                                         
//         DD DSN=SYS2.F1TS00.EXEC,DISP=SHR                                     
//         DD DSN=SYS2.F1TS00.CLIST,DISP=SHR                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//ISPPLIB  DD DSN=SYS1.ISP.SISPPENU,DISP=SHR                                    
//ISPTLIB  DD DSN=SYS1.ISP.SISPTENU,DISP=SHR                                    
//ISPSLIB  DD DSN=SYS1.ISP.SISPSLIB,DISP=SHR                                    
//ISPMLIB  DD DSN=SYS1.ISP.SISPMENU,DISP=SHR                                    
//ISPLLIB  DD DSN=SYS1.ISP.SISPLOAD,DISP=SHR                                    
//DD1      DD DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                               
//         SPACE=(6160,(50,10),RLSE),                                           
//         DCB=(LRECL=80,RECFM=FB,BLKSIZE=6160)                                 
//SYSTSIN  DD DDNAME=SYSIN                                                      
//SYSIN    DD DUMMY                                                             
//*                                                                             
//DMR     EXEC PGM=MPR00                                                        
//STEPLIB  DD  DSN=F1DAV1.DMR.LOAD,DISP=SHR                                     
//MPOUT    DD                                                                   
//SYSUDUMP DD  SYSOUT=*                                                         
//MPAID    DD  DSN=F1DAV1.MPAID,DISP=SHR                                        
//DICT     DD  DSN=W.PROD.INDEX,DISP=SHR                                        
//DICTD    DD  DSN=W.PROD.DATA,DISP=SHR                                         
//DICTS    DD  DSN=W.PROD.DMSOURCE,DISP=SHR                                     
//DICTE    DD  DSN=W.PROD.RECOVER,DISP=SHR                                      
//DICTJ    DD  DSN=W.PROD.LOG,DISP=SHR                                          
//MPIN     DD  DSN=&&TEMP1,DISP=(OLD,DELETE,DELETE)                             
