//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  MATCHA LADDMODULER                                                         
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV5                                      
//*                                                                             
//*  ÅTERSTART:    WDMR33    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP033 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV5,                                             
//             INDUT=&WDMR..WDMRV5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR33   EXEC PGM=V16459,PARM='WDMR33/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//IGZSRTCD DD  DUMMY                                                            
//WDMR33D1 DD  DSN=&INDIN..WDMR32(+0),DISP=SHR                                  
//************ NY LADDMODULSFIL                                                 
//*                                                                             
//WDMR33D2 DD  DSN=&INDIN..WDMR31(+0),DISP=SHR                                  
//************ GAMMAL LADDMODULSFIL                                             
//*                                                                             
//WDMR33D3 DD  DSN=&INDUT..WDMR33(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ LADDMODULER SOM SKALL UPPDATERAS                                 
//             MGMTCLAS=&DEL2BKPC,SPACE=(21,(6000,2000),RLSE),AVGREC=U          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
