//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LADDA DATA MANAGER                                                         
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV1                                      
//*                                                                             
//*  ÅTERSTART:    WDMR19    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP019 PROC INDIN=&WDMR..WDMRV1,                                            
//             INDUT=&WDMR..WDMRV1,                                             
//             DMR=W.PROD,                                                      
//             MPAID=F1DAV1.MPAID,                                              
//             STPLIB=F1DAV1.DMR.LOAD                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR19  EXEC PGM=MPR00,REGION=4096K                                           
//STEPLIB   DD DSN=&STPLIB.,DISP=SHR                                            
//MPOUT     DD DSN=&INDUT..WDMR19(+1),                         -LIM(04)         
//             DISP=(NEW,CATLG,DELETE),                                         
//             MGMTCLAS=DEL2,BLKSIZE=23476,                                     
//             SPACE=(130,(500,500),RLSE),AVGREC=K                              
//SYSUDUMP  DD SYSOUT=*                                                         
//PROD   DD DSN=&DMR..INDEX,DISP=SHR                                            
//PRODD  DD DSN=&DMR..DATA,DISP=SHR                                             
//PRODS  DD DSN=&DMR..DMSOURCE,DISP=SHR                                         
//PRODE  DD DSN=&DMR..RECOVER,DISP=SHR                                          
//PRODJ  DD DSN=&DMR..LOG,DISP=SHR                                              
//MPAID  DD DSN=&MPAID.,DISP=SHR                                                
//MPIN   DD DDNAME=SYSIN                                                        
//SYSIN  DD DSN=&INDRTE..CONSTANT(WDMRLON),DISP=SHR                             
//       DD DSN=&INDIN..WDMR1F(+0),DISP=SHR                                     
//       DD DSN=&INDIN..WDMR1G(+0),DISP=SHR                                     
//       DD DSN=&INDIN..WDMR1H(+0),DISP=SHR                                     
//       DD DSN=&INDIN..WDMR1I(+0),DISP=SHR                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
