//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERA FÖRRA VECKANS FILER FÖR ATT SENARE                                 
//*  KUNNA ANVÄNDA DEM FÖR MATCHNING MOT DENNA VECKAS FILER                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV1                                      
//*                                                                             
//*  ÅTERSTART:    WDMR101   KATALOGISERAR FIL                                  
//*                WDMR102   KATALOGISERAR FIL                                  
//*                WDMR103   KATALOGISERAR FIL                                  
//*                WDMR104   KATALOGISERAR FIL                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP010 PROC INDIN=&WDMR..WDMRV1,                                            
//             INDUT=&WDMR..WDMRV1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR101  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WDMR06(+0),DISP=SHR                                  
//************ FÖRRA VECKANS PROCEDUR FIL                                       
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WDMRO1(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOPIA AV FÖRRA VECKANS PROCEDUR FIL                              
//             MGMTCLAS=NOBACKUP,SPACE=(80,(6000,1000),RLSE),AVGREC=U           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR102  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WDMR07(+0),DISP=SHR                                  
//************ FÖRRA VECKANS JOB-STEP FIL                                       
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WDMRO2(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOPIA AV FÖRRA VECKANS JOB-STEP FIL                              
//             MGMTCLAS=NOBACKUP,SPACE=(80,(400,100),RLSE),AVGREC=U             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR103  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WDMR08(+0),DISP=SHR                                  
//************ FÖRRA VECKANS PROGRAM FIL                                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WDMRO3(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOPIA AV FÖRRA VECKANS PROGRAM FIL                               
//             MGMTCLAS=NOBACKUP,SPACE=(90,(12000,2000),RLSE),AVGREC=U          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR104  EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WDMR09(+0),DISP=SHR                                  
//************ FÖRRA VECKANS DATASET FIL                                        
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WDMRO4(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOPIA AV FÖRRA VECKANS DATASET FIL                               
//             MGMTCLAS=NOBACKUP,SPACE=(80,(9000,1000),RLSE),AVGREC=U           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
