//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXTRAHERA INFO OM RAPPORTER UR EXPRESS-DELIVERY                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN WDMRV2                                          
//*                                                                             
//*  ÅTERSTART:    WDMR42   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP040 PROC INDUT=&WDMR..WDMRV2                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//RMOGRW  EXEC PGM=RMOGRW                                                       
//SYSPRINT DD SYSOUT=*                                                          
//PRTFILE  DD SYSOUT=*                                                          
//OUTFILE  DD DSN=&INDUT..WDMR40(+1),DISP=(,CATLG,DELETE),                      
//************* EXTRAKT AV RAPPORT-INFO FRÅN EXPRESS-DELIVERY                   
//            DCB=(RECFM=FB,LRECL=58,BLKSIZE=23432),                            
//            SPACE=(TRK,(5,5),RLSE),MGMTCLAS=&BACKUPC                          
//SYSIN    DD DSN=&INDRTE..CONSTANT(WDMRPD40),DISP=SHR                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
