//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERAR DATAMANAGER MED INFO OM ETT PROGRAM                             
//*  SAMT DESS FILER                                                            
//*                                                                             
//*  FREKVENS:     VID KOMPILERING AV ETT PROGRAM                               
//*                                                                             
//*  ÅTERSTART:    WDMR20    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP020 PROC STPLIB=&INDRTE..LOAD,                                           
//             CMDLIB=W.ISPF.EXEC,                                              
//             PGMLIB=W.DUMMY.PDS,                                              
//             MEMBER=DUMMY,STATUS=,USER=                                       
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR20   EXEC PGM=WDMR20                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDMR20D1 DD  DSN=&PGMLIB.(&MEMBER),DISP=SHR                                   
//************ PROGRAM SOM SKA UNDERSÖKAS                                       
//*                                                                             
//WDMR20D2 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ DATA OM PROGRAMMET                                               
//             SPACE=(23424,(5,7),RLSE)                                         
//*                                                                             
//DMRCOBUP EXEC PGM=IKJEFT01,DYNAMNBR=20,                                       
//         PARM='ISPSTART CMD(%DMRCOBUP &PGMLIB &MEMBER &USER &STATUS)'         
//ISPPROF  DD  DSN=&&PROF,DISP=(NEW,DELETE),                                    
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),                            
//             SPACE=(6160,(5,,5))                                              
//SYSHELP  DD  DUMMY                                                            
//SYSPROC  DD  DSN=&CMDLIB,DISP=SHR                                             
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//ISPPLIB  DD  DSN=SYS1.ISP.SISPPENU,DISP=SHR                                   
//ISPTLIB  DD  DSN=SYS1.ISP.SISPTENU,DISP=SHR                                   
//ISPSLIB  DD  DSN=SYS1.ISP.SISPSLIB,DISP=SHR                                   
//ISPMLIB  DD  DSN=SYS1.ISP.SISPMENU,DISP=SHR                                   
//ISPLLIB  DD  DSN=SYS1.ISP.SISPLOAD,DISP=SHR                                   
//DD1      DD  DSN=&&TEMP1,DISP=(OLD,DELETE,DELETE)                             
//DD2      DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB,BLKSIZE=6160)                             
//SYSTSIN  DD  DUMMY                                                            
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//DMR     EXEC PGM=MPR00                                                        
//STEPLIB  DD  DSN=F1DAV1.DMR.LOAD,DISP=SHR                                     
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//MPOUT    DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=*                                                         
//MPAID    DD  DSN=F1DAV1.MPAID,DISP=SHR                                        
//DICT     DD  DSN=&INDGRND..INDEX,DISP=SHR                                     
//DICTD    DD  DSN=&INDGRND..DATA,DISP=SHR                                      
//DICTS    DD  DSN=&INDGRND..DMSOURCE,DISP=SHR                                  
//DICTE    DD  DSN=&INDGRND..RECOVER,DISP=SHR                                   
//DICTJ    DD  DSN=&INDGRND..LOG,DISP=SHR                                       
//MPIN     DD  DSN=&&TEMP2,DISP=(OLD,DELETE,DELETE)                             
