//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  UPPDATERING AV DATAMANAGER MED MODUL-INFORMATION                           
//*  EXTRAHERA DATA OM ALLA COBOLPROGAM                                         
//*                                                                             
//*  FREKVENS:     VECKA                                                        
//*                                                                             
//*  ÅTERSTART:    WDMR22    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP022 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV6,                                             
//             INDUT=&WDMR..WDMRV6                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR22   EXEC PGM=WDMR22                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//WDMR22D1 DD  DSN=&INDIN..WDMR21(+0),DISP=SHR                                  
//************ COBOL-SOURCE                                                     
//*                                                                             
//WDMR22D2 DD  DSN=&INDUT..WDMR22(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ EXTRAHERAD MODUL-INFO                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
