//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SUGER UT INFORMATION FRÅN DBD-MEDLEMMAR FÖR ATT                            
//*  FÖDA DATAMANAGER.                                                          
//*                                                                             
//*  FREKVENS:     VECKA    RTN WDMRV4                                          
//*                                                                             
//*  ÅTERSTART:    WDMR72    NORMAL                                             
//*                OBSERVERA ATT INFILEN DELETAS OM NORMAL AVSLUTNING           
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP072 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WDMR..WDMRV4,                                             
//             INDUT=&WDMR..WDMRV4                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR72   EXEC PGM=WDMR72                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//WDMR72D1 DD  DSN=&INDIN..WDMR71(+0),DISP=SHR                                  
//************ ALLA MEDLEMMAR I W.PROD.DBD                                      
//*                                                                             
//WDMR72D2 DD  DSN=&INDUT..WDMR72(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ UTSUGEN INFO FRÅN DBD-MEDLEMMAR MED LOG.DBD                      
//             MGMTCLAS=&BACKUPC,SPACE=(23472,(6,2),RLSE)                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
