//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERA FÖRRA VECKANS FILER FÖR ATT SENARE                                 
//*  KUNNA ANVÄNDA DEM FÖR MATCHNING MOT DENNA VECKAS FILER                     
//*                                                                             
//*  FREKVENS:     BESTÄLLES    RTN WDMRV5                                      
//*                                                                             
//*  ÅTERSTART:    WDMR31    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMRP031 PROC INDIN=&WDMR..WDMRV5,                                            
//             INDUT=&WDMR..WDMRV5                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WDMR31   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WDMR32(+0),DISP=SHR                                  
//************ FÖRRA VECKANS LADDMODULSFIL                                      
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WDMR31(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ KOPIA AV FÖRRA VECKANS LADDMODULSFIL                             
//             MGMTCLAS=DEL2,SPACE=(80,(6000,1000),RLSE),AVGREC=U               
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
