//WDN2V    DD   DSN=&INDBAS..WDN2V,DISP=SHR                                     
//WDN2AK   DD   DSN=&INDBAS..WDN2AK,DISP=SHR                                    
