//WDN7V    DD   DSN=&INDBAS..WDN7V,DISP=SHR                                     
//WDN7AK   DD   DSN=&INDBAS..WDN7AK,DISP=SHR                                    
