//WDP3V    DD  DSN=&INDBAS..WDP3V,DISP=SHR                                      
//WDP3AK   DD  DSN=&INDBAS..WDP3AK,DISP=SHR                                     
//WDP3BK   DD  DSN=&INDBAS..WDP3BK,DISP=SHR                                     
//WDP3CK   DD  DSN=&INDBAS..WDP3CK,DISP=SHR                                     
