//WDP4V    DD  DSN=&INDBAS..WDP4V,DISP=SHR                                      
//WDP4AK   DD  DSN=&INDBAS..WDP4AK,DISP=SHR                                     
