//WDP5V    DD   DSN=&INDBAS..WDP5V,DISP=SHR                                     
//WDP5AK   DD   DSN=&INDBAS..WDP5AK,DISP=SHR                                    
