//WDP8V    DD   DSN=&INDBAS..WDP8V,DISP=SHR                                     
//WDP8AK   DD   DSN=&INDBAS..WDP8AK,DISP=SHR                                    
