//WDQ2V    DD  DSN=&INDBAS..WDQ2V,DISP=SHR                                      
//WDQ2BK   DD  DSN=&INDBAS..WDQ2BK,DISP=SHR                                     
//WDQ2CK   DD  DSN=&INDBAS..WDQ2CK,DISP=SHR                                     
//WDQ2DK   DD  DSN=&INDBAS..WDQ2DK,DISP=SHR                                     
//WDQ2EK   DD  DSN=&INDBAS..WDQ2EK,DISP=SHR                                     
//WDQ2FK   DD  DSN=&INDBAS..WDQ2FK,DISP=SHR                                     
