//WDQ3K    DD  DSN=&INDBAS..WDQ3K,DISP=SHR                                      
//WDQ3AK   DD  DSN=&INDBAS..WDQ3AK,DISP=SHR                                     
//WDQ3BK   DD  DSN=&INDBAS..WDQ3BK,DISP=SHR                                     
//WDQ3CK   DD  DSN=&INDBAS..WDQ3CK,DISP=SHR                                     
//WDQ3DK   DD  DSN=&INDBAS..WDQ3DK,DISP=SHR                                     
//WDQ3EK   DD  DSN=&INDBAS..WDQ3EK,DISP=SHR                                     
//WDQ3FK   DD  DSN=&INDBAS..WDQ3FK,DISP=SHR                                     
//WDQ3GK   DD  DSN=&INDBAS..WDQ3GK,DISP=SHR                                     
//WDQ3HK   DD  DSN=&INDBAS..WDQ3HK,DISP=SHR                                     
//WDQ3IK   DD  DSN=&INDBAS..WDQ3IK,DISP=SHR                                     
//WDQ3JK   DD  DSN=&INDBAS..WDQ3JK,DISP=SHR                                     
//WDQ3KK   DD  DSN=&INDBAS..WDQ3KK,DISP=SHR                                     
