//WDQ4K    DD   DSN=&INDBAS..WDQ4K,DISP=SHR                                     
//WDQ4AK   DD   DSN=&INDBAS..WDQ4AK,DISP=SHR                                    
//WDQ4BK   DD   DSN=&INDBAS..WDQ4BK,DISP=SHR                                    
//WDQ4CK   DD   DSN=&INDBAS..WDQ4CK,DISP=SHR                                    
