//WDQ5K    DD   DSN=&INDBAS..WDQ5K,DISP=SHR                                     
//WDQ5AK   DD   DSN=&INDBAS..WDQ5AK,DISP=SHR                                    
