//WDSGEN PROC DSIN=,DSOUT=NULLFILE,DISPOUT=CATLG,                               
//             BZOUT=,MGMTCLAS=DEL2                                             
//********************************************************************          
//*                                                                  *          
//*  NAME        : WDSGEN                                            *          
//*                                                                  *          
//*  FUNCTION    : THIS PROCEDURE IS USED TO LIST, COPY AND COPY OR  *          
//*                MODIFY DATASETS WITH SEQUENTIAL ORGANIZATION.     *          
//*                THE FUNCTIONS CAN BE PERFORMED ON THE COMPLETE    *          
//*                INPUT DATASET OR ONLY ON REQUESTED PARTS OF IT.   *          
//*                                                                  *          
//*  SYMBOLIC    : &DSIN     - INPUT DATASET                         *          
//*    PARMS       &DSOUT    - OUTPUT DATASET                        *          
//*                &DISPOUT  - SECOND DISP-PARAMETER OF OUTPUT,      *          
//*                            DEFAULT = CATLG                       *          
//*                &BZOUT    - BLKSIZE FOR OUTPUT IF NOT = INPUT     *          
//*                &MGMTCLAS - DEFAULT = DEL2                        *          
//*                                                                             
//*  NOTE        :                                                   *          
//*                                                                  *          
//*  CLASS       : A                                                 *          
//*                                                                  *          
//*  USERS       : ALL DEPT                                          *          
//*                                                                  *          
//*  RESPONSIBLE : VOLVO DATA DEPT 2830                              *          
//********************************************************************          
//GEN    EXEC  PGM=V16284,PARM=&BZOUT                                           
//V16284D1 DD  SYSOUT=*                                                         
//V16284D2 DD  DDNAME=SYSIN                                                     
//V16284D3 DD  DSN=&DSIN,DISP=SHR                                               
//V16284D4 DD  DSN=&DSOUT,DISP=(NEW,&DISPOUT,DELETE),                           
//             SPACE=(TRK,(10,10),RLSE),                                        
//             MGMTCLAS=&MGMTCLAS                                               
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=F1ST00.CONSTANT(V16284),DISP=SHR                             
