//WDT2V    DD   DSN=&INDBAS..WDT2V,DISP=SHR                                     
//WDT2AK   DD   DSN=&INDBAS..WDT2AK,DISP=SHR                                    
//WDT2BK   DD   DSN=&INDBAS..WDT2BK,DISP=SHR                                    
//WDT2CK   DD   DSN=&INDBAS..WDT2CK,DISP=SHR                                    
