//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISTRIBUTION FILE FOR FINANCIAL CUSTOMERS                                  
//*                                                                             
//*  FREKVENS:     DAY      RTN WF10D1                                          
//*                                                                             
//*  ÅTERSTART:    WF1012   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF1012   PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WF10..WF10D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//*                                                                             
//WF1012D1 DD  DSN=&&WF1018,DISP=(NEW,PASS,DELETE),                             
//************ DISTRIBUTION FILE FOR FINANCIAL CUSTOMERS                        
//             SPACE=(478,(50,10),RLSE),AVGREC=K                                
//*                                                                             
//*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *        
//WF1012S EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&&WF1018,DISP=(OLD,DELETE,DELETE)                            
//************** TEMP FILE WITH CUSTOMER DATA                       ***         
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WF1018(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************** OUTPUT FILE WITH SORTED CUSTOMER DATA              ***         
//             SPACE=(478,(50,10),RLSE),AVGREC=K,                               
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WF10PD12),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
