//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT WITH FREIGHT COST,INSURANCE COST,PACKING & HANDLING COST            
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN WF10M2                                       
//*                                                                             
//*  RESTART:      WF1052    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF10P052 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//             INDIN=&WF10..WF10M2,                                             
//             INDUT=&WF10..WF10M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF1052   EXEC PGM=V16459,PARM='WF1052/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//WF1052D1 DD  DSN=&INDIN..WF1051(+0),DISP=SHR                                  
//************ RECORDS FROM T01DHEA_ARC AND T01DLIN_ARC                         
//*                                                                             
//WF1052D2 DD  DSN=&INDUT..WF1052(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ REPORT WITH SAFT POLAND                                          
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
