//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SALES REPORT FOR NON VCCS                                                  
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN WF10M2                                       
//*                                                                             
//*  RESTART:      WF1091    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF10P091 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//             INDUT=&WF10..WF10M2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO      EXEC PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                               
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WF1091D1 DD  DSN=&INDUT..WF1091(+1),DISP=(NEW,CATLG,DELETE),                  
//************ REPORT WITH NON VCCS DATA                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
