//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  REPORT FROM TO1DLIN_ARC & T01DHEA_ARC                                      
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN WF10M1                                       
//*                                                                             
//*  RESTART:      WF1047    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF10P047 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//             INDIN=&WF10..WF10M1,                                             
//             INDUT=&WF10..WF10M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF1047   EXEC PGM=V16459,PARM='WF1047/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//WF1047D1 DD  DSN=&INDIN..WF1046(+0),DISP=SHR                                  
//************ RECORDS FROM T01DHEA_ARC AND T01DLIN_ARC                         
//*                                                                             
//WF1047D2 DD  DSN=&INDUT..WF1047(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SCRAP REPORT FOR CHINA INDIA KOREA USA                           
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
