//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SW DOWNLOAD REPORT FOR RUSSIA                                              
//*                                                                             
//*  FREQUENCE:    MONTHLY     RTN WF10M1                                       
//*                                                                             
//*  RESTART:      WF1064    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF10P064 PROC STPLIB=&INDRTE..LOAD, -- PERHAPS REMOVE COMMA                   
//             INDIN=&WF10..WF10M1,                                             
//             INDUT=&WF10..WF10M1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF1064   EXEC PGM=V16459,PARM='WF1064/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//EZTVFM   DD  DATACLAS=PSEN                                                    
//SORTMSG  DD  SYSOUT=*                                                         
//WF1064D1 DD  DSN=&INDIN..WF1063(+0),DISP=SHR                                  
//************ SW DOWNLOAD DATA FOR RUSSIA                                      
//*                                                                             
//WF1064D2 DD  DSN=&INDUT..WF1064(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ SW DOWNLOAD REPORT FOR RUSSIA                                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
