//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES DISTRIBUTION FILE FOR VAT                                          
//*                                                                             
//*  FREKVENS:     DAY      RTN WF10D1                                          
//*                                                                             
//*  ÅTERSTART:    WF1011   NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF1011   PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WF10..WF10D1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//OSDAT    DD  DSN=&INDRTE..DATUM(+0),DISP=SHR              -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//*                                                                             
//WF1011D1 DD  DSN=&&WF1017,DISP=(NEW,PASS,DELETE),                             
//************ DISTRIBUTION FILE FOR VAT                                        
//             MGMTCLAS=&BACKUPC,SPACE=(87,(10,2),RLSE),AVGREC=K                
//*                                                                             
//*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *        
//WF1011S EXEC PGM=SORT                                                         
//SORTIN   DD  DSN=&&WF1017,DISP=(OLD,DELETE,DELETE)                            
//************** TEMP FILE WITH VAT DATA                            ***         
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WF1017(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************** OUTPUT FILE WITH SORTED VAT DATA                   ***         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WF10PD11),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
