//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES ACCOUNTS RECEIVABLE DATA FILE                                      
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN WF20S2                           
//*                                                                             
//*  RESTART:      WF2016    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF2016   PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WF20..WF20S2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//WF2016D1 DD  DSN=&INDUT..WF2016(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ DOCUMENT DATA FILE                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//WF2016D2 DD  DSN=&INDUT..WF2026(+1),DISP=(NEW,CATLG,DELETE), -LIM(10)         
//************ DOCUMENT DATA FILE                                               
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
