//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FUNKTION:    KOMPLETTERAR DOKUMENTHUVUD                                    
//*                                                                             
//*  FREKVENS:    PÅ BEGÄRAN  RTN WF20S2                                        
//*                                                                             
//*  ÅTERSTART:   WF2004      NORMAL                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF2004   PROC STPLIB=&INDRTE..LOAD                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//TSO    EXEC  PGM=IKJEFT01,DYNAMNBR=20,PARM=' '                                
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=SYS1.F1D200.DSNLOAD,DISP=SHR                                 
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND    EXEC PGM=ABEND,PARM='1234567890123456',                              
//             COND=(4,GE,TSO)                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
