//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISTRIBUTES FILE WITH FINACIAL INFO TO D-A-P                               
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN WF21S1                           
//*                                                                             
//*  RESTART:      WF2111    NORMAL  (BMP)                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF21P011 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WF20..WF21S1,                                             
//             INDUT=&WF21..WF21S1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF2111   EXEC PGM=WF2111                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//************ DOCUMENT DATA FILE                                               
//WF2111D1 DD  DSN=&INDIN..WF2011,DISP=SHR                                      
//         DD  DSN=&INDIN..WF2031A,DISP=SHR                                     
//*                                                                             
//WF2111D2 DD  DSN=&INDUT..WF2111(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DOCUMENT DATA FILE - TO SEND TO D&P                              
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
