//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  DISTRIBUTES FILE WITH DOCUMENT DATA TO D-A-P                               
//*                                                                             
//*  FREQUENCE:    SEVERAL TIMES A DAY     RTN WF21S1                           
//*                                                                             
//*  RESTART:      WF2101    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF21P001 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WF20..WF21S1,                                             
//             INDUT=&WF21..WF21S1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WF2101   EXEC PGM=WF2101                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WF2101D1 DD  DSN=&INDIN..WF2011,DISP=SHR                                      
//************ DOCUMENT DATA FILE                                               
//*                                                                             
//WF2101D2 DD  DSN=&INDUT..WF2101(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)          
//************ DOCUMENT DATA FILE TO D&P                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
//*                                                                             
