//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  TCP/IP FILE TRANSFER                                             *         
//*  TRANSLATION FROM/TO ISO-LATIN1 AND SWEDISH EBCDIC IS DONE        *         
//*  BY DEFAULT.                                                      *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WFTP    PROC OPENCMD=DUMMY,FTPCMD=DUMMY,MAXRC=4,                              
//             TRANSL=ISOESW                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//FTP     EXEC PGM=FTP,PARM='(EXIT TRANSLATE &TRANSL'                           
//SYSTCPD  DD  DSN=F1TI00.TCPIP.DATA(TCPDATA),DISP=SHR                          
//SYSPRINT DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//INPUT    DD  DDNAME=OPENCMD                                                   
//         DD  DDNAME=FTPCMD                                                    
//OPENCMD  DD  DSN=&INDRTE..CONSTANT(&OPENCMD),DISP=SHR                         
//FTPCMD   DD  DSN=&INDRTE..CONSTANT(&FTPCMD),DISP=SHR                          
//OUTPUT   DD  SYSOUT=*                                                         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND   EXEC PGM=ABEND,COND=(&MAXRC,GE,FTP),PARM='1234567890123456'           
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
