//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*      BACKOUT-PROCEDURE FÖR RS-DATABASER                                     
//*      OLD OM MAN VILL STYRA SJÄLV                                            
//*      ÅTERSTART:  IMS-TEKNIK                                                 
//*      OBS.        OM PGMLOG EJ GÅR ATT LÄSA OCH/ELLER                        
//*                  RETUR-CODE EJ ÄR LIKA MED NOLL                             
//*                                                                             
//*                                                                             
//*                              RING VCAS JOURANSVARIG                         
//*                                                                             
//*                                            ANSV. AVD. IMS-TEKNIK            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WG01BACK PROC PSB=SAKNAS,DBRC=Y,                                              
//             DSIN=SAKNAS                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//MAXRGN  EXEC PGM=DFSRRC00,REGION=0M,                                          
//             PARM='&DBB,DFSBBO00,&PSB,,,,,,,,,,,&DBRC'                        
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(BUFFLAES),DISP=SHR                         
//IMSLOGR  DD  DSN=&DSIN,DISP=SHR,DCB=BUFNO=5                                   
//IMSLOG01 DD  DSN=&DSIN1,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG02 DD  DSN=&DSIN2,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG03 DD  DSN=&DSIN3,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG04 DD  DSN=&DSIN4,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG05 DD  DSN=&DSIN5,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG06 DD  DSN=&DSIN6,DISP=SHR,DCB=BUFNO=5                                  
//IMSLOG07 DD  DSN=&DSIN7,DISP=SHR,DCB=BUFNO=5                                  
//IEFRDER  DD  DSN=&WG01..BACKOUT(+1),DISP=(NEW,CATLG,CATLG),                   
//             SPACE=(TRK,(2000,800),RLSE),                                     
//             DCB=(RECFM=VB,LRECL=6229,BLKSIZE=27998,BUFNO=5),                 
//             MGMTCLAS=&EMID70                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,EQ,MAXRGN),PARM='1234567890123456'             
