//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*        SECONDARY-INDEX-PROCEDURE FÖR PARTS PROD-DATABASER                   
//*        ANVÄNDER BMC-UTILITY SECONDARY INDEX UTILITY/EP                      
//*        ÅTERSTART: IMS-TEKNIK                                                
//*                                                                             
//*        EXEMPEL PÅ DD-KORT SOM SKALL LÄGGAS TILL                             
//*                                                                             
//*        //DFSURWF1 DD  DSN=&&DFSURWF1,DISP=(NEW,PASS,DELETE),                
//*        //WDX1AK   DD  DSN=&INDBAS..WDX1AK,DISP=SHR                          
//*        //PLUSIN   DD  *                                                     
//*                                            ANSV. AVD. IMS-TEKNIK            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WG01SIU PROC                                                                  
//*                                                                             
//SIU     EXEC PGM=IDIDBO                                                       
//STEPLIB  DD  DSN=F1IM00.IMSTOOL.CIMTLOAD,DISP=SHR                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//*        DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDGRND..DBDLIB,DISP=SHR                                    
//DBOMSGS  DD  SYSOUT=*                                                         
//DBORPTS  DD  SYSOUT=*                                                         
//IDIPARM  DD  DISP=SHR,DSN=F1IM00.IMSTOOL.PARMLIB                              
//DBDLIB   DD  DISP=SHR,DSN=&INDGRND..DBDLIB                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//ABEND   EXEC PGM=ABEND,COND=(4,GE,SIU),PARM='1234567890123456'                
