//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*      PROCEDURE FÖR ATT SKAPA CHANGE ACCUMULATION-JCL                        
//*      VIA DBRC FÖR PRODDATABASER                                             
//*                                                                             
//*      ÅTERSTART:  GÖRS AV IMS-ANSVARIG                                       
//*                                                                             
//*                                            ANSV. AVD. IMS-TEKNIK            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WG01ACCL PROC                                                                 
//*                                                                             
//DBRC    EXEC PGM=DSPURX00                                                     
//STEPLIB  DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//SYSPRINT DD  SYSOUT=*                                                         
//JCLPDS   DD  DSN=&INDGRND..DBRCJCL,DISP=SHR                                   
//JCLOUT   DD  SYSOUT=(A,INTRDR)                                                
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(8,GT),PARM='1234567890123456'                    
