//* * *** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*        UNLOAD-PROCEDURE FÖR PARTS PROD-DATABASER                            
//*        ANVÄNDER BMC-UTILITY UNLOAD PLUS/EP                                  
//*        ÅTERSTART: IMS-TEKNIK                                                
//*                                                                             
//*        EXEMPEL PÅ DD-KORT SOM SKALL LÄGGAS TILL                             
//*                                                                             
//*        //UNL.DFSURGU1 DD  DSN=&WG01..UNLO.WDX1V,                            
//*        //             DISP=(NEW,CATLG,DELETE),                              
//*        //             DCB=(BLKSIZE=27998,BUFNO=5),                          
//*        //             SPACE=(4096,(1800,180),RLSE),                         
//*        //             MGMTCLAS=NOBACKUP                                     
//*        //UNL.WDX1V    DD  DSN=&INDBAS..WDX1V,DISP=SHR                       
//*        //UNL.PLUSIN   DD  *                                                 
//*                                                                             
//*                                            ANSV. AVD. IMS-TEKNIK            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WG01UNL  PROC DBD=MISSING,                                                    
//         STPLIB=&INDRTE..LOAD                                                 
//*                                                                             
// EXPORT SYMLIST=*                                                             
// SET DBD=&DBD                                                                 
//*                                                                             
//UNL     EXEC PGM=IDIDBO                                                       
//STEPLIB  DD  DSN=F1IM00.IMSTOOL.CIMTLOAD,DISP=SHR                             
//         DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDGRND..DBDLIB,DISP=SHR                                    
//         DD  DSN=&INDGRND..PSBLIB,DISP=SHR                                    
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DBOCTRL  DD  *,SYMBOLS=EXECSYS                                                
* CONVERTED BY CA TECHNOLOGIES 24 FEB 2022 19:44:19                             
                                                                                
  FUNCTION=UNLOAD,                                                              
  DBDNAME=&DBD                                                                  
                                                                                
/*                                                                              
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,GE,UNL),PARM='1234567890123456'                
