//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*        RELOAD-PROCEDURE PROD-DATABASER                                      
//*        ANVÄNDER CA-UTILITY LOADPLUS/EP                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WG01REL PROC DBD=MISSING,DBRC=Y                                               
//*                                                                             
// EXPORT SYMLIST=*                                                             
// SET DBD=&DBD                                                                 
// SET DBRC=&DBRC                                                               
//*                                                                             
//REL     EXEC PGM=IDIDBO                                                       
//STEPLIB  DD  DSN=F1IM00.IMSTOOL.CIMTLOAD,DISP=SHR                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDGRND..DBDLIB,DISP=SHR                                    
//DBOMSGS  DD  SYSOUT=*                                                         
//DBORPTS  DD  SYSOUT=*                                                         
//IDIPARM  DD  DISP=SHR,DSN=F1IM00.IMSTOOL.PARMLIB                              
//DBDLIB   DD  DISP=SHR,DSN=&INDGRND..DBDLIB                                    
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//DFSURWF1 DD  DUMMY,DCB=(BLKSIZE=27998,BUFNO=5)                                
//DBOCTRL  DD  *,SYMBOLS=EXECSYS                                                
* CONVERTED BY CA TECHNOLOGIES 24 FEB 2022 19:44:19                             
                                                                                
  FUNCTION=RELOAD,                                                              
  DBDNAME=&DBD,                                                                 
  DBRC=&DBRC                                                                    
                                                                                
/*                                                                              
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,EQ,REL),PARM='1234567890123456'                
