//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     GENERELL PROCEDUR FÖR RECOVER                    *         
//*                  AV DB2 TABLESPACE                                *         
//*                                                                   *         
//*    ÅTERSTART:    RESTART AV UTILITY ELLER                         *         
//*                  TERMINATE UTILITY OCH NORMAL ÅTERSTART           *         
//*                                                                   *         
//*    ANSVARIG:     30650                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WG02RECO PROC SYSTEM=&DB2SYS,                                                 
//             UTPROC=,UID=,                                                    
//             TSREC=SAKNAS,                                                    
//             JOBNAME=                                                         
//*                                                                             
//RECO    EXEC PGM=DSNUTILB,                                                    
//             PARM=(&SYSTEM,&UID,&UTPROC)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//UTPRINT  DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SORTWK01 DD  DSN=&&SORTWK01,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(20,20),,,ROUND)                                     
//SORTWK02 DD  DSN=&&SORTWK02,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(20,20),,,ROUND)                                     
//SORTWK03 DD  DSN=&&SORTWK03,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(20,20),,,ROUND)                                     
//SORTWK04 DD  DSN=&&SORTWK04,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(20,20),,,ROUND)                                     
//SORTOUT  DD  DSN=&W..&JOBNAME..SORTOUT,                                       
//*            FOR RESTART PURPOSE OF SORT                                      
//             DISP=(MOD,DELETE,CATLG),                                         
//             SPACE=(16384,(1000,500),,,ROUND),                                
//             MGMTCLAS=&DEL2BKPC                                               
//SYSUT1   DD  DSN=&W..&JOBNAME..SYSUT1,                                        
//             DISP=(MOD,DELETE,CATLG),                                         
//             SPACE=(4000,(20,20),,,ROUND),                                    
//             MGMTCLAS=&DEL2BKPC                                               
//SYSIN    DD  DSN=&INDGRND..DDL(&TSREC),DISP=SHR                               
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(4,GE,RECO),PARM='1234567890123456'               
