//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     GENERELL PROCEDUR FÖR REORG                      *         
//*                  AV DB2 TABLESPACE MED DISCARD                    *         
//*                                                                   *         
//*    ÅTERSTART:    RESTART AV UTILITY ELLER                         *         
//*                  TERMINATE UTILITY OCH NORMAL ÅTERSTART           *         
//*                                                                   *         
//*    ANSVARIG:     30650                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WG02REOR PROC SYSTEM=&DB2SYS,                                                 
//             UTPROC=,UID=,                                                    
//             JOBNAME=                                                         
//*                                                                             
//REOR    EXEC PGM=DSNUTILB,                                                    
//             PARM=(&SYSTEM,&UID,&UTPROC)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//UTPRINT  DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SORTWK01 DD  DSN=&&SORTWK01,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(2000,2000),,,ROUND)                                 
//SORTWK02 DD  DSN=&&SORTWK02,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(2000,2000),,,ROUND)                                 
//SORTWK03 DD  DSN=&&SORTWK03,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(2000,2000),,,ROUND)                                 
//SORTWK04 DD  DSN=&&SORTWK04,                                                  
//             DISP=(NEW,DELETE),                                               
//             SPACE=(4000,(2000,2000),,,ROUND)                                 
//SORTOUT  DD  DSN=&W..&JOBNAME..SORTOUT,                                       
//*             FOR RESTART PURPOSE OF SORT                                     
//             DISP=(MOD,DELETE,CATLG),                                         
//             SPACE=(16384,(20000,9000),,,ROUND),                              
//             MGMTCLAS=&DEL2BKPC,DATACLAS=MVOL                                 
//SYSREC   DD  DSN=&W..&JOBNAME..SYSREC,                                        
//*             UNLOADED RECORDS                                                
//             DISP=(MOD,CATLG),                                                
//             SPACE=(4000,(8000,8000),,,ROUND),                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=MVOL                                 
//SYSUT1   DD  DSN=&W..&JOBNAME..SYSUT1,                                        
//             DISP=(MOD,DELETE,CATLG),                                         
//             SPACE=(4000,(4000,4000),,,ROUND),                                
//             MGMTCLAS=&DEL2BKPC,DATACLAS=MVOL                                 
//SYSCOPY     DD       DSN=&INDRTE..DUMP.S01&DB2T.(+1),                         
//             DISP=(,CATLG,DELETE),                                            
//             SPACE=(TRK,(900,300),RLSE),                                      
//             MGMTCLAS=NOBACKUP,DATACLAS=MVOL                                  
//SYSIN DD DSN=&INDRTE..REOR.S01&DB2T.1,DISP=SHR                                
//      DD DSN=&INDRTE..REOR.DAEXDAT(0),DISP=SHR                                
//      DD DSN=&INDRTE..REOR.S01&DB2T.2,DISP=SHR                                
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(4,GE,REOR),PARM='1234567890123456'               
