//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     GENERELL PROCEDUR FÖR RESTORE                    *         
//*                  AV DB2 TABLESPACE                                *         
//*                                                                   *         
//*    ÅTERSTART:    RESTART AV UTILITY ELLER                         *         
//*                  TERMINATE UTILITY OCH NORMAL ÅTERSTART           *         
//*                                                                   *         
//*    ANSVARIG:     30650                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WG02REST PROC SYSTEM=&DB2SYS,                                                 
//             UID=,UTPROC=,                                                    
//             TSRST=SAKNAS                                                     
//*                                                                             
//REST    EXEC PGM=DSNUTILB,                                                    
//             PARM=(&SYSTEM,&UID,&UTPROC)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//UTPRINT  DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDGRND..DDL(&TSRST),DISP=SHR                               
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,EQ,REST),PARM='1234567890123456'               
