//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*    FUNKTION:     GENERELL PROCEDUR FÖR UNLOAD AV DB2-TABELLER     *         
//*                  MAX 9 TABELLER KAN UNLOADAS SAMTIDIGT            *         
//*                                                                   *         
//*    ÅTERSTART:    NORMAL                                           *         
//*                                                                   *         
//*    ANSVARIG:     36500                                            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WG02UNL  PROC MGMTCLAS=DEL2,PUNCH=NULLFILE,                                   
//             SYSTEM=&DB2SYS,                                                  
//             DSOUT1=NULLFILE,                                                 
//             DSOUT2=NULLFILE,                                                 
//             DSOUT3=NULLFILE,                                                 
//             DSOUT4=NULLFILE,                                                 
//             DSOUT5=NULLFILE,                                                 
//             DSOUT6=NULLFILE,                                                 
//             DSOUT7=NULLFILE,                                                 
//             DSOUT8=NULLFILE,                                                 
//             DSOUT9=NULLFILE                                                  
//*                                                                             
//DB2UNL  EXEC PGM=IKJEFT01,DYNAMNBR=20                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSREC00 DD DSN=&DSOUT1,                                                      
//*           OUTPUT DATASET1 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC01 DD DSN=&DSOUT2,                                                      
//*           OUTPUT DATASET2 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC02 DD DSN=&DSOUT3,                                                      
//*           OUTPUT DATASET3 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC03 DD DSN=&DSOUT4,                                                      
//*           OUTPUT DATASET4 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC04 DD DSN=&DSOUT5,                                                      
//*           OUTPUT DATASET5 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC05 DD DSN=&DSOUT6,                                                      
//*           OUTPUT DATASET6 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC06 DD DSN=&DSOUT7,                                                      
//*           OUTPUT DATASET7 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC07 DD DSN=&DSOUT8,                                                      
//*           OUTPUT DATASET8 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSREC08 DD DSN=&DSOUT9,                                                      
//*           OUTPUT DATASET9 FOR UNLOAD                                        
//            DISP=(NEW,CATLG,DELETE),MGMTCLAS=&MGMTCLAS,                       
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSIN  DD DSN=&INDRTE..DDL(&SYSTEM.UNL),DISP=SHR                            
//SYSPUNCH DD DSN=&PUNCH,                                                       
//*           LOAD-KORT FÖR ÅTERLADDNING I DB2                                  
//            DISP=(NEW,PASS,DELETE),MGMTCLAS=&MGMTCLAS,                        
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),                              
//            SPACE=(800,(1,1),RLSE)                                            
//*                                                                             
//ABEND   EXEC PGM=ABEND,COND=(0,EQ,DB2UNL),PARM='1234567890123456'             
//*                                                                             
