//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  GENERELL PROCEDURE FÖR ATT SKAPA EN FIL FRÅN EN DATABASE                   
//*                                                                             
//*  FREKVENS:     KÖRS VID FIXAR OCH TILLFÄLLIGA JOB                           
//*                                                                             
//*  ÅTERSTART:    NORMAL                                                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WGOHSSR  PROC STPLIB=&INDRTE..LOAD,                                           
//             PSB=SAKNAS,MBR=SAKNAS                                            
//*                                                                             
//WGO      EXEC PGM=FABHX034,                                                   
//             PARM=('DFSRRC00/DLI,&MBR,&PSB,,00')                              
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=F1IM00.DBT.LOAD,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY,DCB=(RECFM=VB,BLKSIZE=1408,BUFNO=1)                        
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//HSSRSTAT DD  SYSOUT=*                                                         
//HSSRSNAP DD  SYSOUT=*                                                         
//HSSROPT  DD  DSN=&INDRTE..CONSTANT(HSSRCABS),DISP=SHR                         
//HSSRCABP DD  DSN=&INDRTE..CONSTANT(HSSRCAB),DISP=SHR                          
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&W..IGRT.FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
