//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      RS FIXKÖRNING      (BMP:ER)                                  *         
//*                                                                   *         
//*      PERIODICITET: SEKUND                                         *         
//*                                                                   *         
//*      LÄSER, SKRIVER UT OCH KASTAR TRANSAR PÅ KÖN                  *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WIMSQDEL PROC IN=,OUT=,CHPTID=,CPU=1,                                         
//             MBR=W01501,PSB=W01501,                                           
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//GO      EXEC PGM=DFSRRC00,                                                    
// PARM=('BMP,&MBR,&PSB,&IN,&OUT,N00,,,&CHPTID,,&CPU,,,&IMS')                   
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//PRINTDD  DD  SYSOUT=*                                                         
