//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*  TEST IF A FILE EXISTS AS INPUT IN THIS ROUTINE                   *         
//*  RC = 0 : FILE(S) EXISTS                                          *         
//*  RC = 8 : NO FILE EXISTS                                          *         
//*                                    MAINTAINED BY DEPT. 36100      *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WINPTST  PROC FILE=,INDEX=&W                                                  
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//CARDGEN EXEC PGM=V12340,                                                      
//         PARM=(' DEFINE GDG(NAME(&INDEX..&FILE) LIMIT(1))',                   
//             '** DELETE &INDEX..&FILE  GDG ')                                 
//V12340D1 DD  DUMMY,DCB=BLKSIZE=80                                             
//V12340D2 DD  DSN=&&CARDS,DISP=(NEW,PASS,DELETE),                              
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=160),                             
//             SPACE=(TRK,1)                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//TEST   EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&&CARDS,DISP=(OLD,DELETE,DELETE)                             
