//********************************************************************          
//* Stored procedure for executing the JZOS Java Batch Launcher                 
//*******************************************************************           
//JVMPRC86 PROC JAVACLS=,                < Fully Qfied Java class..RQD          
//   ARGS=,                              < Args to Java class                   
//*  LIBRARY='<HLQ>.JZOS.LOADLIB',       < STEPLIB FOR JVMLDM module            
//   VERSION='86',                       < JVMLDM version: 86                   
//   LOGLVL='',                          < Debug LVL: +I(info) +T(trc)          
//   REGSIZE='0M',                       < EXECUTION REGION SIZE                
//   LEPARM='',                                                                 
//   MAXRC=0                                                                    
//JAVAJVM  EXEC PGM=JVMLDM&VERSION,REGION=&REGSIZE,                             
//   PARM='&LEPARM/&LOGLVL &JAVACLS &ARGS'                                      
//* STEPLIB  DD DSN=&LIBRARY,DISP=SHR                                           
//SYSPRINT DD SYSOUT=*          < System stdout                                 
//SYSOUT   DD SYSOUT=*          < System stderr                                 
//STDOUT   DD SYSOUT=*          < Java System.out                               
//STDERR   DD SYSOUT=*          < Java System.err                               
//CEEDUMP  DD SYSOUT=*                                                          
//ABNLIGNR DD DUMMY                                                             
//*                                                                             
//*The following DDs can/should be present in the calling JCL                   
//*                                                                             
//*STDIN   DD                   < OPTIONAL - Java System.in                     
//*STDENV  DD                   < REQUIRED - JVM Environment script             
//*MAINARGS DD                  < OPTIONAL - Alt. method to supply args         
//CHECKA   IF  (JAVAJVM.RC > &MAXRC) THEN                                       
//*                                                                             
//PABEND  EXEC PGM=ABEND,PARM='1234567890123456'                                
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//*                                                                             
//CHECKA  ENDIF                                                                 
//*                                                                             
// PEND                                                                         
