//*       -- WMAIIMAP - USED BY PROCEDURE WMAILSND                              
//*       -- MAIL SENDING USING IMAP PROTOCOL.                                  
//*                                                                             
//M       EXEC PGM=MAILXC,COND=&CONDS                                           
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//TCPDATA  INCLUDE MEMBER=FTCPDATA                                              
//APIUSER  DD  DSN=&INDRTE..CONSTANT(&FROM),DISP=SHR                            
//APIFILE  DD  DDNAME=SYSIN                                                     
//SYSIN    DD  DSN=&INDRTE..CONSTANT(&REQS.),DISP=SHR                           
//SEND     DD  DSN=&DSIN.,DISP=SHR                                              
//*                                                                             
