//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  EXECUTE UNIX COMMANDS SPECIFIED VIA SYSIN                                  
//*                                                                             
//*  OPTION: LOGINPUT - COPIES INPUT COMMANDS TO STDOUT                         
//*          NOLOGINPUT - ONLY NORMAL OUTPUT TO STDOUT                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WOPNMVS  PROC OPTION=LOGINPUT                                                 
//*                                                                             
//TSO     EXEC PGM=IKJEFT01,DYNAMNBR=50,PARM='%WOPNMVS &OPTION'                 
//SYSHELP  DD  DUMMY                                                            
//SYSEXEC  DD  DSN=&INDRTE..EXEC,DISP=SHR                                       
//         DD  DSN=&INDLIB2..EXEC,DISP=SHR                                      
//         DD  DSN=&INDLIB3..EXEC,DISP=SHR                                      
//         DD  DSN=&INDGRND..EXEC,DISP=SHR                                      
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//CEEDUMP  DD  SYSOUT=*                         -- LE ABENDS                    
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SYSTSIN  DD  DUMMY                        -- NO TSO COMMANDS THIS WAY         
//SYSTSPRT DD  SYSOUT=*                     -- TSO MESSAGES                     
//SYSPRINT DD  SYSOUT=*,RECFM=FB,LRECL=132  -- REROUTED STDOUT OUTPUT           
//SYSERROR DD  SYSOUT=*,RECFM=FB,LRECL=132  -- REROUTED STDERR MESSAGES         
//WOPNMVSI DD  DSN=&INDRTE..CONSTANT(WOPNMVSI),DISP=SHR                         
//WOPNMVSO DD  DSN=&INDRTE..CONSTANT(WOPNMVSO),DISP=SHR                         
//WOPNMVSE DD  DSN=&INDRTE..CONSTANT(WOPNMVSE),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ABEND   EXEC PGM=ABEND,COND=(4,GE,TSO),PARM='1234567890123456'                
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
