//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  COPY VARIABLE DATA FROM PARM TO A TEMPORARY DATASET              *         
//*  THE DATA MAY CONTAIN DOUBLE ASTERISKS TO CAUSE A NEW OUTPUT RCD  *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WPARM2DS PROC DATA=,DSOUT='&&TEMP'                                            
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//COPY    EXEC PGM=V12340,PARM='&DATA'                                          
//V12340D1 DD  DUMMY,BLKSIZE=80                                                 
//V12340D2 DD  DSN=&DSOUT,DISP=(NEW,PASS,DELETE),                               
//             LRECL=80,RECFM=FB,                                               
//             SPACE=(80,(100,100)),AVGREC=U                                    
