//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*   S O P  - CHANGE CURRENT DATE IN THE SOP DATA BASE               *         
//*            DATE=000000 MEANS CHANGE IT TO CURRENT MACHINE DATE    *         
//*                                                                   *         
//*                                    MAINTAINED BY DEPT. 57051      *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WSOPDAT  PROC STPLIB=&INDRTE..LOAD,DATE=000000,                               
//             SDUMP='(D,,DUMP)',                                               
//             SOPREG=&INDRTE..SOP,                                             
//             PDSLIB=&INDRTE..JCL,                                             
//             PDSTEMP=&INDRTE.TMP.JCL                                          
//W98014  EXEC PGM=W98014,PARM='&DATE'                                          
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSUDUMP DD  SYSOUT=&SDUMP,HOLD=YES                       -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//SOPDD1   DD  DSN=&SOPREG,DISP=SHR            -- SOP DATA BASE                 
//PDSDD1   DD  DSN=&PDSTEMP,DISP=SHR           -- TEMP PDS JOB LIB              
//PDSDD2   DD  DSN=&PDSLIB,DISP=SHR            -- PDS JOB LIB                   
