//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*   S O P  - UPPDATE CURRENT CALENDAR IN SOP DATA BASE              *         
//*            FROM SEQUENTIAL CALENDAR FILE                          *         
//*                                                                   *         
//*                                    MAINTAINED BY DEPT. 36000      *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WSOPCAL2 PROC STPLIB=&INDRTE..LOAD,                                           
//             SDATE=500101,EDATE=491231,                                       
//             SOPCAL=,                                                         
//             SOPREG=&INDRTE..SOP                                              
//W98012  EXEC PGM=W98012,PARM='&SDATE&EDATE'                                   
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSUDUMP DD  SYSOUT=*                                     -- ABEND            
//W98012D1 DD  DSN=&SOPCAL.(+0),                        -- SOP CALENDAR         
//             DISP=SHR               -- SOP CALENDAR                           
//SOPDD1   DD  DSN=&SOPREG,                                                     
//             DISP=SHR                    -- SOP DATA BASE                     
