//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  S O P - UPDATE SOP DATA BASE WITH INFO FROM INSTALLATION FILES   *         
//*          THE INPUT TO DMR SHOULD BE ONE OR MORE KEEP COMMANDS,    *         
//*          PARAMETER MTYP SPECIFIES THE LOWEST TYPE OF DMR MEMBER   *         
//*          THAT SHOULD BE ENTERED IN THE DATA BASE.                 *         
//*          VALID MEMBER TYPES ARE SYSTEM, ROUTINE OR JOB            *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WSOPDMRP PROC SOPREG=,INDINS=&W,INSGRP=INSXXXXX,                              
//             STPLIB=&INDRTE..LOAD,                                            
//             MTYP=JOB                                                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//W98030  EXEC PGM=W98030,                                                      
//             PARM='&MTYP'                                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//*                                                                             
//W98030D1 DD  DSN=&SOPREG,DISP=SHR                                             
//************** SOP DATABASE                                                   
//*                                                                             
//W98030D2 DD  DSN=&INDINS..&INSGRP..SOP,DISP=SHR INSTALLATION                  
//************** INSTALLATION FILES                                             
//*                                                                             
//W98030D3 DD  SYSOUT=*,                                                        
//************** LOG AND ERROR LIST                                             
//             DCB=(LRECL=121,RECFM=FBA,BLKSIZE=121)                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//     IF W98030.RC >= 8 THEN                                                   
//ABEND   EXEC PGM=ABEND,PARM='1234567890123456'                                
//     ENDIF                                                                    
