//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  S O P - EXTRACT SOP INFORMATION FROM DATA DICTIONARY AND SAVE    *         
//*          IT IN A SOPLIB SOURCE LIBRARY, FROM WHICH IT CAN LATER   *         
//*          BE IMPORTED TO ENDEVOR AS AN ELEMENT OF TYPE SOP         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WSOPNDVR PROC INDDICT=&INDGRND,INDLIB=&INDRTE,VN=&VX                          
//*                                                                             
//DMR     EXEC PGM=MPR00                                                        
//STEPLIB  DD  DSN=F1DA&VN..DMR.LOAD,DISP=SHR                                   
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//MPOUT    DD  SYSOUT=*                                                         
//MPAID    DD  DSN=F1DA&VN..MPAID,DISP=SHR                                      
//DICT     DD  DSN=&INDDICT..INDEX,DISP=SHR                                     
//DICTD    DD  DSN=&INDDICT..DATA,DISP=SHR                                      
//DICTS    DD  DSN=&INDDICT..DMSOURCE,DISP=SHR                                  
//DICTE    DD  DSN=&INDDICT..RECOVER,DISP=SHR                                   
//DICTJ    DD  DSN=&INDDICT..LOG,DISP=SHR                                       
//MPIN     DD  DDNAME=SYSIN                                                     
//         DD  DSN=&INDRTE..CONSTANT(WSOPDMR),DISP=SHR                          
//*                                                                             
//MAILDD   DD  DSN=&&TEMP,                                                      
//************* INFO FROM DICTIONARY                                            
//             DISP=(NEW,PASS,DELETE),                                          
//             SPACE=(CYL,(1,1))                                                
//*                                                                             
//*                                                                             
//PREPARE EXEC PGM=IRXJCL,PARM='SOPLIB'                                         
//SYSEXEC  DD  DSN=&INDRTE..EXEC,DISP=SHR                                       
//         DD  DSN=&INDLIB2..EXEC,DISP=SHR                                      
//         DD  DSN=&INDLIB3..EXEC,DISP=SHR                                      
//         DD  DSN=&INDGRND..EXEC,DISP=SHR                                      
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//IN       DD  DSN=&&TEMP,DISP=(OLD,DELETE)                                     
//GENCNTL  DD  DSN=&&GENCNTL,DISP=(NEW,PASS,DELETE),                            
//             RECFM=FB,LRECL=80,SPACE=(CYL,(1,1))                              
//OUT      DD  DSN=&&OUT,DISP=(NEW,PASS,DELETE),                                
//             RECFM=FB,LRECL=256,SPACE=(CYL,(1,1))                             
//*                                                                             
//*                                                                             
//TOPDS  EXEC PGM=IEBGENER                                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&&GENCNTL,DISP=(OLD,DELETE)                                  
//SYSUT1   DD  DSN=&&OUT,DISP=(OLD,DELETE)                                      
//SYSUT2   DD  DSN=&&SOPLIB,DISP=(NEW,PASS,DELETE),                             
//             RECFM=FB,LRECL=256,DSORG=PO,                                     
//             SPACE=(CYL,(5,25,1000))                                          
//*                                                                             
//*                                                                             
//PDS2PDS EXEC PGM=IEBCOPY                                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT3   DD  SPACE=(CYL,(1,1))                                                
//SYSUT4   DD  SPACE=(CYL,(1,1))                                                
//DDIN     DD  DSN=&&SOPLIB,DISP=(OLD,DELETE)                                   
//DDOUT    DD  DSN=&INDLIB..SOPLIB,DISP=SHR                                     
//SYSIN    DD  DSN=&INDRTE..CONSTANT(PDSCOPY),DISP=SHR                          
//*                                                                             
