//WTRTGEN   PROC LIB=MISSING,MEMBER=MISSING,LOADLIB=MISSING                     
//*********************************************************************         
//* KOPIA AV VOLVO DATAS VPTRTGEN, MEN ANPASSAD FÖR PDS               *         
//* I VILMA2                                                          *         
//*                                                                   *         
//*      CREATED  910424/TN                                           *         
//*                                     MAINTAINED BY DEPT 30650      *         
//*********************************************************************         
//GEN     EXEC PGM=V16503                                                       
//STEPLIB  DD  DSN=&INDRTE..LOAD,DISP=SHR                                       
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//V16503D1 DD  DSN=&LIB(&MEMBER),DISP=SHR                                       
//V16503D2 DD  DSN=&&AIN,DISP=(,DELETE),                                        
//             SPACE=(TRK,(5,5)),DCB=(BLKSIZE=3200)  ASSEMBLY INPUT             
//V16503D3 DD  SYSOUT=*,DCB=(LRECL=121,BLKSIZE=1573)                            
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),                                   
//             SPACE=(TRK,(5,5)),DCB=(BLKSIZE=3200)  LKED INPUT                 
//V16503D4 DD  DSN=*.SYSLIN,DISP=(MOD,PASS),                                    
//             VOL=REF=*.SYSLIN                    LKED INPUT                   
//SYSPRINT DD  DUMMY,DCB=BLKSIZE=1573                                           
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR                                         
//         DD  DSN=F1ST00.MACLIB,DISP=SHR                                       
//SYSUT1   DD  DSN=&&UT1,DISP=(,DELETE),SPACE=(CYL,(3,1))                       
//SYSUT2   DD  DSN=&&UT2,DISP=(,DELETE),SPACE=(CYL,(3,1))                       
//SYSUT3   DD  DSN=&&UT3,DISP=(,DELETE),SPACE=(CYL,(3,1))                       
//SYSIN    DD  DSN=*.V16503D2,DISP=(OLD,DELETE),VOL=REF=*.V16503D2              
//SYSUDUMP DD  SYSOUT=*                                                         
//LKED    EXEC PGM=IEWL,PARM=(REUS,XREF,LIST,NCAL),                             
//             COND=(00,LT,GEN)                                                 
//SYSPRINT DD  SYSOUT=*,DCB=(LRECL=121,BLKSIZE=1573)                            
//SYSLIB   DD  DSN=SYS1.F1ST00.LINKLIB,DISP=SHR                                 
//SYSUT1   DD  DSN=&&UT1,DISP=(,DELETE),SPACE=(CYL,(3,1))                       
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                                  
//SYSLMOD  DD  DSN=&LOADLIB,DISP=SHR                                            
