//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WWAITFOR PROC ROUTINE=,WAITFOR=,INDEX=&W                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//CARDGEN EXEC PGM=V12340,                                                      
// PARM=(' DEFINE GDG(NAME(&INDEX..&ROUTINE..&WAITFOR) LIMIT(1)) ')             
//V12340D1 DD  DUMMY,DCB=BLKSIZE=80                                             
//V12340D2 DD  DSN=&&CARDS,DISP=(NEW,PASS,DELETE),                              
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=160),                             
//             SPACE=(TRK,1)                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//DEF    EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&&CARDS,DISP=(OLD,DELETE,DELETE)                             
