//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                    MAINTAINED BY DEPT. 30600      *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WWAITOK  PROC ROUTINE=DUMMY,WAITFOR=DUMMY,                                    
//             SOPCMD=ORDER,                                                    
//             MAXRC=4,INDEX=&W,                                                
//             STPLIB=&INDRTE..LOAD,                                            
//             SOPGRP=DUMMY                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//DELGEN  EXEC PGM=V12340,COND=(&MAXRC,LT),                                     
//        PARM=(' DELETE &INDEX..&ROUTINE..&WAITFOR GDG ')                      
//V12340D1 DD  DUMMY,DCB=BLKSIZE=80                                             
//V12340D2 DD  DSN=&&DEL,DISP=(NEW,PASS,DELETE),                                
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=160),                             
//             SPACE=(TRK,1)                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//DUMMY   EXEC PGM=IEFBR14,COND=(&MAXRC,GE)                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//DEL     EXEC PGM=IDCAMS,COND=(&MAXRC,LT)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&&DEL,DISP=(OLD,DELETE,DELETE)                               
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//DELERR  EXEC PGM=ABEND,COND=((0,EQ,DUMMY),(0,EQ,DEL)),                        
//             PARM='1234567890123456'                                          
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//LISTGEN EXEC PGM=V12340,COND=(&MAXRC,LT),                                     
//             PARM=(' LISTCAT LEVEL(&INDEX..&ROUTINE) ')                       
//V12340D1 DD  DUMMY,DCB=BLKSIZE=80                                             
//V12340D2 DD  DSN=&&LIST,DISP=(NEW,PASS,DELETE),                               
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=160),                             
//             SPACE=(TRK,1)                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//LIST    EXEC PGM=IDCAMS,COND=(&MAXRC,LT)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&&LIST,DISP=(OLD,DELETE,DELETE)                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
//SOPOK   EXEC PGM=W98022,COND=((0,EQ,DUMMY),(0,EQ,LIST)),                      
//             PARM='&SOPCMD &ROUTINE./'                                        
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//SYSUDUMP DD  SYSOUT=*                                     -- ABEND            
//W98022D1 DD  DDNAME=SYSIN                                                     
//SOPDD1   DD  DSN=&INDRTE..SOP,DISP=SHR           -- SOP DATA BASE             
//PDSDD1   DD  DSN=&INDRTE.TMP.JCL,DISP=SHR        -- TEMP PDS JOB LIB          
//PDSDD2   DD  DSN=&INDRTE..JCL,DISP=SHR           -- PDS JOB LIB               
//SYSIN    DD  DUMMY                                                            
