//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  PROCEDURE FOR PUTTING A JOB IN WAIT STATE FOR                    *         
//*  SPECIFIED NUMBER OF SECONDS (MAX 99999 S)                                  
//*                                                                   *         
//*                                    MAINTAINED BY DEPT. 9230       *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WWAIT    PROC SECONDS=10                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WAIT    EXEC PGM=W009WA,PARM='&SECONDS./'                                     
//STEPLIB  DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
