//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*              ****************************************                       
//*              *   XICS - VERSION 5.0  AUGUST 1984    *                       
//*              *            INTERPRETER               *                       
//*              ****************************************                       
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXINTP   PROC DSIN=NULLFILE,PROG='XRXINT  ',                                  
//             LISTID='WXXXXX-001 ',                                            
//             PDEF=TAPE,                                                       
//             DCLIBX='R153.XICS.DCLIBX',                                       
//             DCLIBY='R153.XICS.DCLIBY',                                       
//             DCLIBZ='R153.XICS.DCLIBZ'                                        
//*                                                                             
//INTERP  EXEC PGM=XICSLSEP,                                                    
//             PARM='&PROG/&LISTID'                                             
//STEPLIB   DD DSN=VPUBV1.XICS51.LOAD,DISP=SHR                                  
//CSSIN     DD DSN=&DSIN,DISP=SHR                                               
//*SS03     DD DUMMY                                                            
//************** ONLINE 9700 OUTPUT                                             
//*            DEST=NJOCP                                                       
//*                                                                             
//CSSOUT   DD DSN=&W154..RS.W15495,                                             
//             MGMTCLAS=&BACKUPC,SPACE=(CYL,(15,10)),                           
//            DISP=(NEW,CATLG,DELETE),                                          
//            DCB=(RECFM=VB,LRECL=8196,BLKSIZE=8200)                            
//*                                                                             
//FT03F001  DD DSN=VPUBV1.XICS50.DEMO(VLVCONM3),           CONFIG FILE          
//             DISP=SHR                                                         
//FT04F001  DD SPACE=(400,(50,50),RLSE),                   IMAGE LOG            
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=400)                              
//FT05F001  DD DSN=&INDGRND..XICSLIB(&PDEF),DISP=SHR          OPTION            
//FT06F001  DD SYSOUT=*                                    LOG                  
//FT07F001  DD SPACE=(2048,(400,400),RLSE),                                     
//             DCB=(BLKSIZE=2048,RECFM=F)                  TEMP 1               
//VSRN01    DD DSN=&DCLIBX,DISP=SHR                        DCLIB 1              
//VSRN02    DD DSN=&DCLIBY,DISP=SHR                        DCLIB 2              
//VSRN03    DD DSN=&DCLIBZ,DISP=SHR                        DCLIB 3              
//FT08F001  DD DSN=VPUBV1.XICS50.SYSTEM(XICSPDEF),         PDEF                 
//             DISP=SHR                                                         
//FT13F001  DD SPACE=(CYL,(5,1)),                          MIMP SCRATCH         
//             DCB=(RECFM=F,BLKSIZE=8180)                                       
//CSS04     DD SPACE=(TRK,(300,300),RLSE),                 S/S IMP SCR          
//             DCB=(RECFM=VB,LRECL=2200,BLKSIZE=3200)                           
