//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOMPLETTERAR DAGLIG PACKINFO MED AVERAGE COST                              
//*                                                                             
//*  FREKVENS:     DAG         RTN WXTRD1                                       
//*                                                                             
//*  ÅTERSTART:    WXTR17    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP017 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRD1,                                             
//             INDIN1=&W011..NDC,                                               
//             INDUT=&WXTR..WXTRD1                                              
//*                                                                             
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTDCAR),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W01184(+0),DISP=SHR                                 
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//************  SORTAD PÅ DC/ART                                                
//*                                                                             
//SORTA0   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRP171),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WXTRA0(+0),DISP=SHR                                  
//*                                                                             
//SORTOUT  DD  DSN=&&WXTRA0,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//************ DAGLIG PACKAT SORTERAT PÅ IDDC OCH IDDISTRIKT                    
//*                                                                             
//WXTR17   EXEC PGM=V16459,PARM='WXTR17/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTR17D1 DD  DSN=&&WXTRA0,DISP=(OLD,DELETE,DELETE)                            
//************ DAGLIG PACKAT                                                    
//*                                                                             
//WXTR17D2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ NDC-LAGERBAND                                                    
//*                                                                             
//WXTR17D3 DD  DSN=&&WXTR17,DISP=(NEW,PASS,DELETE),                             
//             DATACLAS=PSEN                                                    
//*                                                                             
//SORT17   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRP172),DISP=SHR                         
//SORTIN   DD  DSN=&&WXTR17,DISP=(OLD,DELETE,DELETE)                            
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTR17(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             MGMTCLAS=&DEL2BKPC,DATACLAS=PSEN                                 
//************  DAGLIG PACKATHISTORIK KOMPLETTERAD MED AVERAGE COST             
//************  SORTAD PÅ DC, IDPRC, KDORDKL OCH IDDISTR                        
//GENER1   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..WXTR17(+1),DISP=(OLD,PASS,DELETE)                    
//************ KOPIA FÖR VECKOKÖRNING AV FAKTURERADE RADER                      
//*                                                                             
//SYSUT2   DD DSN=&INDUT..WXTR17V(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************                                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//GENER2   EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..WXTR17(+1),DISP=(OLD,PASS,DELETE)                    
//************ KOPIA FÖR MÅNADSKÖRNING AV FAKTURERADE RADER                     
//*                                                                             
//SYSUT2   DD DSN=&INDUT..WXTR17M(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************                                                                  
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
