//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*            KOPIERING AV POSTTYP KVALITETSFELSFIL TILL VIOS                  
//*                                                                             
//*            FREKVENS:  DAG     RTN W426D1                                    
//*                                                                             
//*            ÅTERSTART: NORMAL                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP0K7 PROC INDIN=&W426..W426D1,                                            
//             INDUT2=&WXTR..W426D1                                             
//*                                                                             
//GENER   EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..W42605(+0),DISP=SHR                                  
//SYSUT2   DD  DSN=&INDUT2..WXTRK7(+1),DISP=(NEW,CATLG,DELETE), -LIM(3)         
//************** KVALITETSFELS FIL                                              
//             SPACE=(6136,(100,10),RLSE),                                      
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
