//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W4795O TILL WXTR18 EFTERSOM RENAMEN ÄTER UPP                      
//*  GÅRDAGENS FIL SOM JAG BEHÖVER I WXTRP007. HAKUNAMATATA                     
//*                                                                             
//*  FREKVENS:     DAG         RTN WXTRD1                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP018 PROC INDIN2=&W479..WXTRD1,                                           
//             INDUT=&WXTR..WXTRD1                                              
//*                                                                             
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN2..W4795O(+0),DISP=SHR                                 
//************ DAGENS EFR FRÅN W479D1/W479P05O                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTR18(+1),DISP=(NEW,CATLG,DELETE),  -LIM(4)         
//************ KOPIAN JU                                                        
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
