//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  LISTA/EMAIL URVAL PACKADE RADER                                            
//*                                                                             
//*  FREKVENS:     VECKA    RTN WXTRV2                                          
//*                                                                             
//*  ≈TERSTART:    WXTR1900 NORMAL                                              
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP019 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRV2,                                             
//             INDUT=&WXTR..WXTRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR19   EXEC PGM=WXTR19                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//OSDAT    DD  DSN=&INDRTE..DATWEEK(+0),DISP=SHR            -- DATKORT          
//DATIN    DD  DSN=&INDRTE..CONSTANT(NORMAL),DISP=SHR       -- DATKORT          
//DATUT    DD  SYSOUT=*                                     -- DATKORT          
//WXTR19D1 DD  DSN=&INDIN..WXTR01(+0),DISP=SHR                                  
//*WXTR19D1 DD  DSN=&WXTR..V≈≈VV.PACKRAD,DISP=SHR                               
//************ VECKANS PACKADE RADER                                            
//*            VID OMK÷RNING ANV D1 ALT 2                                       
//*                                                                             
//TPFIL1   DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//             DATACLAS=PSEB                                                    
//*                                                                             
//WXTR19D2 DD  DUMMY                                                            
//*XTR19D2 DD  SYSOUT=(A,,3803),DEST=&DEST1,OUTPUT=(*.A4LF),                    
//************ LISTA WXTR19-001 VOR PACRADER                                    
//*            DCB=RECFM=FBA,LRECL=76,BLKSIZE= 76)                              
//*                                                                             
//WXTR19D3 DD  DSN=&INDUT..WXTR19(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
