//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FILE TO AZURE DATALAKE IN DISPLAY FORMAT                                   
//*                                                                             
//*  FREQUENCE:    DAILY     RTN WXTRD1                                         
//*                                                                             
//*  RESTART:      WXTRA7    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP0A7 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRD1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRA7   EXEC PGM=WXTRA7                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WXTRA7D1 DD  DSN=&INDIN..WXTRA7(+0),DISP=SHR                                  
//************ INPUT FILE FROM WXTRA0                                           
//*                                                                             
//WXTRA7D2 DD  DSN=&&WXTRA7X,DISP=(NEW,PASS,DELETE),                            
//************ ORDER HIST FILE TO AZURE DATALAKE                                
//             DATACLAS=PSEB                                                    
//*                                                                             
