//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR ETT PREEXTRAKT FÖR LAGERBANDSFRAMSTÄLLNING, SERRU.                  
//*                                                                             
//*  FREKVENS:     TIMME  RTN WXTRS1                                            
//*                DAG    RTN WXTRD2                                            
//*                                                                             
//*  ÅTERSTART:                                                                 
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP090 PROC STPLIB=&INDRTE..LOAD,                                           
//             CNTRL=DUMMY,                                                     
//             INDIN=SAKNAS,                                                    
//             INDUT=SAKNAS,                                                    
//             INDREG=&W011..&RTEGRP.,                                          
//             INDLDC=&W011..LDC,                                               
//             INDSDC=&W011..SDC,                                               
//             INDNDC=&W011..NDC                                                
//**********************************************************************        
//SORT84   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDLDC..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDSDC..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDNDC..W01184(+0),DISP=SHR                                 
//************ W01184 FÖR VARJE SDC/NDC,NÄR DET TILLKOMMER DC'N MÅSTE           
//************ DE LÄGGAS TILL HÄR OCH LÄSAS KONKATINERAT                        
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ W01184 SORTED ON PARTNUMBER/IDDC                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//SORT03   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD9Z),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG..W01103(+0),DISP=SHR                                 
//************ ERSÄTTNINGAR                                                     
//*                                                                             
//SORTOUT  DD  DSN=&&W01103,DISP=(NEW,PASS,DELETE),                             
//************ PARTS ONLY WITH FLTXEXT = 'N' INCLUDED                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//**********************************************************************        
//WXTR90   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,WXTR90,WXTR90,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                 -- ABEND            
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WXTR90DA DD  DSN=&INDRTE..CONSTANT(&CNTRL),DISP=SHR                           
//************ SYSIN FILE TO DECIDE DAILY BATCH OR ORDERED                      
//************ DAILY IS DAY AND ORDERED IS DUMMY                                
//*                                                                             
//WXTR90D1 DD  DSN=&INDIN..W01160(+0),DISP=SHR                                  
//************ SAMTLIGA DATAELEMENT FRÅN WDK601 OCH WDK611                      
//*                                                                             
//WXTR90D2 DD  DSN=&INDIN..W01168(+0),DISP=SHR                                  
//************ UTVALDA DATAELEMENT FRÅN WDK901                                  
//*                                                                             
//WXTR90D4 DD  DSN=&INDIN..W01173(+0),DISP=SHR                                  
//************ BESTÄLLNINGSREST FRÅN WDD9                                       
//*                                                                             
//WXTR90D5 DD  DSN=&INDIN..W01174(+0),DISP=SHR                                  
//************ SAMTLIGA BENÄMNINGAR FRÅN WDD3                                   
//*                                                                             
//WXTR90D6 DD  DSN=&INDUT..WXTR90(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ PREEXTRAKTFIL FÖR CDC                                            
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//WXTR90D7 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ SDC/NDC INFORMATION                                              
//*                                                                             
//WXTR90D8 DD  DSN=&&W01103,DISP=(OLD,DELETE,DELETE)                            
//************ ERSÄTTNINGAR                                                     
//WXTR90D9 DD  DUMMY,DISP=(NEW,CATLG,DELETE),                  -LIM(1)          
//************ CHINESE VOLUME PLANNING FILE FOR WHOLE SALES ORDER               
//************ LIMITATION                                                       
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=DEL2                                                    
//*                                                                             
