//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPIES WXTR9C(+0) TO WXTR.PARTINFO.WCDCACC(+1)                             
//*  COPIES WXTR9S(+0) TO WXTR.PARTINFO.WSDCACC(+1)                             
//*  COPIES WXTR9N(+0) TO WXTR.PARTINFO.WNDCACC(+1)                             
//*  COPIES WXTR9K(+0) TO WXTR.PARCINFO.WNDCACC(+1)                             
//*                                                                             
//*  FREQUENCE:    ACCOUNT (RTN WXTRD2)                                         
//*                PERIOD                                                       
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP094 PROC INDIN=&WXTR..WXTRD2,                                            
//             INDUT2=&WXTR..PARTINFO,                                          
//             INDUT3=&WXTR..PARTINFO,                                          
//             INDUT4=&WXTR..PARTINFO,                                          
//             INDUT5=&WXTR..PARCINFO                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE1 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9C(+0),DISP=SHR                                  
//************ CDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WCDCACC(+1),                       -LIM(12)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ CDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE2 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9S(+0),DISP=SHR                                  
//************ SDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT3..WSDCACC(+1),                       -LIM(12)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE3 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9N(+0),DISP=SHR                                  
//************ SDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT4..WNDCACC(+1),                       -LIM(12)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE4 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9K(+0),DISP=SHR                                  
//************ CN-INFORMATION                                                   
//*                                                                             
//SYSUT2   DD  DSN=&INDUT5..WNDCACC(+1),                       -LIM(12)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ CN-INFORMATION                                                   
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
