//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*            PLANERADE AVROP                                        *         
//*            KOPIERING AV PV-FIL TILL EASYTRIEV-FIL                 *         
//*                                                                   *         
//*            PERIODICITET: DAILY                                              
//*                                                                   *         
//*            ÅTERSTART:    NORMAL                                   *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WXTRP020 PROC INDUT=&WXTR,                                                    
//             INDIN=&WXTR..WXTRD2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRSS   EXEC PGM=SORT                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSIN    DD   DSN=&INDRTE..CONSTANT(W233PD90),DISP=SHR                        
//SORTIN   DD   DSN=&INDIN..W23320(+0),DISP=SHR                                 
//**************                                                    ***         
//SORTOUT  DD DSN=&INDUT..DPLAVROP(+1),DISP=(NEW,CATLG,DELETE),                 
//**************                                           -LIM(14) ***         
//             DATACLAS=PSEN,MGMTCLAS=&BACKUPC                                  
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
