//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DAGLIG FAKTURAHISTORIK                                              
//*                                                                             
//*  FREKVENS:     DAG      RTN WXTRD1                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                WXTR03    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP003 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&W479..WXTRD1,                                             
//             INDREG=&WXTR,                                                    
//             INDUT=&WXTR..WXTRD1,                                             
//             DEST1=LOCAL                                                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR03   EXEC PGM=V16459,PARM='WXTR03/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(500,500))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTR03D1 DD  DSN=&INDIN..W4795N(+0),DISP=(OLD,KEEP,KEEP)                      
//************ W4795M (SORTERAD PÅ DC, IDPRC, DISTR, ORDKL)                     
//*                                                                             
//WXTR03D2 DD  DSN=&INDREG..WXTRAA(+0),DISP=SHR                                 
//************ ÖVERSÄTTNINGSTABELL DISTRIKT                                     
//*                                                                             
//WXTR03D3 DD  DSN=&INDUT..WXTR03(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ FAKTURAINFORMATION PER DC                                        
//             DATACLAS=PSEB,AVGREC=K,                                          
//             MGMTCLAS=&NOBACKUP                                               
//*                                                                             
//WXTR03D4 DD  DSN=&&TEMP,DISP=(NEW,PASS,DELETE),                               
//************ TEMPFIL - FAKTURAINFORMATION PER SDC, DISTRIKT O KLASS           
//             DATACLAS=PSEN,AVGREC=K                                           
//*                                                                             
//WXTR03D5 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ WXTR03-001 FAKTURAINFORMATION SDC:ER                             
//*                                                                             
//WXTR03D6 DD  SYSOUT=(A,,STD),DEST=&DEST1                                      
//************ WXTR03-002 FAKTURAINFORMATION NDC:ER                             
