//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SUMMERAR RO-RADER PER DISTRIKT OCH DO/BO                                   
//*                                                                             
//*  FREKVENS:     VECKA    RTN WXTRV3                                          
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                WXTR09    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP009 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDREG1=&W440,                                                   
//             INDREG2=&WXTR..WXTRV3,                                           
//             INDUT=&WXTR..WXTRV3                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTRO   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD91),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG1..W44061(+0),DISP=SHR                                
//************ RO-REG SEKVENSIELLT                                              
//************ ENDAST POSTER DÄR TIRODAT ÄR > NOLL OCH                          
//************ KDSTARAD ÄR LIKA MED 2 ELLER 3 TAS MED I SORTEN!!!!              
//*                                                                             
//SORTOUT  DD  DSN=&&W44061,DISP=(NEW,PASS,DELETE),                             
//************ RO-REG SEKV SORTAD PER DISTRIKT                                  
//************ ENDAST POSTER DÄR TIRODAT ÄR > NOLL OCH                          
//************ KDSTARAD ÄR LIKA MED 2 ELLER 3 TAS MED I SORTEN!!!!              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR09   EXEC PGM=V16459,PARM='WXTR09/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTR09D1 DD  DSN=&&W44061,DISP=(OLD,DELETE,DELETE)                            
//************ RO-REG SEKV SORTAD PER DISTRIKT                                  
//*                                                                             
//WXTR09D2 DD  DSN=&INDREG2..WXTR09(+0),DISP=SHR                                
//************ RO-REG SEKV SORTAD PER DISTRIKT                                  
//*                                                                             
//WXTR09D3 DD  DSN=&&NYARO,DISP=(NEW,PASS,DELETE),                              
//************ VECKANS RO-RADER SUMMERAD PER DISTRIKT O VECKA                   
//             DATACLAS=PSEN                                                    
//*                                                                             
//WXTR09D4 DD  DSN=&&GAMRO,DISP=(NEW,PASS,DELETE),                              
//************ FÖRRA VECKANS RO-RADER SUMMERAD PER DISTRIKT O VECKA             
//************ MINUS DE POSTER SOM ÄR MER ÄN ETT ÅR GAMMLA                      
//             DATACLAS=PSEN                                                    
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT09   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD92),DISP=SHR                         
//SORTIN   DD  DSN=&&NYARO,DISP=(OLD,DELETE,DELETE)                             
//         DD  DSN=&&GAMRO,DISP=(OLD,DELETE,DELETE)                             
//************ VECKANS RO-FIL RESP FÖRRA VECKANS RO-REG MINUS DE                
//************ POSTER SOM ÄR MER ÄN ETT ÅR GAMMLA                               
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTR09(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ RO-REG (UPPF) SORTAD PER VECKA O DISTRIKT                        
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
