//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR W01162 MED SAMTLIGA NOTERINGAR PER ARTIKELNR                      
//*                                                                             
//*  FREKVENS:     DAG         RTN WXTRD1                                       
//*                                                                             
//*  ÅTERSTART:              NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP062 PROC INDREG=&W011..&RTEGRP.,                                         
//             INDUT=&WXTR..WXTRD1                                              
//*                                                                             
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDREG..W01162(+0),DISP=SHR                                 
//************ NOTERINGAR FRÅN W01160                                           
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTR62(+1),DISP=(NEW,CATLG,DELETE),  -LIM(1)         
//************ KOPIAN                                                           
//             MGMTCLAS=NOBACKUP,DATACLAS=PSEN                                  
