//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPIES WXTR9C(+0) TO WXTR.PARTINFO.WCDCTIME(+1)                            
//*                                                                             
//*  FREQUENCE:    DAILY   (RTN WXTRS1)                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP092 PROC INDIN=&WXTR..WXTRS1,                                            
//             INDUT2=&WXTR..PARTINFO                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9C(+0),DISP=SHR                                  
//************ CDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WCDCTIME(+1),                       -LIM(1)         
//************ CDC-INFORMATION                                                  
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
