//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPA SEKFIL MED INVENTERINGSINFORMATION.                                  
//*  BLIR PRIMÄREXTRAKT I VIOS.                                                 
//*                                                                             
//*  FREKVENS:     DAG      RTN WXTRD1                                          
//*                                                                             
//*  ÅTERSTART:    WXTR10      NORMAL                                           
//*                LÄSER  WDH1                                                  
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP010 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDUT=&WXTR..WXTRD1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR10   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,WXTR10,WXTR10,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSCTL   DD  DSN=F1IM00.IMS.CONSTANT(SBCOND),DISP=SHR                         
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDH1     INCLUDE MEMBER=WDH1                                                  
//WDB6     INCLUDE MEMBER=WDB6                                                  
//WXTR10D1 DD  DSN=&&WXTRK6,DISP=(NEW,PASS,DELETE),                             
//************ INVENTERINGSINFORMATION FRÅN WDH101 & -02                        
//             SPACE=(40,(10,3),RLSE),AVGREC=K                                  
//*                                                                             
//SORTK6  EXEC PGM=SORT                                                         
//*                                                                             
//SYSOUT    DD SYSOUT=*                                                         
//SORTMSG   DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSIN     DD DSN=&INDRTE..CONSTANT(WXTRPD10),DISP=SHR                         
//*  SORTAS PÅ IDARTNR                                                          
//SORTIN    DD DSN=&&WXTRK6,DISP=(OLD,DELETE,DELETE)                            
//SORTOUT   DD DSN=&INDUT..WXTRK6(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//             SPACE=(40,(10,3),RLSE),AVGREC=K,                                 
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
