//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR EXTRAKTFIL FÖR CDC.                                                 
//*                                                                             
//*  FREKVENS:     TIMME       RTN WXTRS1                                       
//*                DAG         RTN WXTRD2                                       
//*                                                                             
//*  ÅTERSTART:    WXTR9C    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP09C PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=SAKNAS,                                                    
//             INDUT=SAKNAS                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR9C   EXEC PGM=WXTR9C                                                      
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                     -- DISPLAY          
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WXTR9CD1 DD  DSN=&INDIN..WXTR90(+0),DISP=SHR                                  
//************ PREEXTRAKT                                                       
//*                                                                             
//WXTR9CD2 DD  DSN=&INDUT..WXTR9C(+1),DISP=(NEW,CATLG,DELETE),  -LIM(2)         
//************ EXTRAKTFIL MED CDC-ARTIKLAR                                      
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
