//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  KOPIERAR HELGKÖRNINGENS OKS/EFR-FIL ATT SPARAS                             
//*  SOM HISTORIK.                                                              
//*                                                                             
//*  FREKVENS:     VECKA    RTN WXTRV2                                          
//*                                                                             
//*  ÅTERSTART:    WXTR02    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP002 PROC INDIN=&WXTR..WXTRD1,                                            
//             INDUT=&WXTR..WXTRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTRA3(+0),DISP=SHR                                  
//************ OKS/EFR-INFO HELGSTATUS                                          
//*                                                                             
//SYSUT2   DD  DSN=&INDUT..WXTRA1(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ OKS/EFR-INFO HELGSTATUS. SPARAS SOM HISTORIK.                    
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEN                                  
//*                                                                             
