//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR SUMMERAD INFORMATION OM EFR-OPACK OKS AK OCH                        
//*  BELÄGGNING , VISAS PER VECKA/IDDC/LAGEROMRÅDE/PRODUKTSLAG                  
//*                                                                             
//*  WXTRE1 SKAPAR TVÅ FILER MED DATA FRÅN TVÅ HÅLL.                            
//*                                                                             
//*  SORTEN TAR IN DESSA BÅDA FILER TILLSAMMANS MED DET GAMLA                   
//*  REGISTRET. SORTAR OCH SUMMERAR IHOP POSTERNA PÅ :                          
//*                   TIAAVV    -    ÅR VECKA                                   
//*                   IDDC      -    IDDC                                       
//*                   ADLAGOMR  -    LAGEROMRÅDE                                
//*                   KDPRODSL  -    PRODUKTSLAG                                
//*                                                                             
//*  SKRIVER UT DET NYA REGISTRET                                               
//*                                                                             
//*  FREKVENS:     VECKA    RTN WXTRV2                                          
//*                                                                             
//*  ÅTERSTART:    WXTRE1    NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP0E1 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRV2,                                             
//             INDIN2=&WXTR..PARTINFO,                                          
//             INDUT=&WXTR..WXTRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRE1   EXEC PGM=V16459,PARM='WXTRE1/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=NJORS1,HOLD=YES                            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTRE1D1 DD  DSN=&INDIN..WXTRA1(+0),DISP=(OLD,KEEP,KEEP)                      
//************ SUMMERAD INFORMATION OM EFR OKS                                  
//*                                                                             
//WXTRE1D2 DD  DSN=&INDIN2..WCDCWEEK(+0),DISP=SHR                               
//************ "NYA LAGERBANDET" FÖR CDC                                        
//*                                                                             
//WXTRE1D3 DD  DSN=&INDIN2..WSDCWEEK(+0),DISP=SHR                               
//************ "NYA LAGERBANDET" FÖR SDC                                        
//*                                                                             
//WXTRE1D4 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ TEMPFIL INNEHÅLLANDE EFR-OPACK OCH OKS                           
//             DATACLAS=PSEB                                                    
//*                                                                             
//WXTRE1D5 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ TEMP2 INNEHÅLLANDE AK OCH BELÄGGNINGSINFORMATION CDC             
//             DATACLAS=PSEB                                                    
//*                                                                             
//WXTRE1D6 DD  DSN=&&TEMP3,DISP=(NEW,PASS,DELETE),                              
//************ TEMP3 INNEHÅLLANDE AK OCH BELÄGGNINGSINFORMATION SDC             
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORTSUM  EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPDE1),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WXTRE1(+0),DISP=(OLD,KEEP,KEEP)                      
//************ DET GAMLA REGISTRET                                              
//*                                                                             
//         DD  DSN=&&TEMP1,DISP=(OLD,DELETE,DELETE)                             
//************ TEMPFIL INNEHÅLLANDE EFR-OPACK OCH OKS                           
//*                                                                             
//         DD  DSN=&&TEMP2,DISP=(OLD,DELETE,DELETE)                             
//************ TEMP2 INNEHÅLLANDE AK OCH BELÄGGNINGSINFORMATION CDC             
//*                                                                             
//         DD  DSN=&&TEMP3,DISP=(OLD,DELETE,DELETE)                             
//************ TEMP3 INNEHÅLLANDE AK OCH BELÄGGNINGSINFORMATION SDC             
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTRE1(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ DET NYA REGISTRET                                                
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=&BACKUPC                                                
