//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  ADD NUMBER OF ORDERS TO WEEKLY                                             
//*                                                                             
//*  FREQUENCE:    WEEKLY    RTN WXTRV2                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                WXTR15    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP015 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRV2,                                             
//             INDUT=&WXTR..WXTRV2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT     EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD15),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WXTR07,DISP=SHR                                      
//************ INFIL                                                            
//*                                                                             
//SORTOUT  DD  DSN=&&WXTR07,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD                                                         
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR15   EXEC PGM=V16459,PARM='WXTR15/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),DEST=LOCAL,HOLD=YES                             
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTR15D1 DD  DSN=&&WXTR07,DISP=(OLD,DELETE,DELETE)                            
//************ SORTERAD                                                         
//*                                                                             
//WXTR15D2 DD  DSN=&INDUT..WXTR15(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//************ UTFIL                                                            
//             MGMTCLAS=&BACKUPC,DATACLAS=PSEB                                  
