//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPIES WXTR9S(+0) TO WXTR.PARTINFO.WSDCTIME(+1)                            
//*                                                                             
//*  FREQUENCE:    ORDERED (RTN WXTRS2)                                         
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP092 PROC INDIN=&WXTR..WXTRS2,                                            
//             INDUT3=&WXTR..PARTINFO                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENER EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9S(+0),DISP=SHR                                  
//************ SDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT3..WSDCTIME(+1),                       -LIM(1)         
//************ SDC-INFORMATION                                                  
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=&BACKUPC                                                
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
