//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  SKAPAR DAGFIL MED INKOMMET PER IDDC/IDDISTR                                
//*                                                                             
//*                                                                             
//*  FREQUENCE:    DAILY    RTN WXTRD1                                          
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                WXTR07    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP007 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN=&WXTR..WXTRD1,                                             
//             INDIN2=&WXTR..WXTRD1,                                            
//             INDUT=&WXTR..WXTRD1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT18M1 EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD07),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WXTR18(-1),DISP=SHR                                  
//************ 'GÅRDAGENS' EFRFIL                                               
//*                                                                             
//SORTOUT  DD  DSN=&&MIN118,DISP=(NEW,PASS,DELETE),                             
//************ SORTERAD PÅ DC, PRC, ORKL OCH DISTR                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT18P0 EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPD07),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN..WXTR18(+0),DISP=SHR                                  
//************ 'DAGENS' EFRFIL                                                  
//*                                                                             
//SORTOUT  DD  DSN=&&PLUS018,DISP=(NEW,PASS,DELETE),                            
//************ SORTERAD PÅ DC, PRC, ORKL OCH DISTR                              
//             DATACLAS=PSEN                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR07   EXEC PGM=V16459,PARM='WXTR07/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//*                                                                             
//WXTR07D1 DD  DSN=&&MIN118,DISP=(OLD,DELETE,DELETE)                            
//************ 'GÅRDAGENS' EFRFIL                                               
//*                                                                             
//WXTR07D2 DD  DSN=&&PLUS018,DISP=(OLD,DELETE,DELETE)                           
//************ 'DAGENS' EFRFIL                                                  
//*                                                                             
//WXTR07D3 DD  DSN=&INDIN2..WXTR03(+0),DISP=SHR                                 
//************ 'DAGENS' FAKTURERAT                                              
//*                                                                             
//WXTR07D4 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//************ 'GÅRDAGENS' EFRFIL - TEMP                                        
//*                                                                             
//WXTR07D5 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//             DATACLAS=PSEN                                                    
//************ 'DAGENS' EFRFIL    - TEMP                                        
//*                                                                             
//WXTR07D6 DD  DSN=&INDUT..WXTR07(+1),DISP=(NEW,CATLG,DELETE), -LIM(99)         
//             DATACLAS=PSEN                                                    
//************ INKOMMET PER IDDC/IDDISTR                                        
//*                                                                             
