//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FREKVENS:     DAGLIG   RTN WXTRD1                                          
//*                                                                             
//*  ÅTERSTART:    WXTRA0   NORMAL                                              
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP0A0 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&W479..WXTRD1,                                            
//             INDREG=&W413,                                                    
//             INDIN3=&W011,                                                    
//             INDUT=&WXTR..WXTRD1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT1    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA01),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W47923B(+0),DISP=SHR                                
//************ WDE4-POSTER                                                      
//************ SORTERAS PÅ IDPRODNR  IDKOLLI                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W47923B,DISP=(NEW,PASS,DELETE),                            
//************ SORTERADE WDE4-POSTER                                            
//             SPACE=(27936,(7500,5500),RLSE)                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT2    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA02),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W47990(+0),DISP=SHR                                 
//************ WDR1-POSTER                                                      
//************ SORTERAS PÅ IDDC  IDUSER                                         
//*                                                                             
//SORTOUT  DD  DSN=&&W47990,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE WDR1-POSTER                                            
//             SPACE=(27990,(800,800),RLSE)                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT3    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA03),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN1..W47925X(+0),DISP=SHR                                
//************ WDE6-POSTER                                                      
//************ SORTERAS PÅ IDPRODNR  IDKOLLI                                    
//*                                                                             
//SORTOUT  DD  DSN=&&W47925X,DISP=(NEW,PASS,DELETE),                            
//************ SORTERADE WDE6-POSTER                                            
//             SPACE=(27987,(800,800),RLSE)                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT4    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA04),DISP=SHR                         
//SORTIN   DD  DSN=&INDREG..W41302(+0),DISP=SHR                                 
//************ WDQ3-POSTER                                                      
//************ SORTERAS PÅ IDORDER  IDDC  IDPRODNR  IDPLKLST                    
//*                                                                             
//SORTOUT  DD  DSN=&&W41302,DISP=(NEW,PASS,DELETE),                             
//************ SORTERADE WDQ3-POSTER                                            
//             SPACE=(27876,(800,800),RLSE)                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRA0   EXEC PGM=V16459,PARM='WXTRA0/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,1000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//WXTRA0D1 DD  DSN=&&W47923B,DISP=(OLD,PASS,DELETE)                             
//************ WDE4-FIL                                                         
//*                                                                             
//WXTRA0D2 DD  DSN=&&W47990,DISP=(OLD,PASS,DELETE)                              
//************ WDR1-FIL                                                         
//*                                                                             
//WXTRA0D3 DD  DSN=&&W47925X,DISP=(OLD,PASS,DELETE)                             
//************ WDE6-FIL                                                         
//*                                                                             
//WXTRA0D4 DD  DSN=&&W41302,DISP=(OLD,PASS,DELETE)                              
//************ WDQ3-FIL                                                         
//*                                                                             
//WXTRA0D5 DD  DSN=&INDIN3..W01172(+0),DISP=SHR                                 
//************ DLB-FIL                                                          
//*                                                                             
//WXTRA0DG DD  DSN=&INDREG..W41301(+0),DISP=SHR                                 
//************ PRCTABEL                                                         
//*                                                                             
//WXTRA0D6 DD  DSN=&&WXTRA0,DISP=(NEW,PASS,DELETE),                             
//************ TEMPORÄR HISTORIK-FIL DAGLIG,                                    
//************ SORTERAS SIST I PROCEDUR                                         
//             SPACE=(29110,(2000,1000),RLSE)                                   
//************                                                                  
//*  OBS! OM OMKÖRNING EFTER KL 1600 KOMMER DET ATT       WXTRA0                
//*  LIGGA FELAKTIGT DATUM I DATUMKORTET, DÅ DATUM REDAN  WXTRA0                
//*  ÄR BYTT.                                             WXTRA0                
//*  MAN FÅR DÅ HÅRDKODA DATUMET I PROGRAMMET FÖR ATT FÅ  WXTRA0                
//*  GÅRDAGENS DATUM.                                     WXTRA0                
//************                                                                  
//WXTRA0D7 DD  DSN=&&TEMP1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR WDE4-FIL NR 1                                           
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0D8 DD  DSN=&&SORT1,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD WDE4-FIL NR 1                                  
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0D9 DD  DSN=&&TEMP2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR WDE4-FIL NR 2                                           
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DA DD  DSN=&&SORT2,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD WDE4-FIL NR 2                                  
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DB DD  DSN=&&TEMP3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR WDE4-FIL NR 2                                           
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DC DD  DSN=&&SORT3,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR SORTERAD WDE4-FIL NR 3                                  
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DD DD  DSN=&&TEMP4,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPORÄR WDE6-FIL NR 1                                           
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DE DD  DSN=&&WXTRA4,DISP=(NEW,PASS,DELETE),                             
//************ TEMPORÄR HISTORIK-FIL DAGLIG (FAKTURERADE RADER)                 
//************ SORTERAS SIST I PROCEDUR                                         
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA0DF DD  DSN=&&WXTRA7,DISP=(NEW,PASS,DELETE),                             
//************ TEMPORÄR HISTORIK-FIL DAGLIG TILL AZURE DATALAKE                 
//************ SORTERAS SIST I PROCEDUR                                         
//             SPACE=(29110,(2000,1000),RLSE)                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT5    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA05),DISP=SHR                         
//SORTIN   DD  DSN=&&WXTRA0,DISP=(OLD,DELETE,DELETE)                            
//************ TEMPORÄR HISTORIK-FIL DAGLIG,                                    
//************ SORTERAS PÅ IDARTNR  IDDC                                        
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTRA0(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ HISTORIK-FIL DAGLIG                                              
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//GENER   EXEC PGM=V16459,PARM='ICEGENER/3/'                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDUT..WXTRA0,DISP=SHR                                      
//SYSUT2   DD  DSN=&INDUT..WXTRA0A(+1),DISP=(NEW,CATLG,DELETE),                 
//************** WXTRA0A COPY FOR PACKERLIST                   -LIM(3)          
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=NOBACKUP                                                
//*                                                                             
//SORT6    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA06),DISP=SHR                         
//SORTIN   DD  DSN=&&WXTRA4,DISP=(OLD,DELETE,DELETE)                            
//************ TEMPORÄR HISTORIK-FIL DAGLIG (FAKTURERADE RADER),                
//************ SORTERAS PÅ IDARTNR  IDPRODNR                                    
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTRA4(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ HISTORIK-FIL DAGLIG (FAKTURERADE RADER)                          
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//SORT7    EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WXTRPA05),DISP=SHR                         
//SORTIN   DD  DSN=&&WXTRA7,DISP=(OLD,DELETE,DELETE)                            
//************ TEMPORÄR HISTORIK-FIL DAGLIG,                                    
//************ SORTERAS PÅ IDARTNR  IDDC                                        
//*                                                                             
//SORTOUT  DD  DSN=&INDUT..WXTRA7(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ HISTORIK-FIL DAGLIG AZURE DATALAKE                               
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
