//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  FREKVENS:     DAGLIG   RTN WXTRD1                                          
//*                                                                             
//*  ÅTERSTART:    WXTRA4   NORMAL                                              
//*                                                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP0A4 PROC STPLIB=&INDRTE..LOAD,                                           
//             INDIN1=&WXTR..WXTRD1,                                            
//             INDIN2=&W483..W483V2,                                            
//             INDIN3=&W479..W479D1,                                            
//             INDIN4=&W413,                                                    
//             INDIN5=&W011..&RTEGRP.,                                          
//             INDIN6=&W011..NDC,                                               
//             INDUT=&WXTR..WXTRD1                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRA4   EXEC PGM=V16459,PARM='WXTRA4/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(8192,(10000,1000))                                        
//SORTMSG  DD  SYSOUT=*                                                         
//WXTRA4D1 DD  DSN=&INDIN1..WXTRA4(+0),DISP=SHR                                 
//************ FAKTURAINFO EJ KOMPLETT                                          
//*                                                                             
//WXTRA4D2 DD  DSN=&INDIN2..W48322(+0),DISP=SHR                                 
//************ WDD2-FIL                                                         
//*                                                                             
//WXTRA4D3 DD  DSN=&INDIN3..W47997(+0),DISP=SHR                                 
//************ WDQ2-FIL                                                         
//*                                                                             
//WXTRA4D4 DD  DSN=&INDIN4..W41301(+0),DISP=SHR                                 
//************ DLB-FIL                                                          
//*                                                                             
//WXTRA4D5 DD  DSN=&INDIN5..W01160(+0),DISP=SHR                                 
//************ DLB-FIL                                                          
//*                                                                             
//WXTRA4D6 DD  DSN=&INDIN6..W01184(+0),DISP=SHR                                 
//************ DLB-FIL                                                          
//*                                                                             
//WXTRA4D7 DD  DSN=&INDUT..WXTRA5(+1),DISP=(NEW,CATLG,DELETE),  -LIM(3)         
//************ HISTORIK-FIL DAGLIG (KOMPLETT HIST.FAKTURERADE RADER)            
//             MGMTCLAS=&NOBACKUP,DATACLAS=PSEN                                 
//*                                                                             
//*                                                                             
//************ TEMPORÄRA FILER                                                  
//*                                                                             
//WXTRA4DA DD  DSN=&&TEMPA,DISP=(NEW,DELETE,DELETE),                            
//************ WXTRA4 SORTERAD (IDDISTR, IDKUNDNR)                              
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DB DD  DSN=&&TEMPB,DISP=(NEW,DELETE,DELETE),                            
//************ WXTRA4 KOMPLETTERAD MED WDD2-INFO                                
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DC DD  DSN=&&TEMPC,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPB SORTERAD (IDORDER)                                         
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DD DD  DSN=&&TEMPD,DISP=(NEW,DELETE,DELETE),                            
//************ W47997 MED ENBART WDQ201-POSTERFO                                
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DE DD  DSN=&&TEMPE,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPD SORTERAD (IDORDER)                                         
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DF DD  DSN=&&TEMPF,DISP=(NEW,DELETE,DELETE),                            
//************ WXTRA4 KOMPLETTERAD MED WDW201-INFO                              
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DG DD  DSN=&&TEMPG,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPF SORTERAD (IDDC, IDPRC)                                     
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DH DD  DSN=&&TEMPH,DISP=(NEW,DELETE,DELETE),                            
//************ WXTRA4 KOMPLETTERAD MED PRC-INFO                                 
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DI DD  DSN=&&TEMPI,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPH SORTERAD (IDARTNR, IDDC)                                   
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DJ DD  DSN=&&TEMPJ,DISP=(NEW,DELETE,DELETE),                            
//************ WXTRA4 KOMPLETTERAD MED W01160-INFO                              
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//WXTRA4DK DD  DSN=&&TEMPK,DISP=(NEW,DELETE,DELETE),                            
//************ TEMPJ SORTERAD (IDDC, IDARTNR)                                   
//             SPACE=(29110,(2000,1000),RLSE)                                   
//*                                                                             
//*                                                                             
