//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  COPIES WXTR9C(+0) TO WXTR.PARTINFO.WCDCPLAN(+1)                            
//*  COPIES WXTR9S(+0) TO WXTR.PARTINFO.WSDCPLAN(+1)                            
//*  COPIES WXTR9N(+0) TO WXTR.PARTINFO.WNDCPLAN(+1)                            
//*  COPIES WXTR9K(+0) TO WXTR.PARCINFO.WNDCPLAN(+1)                            
//*                                                                             
//*  FREQUENCE:   PLANNING (RTN WXTRD2)                                         
//*               PERIOD                                                        
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP095 PROC INDIN=&WXTR..WXTRD2,                                            
//             INDUT2=&WXTR..PARTINFO,                                          
//             INDUT3=&WXTR..PARTINFO,                                          
//             INDUT4=&WXTR..PARTINFO,                                          
//             INDUT5=&WXTR..PARCINFO                                           
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE1 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9C(+0),DISP=SHR                                  
//************ CDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT2..WCDCPLAN(+1),                       -LIM(8)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ CDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE2 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9S(+0),DISP=SHR                                  
//************ SDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT3..WSDCPLAN(+1),                       -LIM(8)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE3 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9N(+0),DISP=SHR                                  
//************ SDC-INFORMATION                                                  
//*                                                                             
//SYSUT2   DD  DSN=&INDUT4..WNDCPLAN(+1),                       -LIM(8)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ SDC-INFORMATION                                                  
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICEGENE4 EXEC PGM=V16459,PARM='ICEGENER/3/'                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//SYSUT1   DD  DSN=&INDIN..WXTR9K(+0),DISP=SHR                                  
//************ CN-INFORMATION                                                   
//*                                                                             
//SYSUT2   DD  DSN=&INDUT5..WNDCPLAN(+1),                       -LIM(8)         
//             DISP=(NEW,CATLG,DELETE),                                         
//************ CN-INFORMATION                                                   
//             DATACLAS=PSEN,                                                   
//             MGMTCLAS=LOW                                                     
