//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//*  CREATES FILE CONTAINING PART AND SDC INFORMATION                           
//*                                                                             
//*  FREQUENCE:    DAILY    RTN WXTRD2                                          
//*                                                                             
//*  RESTART:                NORMAL                                             
//*                          NORMAL                                             
//*                WXTR9S    NORMAL                                             
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTRP09S PROC STPLIB=&INDRTE..LOAD,                                           
//             INDLDC=&W011..LDC,                                               
//             INDSDC=&W011..SDC,                                               
//             INDIN3=&W271..&RTEGRP.,                                          
//             INDIN=&WXTR..WXTRD2,                                             
//             INDUT=&WXTR..WXTRD2                                              
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT84   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDLDC..W01184(+0),DISP=SHR                                 
//         DD  DSN=&INDSDC..W01184(+0),DISP=SHR                                 
//************ W01184 FÖR VARJE SDC, NÄR DET TILLKOMMER DC'N MÅSTE              
//************ DE LÄGGAS TILL HÄR OCH LÄSAS KONKATENERAT                        
//*                                                                             
//SORTOUT  DD  DSN=&&W01184,DISP=(NEW,PASS,DELETE),                             
//************ W01184 SORTED ON PARTNUMBER/IDDC                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT86   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDLDC..W01186(+0),DISP=SHR                                 
//         DD  DSN=&INDSDC..W01186(+0),DISP=SHR                                 
//************ W01186 FÖR VARJE SDC, NÄR DET TILLKOMMER DC'N MÅSTE              
//************ DE LÄGGAS TILL HÄR OCH LÄSAS KONKATENERAT                        
//*                                                                             
//SORTOUT  DD  DSN=&&W01186,DISP=(NEW,PASS,DELETE),                             
//************ W01186 SORTED ON PARTNUMBER/IDDC                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//SORT20   EXEC PGM=SORT                                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=&INDRTE..CONSTANT(WSRTARDC),DISP=SHR                         
//SORTIN   DD  DSN=&INDIN3..W27120(+0),DISP=SHR                                 
//************ W27120 FREKVENSKLASS OCH PRISKLASS / ART/SDC                     
//*                                                                             
//SORTOUT  DD  DSN=&&W27120,DISP=(NEW,PASS,DELETE),                             
//************ W27120 SORTED ON PARTNUMBER/IDDC                                 
//             DATACLAS=PSEB                                                    
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WXTR9S   EXEC PGM=V16459,PARM='WXTR9S/8/'                                     
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//EZTVFM   DD  SPACE=(4096,(100,100))                                           
//SORTMSG  DD  SYSOUT=*                                                         
//WXTR9SD1 DD  DSN=&INDIN..WXTR90(+0),DISP=SHR                                  
//************ CDC-INFORMATION (CDC-LAGERBAND)                                  
//*                                                                             
//WXTR9SD2 DD  DSN=&&W01184,DISP=(OLD,DELETE,DELETE)                            
//************ SDC-INFORMATION                                                  
//*                                                                             
//WXTR9SD3 DD  DSN=&&W01186,DISP=(OLD,DELETE,DELETE)                            
//************ SDC-INFORMATION                                                  
//*                                                                             
//WXTR9SD4 DD  DSN=&&W27120,DISP=(OLD,DELETE,DELETE)                            
//************ SDC-INFORMATION                                                  
//*                                                                             
//WXTR9SD5 DD  DSN=&&TEMP1,DISP=(NEW,PASS,DELETE),                              
//************ TEMP1 W01184 OCH W01186 SAMMANSLAGNA                             
//             DATACLAS=PSEB                                                    
//*                                                                             
//WXTR9SD6 DD  DSN=&INDUT..WXTR9SA(+1),DISP=(NEW,CATLG,DELETE), -LIM(1)         
//************ SDC-INFORMATION (SDC-LAGERBAND)                                  
//             DATACLAS=PSEB,                                                   
//             MGMTCLAS=DEL2                                                    
//*                                                                             
//WXTR9SD7 DD  DSN=&&TEMP2,DISP=(NEW,PASS,DELETE),                              
//************ TEMP1 W01184 OCH W01186 OCH WXTR89 SAMMANSLAGNA                  
//             DATACLAS=PSEB                                                    
//*                                                                             
//WXTR9SD8 DD  DSN=&INDIN..WXTR89(+0),DISP=SHR                                  
//************ REOSAEK                                                          
//*                                                                             
