//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*      WYEAR, STOPPAR WYR001 OM LAGV-ÄNDRING ÄR UTANFÖR GIVEN RAM   *         
//*                                                                   *         
//*      PERIODICITET: WYR001 (EN GÅNG PER ÅR PÅ NYÅR)                *         
//*                                                                   *         
//*      READS WDR2 (WDGX5108)                                        *         
//*                                                                   *         
//*      ÅTERSTART:    NORMAL                                         *         
//*                                                                   *         
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                             
//WYRSTOP1 PROC INDIN=&W540..WYR001,                                            
//             STPLIB=&INDRTE..LOAD                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WYRST1   EXEC PGM=DFSRRC00,                                                   
//             PARM=('&DBB,WYRST1,WYRST1,,00')                                  
//STEPLIB  DD  DSN=&STPLIB,DISP=SHR                                             
//         DD  DSN=&INDUSRL..USERLIB,DISP=SHR                                   
//         DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//         DD  DSN=&INDLIB2..LOAD,DISP=SHR                                      
//         DD  DSN=&INDLIB3..LOAD,DISP=SHR                                      
//         DD  DSN=&INDGRND..LOAD,DISP=SHR                                      
//DFSRESLB DD  DSN=&INDRESL..RESLIB,DISP=SHR                                    
//IMS      DD  DSN=&INDRTE..PSBLIB,DISP=SHR                                     
//         DD  DSN=&INDRTE..DBDLIB,DISP=SHR                                     
//IMSACB   DD  DSN=&INDRTE..ACBLIB,DISP=SHR                                     
//IEFRDER  DD  DUMMY                                                            
//DFSVSAMP DD  DSN=&INDRTE..CONSTANT(VSAM),DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                                         
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//SYSUDUMP DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//IDIHIST  DD  DSN=&INDRTE..FADUMP,DISP=SHR                                     
//IDIREPRT DD  SYSOUT=(D,,DUMP),HOLD=YES                                        
//V16247D3 DD  SYSOUT=*                                     -- POSTSUM          
//WDR2     INCLUDE MEMBER=WDR2                                                  
//*                                                                             
//WYRST1D1 DD  DSN=&INDIN..W54020(+0),DISP=(OLD,KEEP,KEEP)                      
//************** FIL MED PEDALPOSTER TILL REDOVISNINGEN                         
