//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*                                                                   *         
//*  FUNCTION: Compress a normal MVS file containing TEXT data,       *         
//*            and create a zip archive file                          *         
//*            Translation from EBCDIC to ISO codepage will be done   *         
//*            before the text is compressed to make it usable in a   *         
//*            PC environment.                                        *         
//*                                                                   *         
//*  PARAMETERS:                                                      *         
//*                                                                   *         
//*    DSIN:    The name of the MVS file to be zipped.                *         
//*                                                                   *         
//*    FROMCP:  The codepage used in the source MVS file              *         
//*             Examples of useful codepage names are:                *         
//*              IBM-037  = American/English EBCDIC                   *         
//*              IBM-278  = Swedish EBCDIC                            *         
//*                                                                   *         
//*    CONTENT: The name of the content of the zip file.              *         
//*             This should be a short "DOS-file" name in the format  *         
//*             "name.typesuffix" that can be interpreted by the PC   *         
//*             software when the zip file is opened in that          *         
//*             environment.                                          *         
//*             NOTE: The name MUST also be compatible with MVS       *         
//*             file naming standard - Each part should consist of    *         
//*             max 8 CAPITAL letters or digits, each part starting   *         
//*             with a letter. Examples: "REPORT.TXT", "MYDATA.CSV"   *         
//*                                                                   *         
//*    DSOUTZIP: The name of the zip archive file                      *        
//*                                                                   *         
//*    ZIPDISP:  Dispostion for the zip archive file.                 *         
//*              Default is (NEW,CATLG,DELETE)                        *         
//*                                                                   *         
//*    ZIPMGMTC: Management class for the zip archive file.           *         
//*              Default class is DEL2.                               *         
//*                                                                   *         
//*    ZIPDATAC: Data class for the zip arhcive file.                 *         
//*              Default class is PSEN.                               *         
//*                                                                   *         
//*    MAXRC:   The maximum allowed return code from ICONV or INFOZIP *         
//*             A higher return code results in a U0016 abend.        *         
//*             Default: 3                                            *         
//*                                                                   *         
//*  Maintained by dept 923x.                                                   
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//WZ11TZIP PROC DSIN=NULLFILE,DSOUTZIP=NULLFILE,                                
//             ZIPDISP=(NEW,CATLG,DELETE),                                      
//             ZIPDATAC=PSEN,ZIPMGMTC=DEL2,                                     
//             FROMCP=IBM-278,                                                  
//             INDCONT=&SYSUID,CONTENT=DATA.TXT,                                
//             MAXRC=3                                                          
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//BR14     EXEC PGM=IEFBR14                                                     
//DELETE    DD DSNAME=&INDCONT..&CONTENT,DISP=(MOD,DELETE),                     
//             DATACLAS=PSEN,MGMTCLAS=DEL2                                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//*TO CREATE AN EMPTY FILE WITH SAME LRECL, RECFM AS INPUT                      
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//CREMPTY  EXEC PGM=SORT                                                        
//SORTIN    DD DSN=&DSIN,DISP=SHR                                               
//SORTOUT   DD DSN=&INDCONT..&CONTENT,                                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             DATACLAS=&ZIPDATAC,MGMTCLAS=DEL2                                 
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD DSN=&INDRTE..CONSTANT(WINCNONE),DISP=SHR                         
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//ICONV     EXEC PGM=EDCICONV,REGION=7M,                                        
//             PARM=('FROMCODE(&FROMCP),TOCODE(IBM-1047)')                      
//STEPLIB   DD DSNAME=SYS1.CEE.SCEERUN,DISP=SHR                                 
//SYSUT1    DD DSNAME=&DSIN,DISP=SHR                                            
//SYSUT2    DD DSNAME=&INDCONT..&CONTENT,DISP=(MOD,CATLG,DELETE)                
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD DUMMY                                                            
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//INFOZIP EXEC PGM=ZIP,                                                         
//             PARM='/DD:ARCHIVE -avT &CONTENT '                                
//STEPLIB  DD  DSN=F1TEV2.INFOZIP.LOAD,DISP=SHR                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//ARCHIVE  DD  DSN=&DSOUTZIP,DISP=&ZIPDISP,                                     
//             DATACLAS=&ZIPDATAC,MGMTCLAS=&ZIPMGMTC                            
//CONTENT  DD  DSNAME=&INDCONT..&CONTENT,DISP=(OLD,DELETE)                      
//*                                                                             
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
//CHECKRC  IF  (ICONV.RC > &MAXRC OR INFOZIP.RC > &MAXRC) THEN                  
//*                                                                             
//ZABEND  EXEC PGM=ABEND,PARM='1234567890123456'                                
//CEEDUMP  DD  SYSOUT=(D,,DUMP),HOLD=YES                    -- ABEND            
//*                                                                             
//CHECKRC ENDIF                                                                 
