//WPSBMAP PROC IMSGRP=TEST                                                      
//****************************************************************              
//*                                                              *              
//*             EXEKVERING AV DBMAP (PSBMAP)                     *              
//*                                                              *              
//*     SYSIN: PSB I POS 3                                       *              
//*                             ÄGS AV RS                        *              
//****************************************************************              
//MAP     EXEC PGM=PSBMAP                                                       
//*                                                                             
//STEPLIB  DD  DSN=F1IMV1.IMSMAP.LOAD,DISP=SHR                                  
//PSBLIB   DD  DSN=W.&IMSGRP..PSBLIB,DISP=SHR                                   
//         DD  DSN=W.&IMSGRP..PSBLIB,DISP=SHR                                   
//DBDLIB   DD  DSN=W.&IMSGRP..DBDLIB,DISP=SHR                                   
//         DD  DSN=W.&IMSGRP..DBDLIB,DISP=SHR                                   
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//IMSMAP   DD  SYSOUT=*                                                         
