000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300 ID DIVISION.                                                             
000400 PROGRAM-ID.     W2130100.                                                
000500*              PROGRAM CONVERTED BY                                       
000600*              COBOL CONVERSION AID PO 5785-ABJ                           
000700*              CONVERSION DATE 05/25/91 18:38:21.                         
000800*AUTHOR.         TOMAS SVENSSON.                                          
000900*DATE-WRITTEN.   JAN 1978.                                                
001000*REMARKS.                                                                 
001100*        FUNKTION.                                                        
001200*                PROGRAMMET SKRIVER KONTROLLERADE                         
001300*                OCH REDIGERADE TRANSAKTIONER PÅ                          
001400*                TRANSFILERNA W09251, W09253                              
001500*        INDATA.                                                          
001600*                TRANSAKTIONSTYPER   R01, R02, R17                        
001700*        UTDATA.                                                          
001800*                TRANSFIL W09251.    DDNAMN  W09206DE.                    
001900*                TRANSFIL W09253.    DDNAMN  W09206DF.                    
002000     EJECT                                                                
002100 ENVIRONMENT DIVISION.                                                    
002200 INPUT-OUTPUT SECTION.                                                    
002300 FILE-CONTROL.                                                            
002400     SELECT  W09251  ASSIGN TO UT-S-W09206DE.                             
002500     SELECT  W09253  ASSIGN TO UT-S-W09206DF.                             
002600     EJECT                                                                
002700 DATA DIVISION.                                                           
002800 FILE SECTION.                                                            
002900     SKIP2                                                                
003000 FD  W09251                                                               
003100     RECORDING F                                                          
003200     BLOCK CONTAINS 0 RECORDS.                                            
003300     SKIP2                                                                
003400*01  R01-UTPOST -COPY W213R01 -L.                                         
003600     EJECT                                                                
003700     SKIP2                                                                
003800 FD  W09253                                                               
003900     RECORDING V                                                          
004000     BLOCK CONTAINS 0 RECORDS.                                            
004100     SKIP2                                                                
004200*01  R02-UTPOST -COPY W213R02 -L.                                         
004400     SKIP2                                                                
004500*01  R17-UTPOST -COPY W213R17T -L.                                        
004700     EJECT                                                                
004800 WORKING-STORAGE SECTION.                                                 
004810                                                                          
004900*    -- CHECKED BY WY2000                                                 
005100 77  INDENT-I PIC X(40) VALUE                                             
005200     'W2130100 91/05/25 TIME 12.39 VILMAII'.                              
005300***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
005310 01  FL-FIRST                PIC X(1) VALUE 'J'.                          
005400*                                                                         
005500     EJECT                                                                
005600 LINKAGE SECTION.                                                         
005700     SKIP2                                                                
005800 01  TRANS-PARM.                                                          
005900     03  KOD                 PIC X(3).                                    
006000     03  FELTAB OCCURS 100.                                               
006100         05  FELKOD          PIC X(3).                                    
006200         05  FELTEXT         PIC X(15).                                   
006300     03  FILLER              PIC X(3).                                    
006400     03  INPOST              PIC X(100).                                  
006500     03  UTAREA.                                                          
006600*        05  FILLER -COPY W092W001.                                       
006800     SKIP2                                                                
006900         05  UTPOST PIC X(214).                                           
007000     SKIP2                                                                
007100*        05  FILLER -COPY W213R01 -PRE R01- -RED UTPOST.                  
007300     SKIP2                                                                
007400*        05  FILLER -COPY W213R02 -PRE R02- -RED UTPOST.                  
007600     SKIP2                                                                
007700*        05  FILLER -COPY W213R17T -PRE R17- -RED UTPOST.                 
007900     EJECT                                                                
008000 PROCEDURE DIVISION USING TRANS-PARM.                                     
008100     CONTINUE.                                                            
008200     SKIP2                                                                
008300******************************************************************        
008400*    PROGRAMMET ANROPAS DYNAMISKT AV W09206.                     *        
008500******************************************************************        
008600     SKIP2                                                                
008700 STYR SECTION.                                                            
008800     SKIP2                                                                
008801     IF FL-FIRST = 'J'                                                    
008802        OPEN OUTPUT W09251 W09253                                         
008810        MOVE 'N' TO FL-FIRST                                              
008900     END-IF                                                               
009200     IF KOD = 'EOF'                                                       
009300       CLOSE W09251 W09253                                                
009400       GOBACK                                                             
009500     END-IF                                                               
009600     SKIP2                                                                
009700     IF IDPTYP = 'R01'                                                    
009800       WRITE R01-UTPOST FROM R01-W213R01                                  
009900     ELSE                                                                 
010000       IF IDPTYP = 'R02'                                                  
010100         WRITE R02-UTPOST FROM R02-W213R02                                
010200       ELSE                                                               
010300         IF IDPTYP = 'R17'                                                
010400           WRITE R17-UTPOST FROM R17-W213R17T                             
010500         ELSE                                                             
010600           CONTINUE                                                       
010700         END-IF                                                           
010800       END-IF                                                             
010900     END-IF                                                               
011000     GOBACK                                                               
011100     .                                                                    
