010000*                  * CONVERTED BY VILMAII *                               
020000     SKIP3                                                                
030000 ID DIVISION.                                                             
040000 PROGRAM-ID.                 W2216410.                                    
050000*              PROGRAM CONVERTED BY                                       
060000*              COBOL CONVERSION AID PO 5785-ABJ                           
070000*              CONVERSION DATE 05/25/91 19:27:56.                         
080000*AUTHOR.                     IDK, GÖTEBORG.                               
090000*DATE-WRITTEN.               APRIL 1979.                                  
100000*    SKIP3                                                                
110000*REMARKS.                                                                 
120000*        PROGRAMMET ÄR IMS-SUBMODUL TILL W2216400 OCH SKÖTER              
130000*        SAMTLIGA IMS-CALL MOT DATABASEN WDD9.                            
140000     SKIP3                                                                
150000 ENVIRONMENT DIVISION.                                                    
160000 DATA DIVISION.                                                           
170000     EJECT                                                                
180000 WORKING-STORAGE SECTION.                                                 
181005                                                                          
190005*    -- CHECKED BY WY2000                                                 
200000 77  INDENT-I PIC X(40) VALUE                                             
210000     'W2216410 91/05/25 TIME 12.49 VILMAII'.                              
220000***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
230000*                                                                         
230100*01  -COPY WWDCKONS                                                       
230200                                                                          
231006     SKIP3                                                                
232006 01  FELTEXT.                                                             
233006     03  FILLER                  PIC X(8)    VALUE 'FELTEXT'.             
234006     03  FELTEXT-STR             PIC X(72)   VALUE SPACE.                 
240006     SKIP2                                                                
250000 01  RKOD                    PIC S9(4)   VALUE +0    COMP SYNC.           
260000     SKIP1                                                                
270000 01  SUBPROGRAM.                                                          
280000     03  CBLTDLI             PIC X(8)    VALUE 'CBLTDLI'.                 
290000     03  FELLOG              PIC X(8)    VALUE 'FELLOG'.                  
300000     03  ABEND               PIC X(8)    VALUE 'ABEND'.                   
301006     03  WDATKONV            PIC X(8)    VALUE 'WDATKONV'.                
310000     EJECT                                                                
311006*01  -COPY WDATAREA                                                       
312006     EJECT                                                                
320000 01  IMS-WS.                                                              
330000     03  FILLER              PIC X(8)    VALUE 'IMS-WS'.                  
340000     SKIP3                                                                
350000     03  STATUS-WS           PIC X(2).                                    
360000         88  SEGMENT-FINNS               VALUE '  '.                      
370000         88  SEGMENT-SAKNAS              VALUE 'GE'.                      
380000         88  SEGMENT-SLUT                VALUE 'GB'.                      
390000     03  SSA1                PIC X(60).                                   
400000     03  SSA2                PIC X(60).                                   
410000     03  SSA3                PIC X(60).                                   
420000     SKIP3                                                                
420106 01  WS-TIAAVV                    PIC 9(04)   VALUE ZERO.                 
421006     SKIP3                                                                
430000 01  KONSTANTER.                                                          
440000     03  JA                  PIC X       VALUE 'J'.                       
450000     03  NEJ                 PIC X       VALUE 'N'.                       
460000     EJECT                                                                
470000 01  W-WDD901KY-X.                                                        
480000     03  W-IDARTNR           PIC S9(9)   VALUE ZERO  COMP-3.              
480100     03  W-IDDC              PIC X(2)    VALUE SPACE.                     
490000     SKIP1                                                                
500000 01  W-IDLEVNR-X.                                                         
510007     03  W-IDLEVNR           PIC X(5)    VALUE SPACE.                     
520000     SKIP1                                                                
530000 01  W-KDAVROP-X.                                                         
540000     03  W-KDAVROP           PIC S9(1)   VALUE +2    COMP-3.              
550000     SKIP3                                                                
560000 01  GODK-STATUSKODER.                                                    
570000     03  GODK-STATUS OCCURS 10 INDEXED BY STATUS-IX PIC XX.               
580000     EJECT                                                                
590000*    -COPY W0003.                                                         
610000     SKIP3                                                                
620000 01  DLI-IO-AREA             PIC X(120).                                  
630000     EJECT                                                                
640002*01  W221AD01  -COPY WDD901 -PRE LEV- -RED DLI-IO-AREA.                   
660000     EJECT                                                                
670002*01  W221AD02  -COPY WDD902 -PRE BEST- -RED DLI-IO-AREA.                  
690000     EJECT                                                                
700002*01  W221AD03  -COPY WDD905 -PRE AV-   -RED DLI-IO-AREA.                  
720000     EJECT                                                                
730000 LINKAGE SECTION.                                                         
740000     SKIP1                                                                
750002*01  AREA -COPY W221L641 -PRE LINK-                                       
770000     EJECT                                                                
780000*    -COPY W0008     -PRE AD-.                                            
800000         05  FILLER          PIC X.                                       
810000     EJECT                                                                
820000 PROCEDURE DIVISION USING LINK-AREA AD-PCB.                               
830000     ENTRY 'DLITCBL' USING LINK-AREA AD-PCB.                              
840000     SKIP3                                                                
850000     MOVE NEJ                TO LINK-FL-ANROP-OK                          
850100     MOVE WC-CDC-SE          TO W-IDDC                                    
860000     SKIP3                                                                
870000     EVALUATE LINK-KDCALL                                                 
880000     WHEN LINK-LAS-LEVERANSPLAN                                           
890000       PERFORM A-LAS-LEVERANSPLANER                                       
900000     WHEN LINK-LAS-BESTALLNINGSREST                                       
910000       PERFORM B-LAS-BESTALLNINGSREST                                     
920000     WHEN LINK-LAS-AVROP                                                  
930000       PERFORM C-LAS-AVROP                                                
940000     WHEN OTHER                                                           
950000       CONTINUE                                                           
960000     END-EVALUATE                                                         
970000     SKIP3                                                                
980000     MOVE ZERO TO RETURN-CODE                                             
990000     GOBACK                                                               
000000     CONTINUE.                                                            
010000     EJECT                                                                
020000******************************************************************        
030000*                                                                *        
040000*    LÄS LEVERANSPLANER                                          *        
050000*                                                                *        
060000******************************************************************        
070000     SKIP1                                                                
080000 A-LAS-LEVERANSPLANER SECTION.                                            
090000     SKIP1                                                                
100000     MOVE LINK-IDARTNR       TO W-IDARTNR                                 
110000     PERFORM IMS-GET-LEVSEG                                               
120000     SKIP1                                                                
130000     IF  SEGMENT-FINNS                                                    
140000       MOVE JA TO LINK-FL-ANROP-OK                                        
150000     END-IF                                                               
160000     CONTINUE.                                                            
170000     EJECT                                                                
180000******************************************************************        
190000*                                                                *        
200000*    LÄS BESTÄLLNINGSREST                                        *        
210000*                                                                *        
220000******************************************************************        
230000     SKIP1                                                                
240000 B-LAS-BESTALLNINGSREST SECTION.                                          
250000     SKIP1                                                                
260000     PERFORM IMS-GET-BESTSEG                                              
270000     SKIP1                                                                
280000     IF  SEGMENT-FINNS                                                    
290000       MOVE JA TO LINK-FL-ANROP-OK                                        
300000       MOVE BEST-IDLEVNR  TO LINK-IDLEVNR                                 
310000       MOVE BEST-KVBR     TO LINK-KVBR                                    
320000     END-IF                                                               
330000     CONTINUE.                                                            
340000     EJECT                                                                
350000******************************************************************        
360000*                                                                *        
370000*    LÄS AVROP                                                   *        
380000*                                                                *        
390000******************************************************************        
400000     SKIP1                                                                
410000 C-LAS-AVROP SECTION.                                                     
420001     SKIP1                                                                
421001     MOVE LINK-IDLEVNR TO W-IDLEVNR                                       
430000     PERFORM IMS-GET-AVSEG                                                
440000     SKIP1                                                                
450000     IF  SEGMENT-FINNS                                                    
460000       MOVE JA TO LINK-FL-ANROP-OK                                        
461006       MOVE AV-KVAVROP           TO LINK-KVAVROP                          
480006       MOVE AV-TIAVRDAT-DISP     TO DAT-I-TIDATUM                         
481006       MOVE 'AAMMDD'             TO DAT-KDDATFORM                         
482006       CALL WDATKONV USING          DAT-KDDATFORM                         
483006                                    DAT-I-TIDATUM                         
484006                                    DAT-O-TIDATUM                         
485006                                    DAT-KDSVAR                            
486006       IF DAT-KDSVAR-FEL                                                  
487006         MOVE 'FEL VID ANROP TILL DATKONV 2' TO FELTEXT-STR               
488006         CALL FELLOG                                                      
489006       ELSE                                                               
489106         MOVE DAT-TIAAVV-GRP     TO WS-TIAAVV                             
489206         MOVE WS-TIAAVV          TO LINK-TIAVROP-DISP                     
489306       END-IF                                                             
490000     END-IF                                                               
500000     CONTINUE.                                                            
510000     EJECT                                                                
520000******************************************************************        
530000*                                                                *        
540000*    LÄS LEVERANSSEGMENT                                         *        
550000*                                                                *        
560000******************************************************************        
570000     SKIP1                                                                
580000 IMS-GET-LEVSEG SECTION.                                                  
590000     SKIP1                                                                
600003     STRING 'WLINLB01(WDD901KY =' W-WDD901KY-X ')'                        
610000     DELIMITED BY SIZE INTO SSA1                                          
620000     MOVE '  GE'             TO GODK-STATUSKODER                          
630000     CALL CBLTDLI USING GU AD-PCB DLI-IO-AREA SSA1                        
640000     MOVE AD-STATUS-CODE TO STATUS-WS                                     
650000     PERFORM IMS-STATUSKONTROLL                                           
660000     CONTINUE.                                                            
670000     EJECT                                                                
680000******************************************************************        
690000*                                                                *        
700000*    LÄS BESTÄLLNINGSRESTSEGMENT                                 *        
710000*                                                                *        
720000******************************************************************        
730000     SKIP1                                                                
740000 IMS-GET-BESTSEG SECTION.                                                 
750000     SKIP1                                                                
760003     MOVE 'WLINLB11'  TO SSA1                                             
770000     MOVE '  GEGB'   TO GODK-STATUSKODER                                  
780000     CALL CBLTDLI USING GNP AD-PCB DLI-IO-AREA SSA1                       
790000     MOVE AD-STATUS-CODE TO STATUS-WS                                     
800000     PERFORM IMS-STATUSKONTROLL                                           
810000     CONTINUE.                                                            
820000     EJECT                                                                
830000******************************************************************        
840000*                                                                *        
850000*    LÄS AVROPSSEGMENT                                           *        
860000*                                                                *        
870000******************************************************************        
880000     SKIP1                                                                
890000 IMS-GET-AVSEG SECTION.                                                   
900000     SKIP1                                                                
920003     STRING 'WLINLB11(IDLEVNR  =' W-IDLEVNR-X ')'                         
930001     DELIMITED BY SIZE INTO SSA1                                          
931003     STRING 'WLINLB23(KDAVROP  =' W-KDAVROP-X ')'                         
932001     DELIMITED BY SIZE INTO SSA2                                          
940000     MOVE '  GEGB'           TO GODK-STATUSKODER                          
950000     CALL CBLTDLI USING GNP AD-PCB DLI-IO-AREA SSA1 SSA2                  
960000     MOVE AD-STATUS-CODE TO STATUS-WS                                     
970000     PERFORM IMS-STATUSKONTROLL                                           
980000     CONTINUE.                                                            
990000     EJECT                                                                
000000 IMS-STATUSKONTROLL SECTION.                                              
010000     SKIP1                                                                
020000     SET STATUS-IX           TO 1                                         
030000     SEARCH GODK-STATUS AT END                                            
040000     DISPLAY 'IMS-WS  ' IMS-WS                                            
050000     CALL FELLOG                                                          
060000     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS                             
070000     CONTINUE                                                             
080000       END-SEARCH                                                         
090000     CONTINUE                                                             
100000            CONTINUE.                                                     
110000     SKIP1                                                                
120000 IMS-UT. EXIT.                                                            
130000     CONTINUE.                                                            
