000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300     SKIP3                                                                
000400 ID  DIVISION.                                                            
000500     SKIP2                                                                
000600 PROGRAM-ID.    W2217610.                                                 
000700*              PROGRAM CONVERTED BY                                       
000800*              COBOL CONVERSION AID PO 5785-ABJ                           
000900*              CONVERSION DATE 05/25/91 19:30:44.                         
001000*AUTHOR.        MONICA.                                                   
001100*DATE-WRITTEN.  NOVEMBER 1980.                                            
001200                                                                          
001300*REMARKS*********************************************************         
001400*                                                               *         
001500*    FUNKTION:                                                  *         
001600*                                                               *         
001700*        PROGRAMMET ÄR ETT SUBPROGRAM TILL W2217600 OCH         *         
001800*        SKÖTER SAMTLIGA IMS-CALL MOT DATABASERNA:              *         
001900*                                    FYSISKT     LOGISKT        *         
002000*                                       WDD3      WLBENA        *         
002100*                                                               *         
002200*****************************************************************         
002300     EJECT                                                                
002400 ENVIRONMENT DIVISION.                                                    
002500     EJECT                                                                
002600 DATA DIVISION.                                                           
002700     SKIP2                                                                
002800 WORKING-STORAGE SECTION.                                                 
002810                                                                          
002900*    -- CHECKED BY WY2000                                                 
003000 77  INDENT-I PIC X(40) VALUE                                             
003100     'W2217610 91/05/25 TIME 12.50 VILMAII'.                              
003200***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
003300*                                                                         
003400     SKIP2                                                                
003500*****************************************************************         
003600*    GENERERAT PROGRAM-NAMN                                     *         
003700*****************************************************************         
003800                                                                          
003900 77  PROGRAM-NAMN                REDEFINES INDENT-I                       
004000                                 PIC X(8).                                
004100     SKIP2                                                                
004200*****************************************************************         
004300*    GENERELLA KONSTANTER                                       *         
004400*****************************************************************         
004500                                                                          
004600 77  JA                          PIC X(1)    VALUE 'J'.                   
004700 77  NEJ                         PIC X(1)    VALUE 'N'.                   
004800     SKIP2                                                                
004900 77  LAES-BENAEMNING             PIC S9(3)   VALUE +761.                  
005000 77  RKOD                        PIC S9(4)   VALUE +0 COMP SYNC.          
005100     SKIP2                                                                
005200 01  DYNAMISKA-SUBPROGRAM.                                                
005300     03  CBLTDLI                 PIC X(8)    VALUE 'CBLTDLI'.             
005400     03  FELLOG                  PIC X(8)    VALUE 'FELLOG'.              
005500     03  ABEND                   PIC X(8)    VALUE 'ABEND'.               
005600     EJECT                                                                
005700 01  IMS-WS.                                                              
005800     03  FILLER                  PIC X(8)    VALUE 'IMS-WS'.              
005900     SKIP2                                                                
006000     03  STATUS-WS               PIC XX.                                  
006100         88  SEGMENT-FINNS                   VALUE '  '.                  
006200         88  SEGMENT-SAKNAS                  VALUE 'GE'.                  
006300     SKIP2                                                                
006400     03  SSA1                    PIC X(60).                               
006500     SKIP2                                                                
006600 01  W-IDARTNR-X.                                                         
006700     03  W-IDARTNR               PIC S9(9)   COMP-3.                      
006800     SKIP2                                                                
006900 01  W-IDSKYLT-X.                                                         
007000     03  W-IDSKYLT            PIC X(3)  VALUE SPACE.                      
007100     SKIP2                                                                
007200 01  GODK-STATUSKODER.                                                    
007300     03  GODK-STATUS OCCURS 10 INDEXED BY STATUS-IX PIC XX.               
007400     EJECT                                                                
007500*01  -COPY W0003.                                                         
007700     EJECT                                                                
007800 01  DLI-IO-AREA             PIC X(120).                                  
007900     SKIP2                                                                
008000*01  WLBENA01 -COPY WDD301 -PRE BENA01-  -RED DLI-IO-AREA.                
008200     EJECT                                                                
008300     SKIP2                                                                
008400*01  WLBENA11 -COPY WDD311 -PRE BENA11-  -RED DLI-IO-AREA.                
008600     EJECT                                                                
008700 LINKAGE SECTION.                                                         
008800*01  AREA -COPY W221L761 -PRE LINK-.                                      
009000     EJECT                                                                
009100*01  -COPY W0008 -PRE BENA-                                               
009300         05  FILLER          PIC X.                                       
009400     EJECT                                                                
009500 PROCEDURE DIVISION USING LINK-AREA BENA-PCB.                             
009600     ENTRY 'DLITCBL' USING LINK-AREA BENA-PCB.                            
009700     SKIP3                                                                
009800     EVALUATE LINK-KDCALL                                                 
009900     WHEN LAES-BENAEMNING                                                 
010000       PERFORM A-LAES-BENAEMNING                                          
010100     WHEN OTHER                                                           
010200       MOVE +30 TO RKOD                                                   
010300       DISPLAY '***  W2217610  FELAKTIGT CALL-VÄRDE'                      
010400       CALL ABEND USING RKOD                                              
010500     END-EVALUATE                                                         
010600     MOVE ZERO TO RETURN-CODE                                             
010700     GOBACK                                                               
010800     CONTINUE.                                                            
010900     EJECT                                                                
011000 A-LAES-BENAEMNING SECTION.                                               
011100     SKIP2                                                                
011200     MOVE LINK-IDARTNR TO W-IDARTNR                                       
011300     PERFORM IMS-GET-BENA01-CSEQ                                          
011400     MOVE 'S  '  TO W-IDSKYLT                                             
011500     PERFORM IMS-GET-BENA11-CSEQ                                          
011600     MOVE BENA11-TEXT-BEART TO LINK-BEART-SVE                             
011700     CONTINUE.                                                            
011800     EJECT                                                                
011900 IMS-GET-BENA01-CSEQ SECTION.                                             
012000     SKIP1                                                                
012100     STRING 'WLBENA01(WDD3BSEQ =' W-IDARTNR-X ')'                         
012200            DELIMITED BY SIZE INTO SSA1                                   
012300     MOVE '  ' TO GODK-STATUSKODER                                        
012400     CALL CBLTDLI USING GU BENA-PCB DLI-IO-AREA SSA1                      
012500     MOVE BENA-STATUS-CODE TO STATUS-WS                                   
012600     PERFORM IMS-STATUSKONTROLL                                           
012700     CONTINUE.                                                            
012800     EJECT                                                                
012900 IMS-GET-BENA11-CSEQ SECTION.                                             
013000     SKIP1                                                                
013100     STRING 'WLBENA11(IDSKYLT  =' W-IDSKYLT-X ')'                         
013200            DELIMITED BY SIZE INTO SSA1                                   
013300     MOVE '  ' TO GODK-STATUSKODER                                        
013400     CALL CBLTDLI USING GNP BENA-PCB DLI-IO-AREA SSA1                     
013500     MOVE BENA-STATUS-CODE TO STATUS-WS                                   
013600     PERFORM IMS-STATUSKONTROLL                                           
013700     CONTINUE.                                                            
013800     EJECT                                                                
013900 IMS-STATUSKONTROLL SECTION.                                              
014000     SKIP2                                                                
014100     SET STATUS-IX TO 1                                                   
014200     SEARCH GODK-STATUS AT END                                            
014300     CALL FELLOG                                                          
014400     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS                             
014500     CONTINUE                                                             
014600     END-SEARCH                                                           
014700     CONTINUE                                                             
014800            CONTINUE.                                                     
014900 IMS-UT.                                                                  
015000     EXIT.                                                                
015100     .                                                                    
