000100     SKIP3                                                                
000200 ID DIVISION.                                                             
000300 PROGRAM-ID.                 W2211600.                                    
000400*AUTHOR.                     IDK, GÖTEBORG.                               
000500*DATE-WRITTEN.               NOV 1978.                                    
000600*    SKIP3                                                                
000700*REMARKS.                                                                 
000800     SKIP1                                                                
000900*               BMP                                                       
001000*    PROGRAMMET BERÄKNAR INLEVERANS-, FRYS- OCH BESTÄLLNINGSTID.          
001100*    INPUT ÄR HÄNDELSEKOD '2213' PÅ HÄNDELSEREGISTER SOM TALAR OM         
001200*    ATT NÅGON AV DE INGÅENDE PARAMETRARNA I BERÄKNINGSFORMLERNA          
001300*    HAR BLIVIT UPPDATERAD. HÄNDELSETRANSARNA DELETAS EFTER               
001400*    LÄSNING.                                                             
001500*    I DE FALL SOM OMRÄKNING AV BESTÄLLNINGSTID ELLER FRYSTID GER         
001600*    NYTT VÄRDE SKAPAS HÄNDELSETRANS '2204-58' FÖR KONTROLL AV            
001700*    LEVERANSPLAN.                                                        
001800     SKIP3                                                                
001900*    SUBPROGRAM.                                                          
002000     SKIP1                                                                
002100*        W2211610        HANDHAR SAMTLIGA IMS-ANROP MOT DATABAS.          
002101*                                                                         
002102*                                                                         
002110*    ÄNDRINGAR: E-TRACKER 6490267                                         
002120*               ÄNDRA ANTAL INLEV-DAGAR FÖR FPTYP 06 OCH 07 TILL          
002130*               ATTA VARA 5 DAGAR.  (MOTSV. ÄNDR I W2214000)              
002140*                                                                         
002200     SKIP3                                                                
002300 ENVIRONMENT DIVISION.                                                    
002400     SKIP3                                                                
002500 DATA DIVISION.                                                           
002600     EJECT                                                                
002700 WORKING-STORAGE SECTION.                                                 
002800                                                                          
002900*    -- CHECKED BY WY2000                                                 
003000 77  INDENT-I PIC X(40) VALUE                                             
003100     'W2211600 91/05/25 TIME 12.42 VILMAII'.                              
003200***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
003300*                                                                         
003400 77  IDPGM                       PIC X(8)    VALUE 'W2211600'.            
003500 01  CHKP-VAR.                                                            
003600 03  CHKP-MSG-IO-AREA-LENGTH     PIC S9(9)   VALUE +32 COMP SYNC.         
003700 03  CHKP-MSG-IO-AREA            PIC X(32)   VALUE SPACE.                 
003800 03  CHKP-AREA-LENGTH            PIC S9(9)   VALUE +32 COMP SYNC.         
003900 03  CHKP-AREA                   PIC X(32)   VALUE SPACE.                 
004000 03  CHKP-ANT                    PIC S9(3)   VALUE +0   COMP-3.           
004100 03  CHKP-MAX                    PIC S9(3)   VALUE +500 COMP-3.           
004200 01  FELTEXT.                                                             
004300     03  FILLER                  PIC X(8)    VALUE 'FELTEXT'.             
004400     03  FELTEXT-STR             PIC X(72)   VALUE SPACE.                 
004500     SKIP1                                                                
004600 01  KONSTANTER.                                                          
004700     03  JA                  PIC X       VALUE 'J'.                       
004800     03  NEJ                 PIC X       VALUE 'N'.                       
004900     SKIP1                                                                
005000 01  DYNAMISKA-SUBPROGRAM.                                                
005100     03  W2211610            PIC X(8)    VALUE 'W2211610'.                
005200     03  CBLTDLI                 PIC X(8)    VALUE 'CBLTDLI '.            
005300     03  FELLOG                  PIC X(8)    VALUE 'FELLOG  '.            
005400     SKIP1                                                                
005500 01  ARBETSFALT.                                                          
005600     03  W-KVDAGAR-KONTR     PIC S9(3).                                   
005700     03  W-KVDAGAR-FORP      PIC S9(3).                                   
005800     03  W-KVDAGAR-INLAGG    PIC S9(3).                                   
005900     03  W-KVVECKOR-FT       PIC S9(3).                                   
006000     03  W-KVVECKOR-BT       PIC S9(3).                                   
006100     03  W-KVDAGAR-FFH       PIC S9(3).                                   
006200     03  W-KVVECKOR-TEMP1    PIC S9(3).                                   
006300     03  W-KVVECKOR-TEMP2    PIC S9(3).                                   
006500     EJECT                                                                
006600*    --- STATUS-KOD FRÅN IMS                                              
006700 01  STATUS-WS                   PIC XX.                                  
006800     88  SEGMENT-FINNS                       VALUE '  '.                  
006900     88  SEGMENT-FINNS-REDAN                 VALUE 'II'.                  
007000     88  SEGMENT-SAKNAS                      VALUE 'GE'.                  
007100     88  SEGMENT-SLUT                        VALUE 'GB'.                  
007200     88  IMS-EJ-OK                           VALUE 'XD'.                  
007300     SKIP2                                                                
007400 01  GODK-STATUSKODER.                                                    
007500     03  GODK-STATUS OCCURS 5 INDEXED BY STATUS-IX PIC XX.                
007600     EJECT                                                                
007700*    --- IMS FUNKTIONSKODER                                               
007800*01  -COPY W0003                                                          
007900     EJECT                                                                
008000*01  AREA -COPY W221L161   -PRE IMSLNK1-                                  
008100     EJECT                                                                
008200*01  AREA -COPY W221L162   -PRE IMSLNK2-                                  
008300     EJECT                                                                
008600 LINKAGE SECTION.                                                         
008700                                                                          
008800*01  -COPY W0009   -PRE MSG-                                              
008900     EJECT                                                                
009000*    -COPY W0008 -PRE AA-                                                 
009100         05  FILLER          PIC X.                                       
009200*    -COPY W0008 -PRE AA2-                                                
009300         05  FILLER          PIC X.                                       
009400*    -COPY W0008 -PRE AJ1-                                                
009500         05  FILLER          PIC X.                                       
009600*    -COPY W0008 -PRE AJ2-                                                
009700         05  FILLER          PIC X.                                       
009800     EJECT                                                                
009900 PROCEDURE DIVISION  USING MSG-PCB AA-PCB AA2-PCB AJ1-PCB AJ2-PCB.        
010000     ENTRY 'DLITCBL' USING MSG-PCB AA-PCB AA2-PCB AJ1-PCB AJ2-PCB.        
010100     SKIP3                                                                
010200     PERFORM IMS-RESTART                                                  
010300                                                                          
010400     MOVE +2 TO IMSLNK2-KDCALL                                            
010500     CALL W2211610 USING IMSLNK2-W221L162 AA-PCB AA2-PCB                  
010600                         AJ1-PCB AJ2-PCB                                  
010700     ADD +1 TO CHKP-ANT                                                   
010800     SKIP1                                                                
010900     PERFORM UNTIL                                                        
011000      NOT ( IMSLNK2-FLJANEJ-ANROP = JA )                                  
011100       IF CHKP-ANT > CHKP-MAX                                             
011200         PERFORM X-TAG-CHECKPOINT                                         
011300       END-IF                                                             
011400       MOVE IMSLNK2-IDARTNR TO IMSLNK1-IDARTNR                            
011500       MOVE +1 TO IMSLNK1-KDCALL                                          
011600       CALL W2211610 USING IMSLNK1-AREA AA-PCB AA2-PCB                    
011700                           AJ1-PCB AJ2-PCB                                
011800       SKIP1                                                              
011900       IF IMSLNK1-FLJANEJ-ANROP = JA                                      
012000         PERFORM A-BERAKNA-TIDER                                          
012100         PERFORM B-UPPDATERA-HANDELSEREG                                  
012200         PERFORM C-UPPDATERA-ARTREG                                       
012300       ELSE                                                               
012400         DISPLAY 'ARTNR' IMSLNK1-IDARTNR ' EJ BEHANDLAT'                  
012500       END-IF                                                             
012600       SKIP1                                                              
012700       MOVE +2 TO IMSLNK2-KDCALL                                          
012800       CALL W2211610 USING IMSLNK2-W221L162 AA-PCB AA2-PCB                
012900                           AJ1-PCB AJ2-PCB                                
013000       ADD +1 TO CHKP-ANT                                                 
013100     END-PERFORM                                                          
013200     SKIP1                                                                
013300     MOVE ZERO TO RETURN-CODE                                             
013400     GOBACK                                                               
013500     .                                                                    
013600     EJECT                                                                
013700 A-BERAKNA-TIDER SECTION.                                                 
013800     SKIP1                                                                
013900     IF IMSLNK1-KDHF > ZERO                                               
014000     OR IMSLNK1-IDLEVNR = '1002 '                                         
014100       MOVE ZERO TO IMSLNK1-KVDAGAR-TT                                    
014200       MOVE ZERO TO IMSLNK1-KVDAGAR-INLEV                                 
014300     ELSE                                                                 
014400***    MOVE +1 TO W-KVDAGAR-KONTR                                         
014500       MOVE ZERO TO W-KVDAGAR-KONTR                                       
014600                    W-KVDAGAR-FORP                                        
014700                    W-KVDAGAR-INLAGG                                      
014800       SKIP1                                                              
015400       IF  IMSLNK1-BEFT  = +57                                            
015500         MOVE +15 TO W-KVDAGAR-FORP                                       
015600       END-IF                                                             
017301                                                                          
017303       IF  IMSLNK1-BEFT  = +47 OR                                         
017304           IMSLNK1-BEFT  = +49                                            
017305         MOVE +7 TO W-KVDAGAR-FORP                                        
017306       END-IF                                                             
017312                                                                          
017317       IF  IMSLNK1-BEFT  =  +6                                            
017318       OR  IMSLNK1-BEFT  =  +9                                            
017319       OR  IMSLNK1-BEFT  = +20                                            
017323       OR  IMSLNK1-BEFT  = +38                                            
017326       OR  IMSLNK1-BEFT  = +41                                            
017327       OR  IMSLNK1-BEFT  = +42                                            
017328       OR  IMSLNK1-BEFT  = +43                                            
017332       OR  IMSLNK1-BEFT  = +66                                            
017334       OR  IMSLNK1-BEFT  = +79                                            
017336         MOVE +5 TO W-KVDAGAR-FORP                                        
017340       END-IF                                                             
017400                                                                          
017600       IF  IMSLNK1-BEFT  = +10                                            
017601       OR (IMSLNK1-BEFT >= +12 AND <= +16)                                
017602       OR  IMSLNK1-BEFT  = +18                                            
017603       OR  IMSLNK1-BEFT  = +19                                            
017605       OR (IMSLNK1-BEFT >= +21 AND <= +28)                                
017610       OR (IMSLNK1-BEFT >= +32 AND <= +37)                                
017900       OR  IMSLNK1-BEFT  = +39                                            
018000       OR (IMSLNK1-BEFT >= +50 AND <= +54)                                
018100       OR  IMSLNK1-BEFT  = +56                                            
018200       OR (IMSLNK1-BEFT >= +58 AND <= +65)                                
018410       OR  IMSLNK1-BEFT  = +67                                            
018500       OR  IMSLNK1-BEFT  = +68                                            
018600       OR  IMSLNK1-BEFT  = +69                                            
019000       OR (IMSLNK1-BEFT >= +81 AND <= +89)                                
019100         MOVE +4 TO W-KVDAGAR-FORP                                        
019200       END-IF                                                             
019300                                                                          
019400       IF  IMSLNK1-BEFT  =  +7                                            
021200       OR  IMSLNK1-BEFT  =  +8                                            
021301       OR  IMSLNK1-BEFT  = +44                                            
021302       OR  IMSLNK1-BEFT  = +48                                            
021303       OR  IMSLNK1-BEFT  = +55                                            
021304       OR  IMSLNK1-BEFT  = +74                                            
021305       OR  IMSLNK1-BEFT  = +77                                            
021306       OR  IMSLNK1-BEFT  = +78                                            
021307       OR  IMSLNK1-BEFT  = +97                                            
021308       OR  IMSLNK1-BEFT  = +98                                            
021309         MOVE +3 TO W-KVDAGAR-FORP                                        
021310       END-IF                                                             
021311                                                                          
021312       IF  IMSLNK1-BEFT  = +29                                            
021313       OR  IMSLNK1-BEFT  = +30                                            
021320       OR  IMSLNK1-BEFT  = +31                                            
021330       OR  IMSLNK1-BEFT  = +73                                            
022100       OR  IMSLNK1-BEFT  = +90                                            
022101       OR  IMSLNK1-BEFT  = +91                                            
022102         MOVE +2 TO W-KVDAGAR-FORP                                        
022103       END-IF                                                             
022104                                                                          
022105       IF  IMSLNK1-BEFT <=  +5                                            
022106       OR  IMSLNK1-BEFT  = +11                                            
022107       OR  IMSLNK1-BEFT  = +17                                            
022109       OR (IMSLNK1-BEFT >= +70 AND <= +72)                                
022112       OR  IMSLNK1-BEFT  = +80                                            
022200       OR  IMSLNK1-BEFT  = +92                                            
022300       OR  IMSLNK1-BEFT  = +94                                            
022400       OR  IMSLNK1-BEFT  = +96                                            
022500       OR  IMSLNK1-BEFT  = +99                                            
022600         MOVE +1 TO W-KVDAGAR-FORP                                        
022700       END-IF                                                             
022800                                                                          
023000       ADD W-KVDAGAR-KONTR W-KVDAGAR-FORP                                 
023100                           GIVING IMSLNK1-KVDAGAR-INLEV                   
023200     END-IF                                                               
023300     SKIP1                                                                
023400                                                                          
023500     COMPUTE W-KVDAGAR-FFH =                                              
023600              IMSLNK1-KVDAGAR-TT + IMSLNK1-KVDAGAR-INLEV                  
023700                                                                          
023800     COMPUTE W-KVVECKOR-FT ROUNDED =                                      
023900            IMSLNK1-KVVECKOR-LT + (W-KVDAGAR-FFH / 5)                     
024000                                                                          
024100     COMPUTE W-KVVECKOR-BT ROUNDED =                                      
024200            IMSLNK1-KVVECKOR-AT + (W-KVDAGAR-FFH / 5) + 2                 
024300                                                                          
024400     IF IMSLNK1-KDAVT = ZERO                                              
024500       COMPUTE IMSLNK1-KVVECKOR-BT = IMSLNK1-KVVECKOR-BT + 4              
024600     END-IF                                                               
024700     .                                                                    
024800     EJECT                                                                
024900 B-UPPDATERA-HANDELSEREG SECTION.                                         
025000     SKIP1                                                                
025100     IF W-KVVECKOR-FT NOT = IMSLNK1-KVVECKOR-FT                           
025200     OR W-KVVECKOR-BT NOT = IMSLNK1-KVVECKOR-BT                           
025300     OR W-KVDAGAR-FFH NOT = IMSLNK1-KVDAGAR-FFH                           
025400       MOVE W-KVVECKOR-FT   TO IMSLNK1-KVVECKOR-FT                        
025500       MOVE W-KVVECKOR-BT   TO IMSLNK1-KVVECKOR-BT                        
025600       MOVE W-KVDAGAR-FFH   TO IMSLNK1-KVDAGAR-FFH                        
025700       MOVE +4              TO IMSLNK2-KDCALL                             
025800       MOVE '2203'          TO IMSLNK2-IDHTYP                             
025900       MOVE IMSLNK1-IDARTNR TO IMSLNK2-IDARTNR                            
026000       MOVE '58'            TO IMSLNK2-KDLPORS                            
026100       CALL W2211610 USING IMSLNK2-AREA AA-PCB AA2-PCB                    
026200                           AJ1-PCB AJ2-PCB                                
026300       ADD +1 TO CHKP-ANT                                                 
026400     END-IF                                                               
026500     .                                                                    
026600     EJECT                                                                
026700 C-UPPDATERA-ARTREG SECTION.                                              
026800     SKIP1                                                                
026900     MOVE +3 TO IMSLNK1-KDCALL                                            
027000     CALL W2211610 USING IMSLNK1-AREA AA-PCB AA2-PCB                      
027100                         AJ1-PCB AJ2-PCB                                  
027200     ADD +1 TO CHKP-ANT                                                   
027300     .                                                                    
027400     EJECT                                                                
027500 X-TAG-CHECKPOINT   SECTION.                                              
027600                                                                          
027700* --- VID CHECKPOINTTAGGNING SÅ TAPPAR MAN GN-POSITION I BASEN            
027800* --- SPARA DATABASNYCKLAR OM DET BEHÖVS                                  
027900     PERFORM IMS-CHECKPOINT                                               
028000     MOVE ZERO TO CHKP-ANT                                                
028100* --- LÄS OM DATABAS OM DET BEHÖVS                                        
028200     MOVE ZERO TO IMSLNK2-KDCALL                                          
028300     CALL W2211610 USING IMSLNK2-W221L162 AA-PCB AA2-PCB                  
028400                         AJ1-PCB AJ2-PCB                                  
028500     .                                                                    
028600     EJECT                                                                
028700 IMS-RESTART SECTION.                                                     
028800     SKIP2                                                                
028900     MOVE SPACE TO CHKP-MSG-IO-AREA                                       
029000     MOVE '  ' TO GODK-STATUSKODER                                        
029100     CALL CBLTDLI USING XRST MSG-PCB                                      
029200                        CHKP-MSG-IO-AREA-LENGTH CHKP-MSG-IO-AREA          
029300                        CHKP-AREA-LENGTH CHKP-AREA                        
029400     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
029500     PERFORM IMS-STATUSKONTROLL                                           
029600     .                                                                    
029700     EJECT                                                                
029800 IMS-CHECKPOINT SECTION.                                                  
029900     SKIP2                                                                
030000     MOVE SPACE TO CHKP-MSG-IO-AREA                                       
030100     MOVE '  XD' TO GODK-STATUSKODER                                      
030200     CALL CBLTDLI USING CHKP MSG-PCB                                      
030300                        CHKP-MSG-IO-AREA-LENGTH CHKP-MSG-IO-AREA          
030400                        CHKP-AREA-LENGTH CHKP-AREA                        
030500     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
030600     PERFORM IMS-STATUSKONTROLL                                           
030700                                                                          
030800     IF IMS-EJ-OK                                                         
030900       MOVE 'IMS-KONTROLLREGION EJ TILLGÄNGLIG' TO FELTEXT-STR            
031000       DISPLAY FELTEXT                                                    
031100       CALL FELLOG                                                        
031200     END-IF                                                               
031300     .                                                                    
031400     EJECT                                                                
031500 IMS-STATUSKONTROLL SECTION.                                              
031600     SKIP2                                                                
031700     SET STATUS-IX TO 1                                                   
031800     SEARCH GODK-STATUS                                                   
031900       AT END                                                             
032000         STRING ' FELAKTIG STATUSKOD FRÅN IMS: ' STATUS-WS                
032100           DELIMITED BY SIZE INTO FELTEXT                                 
032200         DISPLAY FELTEXT                                                  
032300         CALL FELLOG                                                      
032400       WHEN GODK-STATUS (STATUS-IX) = STATUS-WS                           
032500         CONTINUE                                                         
032600     END-SEARCH                                                           
032700     .                                                                    
