000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300     SKIP2                                                                
000400 ID DIVISION.                                                             
000500 PROGRAM-ID.                 W2613410.                                    
000600*              PROGRAM CONVERTED BY                                       
000700*              COBOL CONVERSION AID PO 5785-ABJ                           
000800*              CONVERSION DATE 05/25/91 20:49:01.                         
000900*AUTHOR.                     IDK INGVAR CARLSSON.                         
001000*DATE-WRITTEN.               MARS 1979.                                   
001100*    SKIP3                                                                
001200*REMARKS.                                                                 
001300                                                                          
001400*    FUNKTION.                                                            
001500*        PROGRAMMET ÄR ETT SUBPROGRAM TILL W2613400                       
001600*        SOM SKÖTER OM SAMTLIGA IMS-CALL ÅT DETSAMMA                      
001700*        MOT LEVERANSPLANEREGISTRET, LOGISKT (WLINLB),                    
001800*        SAMT LÄSER BENÄMNING (WDD3),LOGISKT (WLBENA).                    
001900*        PROGRAMMET LÄSER      WDD8                                       
002000     SKIP3                                                                
002100 ENVIRONMENT DIVISION.                                                    
002200     SKIP3                                                                
002300 DATA DIVISION.                                                           
002400     EJECT                                                                
002500 WORKING-STORAGE SECTION.                                                 
002600                                                                          
002700*    -- CHECKED BY WY2000                                                 
002800 77  INDENT-I PIC X(40) VALUE                                             
002900     'W2613410 91/05/25 TIME 13.21 VILMAII'.                              
003000***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
003100*                                                                         
003200     SKIP2                                                                
003300*--------------------------------------- NYCKLAR                          
003400 01  W-IDARTNR-X.                                                         
003500     05  W-IDARTNR           PIC S9(9)               COMP-3.              
003600                                                                          
003700 01  W-WDD901KY-X.                                                        
003800     05  W-IDARTNR-D9        PIC S9(9)               COMP-3.              
003900     05  W-IDDC-D9           PIC  X(2).                                   
004000                                                                          
004100 01  W-IDSKYLT-X.                                                         
004200     05  W-IDSKYLT           PIC X(3)        VALUE 'S  '.                 
004300     SKIP3                                                                
004400 01  NYCKLAR-TILL-WDD811.                                                 
004500     03  W-WDD811KY-X.                                                    
004600         05  W-WDD811KY          PIC X(17)    VALUE SPACE.                
004700     03  W-IDDC-X.                                                        
004800         05  W-IDDC      PIC X(2)    VALUE SPACE.                         
004900     03  W-ADBUFFOMR-X.                                                   
005000         05  W-ADBUFFOMR PIC S9(3)   VALUE ZERO  COMP-3.                  
005100     03  W-ADBUFFGANG-X.                                                  
005200         05  W-ADBUFFGANG PIC S9(3)  VALUE ZERO  COMP-3.                  
005300                                                                          
005400 01  ARBAREA.                                                             
005500     03  WS-KVBUFF               PIC S9(7)   VALUE ZERO COMP-3.           
005600                                                                          
005700*--------------------------------------- KONSTANTER                       
005800 01  KONSTANTER.                                                          
005900     05  JA                  PIC X       VALUE 'J'.                       
006000     05  NEJ                 PIC X       VALUE 'N'.                       
006100     05  LAS-ART-INFO        PIC S9(3)   VALUE +5    COMP-3.              
006101                                                                          
006110*01  -COPY WWDCKONS                                                       
006200     SKIP3                                                                
006300*--------------------------------------- GENERELLA SUBRUTINER             
006400 01  SUBPROGRAM.                                                          
006500     05  CBLTDLI             PIC X(8)    VALUE 'CBLTDLI '.                
006600     05  FELLOG              PIC X(8)    VALUE 'FELLOG  '.                
006700     EJECT                                                                
006800*--------------------------------------- ARBETSAREOR TILL                 
006900*                                        IMS-SEKTIONERNA                  
007000 01  IMS-WS.                                                              
007100     05  FILLER              PIC X(8)    VALUE 'IMS-WS  '.                
007200     SKIP3                                                                
007300*--------------------------------------- STATUSKOD FRÅN IMS               
007400     05  STATUS-WS           PIC XX.                                      
007500         88  SEGMENT-FINNS               VALUE '  '.                      
007600         88  SEGMENT-SAKNAS              VALUE 'GE'.                      
007700     SKIP3                                                                
007800     05  SSA1                PIC X(64).                                   
007900     05  SSA2                PIC X(64).                                   
008000     SKIP3                                                                
008100     05  GODK-STATUSKODER.                                                
008200         10  GODK-STATUS OCCURS 10 INDEXED BY STATUS-IX PIC XX.           
008300     SKIP3                                                                
008400*01  -COPY W0003                                                          
008500     EJECT                                                                
008600 01  DLI-IO-AREA             PIC X(100)  VALUE SPACE.                     
008700     SKIP3                                                                
008800*01  WLINLB01 -COPY WDD901 -L          -RED DLI-IO-AREA                   
008900     SKIP3                                                                
009000*01  WLINLB11 -COPY WDD902 -PRE ABLEV- -RED DLI-IO-AREA                   
009100     EJECT                                                                
009200*01  WLBENA11 -COPY WDD311 -PRE BENA11- -RED DLI-IO-AREA                  
009300     EJECT                                                                
009400 01  FILLER         PIC X(16) VALUE 'DLI-IO-WDD801'.                      
009500 01  DLI-IO-WDD801.                                                       
009600*    03  -COPY WDD801                                                     
009700     EJECT                                                                
009800 01  FILLER         PIC X(16) VALUE 'DLI-IO-WDD811'.                      
009900 01  DLI-IO-WDD811.                                                       
010000*    03  -COPY WDD811                                                     
010100     EJECT                                                                
010200 LINKAGE SECTION.                                                         
010300*01  AREA -COPY W261L005 -PRE LINK1-                                      
010400     EJECT                                                                
010500*01  -COPY W0008     -PRE WLINLB-.                                        
010600     05  FILLER              PIC X.                                       
010700     EJECT                                                                
010800*01  -COPY W0008     -PRE WLBENA-.                                        
010900     05  FILLER              PIC X.                                       
011000     EJECT                                                                
011100*01  -COPY W0008  -PRE WDD8-                                              
011200     05  FILLER                  PIC X.                                   
011300     EJECT                                                                
011400 PROCEDURE DIVISION USING LINK1-AREA     WLINLB-PCB WLBENA-PCB            
011500                                           WDD8-PCB.                      
011600     ENTRY 'DLITCBL' USING LINK1-AREA    WLINLB-PCB WLBENA-PCB            
011700                                           WDD8-PCB.                      
011800     SKIP3                                                                
011900     EVALUATE LINK1-KDCALL                                                
012000     WHEN LAS-ART-INFO                                                    
012100       PERFORM A-LAS-ART-INFO                                             
012200     WHEN OTHER                                                           
012300       MOVE NEJ TO LINK1-FLJANEJ-ANROP                                    
012400     END-EVALUATE                                                         
012500     MOVE ZERO TO RETURN-CODE                                             
012600     GOBACK                                                               
012700     CONTINUE.                                                            
012800     EJECT                                                                
012900 A-LAS-ART-INFO SECTION.                                                  
013000     SKIP3                                                                
013100     MOVE NEJ TO LINK1-FLJANEJ-ANROP                                      
013200     MOVE LOW-VALUE TO LINK1-IO-AREA                                      
013300                                                                          
013400     MOVE LINK1-IDARTNR TO W-IDARTNR                                      
013500                           W-IDARTNR-D9                                   
013510     MOVE WC-CDC-SE     TO W-IDDC-D9                                      
013600     PERFORM IMS-GET-AAART                                                
013700                                                                          
013800     MOVE ZERO TO LINK1-KVBR                                              
013900     IF  SEGMENT-FINNS                                                    
014000       PERFORM IMS-GET-ABLEV                                              
014100                                                                          
014200       PERFORM UNTIL                                                      
014300        NOT ( SEGMENT-FINNS )                                             
014400         ADD  ABLEV-KVBR TO LINK1-KVBR                                    
014500         PERFORM IMS-GET-ABLEV                                            
014600       END-PERFORM                                                        
014700     END-IF                                                               
014800     PERFORM IMS-GET-BENA11-BSEQ                                          
014900     MOVE BENA11-TEXT-BEART TO LINK1-TEXT-BEART                           
015000                                                                          
015100     MOVE ZERO          TO WS-KVBUFF                                      
015200     PERFORM IMS-GET-WDD801                                               
015300     IF SEGMENT-FINNS                                                     
015400        MOVE WC-CDC-SE  TO W-IDDC                                         
015500        MOVE 17         TO W-ADBUFFOMR                                    
015600        PERFORM IMS-GET-WDD811                                            
015700        PERFORM UNTIL SEGMENT-SAKNAS                                      
015800           ADD SALDO-KVBUFF-F   TO WS-KVBUFF                              
015900           ADD SALDO-KVBUFF-OF  TO WS-KVBUFF                              
016000           PERFORM IMS-GET-WDD811                                         
016100        END-PERFORM                                                       
016200     END-IF                                                               
016300     MOVE WS-KVBUFF     TO LINK1-KVBUFF                                   
016400                                                                          
016500     MOVE JA TO LINK1-FLJANEJ-ANROP                                       
016600     CONTINUE.                                                            
016700     EJECT                                                                
016800******************************************************************        
016900*                                                                *        
017000*    I M S   S E K T I O N E R                                   *        
017100*                                                                *        
017200******************************************************************        
017300     SKIP3                                                                
017400 IMS-GET-AAART SECTION.                                                   
017500                                                                          
017600     STRING 'WLINLB01(WDD901KY =' W-WDD901KY-X ')'                        
017700             DELIMITED BY SIZE INTO SSA1                                  
017800     MOVE '  GE' TO GODK-STATUSKODER                                      
017900     CALL CBLTDLI USING GU WLINLB-PCB DLI-IO-AREA SSA1                    
018000     MOVE WLINLB-STATUS-CODE TO STATUS-WS                                 
018100     PERFORM IMS-STATUSKONTROLL                                           
018200     CONTINUE.                                                            
018300     SKIP3                                                                
018400 IMS-GET-ABLEV SECTION.                                                   
018500                                                                          
018600     STRING 'WLINLB11 '                                                   
018700             DELIMITED BY SIZE INTO SSA1                                  
018800     MOVE '  GE'   TO GODK-STATUSKODER                                    
018900     CALL CBLTDLI USING GNP WLINLB-PCB DLI-IO-AREA SSA1                   
019000     MOVE WLINLB-STATUS-CODE TO STATUS-WS                                 
019100     PERFORM IMS-STATUSKONTROLL                                           
019200     CONTINUE.                                                            
019300     EJECT                                                                
019400 IMS-GET-BENA11-BSEQ SECTION.                                             
019500                                                                          
019600     STRING 'WLBENA01(WDD3BSEQ =' W-IDARTNR-X ')'                         
019700             DELIMITED BY SIZE INTO SSA1                                  
019800     STRING 'WLBENA11(IDSKYLT  =' W-IDSKYLT-X ')'                         
019900             DELIMITED BY SIZE INTO SSA2                                  
020000     MOVE '  '   TO GODK-STATUSKODER                                      
020100     CALL CBLTDLI USING GU WLBENA-PCB DLI-IO-AREA SSA1 SSA2               
020200     MOVE WLBENA-STATUS-CODE TO STATUS-WS                                 
020300     PERFORM IMS-STATUSKONTROLL                                           
020400     CONTINUE.                                                            
020500     EJECT                                                                
020600 IMS-GET-WDD801 SECTION.                                                  
020700                                                                          
020800     STRING 'WDD801  (IDARTNR  =' W-IDARTNR-X ')'                         
020900          DELIMITED BY SIZE INTO SSA1                                     
021000     MOVE '  GE' TO GODK-STATUSKODER                                      
021100     CALL CBLTDLI USING GU WDD8-PCB DLI-IO-WDD801 SSA1                    
021200     MOVE WDD8-STATUS-CODE TO STATUS-WS                                   
021300     PERFORM IMS-STATUSKONTROLL                                           
021400     .                                                                    
021500     EJECT                                                                
021600 IMS-GET-WDD811         SECTION.                                          
021700     STRING 'WDD811  (IDDC     =' W-IDDC-X                                
021800                    '&ADBUFFOM =' W-ADBUFFOMR-X                           
021900                    '&ADBUFGAN =' W-ADBUFFGANG-X   ')'                    
022000            DELIMITED BY SIZE INTO SSA1                                   
022100     MOVE '  GE' TO GODK-STATUSKODER                                      
022200     CALL CBLTDLI USING GNP WDD8-PCB DLI-IO-WDD811 SSA1                   
022300     MOVE WDD8-STATUS-CODE TO STATUS-WS                                   
022400     PERFORM IMS-STATUSKONTROLL                                           
022500     .                                                                    
022600     EJECT                                                                
022700 IMS-STATUSKONTROLL SECTION.                                              
022800                                                                          
022900     SET STATUS-IX TO 1                                                   
023000     SEARCH GODK-STATUS AT END CALL FELLOG                                
023100     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS                             
023200     CONTINUE                                                             
023300     END-SEARCH                                                           
023400     .                                                                    
