000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300     SKIP3                                                                
000400 ID DIVISION.                                                             
000500     SKIP2                                                                
000600 PROGRAM-ID.     W4039400.                                                
000700*              PROGRAM CONVERTED BY                                       
000800*              COBOL CONVERSION AID PO 5785-ABJ                           
000900*              CONVERSION DATE 05/25/91 11:02:10.                         
001000*AUTHOR.         LOTTA LANDSTEN.                                          
001100*DATE-WRITTEN.   NOV -85.                                                 
001200                                                                          
001300*    REMARKS.                                                             
001400*                                                                         
001500*    FUNKTION.                                                            
001600*        BILD 4394.                                                       
001700*        PACKNINGSRAPPORTERING ORDERVIS                                   
001800*        URSPRUNG EXPORT.                                                 
001900*                                                                         
002000*                                                                         
002100*    INDATA.                                                              
002200*        TRANSAKTION: W4T394                                              
002300*        MID:         W4I39401-MID.                                       
002400*                                                                         
002500*    UTDATA.                                                              
002600*        TRANSAKTION: W0T605                                              
002700*        MOD:         W4O39401-MOD.                                       
002800*                     W4O39501-MOD.                                       
002900*                     W4O39601-MOD.                                       
003000*                     W4O30201-MOD.                                       
003100*                     RXOXXX01-MOD.                                       
003200*    SKIP3                                                                
003300 ENVIRONMENT DIVISION.                                                    
003400     SKIP3                                                                
003500 DATA DIVISION.                                                           
003600     EJECT                                                                
003700 WORKING-STORAGE SECTION.                                                 
003710                                                                          
003800*    -- CHECKED BY WY2000                                                 
003900 77  INDENT-I PIC X(40) VALUE                                             
004000     'W4039400 91/05/25 TIME 09.41 VILMAII'.                              
004100***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
004200*                                                                         
004300 77  PROGRAM-NAMN REDEFINES INDENT-I                                      
004400                                 PIC X(8).                                
004500 77    INDX                      PIC S9(9)   VALUE +0   COMP SYNC.        
004600 77    RADIND                    PIC S9(9)   VALUE +0   COMP SYNC.        
004700 77    MAX-RADIND                PIC S9(9)   VALUE +13  COMP SYNC.        
004800 77    MAX-RADIND-PLUS-1         PIC S9(9)   VALUE +14  COMP SYNC.        
004900 77    MAX-MOD-LAENGD            PIC S9(4)   VALUE +242 COMP SYNC.        
005000 77    MIN-MOD-LAENGD            PIC S9(4)   VALUE +48  COMP SYNC.        
005100 77    M4302-MOD-LAENGD          PIC S9(4)   VALUE +109 COMP SYNC.        
005200 77    M4391-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005300 77    M4393-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005400 77    M4395-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005500 77    M4396-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005600 77    4316-IND                  PIC S9(9)   VALUE +0   COMP SYNC.        
005700 77    MAX-4316-IND              PIC S9(9)   VALUE +13  COMP SYNC.        
005800 77    MAX-4316-IND-004          PIC S9(9)   VALUE +26  COMP SYNC.        
005900 77    RAETT                     PIC X       VALUE 'R'.                   
006000 77    FEL                       PIC X       VALUE 'F'.                   
006100 77    JA                        PIC X       VALUE 'J'.                   
006200 77    NEJ                       PIC X       VALUE 'N'.                   
006300     EJECT                                                                
006400 01  WS-MSG-CALL-GRP.                                                     
006500   03  WS-MSG-CALL               PIC X.                                   
006600     88  VISA-NAESTA-BILD                    VALUE '0'.                   
006700     88  STARTA-4301                         VALUE '1'.                   
006800     88  STARTA-4302                         VALUE '2'.                   
006900     88  STARTA-4303                         VALUE '3'.                   
007000     88  STARTA-4391                         VALUE '4'.                   
007100     88  STARTA-4392                         VALUE '5'.                   
007200     88  STARTA-4393                         VALUE '6'.                   
007300     88  STARTA-4394                         VALUE '7'.                   
007400     88  STARTA-4395                         VALUE '8'.                   
007500     88  STARTA-4396                         VALUE '9'.                   
007600   03  WS-VISA-NAESTA-BILD       PIC X       VALUE '0'.                   
007700   03  WS-STARTA-4301            PIC X       VALUE '1'.                   
007800   03  WS-STARTA-4302            PIC X       VALUE '2'.                   
007900   03  WS-STARTA-4303            PIC X       VALUE '3'.                   
008000   03  WS-STARTA-4391            PIC X       VALUE '4'.                   
008100   03  WS-STARTA-4392            PIC X       VALUE '5'.                   
008200   03  WS-STARTA-4393            PIC X       VALUE '6'.                   
008300   03  WS-STARTA-4394            PIC X       VALUE '7'.                   
008400   03  WS-STARTA-4395            PIC X       VALUE '8'.                   
008500   03  WS-STARTA-4396            PIC X       VALUE '9'.                   
008600     EJECT                                                                
008700 01    DYNAMISKA-SUBPROGRAM.                                              
008800   03  W400ARTU                  PIC X(8)    VALUE 'W400ARTU'.            
008900   03  CBLTDLI                   PIC X(8)    VALUE 'CBLTDLI '.            
009000   03  FELLOG                    PIC X(8)    VALUE 'FELLOG  '.            
009010                                                                          
009020 01    FILLER                    PIC X(16) VALUE 'W400ARTU-AREA'.         
009030*01    FILLER  -COPY W400ARTU                                             
009040     SKIP2                                                                
009200 01    FILLER                    PIC X(16)                                
009300                                 VALUE 'WS-MODNAMN'.                      
009400 01    WS-MODNAMN.                                                        
009500   03    FILLER                  PIC X       VALUE 'W'.                   
009600   03    WS-MOD-IDTRANS-POS-1    PIC X       VALUE SPACE.                 
009700   03    FILLER                  PIC X       VALUE 'O'.                   
009800   03    WS-MOD-IDTRANS-POS-2-4  PIC X(3)    VALUE SPACE.                 
009900   03    FILLER                  PIC X(2)    VALUE '01'.                  
010000                                                                          
010100 01    FILLER                    PIC X(16)                                
010200                                 VALUE 'WS-IDTRANS-MOD'.                  
010300 01    WS-IDTRANS-MOD.                                                    
010400   03    WS-IDTRANS-POS-1-MOD    PIC X       VALUE SPACE.                 
010500   03    WS-IDTRANS-POS-2-4-MOD  PIC X(3)    VALUE SPACE.                 
010600                                                                          
010700 01    FILLER                    PIC X(16)   VALUE 'DIVERSE'.             
010800 01    DIVERSE.                                                           
010900                                                                          
011000   03    WS-IDDC                 PIC X(2).                                
011100   03    WS-PRTVAL               PIC X(2).                                
011110   03    W-IDPRODNR              PIC S9(7)   VALUE ZERO.                  
011200                                                                          
011300   03    WS-INDATA-TEST          PIC X       VALUE SPACE.                 
011400         88  WS-INDATA-FEL                   VALUE 'F'.                   
011500         88  WS-INDATA-RAETT                 VALUE 'R'.                   
011600                                                                          
011700   03    WS-IDTRANS              PIC X(4)    VALUE SPACE.                 
011800         88  WS-GODKAEND-BILD    VALUE '4394'.                            
011900                                                                          
012000   03    WS-FLREPL-TEST          PIC X       VALUE SPACE.                 
012100         88  WS-FLREPL                       VALUE 'J'.                   
012200                                                                          
012300   03    WS-4312-KVORDRAD        PIC S9(5)   VALUE ZERO COMP-3.           
012400   03    WS-4312-IDTRANS         PIC X(4)    VALUE SPACE.                 
012500                                                                          
012600   03    WS-IDPRODNR             PIC 9(7)    VALUE ZERO.                  
012700   03    WS-IDDISTR              PIC 9(4)    VALUE ZERO.                  
012800   03    WS-IDKUNDNR             PIC 9(6)    VALUE ZERO.                  
012900   03    WS-KDFRAKT              PIC 9(2)    VALUE ZERO.                  
013000   03    WS-KDORDKL              PIC 9       VALUE ZERO.                  
013200*                                                                         
014000 01    FILLER                    PIC X(16)                                
014100                                 VALUE 'NYCKLAR-TILL-DLI'.                
014200 01    NYCKLAR-TILL-DLI.                                                  
014300                                                                          
014400   03    W-WDGXKEY-4305-X.                                                
014500     05    FILLER                PIC X(4)    VALUE '4305'.                
014600     05    W-IDDC-4305           PIC X(2).                                
014700     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
014800                                                                          
014900   03    W-WDGXKEY-4306-X.                                                
015000     05    W-IDPRODNR-4306       PIC S9(7)   VALUE ZERO  COMP-3.          
015100     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
015200                                                                          
015300   03    W-WDGXKEY-4311-X.                                                
015400     05    FILLER                PIC X(4)    VALUE '4311'.                
015500     05    W-IDDC-4311           PIC X(2).                                
015600     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
015700                                                                          
015800   03    W-WDGXKEY-4312-X.                                                
015900     05    W-IDPRODNR-4312       PIC S9(7)   VALUE ZERO  COMP-3.          
016000     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
016100                                                                          
016200   03    W-WDGXKEY-IDUSER-4312   PIC X(8)    VALUE SPACE.                 
016300                                                                          
016400   03    W-WDGXKEY-4315-X.                                                
016500     05    FILLER                PIC X(4)    VALUE '4315'.                
016600     05    FILLER                PIC X(26)   VALUE LOW-VALUE.             
016700                                                                          
016800   03    W-WDGXKEY-4316-X.                                                
016900     05    W-IDPRODNR-4316       PIC S9(7)   VALUE ZERO  COMP-3.          
017000     05    W-IDPTYP-4316         PIC X(3)    VALUE '001'.                 
017100     05    W-IDKOLLI-4316        PIC S9(5)   VALUE ZERO  COMP-3.          
017200     05    FILLER                PIC X(10)   VALUE LOW-VALUE.             
017300                                                                          
017400   03    W-WDGXKEY-4316-X-MIN.                                            
017500     05    W-IDPRODNR-4316-MIN   PIC S9(7)   VALUE ZERO  COMP-3.          
017600     05    W-IDPTYP-4316-MIN     PIC X(3)    VALUE SPACE.                 
017700     05    FILLER                PIC X(13)   VALUE LOW-VALUE.             
017800                                                                          
017900                                                                          
018000   03    W-WDGXKEY-4316-X-KOL-MIN.                                        
018100     05    W-IDPRODNR-4316-KOL-MIN PIC S9(7)   VALUE ZERO  COMP-3.        
018200     05    W-IDPTYP-4316-KOL-MIN   PIC X(3)    VALUE '002'.               
018300     05    W-IDKOLLI-4316-KOL-MIN  PIC S9(5)   VALUE ZERO  COMP-3.        
018400     05    FILLER                  PIC X(10)   VALUE LOW-VALUE.           
018500                                                                          
018600   03    W-WDGXKEY-4316-X-MAX.                                            
018700     05    W-IDPRODNR-4316-MAX   PIC S9(7)   VALUE ZERO  COMP-3.          
018800     05    W-IDPTYP-4316-MAX     PIC X(3)    VALUE SPACE.                 
018900     05    FILLER                PIC X(13)   VALUE HIGH-VALUE.            
019000                                                                          
019100   03    W-WDE4BSEQ-X.                                                    
019200     05    W-IDPRODNR-WDE4       PIC S9(7)   VALUE ZERO  COMP-3.          
019300     05    W-IDPURAD             PIC S9(5)   VALUE ZERO  COMP-3.          
019400                                                                          
019500     EJECT                                                                
019600 01    FILLER                    PIC X(16)   VALUE 'MEDDELANDE'.          
019700 01    MEDDELANDE.                                                        
019800                                                                          
019900   03    FEL1.                                                            
020000      05    FILLER               PIC X(40)   VALUE                        
020100           '748. UPPLYSTA FÄLT FEL'.                                      
020200      05    FILLER               PIC X(40)   VALUE                        
020300           '748. VERLICHTE ZONE FOUTIEF'.                                 
020400   03    FILLER  REDEFINES FEL1.                                          
020500      05    FEL-1                PIC X(40)   OCCURS 2.                    
020600                                                                          
020700   03    FEL2.                                                            
020800      05    FILLER               PIC X(40)   VALUE                        
020900           '754. FEL I NYCKEL BÖRJA FRÅN GRUND-BILD'.                     
021000      05    FILLER               PIC X(40)   VALUE                        
021100           '754. HERBEGIN VANAF BASISBEELD'.                              
021200   03    FILLER  REDEFINES FEL2.                                          
021300      05    FEL-2                PIC X(40)   OCCURS 2.                    
021400                                                                          
021500   03    FEL3.                                                            
021600      05    FILLER               PIC X(40)   VALUE                        
021700           '750. INGÅNG VIA ANNAN MENY'.                                  
021800      05    FILLER               PIC X(40)   VALUE                        
021900           '750. TOEGANGELIJK VIA EEN ANDERE MENU'.                       
022000   03    FILLER  REDEFINES FEL3.                                          
022100      05    FEL-3                PIC X(40)   OCCURS 2.                    
022200   03    INF1.                                                            
022300      05    FILLER               PIC X(40)   VALUE                        
022400           'UPPDATERING UTFÖRD'.                                          
022500      05    FILLER               PIC X(40)   VALUE                        
022600           'UPDATING UITGEVOERD '.                                        
022700   03    FILLER  REDEFINES INF1.                                          
022800      05    INF-1                PIC X(40)   OCCURS 2.                    
022900                                                                          
023000     EJECT                                                                
023100******************************************************************        
023200*                                                                         
023300*                AREOR FÖR MFS OCH SKÄRMHANTERING                         
023400*                                                                         
023500 01    FILLER                    PIC X(16)   VALUE 'MFS-WS'.              
023600     SKIP3                                                                
023700 01    FILLER                    PIC X(16)                                
023800                                 VALUE 'MID W4I39401 MID'.                
023900*01    -COPY W4I39401                                                     
024000     EJECT                                                                
024100*01    -COPY WMSGAREA                                                     
024200     EJECT                                                                
024300*  03  MOD -COPY W4O39401   -RED MSG-AREA                                 
024400     EJECT                                                                
024500*  03  MOD -COPY W4O30202   -RED MSG-AREA -PRE M4302-                     
024600     EJECT                                                                
024700*03  MOD -COPY W4O39101   -RED MSG-AREA -PRE M4391-                       
024800     EJECT                                                                
024900*03  MOD -COPY W4O39301   -RED MSG-AREA -PRE M4393-                       
025000     EJECT                                                                
025100*03  MOD -COPY W4O39501   -RED MSG-AREA -PRE M4395-                       
025200     EJECT                                                                
025300*03  MOD -COPY W4O39601   -RED MSG-AREA -PRE M4396-                       
025400     EJECT                                                                
025500 01    FILLER                    PIC X(16)   VALUE 'P-TO-P-SW'.           
025600 01    P-TO-P-SW.                                                         
025700       03  PTOP-LL               PIC S9(4)   VALUE +17 COMP SYNC.         
025800       03  PTOP-Z1               PIC X       VALUE LOW-VALUE.             
025900       03  PTOP-Z2               PIC X       VALUE LOW-VALUE.             
026000       03  PTOP-TRANSKOD         PIC X(7)    VALUE 'W0T605U'.             
026100       03  FILLER                PIC X       VALUE SPACE.                 
026200       03  FILLER                PIC X(4)    VALUE '4302'.                
026300       03  PTOP-KDMFSFOR         PIC X.                                   
026400     EJECT                                                                
026500 01  FILLER                      PIC X(16)   VALUE 'P-TO-P-SW1'.          
026600 01  P-TO-P-SW1.                                                          
026700       03  PTOP1-LL              PIC S9(4)   VALUE +187 COMP SYNC.        
026800       03  PTOP1-Z1              PIC X       VALUE LOW-VALUE.             
026900       03  PTOP1-Z2              PIC X       VALUE LOW-VALUE.             
027000       03  PTOP1-TRANSKOD        PIC X(7)    VALUE 'W4T391U'.             
027100       03  FILLER                PIC X       VALUE SPACE.                 
027200       03  FILLER                PIC X(4)    VALUE '4301'.                
027300       03  PTOP1-KDMFSFOR        PIC X.                                   
027400       03  PTOP1-IDPRODNR-IN     PIC X(7).                                
027500       03  PTOP1-IDPRODNR-UT     PIC X(7).                                
027600       03  PTOP1-IDDISTR-UT      PIC X(4).                                
027700       03  PTOP1-IDKUNDNR-UT     PIC X(6).                                
027800       03  PTOP1-KDFRAKT-UT      PIC X(2).                                
027900       03  PTOP1-IDORDNR-UT      PIC X(5).                                
028000       03  PTOP1-KDORDKL-UT      PIC X(1).                                
028010       03  PTOP1-IDDC-UT         PIC X(2).                                
028020       03  PTOP1-PRTVAL-ADRESSFL PIC X(2).                                
028100       03  FILLER                PIC X(136)  VALUE ALL '+'.               
028200     EJECT                                                                
028300 01    FILLER                    PIC X(16)   VALUE 'P-TO-P-SW2'.          
028400 01    P-TO-P-SW2.                                                        
028500       03  PTOP2-LL              PIC S9(4)   VALUE +89 COMP SYNC.         
028600       03  PTOP2-Z1              PIC X       VALUE LOW-VALUE.             
028700       03  PTOP2-Z2              PIC X       VALUE LOW-VALUE.             
028800       03  PTOP2-TRANSKOD        PIC X(7)    VALUE 'W4T396U'.             
028900       03  FILLER                PIC X       VALUE SPACE.                 
029000       03  FILLER                PIC X(4)    VALUE '4394'.                
029100       03  PTOP2-KDMFSFOR        PIC X.                                   
029200       03  PTOP2-IDPRODNR-IN     PIC X(7).                                
029300       03  PTOP2-IDPRODNR-UT     PIC X(7).                                
029400       03  PTOP2-IDDISTR-UT      PIC X(4).                                
029500       03  PTOP2-IDKUNDNR-UT     PIC X(6).                                
029600       03  PTOP2-KDFRAKT-UT      PIC X(2).                                
029700       03  PTOP2-IDORDNR-UT      PIC X(5).                                
029800       03  PTOP2-KDORDKL-UT      PIC X(1).                                
029810       03  PTOP2-IDDC-UT         PIC X(2).                                
029820       03  PTOP2-PRTVAL-ADRESSFL PIC X(2).                                
029900     EJECT                                                                
030000*01    -COPY WMFSAREA                                                     
030100     EJECT                                                                
030200******************************************************************        
030300*                                                                         
030400*        ARBETS-AREOR TILL IMS-SEKTIONERNA                                
030500*                                                                         
030600 01    IMS-WS.                                                            
030700   03    FILLER                  PIC X(16)   VALUE 'IMS-WS     '.         
030800     SKIP3                                                                
030900*                        **** STATUS-KOD FRÅN IMS                         
031000   03    STATUS-WS               PIC XX.                                  
031100     88    SEGMENT-FINNS                     VALUE '  '.                  
031200     88    SEGMENT-SAKNAS                    VALUE 'GE'.                  
031300     SKIP3                                                                
031400   03    GODK-STATUSKODER.                                                
031500     05    GODK-STATUS OCCURS 5 INDEXED BY STATUS-IX PIC XX.              
031600     SKIP3                                                                
031700 01    SSA1                      PIC X(96).                               
031800 01    SSA2                      PIC X(64).                               
031900     EJECT                                                                
032000*                            IMS FUNKTIONSKODER                           
032100*01    -COPY W0003                                                        
032200     EJECT                                                                
032300*                            DLI INPUT-OUTPUT AREA                        
032400 01    FILLER                    PIC X(16)   VALUE                        
032500                                 'DLI-IO-AREA'.                           
032600 01    DLI-IO-AREA1.                                                      
032700   03    IO-AREA1                PIC X(370)  VALUE SPACE.                 
032800     SKIP3                                                                
032900*  03    XXDJ01 -COPY WDGX4305    -RED IO-AREA1                           
033000     EJECT                                                                
033100*  03    XXDJ11 -COPY WDGX4306    -RED IO-AREA1                           
033200     EJECT                                                                
033300*  03    XXDJ21 -COPY WDGX4308    -RED IO-AREA1                           
033400     EJECT                                                                
033500*  03    XXDK11 -COPY WDGX4312    -RED IO-AREA1                           
033600     EJECT                                                                
033700*  03    XXDL11 -COPY WDGX4316    -RED IO-AREA1                           
033800     EJECT                                                                
033900*    08    AREA -COPY W4I31501   -RED 4316-FILLER -PRE 4316-A-            
034000     EJECT                                                                
034100*    08    AREA -COPY W4I31401   -RED 4316-FILLER -PRE 4316-B-            
034200     EJECT                                                                
034300*    08    AREA -COPY W4I39801   -RED 4316-FILLER -PRE 4316-C-            
034400     EJECT                                                                
034500*    08    AREA -COPY W4I31701   -RED 4316-FILLER -PRE 4316-              
034600     EJECT                                                                
034700 01    DLI-IO-AREA2.                                                      
034800   03    IO-AREA2                PIC X(400)  VALUE SPACE.                 
034900     SKIP3                                                                
035000*  03    ORAD-AREA -COPY WDE411      -RED IO-AREA2                        
035100     EJECT                                                                
035200 LINKAGE SECTION.                                                         
035300*01    -COPY W0009     -PRE MSG-                                          
035400     EJECT                                                                
035500*01    -COPY W0009     -PRE ALT-                                          
035600     EJECT                                                                
035700*01    -COPY W0009     -PRE ALT1-                                         
035800     EJECT                                                                
035900*01    -COPY W0009     -PRE ALT2-                                         
036000     EJECT                                                                
036100*01    -COPY W0008     -PRE XXDJ-                                         
036200        05 FILLER                PIC X.                                   
036300     EJECT                                                                
036400*01    -COPY W0008     -PRE XXDK-                                         
036500        05 FILLER                PIC X.                                   
036600     EJECT                                                                
036700*01    -COPY W0008     -PRE XXDL-                                         
036800        05 FILLER                PIC X.                                   
036900     EJECT                                                                
037000*01    -COPY W0008     -PRE WDE4-                                         
037100        05 FILLER                PIC X.                                   
037200     EJECT                                                                
037300 PROCEDURE DIVISION USING MSG-PCB ALT-PCB ALT1-PCB ALT2-PCB               
037400     XXDJ-PCB XXDK-PCB XXDL-PCB WDE4-PCB.                                 
037500                                                                          
037600     ENTRY 'DLITCBL' USING MSG-PCB ALT-PCB ALT1-PCB ALT2-PCB              
037700     XXDJ-PCB XXDK-PCB XXDL-PCB WDE4-PCB.                                 
037800                                                                          
037900     PERFORM IMS-GET-MSG                                                  
038000                                                                          
038100     IF SEGMENT-FINNS                                                     
038200       PERFORM A-INIT-SPARA-INPUT                                         
038300       IF (MID-IDPRODNR-UT NUMERIC                                        
038400       AND MID-IDDISTR-UT  NUMERIC                                        
038500       AND MID-IDKUNDNR-UT NUMERIC                                        
038600       AND MID-KDFRAKT-UT  NUMERIC                                        
038700       AND MID-IDORDNR-UT NUMERIC                                         
038800       AND MID-KDORDKL-UT  NUMERIC                                        
038810       AND MID-IDDC-UT     NUMERIC)                                       
038900                                                                          
039100         MOVE MID-PRTVAL-ADRESSFL    TO WS-PRTVAL                         
039101         MOVE MID-IDDC-UT            TO WS-IDDC                           
039110                                        W-IDDC-4305                       
039200                                        W-IDDC-4311                       
039300         MOVE MID-IDPRODNR-UT       TO W-IDPRODNR                         
039310                                       WS-IDPRODNR                        
039400         MOVE W-IDPRODNR            TO W-IDPRODNR-4306                    
039500                                       W-IDPRODNR-4312                    
039600                                       W-IDPRODNR-4316                    
039700                                       W-IDPRODNR-4316-KOL-MIN            
039800                                       W-IDPRODNR-4316-MIN                
039900                                       W-IDPRODNR-4316-MAX                
040000                                       W-IDPRODNR-WDE4                    
040100         MOVE MFS-IDTRANS  TO WS-IDTRANS                                  
040200         IF MFS-UPDATE                                                    
040300         AND WS-GODKAEND-BILD                                             
040400           IF MID-RAPP-RAD NOT = ALL '+'                                  
040500             PERFORM B-INDATA-KOLL                                        
040600             IF WS-INDATA-RAETT                                           
040700               PERFORM C-REL-KOLL                                         
040800               IF WS-INDATA-RAETT                                         
040900                 PERFORM D-UPPDATERA                                      
041000                 PERFORM S99-NAESTA-TRANS                                 
041100               ELSE                                                       
041200                 MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                        
041300                 PERFORM S01-ROER-EJ-FAELT                                
041400                 MOVE MAX-MOD-LAENGD TO MSG-KVLL                          
041500               END-IF                                                     
041600             ELSE                                                         
041700               MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                          
041800               PERFORM S01-ROER-EJ-FAELT                                  
041900               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
042000             END-IF                                                       
042100           ELSE                                                           
042200             PERFORM S99-NAESTA-TRANS                                     
042300           END-IF                                                         
042400         ELSE                                                             
042500           MOVE FEL-3 (INDX) TO MOD-TEMFSFEL                              
042600           MOVE MFS-IDTRANS TO WS-IDTRANS-MOD                             
042700           MOVE WS-IDTRANS-POS-1-MOD TO WS-MOD-IDTRANS-POS-1              
042800           MOVE WS-IDTRANS-POS-2-4-MOD TO                                 
042900                               WS-MOD-IDTRANS-POS-2-4                     
043000           MOVE WS-MODNAMN TO MFS-IDMOD                                   
043100           MOVE MIN-MOD-LAENGD TO MSG-KVLL                                
043200         END-IF                                                           
043300       ELSE                                                               
043400         MOVE FEL-2 (INDX) TO MOD-TEMFSFEL                                
043500         PERFORM S01-ROER-EJ-FAELT                                        
043600         MOVE MAX-MOD-LAENGD TO MSG-KVLL                                  
043700       END-IF                                                             
043800       EVALUATE TRUE                                                      
043900       WHEN VISA-NAESTA-BILD PERFORM IMS-INSERT-MSG                       
044000         CONTINUE                                                         
044100       WHEN STARTA-4391      PERFORM IMS-INSERT-MSG-ALT1-PCB              
044200         CONTINUE                                                         
044300       WHEN STARTA-4392      PERFORM IMS-INSERT-MSG-ALT2-PCB              
044400         CONTINUE                                                         
044500       END-EVALUATE                                                       
044600     END-IF                                                               
044700     MOVE ZERO TO RETURN-CODE                                             
044800     GOBACK                                                               
044900     CONTINUE.                                                            
045000     EJECT                                                                
045100 A-INIT-SPARA-INPUT SECTION.                                              
045200                                                                          
045300     IF MSG-DUBBLA-TRANSKODER                                             
045400       MOVE MSG-INDATA-MINUS-2-TRANSKODER TO MID-W4I39401                 
045500       MOVE MSG-IDTRANS-2        TO MFS-IDTRANS                           
045600       MOVE MSG-KDMFSFOR-2       TO MFS-KDMFSFOR                          
045700       MOVE MSG-IDPFK            TO MFS-IDPFK                             
045800     ELSE                                                                 
045900       MOVE MSG-INDATA-MINUS-1-TRANSKOD  TO MID-W4I39401                  
046000       MOVE MSG-IDTRANS-1 TO MFS-IDTRANS                                  
046100       MOVE MSG-KDMFSFOR-1 TO MFS-KDMFSFOR                                
046200       MOVE ' '            TO MFS-IDPFK                                   
046300     END-IF                                                               
046400     MOVE MSG-KDTRTYP          TO MFS-KDTRTYP                             
046500     MOVE LOW-VALUE TO MSG-AREA                                           
046600     MOVE 'W4O39401' TO MFS-IDMOD                                         
046700     MOVE '4394' TO MOD-IDTRANS                                           
046800     MOVE WS-VISA-NAESTA-BILD            TO WS-MSG-CALL                   
046900                                                                          
047000     IF SWEDISH-TEXT                                                      
047100       MOVE +1 TO INDX                                                    
047200     ELSE                                                                 
047300       MOVE +2 TO INDX                                                    
047400     END-IF                                                               
047500     INSPECT MID-IDPRODNR-UT REPLACING LEADING SPACE BY ZERO              
047600     INSPECT MID-IDDISTR-UT  REPLACING LEADING SPACE BY ZERO              
047700     INSPECT MID-IDKUNDNR-UT REPLACING LEADING SPACE BY ZERO              
047800     INSPECT MID-KDFRAKT-UT  REPLACING LEADING SPACE BY ZERO              
047900     INSPECT MID-IDORDNR-UT  REPLACING LEADING SPACE BY ZERO              
048000                                                                          
048100     MOVE MID-IDPRODNR-UT    TO MOD-IDPRODNR-UT                           
048200     MOVE MID-IDDISTR-UT     TO MOD-IDDISTR-UT                            
048300     MOVE MID-IDKUNDNR-UT    TO MOD-IDKUNDNR-UT                           
048400     MOVE MID-KDFRAKT-UT     TO MOD-KDFRAKT-UT                            
048500     MOVE MID-IDORDNR-UT     TO MOD-IDORDNR-UT                            
048600     MOVE MID-KDORDKL-UT     TO MOD-KDORDKL-UT                            
048610     MOVE MID-IDDC-UT        TO MOD-IDDC-UT                               
048700                                                                          
048800     INSPECT MOD-IDPRODNR-UT REPLACING LEADING ZERO BY SPACE              
048900     INSPECT MOD-IDDISTR-UT  REPLACING LEADING ZERO BY SPACE              
049000     INSPECT MOD-IDKUNDNR-UT REPLACING LEADING ZERO BY SPACE              
049100     INSPECT MOD-KDFRAKT-UT  REPLACING LEADING ZERO BY SPACE              
049200     INSPECT MOD-IDORDNR-UT  REPLACING LEADING ZERO BY SPACE              
049300                                                                          
049400     MOVE +1                TO RADIND                                     
049500                                                                          
049600     PERFORM UNTIL                                                        
049700      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
049800       MOVE MFS-RENSA-FAELT   TO MOD-IDRADNR      (RADIND)                
049900                                 MOD-KDARTURS     (RADIND)                
050000       ADD +1                 TO RADIND                                   
050100     END-PERFORM                                                          
050200     MOVE MFS-RENSA-FAELT   TO MOD-IDRADNR-SENAST                         
050300                               MOD-TEMFSFEL                               
050400                               MOD-TEMFSINF                               
050500     CONTINUE.                                                            
050600     EJECT                                                                
050700 B-INDATA-KOLL SECTION.                                                   
050800                                                                          
050900     MOVE +1         TO RADIND                                            
051000     MOVE RAETT                 TO WS-INDATA-TEST                         
051100                                                                          
051200     PERFORM UNTIL                                                        
051300      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
051400       IF MID-RAD (RADIND) NOT = ALL '+'                                  
051500                                                                          
051600         IF MID-IDRADNR (RADIND) = ALL '+'                                
051700           MOVE FEL                   TO WS-INDATA-TEST                   
051800           MOVE MFS-NUM-FAELT-FEL  TO MOD-IDRADNR-ATTR (RADIND)           
051900         ELSE                                                             
052000           IF MID-IDRADNR (RADIND) NUMERIC                                
052510             MOVE MFS-NUM-FAELT-RAETT TO                                  
052520                                  MOD-IDRADNR-ATTR (RADIND)               
052521           ELSE                                                           
052530             MOVE FEL                TO WS-INDATA-TEST                    
052540             MOVE MFS-NUM-FAELT-FEL  TO MOD-IDRADNR-ATTR (RADIND)         
052600           END-IF                                                         
052700         END-IF                                                           
052800         IF MID-KDARTURS (RADIND) = ALL '+'                               
052900           MOVE FEL                   TO WS-INDATA-TEST                   
053000           MOVE MFS-ALFA-FAELT-FEL TO MOD-KDARTURS-ATTR (RADIND)          
053100         ELSE                                                             
053200           IF MID-KDARTURS  (RADIND) NUMERIC                              
053600             MOVE FEL                TO WS-INDATA-TEST                    
053700             MOVE MFS-ALFA-FAELT-FEL TO MOD-KDARTURS-ATTR (RADIND)        
053701           ELSE                                                           
053810             INSPECT MID-KDARTURS (RADIND) REPLACING LEADING ZERO         
053820                                BY SPACE                                  
053890             MOVE MID-KDARTURS (RADIND)  TO ARTU-KDARTURS                 
053891             MOVE MID-IDDISTR-UT         TO ARTU-IDDISTR                  
053892             MOVE WS-IDDC                TO ARTU-IDDC                     
053893             CALL W400ARTU USING ARTU-W400ARTU                            
053894                                                                          
053895             IF ARTU-KDARTURS-NUM NUMERIC                                 
053896               MOVE MID-KDARTURS (RADIND) TO MOD-KDARTURS (RADIND)        
053897               MOVE MFS-ALFA-FAELT-RAETT TO                               
053898                                   MOD-KDARTURS-ATTR (RADIND)             
053899             ELSE                                                         
053900               MOVE FEL                TO WS-INDATA-TEST                  
053902               MOVE MFS-ALFA-FAELT-FEL TO                                 
053903                                  MOD-KDARTURS-ATTR (RADIND)              
053904             END-IF                                                       
053905           END-IF                                                         
053906         END-IF                                                           
054000       END-IF                                                             
054100       ADD +1          TO RADIND                                          
054200     END-PERFORM                                                          
054300     CONTINUE.                                                            
054400     EJECT                                                                
054500 C-REL-KOLL SECTION.                                                      
054600                                                                          
054700     MOVE +1        TO RADIND                                             
054800                                                                          
054900     PERFORM IMS-GET-XXDK-4311                                            
055000     PERFORM IMS-GET-XXDK-4312                                            
055100     MOVE 4312-KVORDRAD        TO WS-4312-KVORDRAD                        
055200     MOVE 4312-IDTRANS         TO WS-4312-IDTRANS                         
055300     PERFORM IMS-GET-XXDJ-4305                                            
055400     PERFORM IMS-GET-XXDJ-4306                                            
055500                                                                          
055600     PERFORM UNTIL                                                        
055700      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
055800       IF MID-RAD (RADIND) NOT = ALL '+'                                  
055900                                                                          
056000         IF MID-IDRADNR (RADIND) > WS-4312-KVORDRAD                       
056100         AND WS-4312-IDTRANS = '4302'                                     
056200           MOVE FEL    TO WS-INDATA-TEST                                  
056300           MOVE MFS-NUM-FAELT-FEL TO MOD-IDRADNR-ATTR (RADIND)            
056400         ELSE                                                             
056500           PERFORM IMS-GET-XXDJ-4308-F                                    
056600                                                                          
056700           PERFORM UNTIL                                                  
056800            NOT ( ((SEGMENT-FINNS) AND (4308-IDRADNR-ORD-FROM <           
056900              MID-IDRADNR (RADIND) OR 4308-IDRADNR-ORD-FROM =             
057000              MID-IDRADNR (RADIND)) AND (WS-INDATA-RAETT)) )              
057100             IF (MID-IDRADNR (RADIND) < 4308-IDRADNR-ORD-FROM)            
057200             OR (MID-IDRADNR (RADIND) > 4308-IDRADNR-ORD-TOM)             
057300               PERFORM IMS-GET-XXDJ-4308                                  
057400             ELSE                                                         
057500               MOVE FEL    TO WS-INDATA-TEST                              
057600               MOVE MFS-NUM-FAELT-FEL TO MOD-IDRADNR-ATTR                 
057700               (RADIND)                                                   
057800             END-IF                                                       
057900           END-PERFORM                                                    
058600           IF MID-KDARTURS (RADIND) = SPACE                               
058700             MOVE FEL    TO WS-INDATA-TEST                                
058800             MOVE MFS-NUM-FAELT-FEL TO                                    
058900                          MOD-KDARTURS-ATTR (RADIND)                      
059000           END-IF                                                         
059100         END-IF                                                           
059200       END-IF                                                             
059300       ADD +1           TO RADIND                                         
059400     END-PERFORM                                                          
059500     CONTINUE.                                                            
059600     EJECT                                                                
059700 D-UPPDATERA SECTION.                                                     
059800                                                                          
059900     MOVE +1          TO RADIND                                           
060000     MOVE +1          TO 4316-IND                                         
060100     MOVE NEJ         TO WS-FLREPL-TEST                                   
060200     PERFORM IMS-GET-XXDL-4315                                            
060300     PERFORM IMS-GET-XXDL-4316-L                                          
060400                                                                          
060500     IF SEGMENT-FINNS                                                     
060600       IF 4316-MID-RAD (MAX-4316-IND) = ALL '+'                           
060700         PERFORM UNTIL                                                    
060800          NOT ( (4316-IND < MAX-4316-IND OR 4316-IND =                    
060900            MAX-4316-IND) AND (4316-MID-IDRADNR (4316-IND) NOT            
061000            = ALL '+' ) )                                                 
061100           ADD +1          TO 4316-IND                                    
061200         END-PERFORM                                                      
061300         MOVE JA         TO WS-FLREPL-TEST                                
061400         PERFORM DB-SKAPA-4316-TAB                                        
061500       ELSE                                                               
061600         PERFORM DA-SKAPA-4316-HUVUD                                      
061700         PERFORM DB-SKAPA-4316-TAB                                        
061800       END-IF                                                             
061900     ELSE                                                                 
062000       PERFORM DA-SKAPA-4316-HUVUD                                        
062100       PERFORM DB-SKAPA-4316-TAB                                          
062200     END-IF                                                               
062300     CONTINUE.                                                            
062400     EJECT                                                                
062500 DA-SKAPA-4316-HUVUD SECTION.                                             
062600                                                                          
062700     MOVE LOW-VALUE               TO IO-AREA1                             
062800     MOVE ALL '+'                 TO 4316-WDGX4316                        
062900     MOVE W-IDPRODNR              TO 4316-IDPRODNR                        
063000     MOVE '001'                   TO 4316-IDPTYP                          
063100     MOVE +0                      TO 4316-IDKOLLI                         
063200     MOVE LOW-VALUE               TO 4316-LOWVALUE                        
063300     MOVE ZERO                    TO 4316-KDTRSTAT                        
063400     MOVE +174                    TO 4316-LL                              
063500     MOVE LOW-VALUE               TO 4316-Z1                              
063600     MOVE LOW-VALUE               TO 4316-Z2                              
063700     MOVE 'W4T317'                TO 4316-KDTRANS                         
063800     MOVE '4394'                  TO 4316-IDTRANS                         
063900     MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                        
064000     MOVE ZERO                    TO 4316-MID-IDANSTNR-UT                 
064100     MOVE MID-IDDISTR-UT          TO 4316-MID-IDDISTR-IN                  
064200                                     4316-MID-IDDISTR-UT                  
064300     MOVE MID-IDKUNDNR-UT         TO 4316-MID-IDKUNDNR-IN                 
064400                                     4316-MID-IDKUNDNR-UT                 
064500     MOVE MID-IDORDNR-UT          TO 4316-MID-IDORDNR-IN                  
064600                                     4316-MID-IDORDNR-UT                  
064610     MOVE MID-IDDC-UT             TO 4316-MID-IDDC-IN                     
064620                                     4316-MID-IDDC-UT                     
064700     MOVE W-IDPRODNR              TO 4316-MID-IDPRODNR-IN                 
064800                                     4316-MID-IDPRODNR-UT                 
064900     MOVE ZERO                    TO 4316-MID-IDKOLLI-IN                  
065000                                     4316-MID-IDKOLLI-UT                  
065100     CONTINUE.                                                            
065200                                                                          
065300     EJECT                                                                
065400 DB-SKAPA-4316-TAB SECTION.                                               
065500                                                                          
065600     PERFORM UNTIL                                                        
065700      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
065800       IF  MID-RAD (RADIND) = ALL '+'                                     
065900         CONTINUE                                                         
066000       ELSE                                                               
066100         IF  4316-IND > MAX-4316-IND                                      
066200           IF  WS-FLREPL                                                  
066300             PERFORM IMS-REPL-XXDL                                        
066400             MOVE NEJ     TO WS-FLREPL-TEST                               
066500           ELSE                                                           
066600             PERFORM IMS-ISRT-XXDL-4316-STAT-II                           
066700           END-IF                                                         
066800           PERFORM DA-SKAPA-4316-HUVUD                                    
066900           MOVE +1          TO 4316-IND                                   
067000         END-IF                                                           
067100         MOVE MID-IDRADNR (RADIND)   TO                                   
067200                          4316-MID-IDRADNR (4316-IND)                     
067300         MOVE MID-KDARTURS (RADIND)  TO                                   
067400                          4316-MID-KDARTURS (4316-IND)                    
067500         ADD +1           TO 4316-IND                                     
067600       END-IF                                                             
067700       ADD +1           TO RADIND                                         
067800     END-PERFORM                                                          
067900     IF  MID-RAD (MAX-RADIND) NOT = ALL '+'                               
068000       MOVE MID-IDRADNR (MAX-RADIND) TO                                   
068100                         MOD-IDRADNR-SENAST                               
068200     END-IF                                                               
068300     IF  WS-FLREPL                                                        
068400       PERFORM IMS-REPL-XXDL                                              
068500       MOVE NEJ      TO WS-FLREPL-TEST                                    
068600     ELSE                                                                 
068700       PERFORM IMS-ISRT-XXDL-4316-STAT-II                                 
068800     END-IF                                                               
068900     CONTINUE.                                                            
069000     EJECT                                                                
069100 S01-ROER-EJ-FAELT SECTION.                                               
069200                                                                          
069300     IF  MID-IDRADNR-SENAST NOT = ALL '+'                                 
069400       MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR-SENAST                       
069500     END-IF                                                               
069600     MOVE +1               TO RADIND                                      
069700                                                                          
069800     PERFORM UNTIL                                                        
069900      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
070000       IF  MID-IDRADNR (RADIND) NOT = ALL '+'                             
070100         MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR (RADIND)                   
070200       END-IF                                                             
070300       IF  MID-KDARTURS (RADIND) NOT = ALL '+'                            
070400         MOVE MFS-ROER-EJ-FAELT TO MOD-KDARTURS (RADIND)                  
070500       END-IF                                                             
070600       ADD +1                 TO RADIND                                   
070700                                                                          
070800     END-PERFORM                                                          
070900     CONTINUE.                                                            
071000     EJECT                                                                
071100 S02-FORMATETS-ATTR SECTION.                                              
071200                                                                          
071300     MOVE +1               TO RADIND                                      
071400                                                                          
071500     PERFORM UNTIL                                                        
071600      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
071700       MOVE MFS-FORMATETS-ATTR TO MOD-IDRADNR-ATTR (RADIND)               
071800       MOVE MFS-FORMATETS-ATTR TO MOD-KDARTURS-ATTR (RADIND)              
071900       ADD +1                 TO RADIND                                   
072000     END-PERFORM                                                          
072100     CONTINUE.                                                            
072200     EJECT                                                                
072300 S90-SKAPA-TOM-003 SECTION.                                               
072400                                                                          
072500     MOVE '002'      TO W-IDPTYP-4316-MIN                                 
072600     MOVE '002'      TO W-IDPTYP-4316-MAX                                 
072700     PERFORM IMS-GET-XXDL-4316-INTERV                                     
072800                                                                          
072900     PERFORM UNTIL                                                        
073000      NOT ( SEGMENT-FINNS )                                               
073100       MOVE '003'              TO W-IDPTYP-4316                           
073200       MOVE 4316-IDKOLLI       TO W-IDKOLLI-4316                          
073300       PERFORM IMS-GET-XXDL-4316-L                                        
073400                                                                          
073500       IF SEGMENT-FINNS                                                   
073600         IF 4316-B-MID-RAD (MAX-4316-IND) NOT = ALL '+'                   
073700           MOVE '4393'        TO 4316-IDTRANS                             
073800                                                                          
073900           MOVE +1            TO 4316-IND                                 
074000                                                                          
074100           PERFORM UNTIL                                                  
074200            NOT ( 4316-IND < MAX-4316-IND OR 4316-IND =                   
074300              MAX-4316-IND )                                              
074400             MOVE ALL '+'    TO 4316-B-MID-RAD (4316-IND)                 
074500             ADD +1          TO 4316-IND                                  
074600           END-PERFORM                                                    
074700           PERFORM IMS-ISRT-XXDL-4316-STAT-II                             
074800         END-IF                                                           
074900       ELSE                                                               
075000         IF 4316-A-MID-RAD (MAX-4316-IND) NOT = ALL '+'                   
075100           MOVE '003'         TO 4316-IDPTYP                              
075200           MOVE 'W4T314'      TO 4316-KDTRANS                             
075300           MOVE +273          TO 4316-LL                                  
075400           MOVE '4394'        TO 4316-IDTRANS                             
075500           MOVE '+'           TO 4316-B-MID-FLSISTAK                      
075600           MOVE 'J'           TO 4316-B-MID-FLFORTSK                      
075700           MOVE 0             TO 4316-B-MID-IDRADNR-FOM-S                 
075800           MOVE 0             TO 4316-B-MID-IDRADNR-TOM-S                 
075900           MOVE 0             TO 4316-B-MID-KVLEVART-S                    
076000           MOVE 'UU'          TO 4316-B-MID-KDPRTVAL-FOLJEFL              
076100           MOVE WS-PRTVAL     TO 4316-B-MID-KDPRTVAL-ADRESSFL             
076200                                                                          
076300           MOVE +1        TO 4316-IND                                     
076400                                                                          
076500           PERFORM UNTIL                                                  
076600            NOT ( 4316-IND < MAX-4316-IND OR 4316-IND =                   
076700              MAX-4316-IND )                                              
076800             MOVE ALL '+'    TO 4316-B-MID-RAD (4316-IND)                 
076900             ADD +1          TO 4316-IND                                  
077000           END-PERFORM                                                    
077100           PERFORM IMS-ISRT-XXDL-4316-STAT-II                             
077200         END-IF                                                           
077300       END-IF                                                             
077400       MOVE '002'               TO W-IDPTYP-4316-KOL-MIN                  
077500       MOVE W-IDKOLLI-4316      TO W-IDKOLLI-4316-KOL-MIN                 
077600       MOVE '002'               TO W-IDPTYP-4316-MAX                      
077700       PERFORM IMS-GET-XXDL-4316-INTERV-KOL-F                             
077800     END-PERFORM                                                          
077900     CONTINUE.                                                            
078000     EJECT                                                                
078100                                                                          
078200 S91-SKAPA-TOM-004 SECTION.                                               
078300                                                                          
078400     MOVE '004'              TO W-IDPTYP-4316                             
078500     MOVE ZERO               TO W-IDKOLLI-4316                            
078600     PERFORM IMS-GET-XXDL-4316-L-BLANK                                    
078700                                                                          
078800     IF 4316-C-MID-RAD (MAX-4316-IND-004) NOT = ALL '+'                   
078900       MOVE LOW-VALUE               TO IO-AREA1                           
079000       MOVE ALL '+'                 TO 4316-WDGX4316                      
079100       MOVE MID-IDPRODNR-UT         TO 4316-IDPRODNR                      
079200       MOVE '004'                   TO 4316-IDPTYP                        
079300       MOVE ZERO                    TO 4316-IDKOLLI                       
079400       MOVE LOW-VALUE               TO 4316-LOWVALUE                      
079500       MOVE ZERO                    TO 4316-KDTRSTAT                      
079600       MOVE +346                    TO 4316-LL                            
079700       MOVE LOW-VALUE               TO 4316-Z1                            
079800       MOVE LOW-VALUE               TO 4316-Z2                            
079900       MOVE 'W4T398X'               TO 4316-KDTRANS                       
080000       MOVE '4394'                  TO 4316-IDTRANS                       
080100       MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                      
080200                                                                          
080300       MOVE MID-IDORDNR-UT       TO 4316-C-MID-IDORDNR-IN                 
080400                                    4316-C-MID-IDORDNR-UT                 
080500                                                                          
080600       MOVE MID-IDDISTR-UT       TO 4316-C-MID-IDDISTR-IN                 
080700                                    4316-C-MID-IDDISTR-UT                 
080800                                                                          
080900       MOVE MID-IDKUNDNR-UT      TO 4316-C-MID-IDKUNDNR-IN                
081000                                    4316-C-MID-IDKUNDNR-UT                
081100                                                                          
081200                                                                          
081300       MOVE MID-IDPRODNR-UT      TO 4316-C-MID-IDPRODNR-IN                
081400                                    4316-C-MID-IDPRODNR-UT                
081500                                                                          
081600       MOVE ZERO                 TO 4316-C-MID-IDKOLLI-IN                 
081700                                    4316-C-MID-IDKOLLI-UT                 
081800                                                                          
081900       PERFORM IMS-ISRT-XXDL-4316-STAT-II                                 
082000     END-IF                                                               
082100     CONTINUE.                                                            
082200     EJECT                                                                
082300                                                                          
082400 S99-NAESTA-TRANS SECTION.                                                
082500                                                                          
082600     PERFORM IMS-GET-XXDK-4311                                            
082700     PERFORM IMS-GET-XXDK-4312                                            
082800                                                                          
082900     IF  MID-RAD (MAX-RADIND) = ALL '+'                                   
083000       IF ((4312-KDBEHAND-GRUND = 0 OR 2)                                 
083100       AND (4312-KDBEHAND-AVVIK = 0 OR 2)                                 
083200       AND (4312-KDBEHAND-RAD   = 0 OR 2)                                 
083300       AND (4312-KDBEHAND-DEL   = 0 OR 2)                                 
083400       AND (4312-KDBEHAND-KOL   = 0 OR 2))                                
083500         MOVE 4312-IDTRANS      TO WS-IDTRANS-MOD                         
083600         PERFORM IMS-DLET-XXDK-4312                                       
083700         PERFORM IMS-GET-XXDL-4315                                        
083800                                                                          
083900         PERFORM S90-SKAPA-TOM-003                                        
084000         PERFORM S91-SKAPA-TOM-004                                        
084100                                                                          
084200         MOVE '001'      TO W-IDPTYP-4316-MIN                             
084300         MOVE '004'      TO W-IDPTYP-4316-MAX                             
084400         PERFORM IMS-GET-XXDL-4316-INTERV-F                               
084500                                                                          
084600         PERFORM UNTIL                                                    
084700          NOT ( SEGMENT-FINNS )                                           
084800           MOVE +1           TO 4316-KDTRSTAT                             
084900           PERFORM IMS-REPL-XXDL                                          
085000           PERFORM IMS-GET-XXDL-4316-INTERV                               
085100         END-PERFORM                                                      
085200         PERFORM IMS-GET-XXDJ-4305                                        
085300         PERFORM IMS-GET-XXDJ-4306                                        
085400         MOVE +3 TO 4306-KDPACLAS                                         
085500         PERFORM IMS-REPL-XXDJ                                            
085600                                                                          
085700         MOVE MFS-KDMFSFOR    TO PTOP-KDMFSFOR                            
085800         PERFORM IMS-INSERT-MSG-ALT-PCB                                   
085900*********************************************************                 
086000                                                                          
086100*** FINNS DET FLER ORDER SOM LIGGER PÅ KÖ FÖR BEARBETNING                 
086200*** LÄGGS DEN FÖRSTA ORDERN UT PÅ DEN BILD SOM STÅR                       
086300*** I TUR FÖR BEARBETNING                                                 
086400*** KVAL MED USERID                                                       
086500                                                                          
086600         MOVE MSG-SIGNON-USERID TO W-WDGXKEY-IDUSER-4312                  
086700         PERFORM IMS-GET-XXDK-4312-STAT-GE-F                              
086800                                                                          
086900         PERFORM UNTIL                                                    
087000          NOT ( (((SEGMENT-FINNS) AND (4312-KDBEHAND-AVVIK = +3           
087100           OR                                                             
087200            4312-KDBEHAND-RAD = +3 OR 4312-KDBEHAND-DEL = +3              
087300            OR 4312-KDBEHAND-URS = +3 OR 4312-KDBEHAND-KOL =              
087400            +3)) OR ((SEGMENT-FINNS) AND (4312-IDTRANS =                  
087500            '4301' OR 4312-IDTRANS = '4303' ))) )                         
087600           PERFORM IMS-GET-XXDK-4312-STAT-GE                              
087700         END-PERFORM                                                      
087800         IF SEGMENT-FINNS                                                 
087900           IF 4312-KDBEHAND-AVVIK = 1                                     
088000             MOVE 'W4O39101'         TO MFS-IDMOD                         
088100             MOVE M4391-MOD-LAENGD TO MSG-KVLL                            
088200             MOVE '4391'             TO M4391-MOD-IDTRANS                 
088300             MOVE 4312-IDPRODNR      TO WS-IDPRODNR                       
088400             MOVE WS-IDPRODNR        TO M4391-MOD-IDPRODNR-UT             
088500             MOVE 4312-IDDISTR       TO WS-IDDISTR                        
088600             MOVE WS-IDDISTR         TO M4391-MOD-IDDISTR-UT              
088700             MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                       
088800             MOVE WS-IDKUNDNR        TO M4391-MOD-IDKUNDNR-UT             
088900             MOVE 4312-KDFRAKT       TO WS-KDFRAKT                        
089000             MOVE WS-KDFRAKT         TO M4391-MOD-KDFRAKT-UT              
089100             MOVE 4312-IDKUNDRF      TO M4391-MOD-IDORDNR-UT              
089200             MOVE 4312-KDORDKL       TO WS-KDORDKL                        
089300             MOVE WS-KDORDKL         TO M4391-MOD-KDORDKL-UT              
089310             MOVE WS-IDDC            TO M4391-MOD-IDDC-UT                 
089320             MOVE WS-PRTVAL          TO M4391-MOD-PRTVAL-ADRESSFL         
089400                                                                          
089500             INSPECT M4391-MOD-IDPRODNR-UT REPLACING                      
089600                                     LEADING ZERO BY SPACE                
089700             INSPECT M4391-MOD-IDDISTR-UT REPLACING                       
089800                                     LEADING ZERO BY SPACE                
089900             INSPECT M4391-MOD-IDKUNDNR-UT REPLACING                      
090000                                     LEADING ZERO BY SPACE                
090100             INSPECT M4391-MOD-KDFRAKT-UT REPLACING                       
090200                                     LEADING ZERO BY SPACE                
090300             INSPECT M4391-MOD-IDORDNR-UT REPLACING                       
090400                                     LEADING ZERO BY SPACE                
090500           ELSE                                                           
090600             EVALUATE TRUE                                                
090700             WHEN 4312-KDBEHAND-AVVIK = 4                                 
090800               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
090900               MOVE WS-IDPRODNR        TO PTOP1-IDPRODNR-IN               
091000               PTOP1-IDPRODNR-UT                                          
091100               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
091200               MOVE WS-IDDISTR         TO PTOP1-IDDISTR-UT                
091300               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
091400               MOVE WS-IDKUNDNR        TO PTOP1-IDKUNDNR-UT               
091500               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
091600               MOVE WS-KDFRAKT         TO PTOP1-KDFRAKT-UT                
091700               MOVE 4312-IDKUNDRF      TO PTOP1-IDORDNR-UT                
091800               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
091900               MOVE WS-KDORDKL         TO PTOP1-KDORDKL-UT                
091910               MOVE WS-IDDC            TO PTOP1-IDDC-UT                   
091920               MOVE WS-PRTVAL          TO PTOP1-PRTVAL-ADRESSFL           
092000               MOVE MFS-KDMFSFOR       TO PTOP1-KDMFSFOR                  
092100               MOVE WS-STARTA-4391     TO WS-MSG-CALL                     
092200             WHEN 4312-KDBEHAND-RAD = 1                                   
092300               MOVE 'W4O39301'         TO MFS-IDMOD                       
092400               MOVE M4393-MOD-LAENGD TO MSG-KVLL                          
092500               MOVE '4393'             TO M4393-MOD-IDTRANS               
092600               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
092700               MOVE WS-IDPRODNR        TO M4393-MOD-IDPRODNR-UT           
092800               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
092900               MOVE WS-IDDISTR         TO M4393-MOD-IDDISTR-UT            
093000               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
093100               MOVE WS-IDKUNDNR        TO M4393-MOD-IDKUNDNR-UT           
093200               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
093300               MOVE WS-KDFRAKT         TO M4393-MOD-KDFRAKT-UT            
093400               MOVE 4312-IDKUNDRF      TO M4393-MOD-IDORDNR-UT            
093500               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
093600               MOVE WS-KDORDKL         TO M4393-MOD-KDORDKL-UT            
093610               MOVE WS-IDDC            TO M4393-MOD-IDDC-UT               
093620               MOVE WS-PRTVAL        TO M4393-MOD-PRTVAL-ADRESSFL         
093700                                                                          
093800               INSPECT M4393-MOD-IDPRODNR-UT REPLACING                    
093900                                       LEADING ZERO BY SPACE              
094000               INSPECT M4393-MOD-IDDISTR-UT REPLACING                     
094100                                       LEADING ZERO BY SPACE              
094200               INSPECT M4393-MOD-IDKUNDNR-UT REPLACING                    
094300                                       LEADING ZERO BY SPACE              
094400               INSPECT M4393-MOD-KDFRAKT-UT REPLACING                     
094500                                       LEADING ZERO BY SPACE              
094600               INSPECT M4393-MOD-IDORDNR-UT REPLACING                     
094700                                       LEADING ZERO BY SPACE              
094800             WHEN 4312-KDBEHAND-URS = 1                                   
094900               MOVE 'W4O39401' TO MFS-IDMOD                               
095000               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
095100               MOVE '4394'             TO MOD-IDTRANS                     
095200               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
095300               MOVE WS-IDPRODNR        TO MOD-IDPRODNR-UT                 
095400               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
095500               MOVE WS-IDDISTR         TO MOD-IDDISTR-UT                  
095600               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
095700               MOVE WS-IDKUNDNR        TO MOD-IDKUNDNR-UT                 
095800               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
095900               MOVE WS-KDFRAKT         TO MOD-KDFRAKT-UT                  
096000               MOVE 4312-IDKUNDRF      TO MOD-IDORDNR-UT                  
096100               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
096200               MOVE WS-KDORDKL         TO MOD-KDORDKL-UT                  
096210               MOVE WS-IDDC            TO MOD-IDDC-UT                     
096220               MOVE WS-PRTVAL          TO MOD-PRTVAL-ADRESSFL             
096300                                                                          
096400               INSPECT MOD-IDPRODNR-UT REPLACING                          
096500                                       LEADING ZERO BY SPACE              
096600               INSPECT MOD-IDDISTR-UT REPLACING                           
096700                                       LEADING ZERO BY SPACE              
096800               INSPECT MOD-IDKUNDNR-UT REPLACING                          
096900                                       LEADING ZERO BY SPACE              
097000               INSPECT MOD-KDFRAKT-UT REPLACING                           
097100                                       LEADING ZERO BY SPACE              
097200               INSPECT MOD-IDORDNR-UT REPLACING                           
097300                                       LEADING ZERO BY SPACE              
097400                                                                          
097500               PERFORM S02-FORMATETS-ATTR                                 
097600                                                                          
097700             WHEN 4312-KDBEHAND-DEL = 1                                   
097800               MOVE 'W4O39501' TO MFS-IDMOD                               
097900               MOVE M4395-MOD-LAENGD TO MSG-KVLL                          
098000               MOVE '4395'             TO M4395-MOD-IDTRANS               
098100               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
098200               MOVE WS-IDPRODNR        TO M4395-MOD-IDPRODNR-UT           
098300               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
098400               MOVE WS-IDDISTR         TO M4395-MOD-IDDISTR-UT            
098500               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
098600               MOVE WS-IDKUNDNR        TO M4395-MOD-IDKUNDNR-UT           
098700               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
098800               MOVE WS-KDFRAKT         TO M4395-MOD-KDFRAKT-UT            
098900               MOVE 4312-IDKUNDRF      TO M4395-MOD-IDORDNR-UT            
099000               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
099100               MOVE WS-KDORDKL         TO M4395-MOD-KDORDKL-UT            
099110               MOVE WS-IDDC            TO M4395-MOD-IDDC-UT               
099120               MOVE WS-PRTVAL       TO M4395-MOD-PRTVAL-ADRESSFL          
099200                                                                          
099300               INSPECT M4395-MOD-IDPRODNR-UT REPLACING                    
099400                                       LEADING ZERO BY SPACE              
099500               INSPECT M4395-MOD-IDDISTR-UT REPLACING                     
099600                                       LEADING ZERO BY SPACE              
099700               INSPECT M4395-MOD-IDKUNDNR-UT REPLACING                    
099800                                       LEADING ZERO BY SPACE              
099900               INSPECT M4395-MOD-KDFRAKT-UT REPLACING                     
100000                                       LEADING ZERO BY SPACE              
100100               INSPECT M4395-MOD-IDORDNR-UT REPLACING                     
100200                                       LEADING ZERO BY SPACE              
100300              WHEN OTHER                                                  
100400               MOVE 'W4O39601' TO MFS-IDMOD                               
100500               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
100600               MOVE '4396'             TO M4396-MOD-IDTRANS               
100700               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
100800               MOVE WS-IDPRODNR        TO M4396-MOD-IDPRODNR-UT           
100900               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
101000               MOVE WS-IDDISTR         TO M4396-MOD-IDDISTR-UT            
101100               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
101200               MOVE WS-IDKUNDNR        TO M4396-MOD-IDKUNDNR-UT           
101300               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
101400               MOVE WS-KDFRAKT         TO M4396-MOD-KDFRAKT-UT            
101500               MOVE 4312-IDKUNDRF      TO M4396-MOD-IDORDNR-UT            
101600               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
101700               MOVE WS-KDORDKL         TO M4396-MOD-KDORDKL-UT            
101710               MOVE WS-IDDC            TO M4396-MOD-IDDC-UT               
101720               MOVE WS-PRTVAL        TO M4396-MOD-PRTVAL-ADRESSFL         
101800                                                                          
101900               INSPECT M4396-MOD-IDPRODNR-UT REPLACING                    
102000                                       LEADING ZERO BY SPACE              
102100               INSPECT M4396-MOD-IDDISTR-UT REPLACING                     
102200                                       LEADING ZERO BY SPACE              
102300               INSPECT M4396-MOD-IDKUNDNR-UT REPLACING                    
102400                                       LEADING ZERO BY SPACE              
102500               INSPECT M4396-MOD-KDFRAKT-UT REPLACING                     
102600                                       LEADING ZERO BY SPACE              
102700               INSPECT M4396-MOD-IDORDNR-UT REPLACING                     
102800                                       LEADING ZERO BY SPACE              
102900                                                                          
103000             END-EVALUATE                                                 
103100           END-IF                                                         
103200         ELSE                                                             
103300           MOVE 'W4O30202'      TO MFS-IDMOD                              
103400           MOVE M4302-MOD-LAENGD TO MSG-KVLL                              
103500           MOVE '4302'             TO M4302-MOD-IDTRANS                   
103600           MOVE INF-1 (INDX)       TO M4302-MOD-TEMFSINF                  
103700         END-IF                                                           
103800       ELSE                                                               
103900         MOVE +2 TO 4312-KDBEHAND-URS                                     
104000         PERFORM IMS-REPL-XXDK                                            
104100                                                                          
104200         IF 4312-KDBEHAND-DEL = +1                                        
104300           MOVE 'W4O39501' TO MFS-IDMOD                                   
104400           MOVE M4395-MOD-LAENGD TO MSG-KVLL                              
104500           MOVE '4395'             TO M4395-MOD-IDTRANS                   
104600           MOVE MID-IDPRODNR-UT    TO M4395-MOD-IDPRODNR-UT               
104700           MOVE MID-IDDISTR-UT     TO M4395-MOD-IDDISTR-UT                
104800           MOVE MID-IDKUNDNR-UT    TO M4395-MOD-IDKUNDNR-UT               
104900           MOVE MID-KDFRAKT-UT     TO M4395-MOD-KDFRAKT-UT                
105000           MOVE MID-IDORDNR-UT     TO M4395-MOD-IDORDNR-UT                
105100           MOVE MID-KDORDKL-UT     TO M4395-MOD-KDORDKL-UT                
105110           MOVE MID-IDDC-UT        TO M4395-MOD-IDDC-UT                   
105200                                                                          
105300           INSPECT M4395-MOD-IDPRODNR-UT REPLACING                        
105400                                   LEADING ZERO BY SPACE                  
105500           INSPECT M4395-MOD-IDDISTR-UT REPLACING                         
105600                                   LEADING ZERO BY SPACE                  
105700           INSPECT M4395-MOD-IDKUNDNR-UT REPLACING                        
105800                                   LEADING ZERO BY SPACE                  
105900           INSPECT M4395-MOD-KDFRAKT-UT REPLACING                         
106000                                   LEADING ZERO BY SPACE                  
106100           INSPECT M4395-MOD-IDORDNR-UT REPLACING                         
106200                                   LEADING ZERO BY SPACE                  
106300                                                                          
106400                                                                          
106500         ELSE                                                             
106600           EVALUATE TRUE                                                  
106700           WHEN 4312-KDBEHAND-KOL = +1                                    
106800             MOVE MID-IDPRODNR-UT    TO PTOP2-IDPRODNR-IN                 
106900                                        PTOP2-IDPRODNR-UT                 
107000             MOVE MID-IDDISTR-UT     TO PTOP2-IDDISTR-UT                  
107100             MOVE MID-IDKUNDNR-UT    TO PTOP2-IDKUNDNR-UT                 
107200             MOVE MID-KDFRAKT-UT     TO PTOP2-KDFRAKT-UT                  
107300             MOVE MID-IDORDNR-UT     TO PTOP2-IDORDNR-UT                  
107400             MOVE MID-KDORDKL-UT     TO PTOP2-KDORDKL-UT                  
107410             MOVE MID-IDDC-UT        TO PTOP2-IDDC-UT                     
107420             MOVE MID-PRTVAL-ADRESSFL TO PTOP2-PRTVAL-ADRESSFL            
107500             MOVE MFS-KDMFSFOR       TO PTOP2-KDMFSFOR                    
107600             MOVE WS-STARTA-4392     TO WS-MSG-CALL                       
107700           END-EVALUATE                                                   
107800         END-IF                                                           
107900       END-IF                                                             
108000     ELSE                                                                 
108100       MOVE MAX-MOD-LAENGD TO MSG-KVLL                                    
108200       PERFORM S02-FORMATETS-ATTR                                         
108300     END-IF                                                               
108400     CONTINUE.                                                            
108500     EJECT                                                                
108600* IMS SEKTIONER                                                           
108700     SKIP3                                                                
108800 IMS-GET-MSG SECTION.                                                     
108900     MOVE '  QC' TO GODK-STATUSKODER                                      
109000     CALL CBLTDLI USING GU MSG-PCB MSG-IO-AREA                            
109100     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
109200     PERFORM IMS-STATUSKONTROLL                                           
109300     CONTINUE.                                                            
109400     SKIP3                                                                
109500 IMS-INSERT-MSG SECTION.                                                  
109600     IF ENGLISH-TEXT                                                      
109700       MOVE NEJ TO MFS-KDHUVOMR                                           
109800     END-IF                                                               
109900     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
110000     MOVE SPACE TO GODK-STATUSKODER                                       
110100     CALL CBLTDLI USING ISRT MSG-PCB MSG-IO-AREA MFS-IDMOD                
110200     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
110300     PERFORM IMS-STATUSKONTROLL                                           
110400     CONTINUE.                                                            
110500     SKIP3                                                                
110600 IMS-INSERT-MSG-ALT-PCB SECTION.                                          
110700     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
110800     MOVE SPACE TO GODK-STATUSKODER                                       
110900     CALL CBLTDLI USING ISRT ALT-PCB P-TO-P-SW                            
111000     MOVE ALT-STATUS-CODE TO STATUS-WS                                    
111100     PERFORM IMS-STATUSKONTROLL                                           
111200     CONTINUE.                                                            
111300     EJECT                                                                
111400 IMS-INSERT-MSG-ALT1-PCB SECTION.                                         
111500     MOVE SPACE TO GODK-STATUSKODER                                       
111600     CALL CBLTDLI USING ISRT ALT1-PCB P-TO-P-SW1                          
111700     MOVE ALT1-STATUS-CODE TO STATUS-WS                                   
111800     PERFORM IMS-STATUSKONTROLL                                           
111900     CONTINUE.                                                            
112000     SKIP2                                                                
112100 IMS-INSERT-MSG-ALT2-PCB SECTION.                                         
112200     MOVE SPACE TO GODK-STATUSKODER                                       
112300     CALL CBLTDLI USING ISRT ALT2-PCB P-TO-P-SW2                          
112400     MOVE ALT2-STATUS-CODE TO STATUS-WS                                   
112500     PERFORM IMS-STATUSKONTROLL                                           
112600     CONTINUE.                                                            
112700     SKIP3                                                                
112800 IMS-GET-XXDJ-4305 SECTION.                                               
112900     STRING 'WLXXDJ01(WDGXKEY  =' W-WDGXKEY-4305-X ')'                    
113000            DELIMITED BY SIZE INTO SSA1                                   
113100     MOVE '  '   TO GODK-STATUSKODER                                      
113200     CALL CBLTDLI USING GU XXDJ-PCB DLI-IO-AREA1 SSA1                     
113300     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
113400     PERFORM IMS-STATUSKONTROLL                                           
113500     CONTINUE.                                                            
113600     SKIP3                                                                
113700 IMS-GET-XXDJ-4306 SECTION.                                               
113800     STRING 'WLXXDJ11*F(WDGXKEY  =' W-WDGXKEY-4306-X ')'                  
113900            DELIMITED BY SIZE INTO SSA1                                   
114000     MOVE '  '   TO GODK-STATUSKODER                                      
114100     CALL CBLTDLI USING GHNP XXDJ-PCB DLI-IO-AREA1 SSA1                   
114200     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
114300     PERFORM IMS-STATUSKONTROLL                                           
114400     CONTINUE.                                                            
114500     EJECT                                                                
114600 IMS-GET-XXDJ-4308-F SECTION.                                             
114700     STRING 'WLXXDJ11*F(WDGXKEY  =' W-WDGXKEY-4306-X ')'                  
114800            DELIMITED BY SIZE INTO SSA1                                   
114900     MOVE 'WLXXDJ21 '    TO SSA2                                          
115000     MOVE '  GE' TO GODK-STATUSKODER                                      
115100     CALL CBLTDLI USING GNP XXDJ-PCB DLI-IO-AREA1 SSA1 SSA2               
115200     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
115300     PERFORM IMS-STATUSKONTROLL                                           
115400     CONTINUE.                                                            
115500     SKIP3                                                                
115600 IMS-GET-XXDJ-4308 SECTION.                                               
115700     STRING 'WLXXDJ11(WDGXKEY  =' W-WDGXKEY-4306-X ')'                    
115800            DELIMITED BY SIZE INTO SSA1                                   
115900     MOVE 'WLXXDJ21 '    TO SSA2                                          
116000     MOVE '  GE' TO GODK-STATUSKODER                                      
116100     CALL CBLTDLI USING GNP XXDJ-PCB DLI-IO-AREA1 SSA2                    
116200     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
116300     PERFORM IMS-STATUSKONTROLL                                           
116400     CONTINUE.                                                            
116500     SKIP3                                                                
116600 IMS-REPL-XXDJ SECTION.                                                   
116700     MOVE '  '   TO GODK-STATUSKODER                                      
116800     CALL CBLTDLI USING REPL XXDJ-PCB DLI-IO-AREA1                        
116900     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
117000     PERFORM IMS-STATUSKONTROLL                                           
117100     CONTINUE.                                                            
117200                                                                          
117300     EJECT                                                                
117400 IMS-GET-XXDK-4311 SECTION.                                               
117500     STRING 'WLXXDK01(WDGXKEY  =' W-WDGXKEY-4311-X ')'                    
117600            DELIMITED BY SIZE INTO SSA1                                   
117700     MOVE '  '     TO GODK-STATUSKODER                                    
117800     CALL CBLTDLI USING GU XXDK-PCB DLI-IO-AREA1 SSA1                     
117900     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
118000     PERFORM IMS-STATUSKONTROLL                                           
118100     CONTINUE.                                                            
118200     SKIP3                                                                
118300 IMS-GET-XXDK-4312 SECTION.                                               
118400     STRING 'WLXXDK11(WDGXKEY  =' W-WDGXKEY-4312-X ')'                    
118500            DELIMITED BY SIZE INTO SSA1                                   
118600     MOVE '  '     TO GODK-STATUSKODER                                    
118700     CALL CBLTDLI USING GHNP XXDK-PCB DLI-IO-AREA1 SSA1                   
118800     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
118900     PERFORM IMS-STATUSKONTROLL                                           
119000     CONTINUE.                                                            
119100     SKIP3                                                                
119200 IMS-GET-XXDK-4312-STAT-GE SECTION.                                       
119300     STRING 'WLXXDK11(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'               
119400            DELIMITED BY SIZE INTO SSA1                                   
119500     MOVE '  GE'   TO GODK-STATUSKODER                                    
119600     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA1 SSA1                    
119700     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
119800     PERFORM IMS-STATUSKONTROLL                                           
119900     CONTINUE.                                                            
120000     EJECT                                                                
120100 IMS-GET-XXDK-4312-STAT-GE-F SECTION.                                     
120200     STRING 'WLXXDK11*F(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'             
120300            DELIMITED BY SIZE INTO SSA1                                   
120400     MOVE '  GE'   TO GODK-STATUSKODER                                    
120500     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA1 SSA1                    
120600     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
120700     PERFORM IMS-STATUSKONTROLL                                           
120800     CONTINUE.                                                            
120900     SKIP3                                                                
121000 IMS-DLET-XXDK-4312 SECTION.                                              
121100     MOVE '  '   TO GODK-STATUSKODER                                      
121200     CALL CBLTDLI USING DLET XXDK-PCB DLI-IO-AREA1                        
121300     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
121400     PERFORM IMS-STATUSKONTROLL                                           
121500     CONTINUE.                                                            
121600     SKIP3                                                                
121700 IMS-REPL-XXDK SECTION.                                                   
121800     MOVE '  '   TO GODK-STATUSKODER                                      
121900     CALL CBLTDLI USING REPL XXDK-PCB DLI-IO-AREA1                        
122000     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
122100     PERFORM IMS-STATUSKONTROLL                                           
122200     CONTINUE.                                                            
122300     EJECT                                                                
122400 IMS-GET-XXDL-4315 SECTION.                                               
122500     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
122600            DELIMITED BY SIZE INTO SSA1                                   
122700     MOVE '  '     TO GODK-STATUSKODER                                    
122800     CALL CBLTDLI USING GU XXDL-PCB DLI-IO-AREA1 SSA1                     
122900     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
123000     PERFORM IMS-STATUSKONTROLL                                           
123100     CONTINUE.                                                            
123200     SKIP3                                                                
123300 IMS-GET-XXDL-4316-L SECTION.                                             
123400     STRING 'WLXXDL11*L(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
123500            DELIMITED BY SIZE INTO SSA1                                   
123600     MOVE '  GE'     TO GODK-STATUSKODER                                  
123700     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA1 SSA1                   
123800     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
123900     PERFORM IMS-STATUSKONTROLL                                           
124000     CONTINUE.                                                            
124100     SKIP3                                                                
124200 IMS-GET-XXDL-4316-L-BLANK SECTION.                                       
124300     STRING 'WLXXDL11*L(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
124400            DELIMITED BY SIZE INTO SSA1                                   
124500     MOVE '  '     TO GODK-STATUSKODER                                    
124600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA1 SSA1                   
124700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
124800     PERFORM IMS-STATUSKONTROLL                                           
124900     CONTINUE.                                                            
125000     EJECT                                                                
125100 IMS-GET-XXDL-4316-INTERV SECTION.                                        
125200     STRING 'WLXXDL11(WDGXKEY  >' W-WDGXKEY-4316-X-MIN                    
125300     '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'                               
125400            DELIMITED BY SIZE INTO SSA1                                   
125500     MOVE '  GE'     TO GODK-STATUSKODER                                  
125600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA1 SSA1                   
125700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
125800     PERFORM IMS-STATUSKONTROLL                                           
125900     CONTINUE.                                                            
126000     SKIP3                                                                
126100 IMS-GET-XXDL-4316-INTERV-KOL-F SECTION.                                  
126200     STRING 'WLXXDL11*F(WDGXKEY  >' W-WDGXKEY-4316-X-KOL-MIN              
126300                      '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'              
126400            DELIMITED BY SIZE INTO SSA1                                   
126500     MOVE '  GE'     TO GODK-STATUSKODER                                  
126600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA1 SSA1                   
126700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
126800     PERFORM IMS-STATUSKONTROLL                                           
126900     CONTINUE.                                                            
127000     SKIP3                                                                
127100 IMS-GET-XXDL-4316-INTERV-F SECTION.                                      
127200     STRING 'WLXXDL11*F(WDGXKEY  >' W-WDGXKEY-4316-X-MIN                  
127300     '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'                               
127400            DELIMITED BY SIZE INTO SSA1                                   
127500     MOVE '  '       TO GODK-STATUSKODER                                  
127600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA1 SSA1                   
127700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
127800     PERFORM IMS-STATUSKONTROLL                                           
127900     CONTINUE.                                                            
128000     EJECT                                                                
128100 IMS-ISRT-XXDL-4316-STAT-II SECTION.                                      
128200     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
128300            DELIMITED BY SIZE INTO SSA1                                   
128400     MOVE   'WLXXDL11 '         TO SSA2                                   
128500     MOVE '  II'     TO GODK-STATUSKODER                                  
128600     CALL CBLTDLI USING ISRT XXDL-PCB DLI-IO-AREA1 SSA1 SSA2              
128700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
128800     PERFORM IMS-STATUSKONTROLL                                           
128900     CONTINUE.                                                            
129000     SKIP3                                                                
129100 IMS-REPL-XXDL SECTION.                                                   
129200     MOVE '  '       TO GODK-STATUSKODER                                  
129300     CALL CBLTDLI USING REPL XXDL-PCB DLI-IO-AREA1                        
129400     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
129500     PERFORM IMS-STATUSKONTROLL                                           
129600     CONTINUE.                                                            
129700     EJECT                                                                
129800 IMS-GET-WDE4 SECTION.                                                    
129900     STRING 'WDE411  (WDE4BSEQ =' W-WDE4BSEQ-X ')'                        
130000            DELIMITED BY SIZE INTO SSA1                                   
130100     MOVE '  GE'     TO GODK-STATUSKODER                                  
130200     CALL CBLTDLI USING GU WDE4-PCB DLI-IO-AREA2 SSA1                     
130300     MOVE WDE4-STATUS-CODE TO STATUS-WS                                   
130400     PERFORM IMS-STATUSKONTROLL                                           
130500     CONTINUE.                                                            
130600     SKIP3                                                                
130700 IMS-STATUSKONTROLL SECTION.                                              
130800     SET STATUS-IX TO 1                                                   
130900     SEARCH GODK-STATUS AT END CALL FELLOG                                
131000     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS CONTINUE                    
131100     END-SEARCH                                                           
131200     CONTINUE.                                                            
