000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300     SKIP3                                                                
000400 ID DIVISION.                                                             
000500     SKIP2                                                                
000600 PROGRAM-ID.     W4039200.                                                
000700*              PROGRAM CONVERTED BY                                       
000800*              COBOL CONVERSION AID PO 5785-ABJ                           
000900*              CONVERSION DATE 05/25/91 11:00:44.                         
001000*AUTHOR.         SVANTE BJÖRKBERG.                                        
001100*DATE-WRITTEN.   SEP -87.                                                 
001200                                                                          
001300*    REMARKS.                                                             
001400*                                                                         
001500*    FUNKTION.                                                            
001600*        BILD 4392.                                                       
001700*        PACKNINGSRAPPORTERING ORDERVIS                                   
001800*        KOLLI SVERIGE.                                                   
001900*                                                                         
002000*                                                                         
002100*    INDATA.                                                              
002200*        TRANSAKTION: W4T392                                              
002300*        MID:         W4I39201-MID.                                       
002400*                                                                         
002500*    UTDATA.                                                              
002600*        TRANSAKTION: W0T605                                              
002700*        MOD:         W4O39201-MOD.                                       
002800*                     W4O30102-MOD.                                       
002900*                     RXOXXX01-MOD.                                       
003000*    SKIP3                                                                
003100 ENVIRONMENT DIVISION.                                                    
003200     SKIP3                                                                
003300 DATA DIVISION.                                                           
003400     EJECT                                                                
003500 WORKING-STORAGE SECTION.                                                 
003510                                                                          
003600*    -- CHECKED BY WY2000                                                 
003700 77  INDENT-I PIC X(40) VALUE                                             
003800     'W4039200 91/05/25 TIME 09.41 VILMAII'.                              
003900***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
004000*                                                                         
004100 77  PROGRAM-NAMN REDEFINES INDENT-I                                      
004200                                 PIC X(8).                                
004300 77    INDX                      PIC S9(9)   VALUE +0   COMP SYNC.        
004400 77    RADIND                    PIC S9(9)   VALUE +0   COMP SYNC.        
004500 77    IX                        PIC S9(9)   VALUE +0   COMP SYNC.        
004600 77    MAX-RADIND                PIC S9(9)   VALUE +13  COMP SYNC.        
004700 77    MAX-RADIND-PLUS-1         PIC S9(9)   VALUE +14  COMP SYNC.        
004800 77    4316-IND                  PIC S9(9)   VALUE +0   COMP SYNC.        
004900 77    MAX-4316-IND              PIC S9(9)   VALUE +12  COMP SYNC.        
005000 77    MAX-4316-IND-004          PIC S9(9)   VALUE +26  COMP SYNC.        
005100 77    MAX-MOD-LAENGD            PIC S9(4)   VALUE +360 COMP SYNC.        
005200 77    MIN-MOD-LAENGD            PIC S9(4)   VALUE +48  COMP SYNC.        
005300 77    M4301-MOD-LAENGD          PIC S9(4)   VALUE +109 COMP SYNC.        
005400 77    M4391-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005500 77    M4393-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005600 77    M4394-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005700 77    M4395-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005800 77    RAETT                     PIC X       VALUE 'R'.                   
005900 77    FEL                       PIC X       VALUE 'F'.                   
006000 77    JA                        PIC X       VALUE 'J'.                   
006100 77    NEJ                       PIC X       VALUE 'N'.                   
006200     EJECT                                                                
006300 01  WS-MSG-CALL-GRP.                                                     
006400   03  WS-MSG-CALL               PIC X.                                   
006500     88  VISA-NAESTA-BILD                    VALUE '0'.                   
006600     88  STARTA-4301                         VALUE '1'.                   
006700     88  STARTA-4302                         VALUE '2'.                   
006800     88  STARTA-4303                         VALUE '3'.                   
006900     88  STARTA-4391                         VALUE '4'.                   
007000     88  STARTA-4392                         VALUE '5'.                   
007100     88  STARTA-4393                         VALUE '6'.                   
007200     88  STARTA-4394                         VALUE '7'.                   
007300     88  STARTA-4395                         VALUE '8'.                   
007400     88  STARTA-4396                         VALUE '9'.                   
007500   03  WS-VISA-NAESTA-BILD       PIC X       VALUE '0'.                   
007600   03  WS-STARTA-4301            PIC X       VALUE '1'.                   
007700   03  WS-STARTA-4302            PIC X       VALUE '2'.                   
007800   03  WS-STARTA-4303            PIC X       VALUE '3'.                   
007900   03  WS-STARTA-4391            PIC X       VALUE '4'.                   
008000   03  WS-STARTA-4392            PIC X       VALUE '5'.                   
008100   03  WS-STARTA-4393            PIC X       VALUE '6'.                   
008200   03  WS-STARTA-4394            PIC X       VALUE '7'.                   
008300   03  WS-STARTA-4395            PIC X       VALUE '8'.                   
008400   03  WS-STARTA-4396            PIC X       VALUE '9'.                   
008500     EJECT                                                                
008600 01    DYNAMISKA-SUBPGM.                                                  
008700   03    WDECEDIT                PIC X(8)    VALUE 'WDECEDIT'.            
008800   03    CBLTDLI                 PIC X(8)    VALUE 'CBLTDLI '.            
008900   03    FELLOG                  PIC X(8)    VALUE 'FELLOG  '.            
009000     EJECT                                                                
009100 01    FILLER                    PIC X(16)                                
009200                                 VALUE 'WS-MODNAMN'.                      
009300 01    WS-MODNAMN.                                                        
009400   03    FILLER                  PIC X       VALUE 'W'.                   
009500   03    WS-MOD-IDTRANS-POS-1    PIC X       VALUE SPACE.                 
009600   03    FILLER                  PIC X       VALUE 'O'.                   
009700   03    WS-MOD-IDTRANS-POS-2-4  PIC X(3)    VALUE SPACE.                 
009800   03    FILLER                  PIC X(2)    VALUE '01'.                  
009900                                                                          
010000 01    FILLER                    PIC X(16)                                
010100                                 VALUE 'WS-IDTRANS-MOD'.                  
010200 01    WS-IDTRANS-MOD.                                                    
010300   03    WS-IDTRANS-POS-1-MOD    PIC X       VALUE SPACE.                 
010400   03    WS-IDTRANS-POS-2-4-MOD  PIC X(3)    VALUE SPACE.                 
010500                                                                          
010600 01    FILLER                    PIC X(16)   VALUE 'DIVERSE'.             
010700 01    DIVERSE.                                                           
010800                                                                          
010900   03    W-IDDC                  PIC X(2).                                
011000   03    W-IDPRODNR              PIC S9(7)   VALUE ZERO.                  
011100                                                                          
011200   03    WS-FLKLAR-TEST          PIC X       VALUE SPACE.                 
011300         88  WS-FLKLAR                       VALUE 'J'.                   
011400                                                                          
011500   03    WS-INDATA-TEST          PIC X       VALUE SPACE.                 
011600         88  WS-INDATA-FEL                   VALUE 'F'.                   
011700         88  WS-INDATA-RAETT                 VALUE 'R'.                   
011800                                                                          
011900   03    WS-IDTRANS              PIC X(4)    VALUE SPACE.                 
012000         88  WS-GODKAEND-BILD    VALUE  '4301' '4391'.                    
012100         88  WS-EGEN-BILD        VALUE  '4392'.                           
012200                                                                          
012300   03    WS-VKORDBTO-X.                                                   
012400         05    WS-VKORDBTO-RED   PIC 9(5).9  VALUE ZERO.                  
012500                                                                          
012600   03    WS-IDEDITDATA           PIC 9(5)V9  VALUE ZERO.                  
012700   03    WS-VKORDBTO REDEFINES WS-IDEDITDATA.                             
012800         05  FILLER              PIC 9(5).                                
012900         05  WS-VKORDBTO-DEC     PIC 9.                                   
013000                                                                          
013100   03    FILLER                  PIC X(8)    VALUE 'AAAAAAAA'.            
013101   03    WS-FELTEXT              PIC X(16)   VALUE SPACE.                 
013110   03    WS-IDPRODNR             PIC 9(7)    VALUE ZERO.                  
013200   03    WS-IDDISTR              PIC 9(4)    VALUE ZERO.                  
013300   03    WS-IDKUNDNR             PIC 9(6)    VALUE ZERO.                  
013400   03    WS-KDFRAKT              PIC 9(2)    VALUE ZERO.                  
013500   03    WS-KDORDKL              PIC 9       VALUE ZERO.                  
013600                                                                          
013700                                                                          
013800 01  FILLER                      PIC X(16)   VALUE 'WS-TAB'.              
013900 01  WS-TAB.                                                              
014000   03  WS-TABSTEG OCCURS 13.                                              
014100     05  WSEMB-KDEMBTYP          PIC 9.                                   
014200     05  WSTAB-VKORDBTO-X.                                                
014300       07  WSTAB-VKORDBTO          PIC 9(7).                              
014400                                                                          
014500     EJECT                                                                
014600                                                                          
014700 01  FILLER                      PIC X(16)   VALUE 'WDECAREA'.            
014800*01  -COPY WDECAREA                                                       
014900                                                                          
015000     EJECT                                                                
015100 01    FILLER                    PIC X(16)                                
015200                                 VALUE 'NYCKLAR-TILL-DLI'.                
015300 01    NYCKLAR-TILL-DLI.                                                  
015400                                                                          
015500   03    W-WDGXKEY-4305-X.                                                
015600     05    FILLER                PIC X(4)    VALUE '4305'.                
015700     05    W-IDDC-4305           PIC X(2).                                
015800     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
015900                                                                          
016000   03    W-WDGXKEY-4306-X.                                                
016100     05    W-IDPRODNR-4306       PIC S9(7)   VALUE ZERO  COMP-3.          
016200     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
016300                                                                          
016400   03    W-WDGXKEY-4311-X.                                                
016500     05    FILLER                PIC X(4)    VALUE '4311'.                
016600     05    W-IDDC-4311           PIC X(2).                                
016700     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
016800                                                                          
016900   03    W-WDGXKEY-4312-X.                                                
017000     05    W-IDPRODNR-4312       PIC S9(7)   VALUE ZERO  COMP-3.          
017100     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
017200                                                                          
017300   03    W-WDGXKEY-IDUSER-4312   PIC X(8)    VALUE SPACE.                 
017400                                                                          
017500   03    W-WDGXKEY-4315-X.                                                
017600     05    FILLER                PIC X(4)    VALUE '4315'.                
017700     05    FILLER                PIC X(26)   VALUE LOW-VALUE.             
017800                                                                          
017900   03    W-WDGXKEY-4316-X.                                                
018000     05    W-IDPRODNR-4316       PIC S9(7)   VALUE ZERO  COMP-3.          
018100     05    W-IDPTYP-4316         PIC X(3)    VALUE SPACE.                 
018200     05    W-IDKOLLI-4316        PIC S9(5)   VALUE ZERO  COMP-3.          
018300     05    FILLER                PIC X(10)   VALUE LOW-VALUE.             
018400                                                                          
018500                                                                          
018600   03    W-WDGXKEY-4316-X-KOL-MIN.                                        
018700     05    W-IDPRODNR-4316-KOL-MIN PIC S9(7)   VALUE ZERO  COMP-3.        
018800     05    W-IDPTYP-4316-KOL-MIN   PIC X(3)    VALUE '002'.               
018900     05    W-IDKOLLI-4316-KOL-MIN  PIC S9(5)   VALUE ZERO  COMP-3.        
019000     05    FILLER                  PIC X(10)   VALUE LOW-VALUE.           
019100                                                                          
019200   03    W-WDGXKEY-4316-X-MIN.                                            
019300     05    W-IDPRODNR-4316-MIN   PIC S9(7)  VALUE ZERO  COMP-3.           
019400     05    W-IDPTYP-4316-MIN     PIC X(3)   VALUE SPACE.                  
019500     05    FILLER                PIC X(13)  VALUE LOW-VALUE.              
019600                                                                          
019700   03    W-WDGXKEY-4316-X-MAX.                                            
019800     05    W-IDPRODNR-4316-MAX   PIC S9(7)  VALUE ZERO  COMP-3.           
019900     05    W-IDPTYP-4316-MAX     PIC X(3)   VALUE SPACE.                  
020000     05    FILLER                PIC X(13)  VALUE HIGH-VALUE.             
020100                                                                          
020200   03    W-KDKOLLI-WDK5          PIC X(8)   VALUE SPACE.                  
020201*                                                                         
020210****************************                                              
020220 01    FILLER                    PIC X(16)   VALUE 'WWDIST  '.            
020230 01    TEST-IDDISTR              PIC  9(5)   VALUE ZERO COMP-3.           
020240 01    FILLER REDEFINES TEST-IDDISTR.                                     
020250*  03  -COPY WWDIST03.                                                    
020251****************************                                              
020260     SKIP2                                                                
020300                                                                          
020400     EJECT                                                                
020500 01    FILLER                    PIC X(16)   VALUE 'MEDDELANDE'.          
020600 01    MEDDELANDE.                                                        
020700                                                                          
020800   03    FEL1.                                                            
020900      05    FILLER               PIC X(40)   VALUE                        
021000           '748. UPPLYSTA FÄLT FEL'.                                      
021100      05    FILLER               PIC X(40)   VALUE                        
021200           '748. VERLICHTE ZONE FOUTIEF'.                                 
021300   03    FILLER  REDEFINES FEL1.                                          
021400      05    FEL-1                PIC X(40)   OCCURS 2.                    
021500                                                                          
021600   03    FEL2.                                                            
021700      05    FILLER               PIC X(40)   VALUE                        
021800           '754. FEL I NYCKEL BÖRJA FRÅN GRUND-BILD'.                     
021900      05    FILLER               PIC X(40)   VALUE                        
022000           '754. HERBEGIN VANAF BASISBEELD'.                              
022100   03    FILLER  REDEFINES FEL2.                                          
022200      05    FEL-2                PIC X(40)   OCCURS 2.                    
022300                                                                          
022400   03    FEL3.                                                            
022500      05    FILLER               PIC X(40)   VALUE                        
022600           '750. INGÅNG VIA ANNAN MENY'.                                  
022700      05    FILLER               PIC X(40)   VALUE                        
022800           '750. TOEGANGELIJK VIA EEN ANDERE MENU'.                       
022900   03    FILLER  REDEFINES FEL3.                                          
023000      05    FEL-3                PIC X(40)   OCCURS 2.                    
023100                                                                          
023200   03    FEL4.                                                            
023300      05    FILLER               PIC X(40)   VALUE                        
023400           '762. GÅ TILL BÖRJA OM-BILDEN'.                                
023500      05    FILLER               PIC X(40)   VALUE                        
023600           '762. DIST-KLANT-ORDER BESTAAT NIET'.                          
023700   03    FILLER  REDEFINES FEL4.                                          
023800      05    FEL-4                PIC X(40)   OCCURS 2.                    
023900                                                                          
024000   03    INF1.                                                            
024100      05    FILLER               PIC X(61)   VALUE                        
024200           'UPPDATERING UTFÖRD '.                                         
024300      05    FILLER               PIC X(61)   VALUE                        
024400           'UPDATING UITGEVOERD '.                                        
024500   03    FILLER  REDEFINES INF1.                                          
024600      05    INF-1                PIC X(61)   OCCURS 2.                    
024700                                                                          
024800     EJECT                                                                
024900******************************************************************        
025000*                                                                         
025100*                AREOR FÖR MFS OCH SKÄRMHANTERING                         
025200*                                                                         
025300 01    FILLER                    PIC X(16)   VALUE 'MFS-WS'.              
025400     SKIP3                                                                
025500 01    FILLER                    PIC X(16)                                
025600                                 VALUE 'MID W4I39201 MID'.                
025700*01    -COPY W4I39201                                                     
025800     EJECT                                                                
025900*01    -COPY WMSGAREA                                                     
026000     EJECT                                                                
026100*  03  MOD -COPY W4O39201   -RED MSG-AREA                                 
026200     EJECT                                                                
026300*  03  MOD -COPY W4O30102   -RED MSG-AREA -PRE M4301-                     
026400     EJECT                                                                
026500*  03  MOD -COPY W4O39101   -RED MSG-AREA -PRE M4391-                     
026600     EJECT                                                                
026700*  03  MOD -COPY W4O39301   -RED MSG-AREA -PRE M4393-                     
026800     EJECT                                                                
026900*  03  MOD -COPY W4O39401   -RED MSG-AREA -PRE M4394-                     
027000     EJECT                                                                
027100*  03  MOD -COPY W4O39501   -RED MSG-AREA -PRE M4395-                     
027200     EJECT                                                                
027300 01    FILLER                    PIC X(16)   VALUE 'P-TO-P-SW'.           
027400 01    P-TO-P-SW.                                                         
027500       03  PTOP-LL               PIC S9(4)   VALUE +17 COMP SYNC.         
027600       03  PTOP-Z1               PIC X       VALUE LOW-VALUE.             
027700       03  PTOP-Z2               PIC X       VALUE LOW-VALUE.             
027800       03  PTOP-TRANSKOD         PIC X(7)    VALUE 'W0T605U'.             
027900       03  FILLER                PIC X       VALUE SPACE.                 
028000       03  FILLER                PIC X(4)    VALUE '4301'.                
028100       03  PTOP-KDMFSFOR         PIC X.                                   
028200     EJECT                                                                
028300 01  FILLER                      PIC X(16)   VALUE 'P-TO-P-SW1'.          
028400 01  P-TO-P-SW1.                                                          
028500       03  PTOP1-LL              PIC S9(4)   VALUE +187 COMP SYNC.        
028600       03  PTOP1-Z1              PIC X       VALUE LOW-VALUE.             
028700       03  PTOP1-Z2              PIC X       VALUE LOW-VALUE.             
028800       03  PTOP1-TRANSKOD        PIC X(7)    VALUE 'W4T391U'.             
028900       03  FILLER                PIC X       VALUE SPACE.                 
029000       03  FILLER                PIC X(4)    VALUE '4301'.                
029100       03  PTOP1-KDMFSFOR        PIC X.                                   
029200       03  PTOP1-IDPRODNR-IN     PIC X(7).                                
029300       03  PTOP1-IDPRODNR-UT     PIC X(7).                                
029400       03  PTOP1-IDDISTR-UT      PIC X(4).                                
029500       03  PTOP1-IDKUNDNR-UT     PIC X(6).                                
029600       03  PTOP1-KDFRAKT-UT      PIC X(2).                                
029700       03  PTOP1-IDORDNR-UT      PIC X(5).                                
029800       03  PTOP1-KDORDKL-UT      PIC X(1).                                
029810       03  PTOP1-IDDC-UT         PIC X(2).                                
029900       03  FILLER                PIC X(136)  VALUE ALL '+'.               
030000     EJECT                                                                
030100*01    -COPY WMFSAREA                                                     
030200     EJECT                                                                
030300******************************************************************        
030400*                                                                         
030500*        ARBETS-AREOR TILL IMS-SEKTIONERNA                                
030600*                                                                         
030700 01    IMS-WS.                                                            
030800   03    FILLER                  PIC X(16)   VALUE 'IMS-WS     '.         
030900     SKIP3                                                                
031000*                        **** STATUS-KOD FRÅN IMS                         
031100   03    STATUS-WS               PIC XX.                                  
031200     88    SEGMENT-FINNS                     VALUE '  '.                  
031300     88    SEGMENT-SAKNAS                    VALUE 'GE'.                  
031400     SKIP3                                                                
031500   03    GODK-STATUSKODER.                                                
031600     05    GODK-STATUS OCCURS 5 INDEXED BY STATUS-IX PIC XX.              
031700     SKIP3                                                                
031800 01    SSA1                      PIC X(96).                               
031900 01    SSA2                      PIC X(96).                               
032000     EJECT                                                                
032100*                            IMS FUNKTIONSKODER                           
032200*01    -COPY W0003                                                        
032300     EJECT                                                                
032400*                            DLI INPUT-OUTPUT AREA                        
032500 01    FILLER                    PIC X(16)   VALUE                        
032600                                 'DLI-IO-AREA'.                           
032700 01    DLI-IO-AREA.                                                       
032800   03    IO-AREA                 PIC X(370)  VALUE SPACE.                 
032900     SKIP3                                                                
033000*  03    XXDJ01 -COPY WDGX4305    -RED IO-AREA                            
033100     EJECT                                                                
033200*  03    XXDJ11 -COPY WDGX4306    -RED IO-AREA                            
033300     EJECT                                                                
033400*  03    XXDK11 -COPY WDGX4312    -RED IO-AREA                            
033500     EJECT                                                                
033600*  03    XXDL11 -COPY WDGX4316    -RED IO-AREA                            
033700*    08    AREA -COPY W4I31501   -RED 4316-FILLER -PRE 4316-A-            
033800     EJECT                                                                
033900*    08    AREA -COPY W4I31401   -RED 4316-FILLER -PRE 4316-B-            
034000     EJECT                                                                
034100*    08    AREA -COPY W4I39801   -RED 4316-FILLER -PRE 4316-C-            
034200     EJECT                                                                
034300*  03    EMBB01 -COPY WDK501      -RED IO-AREA                            
034400     EJECT                                                                
034500                                                                          
034600     EJECT                                                                
034700 LINKAGE SECTION.                                                         
034800*01    -COPY W0009     -PRE MSG-                                          
034900     EJECT                                                                
035000*01    -COPY W0009     -PRE ALT-                                          
035100     EJECT                                                                
035200*01    -COPY W0009     -PRE ALT1-                                         
035300     EJECT                                                                
035400*01    -COPY W0008     -PRE XXDJ-                                         
035500        05 FILLER                PIC X.                                   
035600     EJECT                                                                
035700*01    -COPY W0008     -PRE XXDK-                                         
035800        05 FILLER                PIC X.                                   
035900     EJECT                                                                
036000*01    -COPY W0008     -PRE XXDL-                                         
036100        05 FILLER                PIC X.                                   
036200     EJECT                                                                
036300*01    -COPY W0008     -PRE EMBB-                                         
036400        05 FILLER                PIC X.                                   
036500     EJECT                                                                
036600 PROCEDURE DIVISION USING MSG-PCB ALT-PCB ALT1-PCB                        
036700     XXDJ-PCB XXDK-PCB XXDL-PCB EMBB-PCB.                                 
036800                                                                          
036900     ENTRY 'DLITCBL' USING MSG-PCB ALT-PCB ALT1-PCB                       
037000     XXDJ-PCB XXDK-PCB XXDL-PCB EMBB-PCB.                                 
037100                                                                          
037200     PERFORM IMS-GET-MSG                                                  
037300                                                                          
037400     IF SEGMENT-FINNS                                                     
037500       PERFORM A-INIT-SPARA-INPUT                                         
037600       IF (MID-IDPRODNR-UT NUMERIC                                        
037700       AND MID-IDDISTR-UT  NUMERIC                                        
037800       AND MID-IDKUNDNR-UT NUMERIC                                        
037900       AND MID-KDFRAKT-UT  NUMERIC                                        
038000       AND MID-IDORDNR-UT NUMERIC                                         
038100       AND MID-KDORDKL-UT  NUMERIC)                                       
038200                                                                          
038400         MOVE MID-IDDC-UT           TO W-IDDC-4305                        
038500                                       W-IDDC-4311                        
038600         MOVE MID-IDPRODNR-UT       TO W-IDPRODNR                         
038700         MOVE W-IDPRODNR            TO W-IDPRODNR-4306                    
038800                                       W-IDPRODNR-4312                    
038900                                       W-IDPRODNR-4316                    
039000                                       W-IDPRODNR-4316-KOL-MIN            
039100                                       W-IDPRODNR-4316-MIN                
039200                                       W-IDPRODNR-4316-MAX                
039300         MOVE MFS-IDTRANS  TO WS-IDTRANS                                  
039400         IF WS-EGEN-BILD                                                  
039500         AND MFS-UPDATE                                                   
039600           IF MID-IDKOLLI (1) NOT = ALL '+'                               
039700             PERFORM B-INDATA-KOLL                                        
039800             IF WS-INDATA-RAETT                                           
039900               PERFORM C-REL-KOLL                                         
040000               IF WS-INDATA-RAETT                                         
040100                 PERFORM D-UPPDATERA                                      
040200                 PERFORM F-VISA-NAESTA-KOLLI                              
040300                 PERFORM S99-NAESTA-TRANS                                 
040400               ELSE                                                       
040500                 MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                        
040600                 PERFORM S01-ROER-EJ-FAELT                                
040700                 MOVE MAX-MOD-LAENGD TO MSG-KVLL                          
040800               END-IF                                                     
040900             ELSE                                                         
041000               MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                          
041100               PERFORM S01-ROER-EJ-FAELT                                  
041200               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
041300             END-IF                                                       
041400           ELSE                                                           
041500             PERFORM E-VISA-FOERSTA-KOLLI                                 
041600             PERFORM S99-NAESTA-TRANS                                     
041700           END-IF                                                         
041800         ELSE                                                             
041900           EVALUATE TRUE                                                  
042000           WHEN WS-GODKAEND-BILD                                          
042100             PERFORM E-VISA-FOERSTA-KOLLI                                 
042200             PERFORM S99-NAESTA-TRANS                                     
042300            WHEN OTHER                                                    
042400             MOVE FEL-3 (INDX) TO MOD-TEMFSFEL                            
042500             MOVE MFS-IDTRANS TO WS-IDTRANS-MOD                           
042600             MOVE WS-IDTRANS-POS-1-MOD TO WS-MOD-IDTRANS-POS-1            
042700             MOVE WS-IDTRANS-POS-2-4-MOD TO                               
042800                                 WS-MOD-IDTRANS-POS-2-4                   
042900             MOVE WS-MODNAMN TO MFS-IDMOD                                 
043000             MOVE MIN-MOD-LAENGD TO MSG-KVLL                              
043100           END-EVALUATE                                                   
043200         END-IF                                                           
043300       ELSE                                                               
043400         MOVE FEL-2 (INDX) TO MOD-TEMFSFEL                                
043500         PERFORM S01-ROER-EJ-FAELT                                        
043600         MOVE MAX-MOD-LAENGD TO MSG-KVLL                                  
043700       END-IF                                                             
043800       EVALUATE TRUE                                                      
043900       WHEN VISA-NAESTA-BILD PERFORM IMS-INSERT-MSG                       
044000         CONTINUE                                                         
044100       WHEN STARTA-4391      PERFORM IMS-INSERT-MSG-ALT1-PCB              
044200         CONTINUE                                                         
044300       END-EVALUATE                                                       
044400     END-IF                                                               
044500     MOVE ZERO TO RETURN-CODE                                             
044600     GOBACK                                                               
044700     CONTINUE.                                                            
044800     EJECT                                                                
044900 A-INIT-SPARA-INPUT SECTION.                                              
045000                                                                          
045100     IF MSG-DUBBLA-TRANSKODER                                             
045200       MOVE MSG-INDATA-MINUS-2-TRANSKODER TO MID-W4I39201                 
045300       MOVE MSG-IDTRANS-2        TO MFS-IDTRANS                           
045400       MOVE MSG-KDMFSFOR-2       TO MFS-KDMFSFOR                          
045500       MOVE MSG-IDPFK            TO MFS-IDPFK                             
045600     ELSE                                                                 
045700       MOVE MSG-INDATA-MINUS-1-TRANSKOD  TO MID-W4I39201                  
045800       MOVE MSG-IDTRANS-1 TO MFS-IDTRANS                                  
045900       MOVE MSG-KDMFSFOR-1 TO MFS-KDMFSFOR                                
046000       MOVE ' '            TO MFS-IDPFK                                   
046100     END-IF                                                               
046200     MOVE MSG-KDTRTYP          TO MFS-KDTRTYP                             
046300     MOVE LOW-VALUE TO MSG-AREA                                           
046400     MOVE 'W4O39201' TO MFS-IDMOD                                         
046500     MOVE '4392' TO MOD-IDTRANS                                           
046600     MOVE WS-VISA-NAESTA-BILD            TO WS-MSG-CALL                   
046700                                                                          
046800     IF SWEDISH-TEXT                                                      
046900       MOVE +1 TO INDX                                                    
047000     ELSE                                                                 
047100       MOVE +2 TO INDX                                                    
047200     END-IF                                                               
047300     INSPECT MID-IDPRODNR-UT REPLACING LEADING SPACE BY ZERO              
047400     INSPECT MID-IDDISTR-UT  REPLACING LEADING SPACE BY ZERO              
047500     INSPECT MID-IDKUNDNR-UT REPLACING LEADING SPACE BY ZERO              
047600     INSPECT MID-KDFRAKT-UT  REPLACING LEADING SPACE BY ZERO              
047700     INSPECT MID-IDORDNR-UT  REPLACING LEADING SPACE BY ZERO              
047800                                                                          
047900     MOVE MID-IDPRODNR-UT    TO MOD-IDPRODNR-UT                           
048000     MOVE MID-IDDISTR-UT     TO MOD-IDDISTR-UT                            
048100     MOVE MID-IDKUNDNR-UT    TO MOD-IDKUNDNR-UT                           
048200     MOVE MID-KDFRAKT-UT     TO MOD-KDFRAKT-UT                            
048300     MOVE MID-IDORDNR-UT     TO MOD-IDORDNR-UT                            
048400     MOVE MID-KDORDKL-UT     TO MOD-KDORDKL-UT                            
048410     MOVE MID-IDDC-UT        TO MOD-IDDC-UT                               
048500                                                                          
048600     INSPECT MOD-IDPRODNR-UT REPLACING LEADING ZERO BY SPACE              
048700     INSPECT MOD-IDDISTR-UT  REPLACING LEADING ZERO BY SPACE              
048800     INSPECT MOD-IDKUNDNR-UT REPLACING LEADING ZERO BY SPACE              
048900     INSPECT MOD-KDFRAKT-UT  REPLACING LEADING ZERO BY SPACE              
049000     INSPECT MOD-IDORDNR-UT  REPLACING LEADING ZERO BY SPACE              
049100                                                                          
049200     IF  MID-IDKOLLI-SENAST = ALL '+'                                     
049300       MOVE MFS-RENSA-FAELT TO MOD-IDKOLLI-SENAST                         
049400     END-IF                                                               
049500     MOVE +1                TO RADIND                                     
049600                                                                          
049700     PERFORM UNTIL                                                        
049800      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
049900       MOVE MFS-RENSA-FAELT   TO MOD-IDKOLLI        (RADIND)              
050000                                 MOD-KDKOLLI        (RADIND)              
050100                                 MOD-VKORDBTO-KOLLI (RADIND)              
050200                                 MOD-KDEMBTYP       (RADIND)              
050300       ADD +1                 TO RADIND                                   
050400     END-PERFORM                                                          
050500     MOVE MFS-RENSA-FAELT   TO MOD-TEMFSFEL                               
050600                               MOD-TEMFSINF                               
050700     MOVE NEJ               TO WS-FLKLAR-TEST                             
050800     CONTINUE.                                                            
050900     EJECT                                                                
051000 B-INDATA-KOLL SECTION.                                                   
051010     MOVE 'STA B-INDATA'        TO WS-FELTEXT                             
051100                                                                          
051200     MOVE +1         TO RADIND                                            
051300     MOVE RAETT                 TO WS-INDATA-TEST                         
051310     MOVE MID-IDDISTR-UT        TO TEST-IDDISTR                           
051400                                                                          
051500     PERFORM UNTIL                                                        
051600      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
051620                                                                          
051700       IF MID-KDKOLLI        (RADIND) = ALL '+' AND                       
051800          MID-VKORDBTO-KOLLI (RADIND) = ALL '+' AND                       
051901          MID-KDEMBTYP       (RADIND) = ALL '+'                           
051910          IF DIST03-SVERIGE AND RADIND = 1                                
051911             MOVE FEL                   TO WS-INDATA-TEST                 
051920             MOVE MFS-ALFA-FAELT-FEL    TO                                
051930                  MOD-KDKOLLI-ATTR (RADIND)                               
051932          ELSE                                                            
051933            CONTINUE                                                      
051940          END-IF                                                          
052100       ELSE                                                               
052110         IF DIST03-SVERIGE AND RADIND = +1                                
052120           IF MID-KDKOLLI (RADIND) = ALL '+'                              
052121             IF MID-KDEMBTYP (RADIND) = ALL '+'                           
052170               MOVE FEL                 TO WS-INDATA-TEST                 
052171               MOVE MFS-ALFA-FAELT-FEL  TO                                
052172                    MOD-KDKOLLI-ATTR (RADIND)                             
052180               MOVE MFS-NUM-FAELT-FEL   TO                                
052190                    MOD-KDEMBTYP-ATTR (RADIND)                            
052192             END-IF                                                       
052193           END-IF                                                         
052194         END-IF                                                           
052195                                                                          
052200         IF MID-KDKOLLI (RADIND) = ALL '+'                                
052300           CONTINUE                                                       
052410         ELSE                                                             
052500           MOVE MFS-ALFA-FAELT-RAETT  TO                                  
052600                                MOD-KDKOLLI-ATTR (RADIND)                 
052700         END-IF                                                           
052710                                                                          
052800         IF MID-KDEMBTYP (RADIND) = ALL '+'                               
052856           CONTINUE                                                       
053000         ELSE                                                             
053100           IF (MID-KDEMBTYP (RADIND) NUMERIC)                             
053200           AND (MID-KDEMBTYP (RADIND) > 0 AND < 8)                        
053300           AND (MID-KDKOLLI  (RADIND) = ALL '+')                          
053400             MOVE MFS-NUM-FAELT-RAETT   TO                                
053500                               MOD-KDEMBTYP-ATTR (RADIND)                 
053600           ELSE                                                           
053700             MOVE FEL                   TO WS-INDATA-TEST                 
053800             MOVE MFS-NUM-FAELT-FEL   TO                                  
053900                               MOD-KDEMBTYP-ATTR (RADIND)                 
054000           END-IF                                                         
054100         END-IF                                                           
054200         IF MID-VKORDBTO-KOLLI (RADIND) = ALL '+'                         
054300           MOVE 0                     TO WSTAB-VKORDBTO (RADIND)          
054400         ELSE                                                             
054500           MOVE MID-VKORDBTO-KOLLI (RADIND) TO DEC-IDFRIDATA              
054600           MOVE 5                     TO DEC-KVHELTAL                     
054700           MOVE 1                     TO DEC-KVDECIMAL                    
054800           CALL WDECEDIT   USING DEC-WDECAREA                             
054900                                                                          
055000           IF DEC-KDSVAR-OK                                               
055100             MOVE MFS-NUM-FAELT-RAETT TO                                  
055200                               MOD-VKORDBTO-KOLLI-ATTR (RADIND)           
055300             MOVE DEC-IDEDITDATA TO WS-IDEDITDATA                         
055400                                                                          
055500             IF  WS-VKORDBTO-DEC > 0                                      
055600               MOVE WS-IDEDITDATA     TO WS-VKORDBTO-RED                  
055700               MOVE WS-VKORDBTO-X     TO WSTAB-VKORDBTO-X                 
055800               (RADIND)                                                   
055900             ELSE                                                         
056000               MOVE WS-IDEDITDATA     TO WSTAB-VKORDBTO (RADIND)          
056100             END-IF                                                       
056200           ELSE                                                           
056300             MOVE FEL                 TO WS-INDATA-TEST                   
056400             MOVE MFS-NUM-FAELT-FEL   TO                                  
056500                           MOD-VKORDBTO-KOLLI-ATTR (RADIND)               
056600           END-IF                                                         
056700         END-IF                                                           
056800       END-IF                                                             
056900       ADD +1          TO RADIND                                          
057000     END-PERFORM                                                          
057100     CONTINUE.                                                            
057200     EJECT                                                                
057300 C-REL-KOLL SECTION.                                                      
057310     MOVE 'STA C-REL-KOLL'      TO WS-FELTEXT                             
057400                                                                          
057410     MOVE MID-IDDISTR-UT        TO TEST-IDDISTR                           
057500     MOVE +1        TO RADIND                                             
057600                                                                          
057700     PERFORM UNTIL                                                        
057800      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
057900       IF MID-KDKOLLI        (RADIND) = ALL '+' AND                       
058000          MID-VKORDBTO-KOLLI (RADIND) = ALL '+' AND                       
058111          MID-KDEMBTYP       (RADIND) = ALL '+'                           
058112                                                                          
058113         IF DIST03-SVERIGE AND RADIND = +1                                
058114           IF MID-KDKOLLI (RADIND) = ALL '+'                              
058115             IF MID-KDEMBTYP (RADIND) = ALL '+'                           
058116               MOVE FEL                 TO WS-INDATA-TEST                 
058117               MOVE MFS-ALFA-FAELT-FEL TO                                 
058118                    MOD-KDKOLLI-ATTR (RADIND)                             
058119               MOVE MFS-NUM-FAELT-FEL TO                                  
058120                    MOD-KDEMBTYP-ATTR (RADIND)                            
058122             END-IF                                                       
058123           END-IF                                                         
058124         END-IF                                                           
058125                                                                          
058300       ELSE                                                               
058301         IF MID-KDKOLLI (RADIND) = ALL '+'                                
058310           IF DIST03-SVERIGE AND RADIND = +1                              
058320             IF MID-KDKOLLI (RADIND) = ALL '+'                            
058330               IF MID-KDEMBTYP (RADIND) = ALL '+'                         
058340                 MOVE FEL               TO WS-INDATA-TEST                 
058350                 MOVE MFS-ALFA-FAELT-FEL TO                               
058360                      MOD-KDKOLLI-ATTR (RADIND)                           
058370                 MOVE MFS-NUM-FAELT-FEL TO                                
058380                      MOD-KDEMBTYP-ATTR (RADIND)                          
058391               END-IF                                                     
058392             END-IF                                                       
058393           END-IF                                                         
058394                                                                          
059000         ELSE                                                             
059100           MOVE MID-KDKOLLI  (RADIND) TO W-KDKOLLI-WDK5                   
059200           PERFORM IMS-GET-EMBB                                           
059300                                                                          
059400           IF SEGMENT-SAKNAS                                              
059500             MOVE FEL      TO WS-INDATA-TEST                              
059600             MOVE MFS-ALFA-FAELT-FEL TO                                   
059700                                 MOD-KDKOLLI-ATTR (RADIND)                
059800           ELSE                                                           
059900             MOVE EMB-KDEMBTYP TO WSEMB-KDEMBTYP (RADIND)                 
060000           END-IF                                                         
060100         END-IF                                                           
060200       END-IF                                                             
060300       ADD +1           TO RADIND                                         
060400     END-PERFORM                                                          
060500     CONTINUE.                                                            
060600     EJECT                                                                
060700                                                                          
060800 D-UPPDATERA SECTION.                                                     
060810     MOVE 'STA D-UPPDATER'      TO WS-FELTEXT                             
060900                                                                          
060910     MOVE MID-IDDISTR-UT        TO TEST-IDDISTR                           
061000     PERFORM IMS-GET-XXDK-4311                                            
061100     PERFORM IMS-GET-XXDK-4312                                            
061200       MOVE +3        TO 4312-KDBEHAND-KOL                                
061300       PERFORM IMS-REPL-XXDK                                              
061400                                                                          
061500       MOVE +1        TO RADIND                                           
061600       PERFORM IMS-GET-XXDL-4315                                          
061700                                                                          
061800       PERFORM UNTIL                                                      
061900        NOT ( RADIND < MAX-RADIND-PLUS-1 )                                
062000         IF MID-KDKOLLI       (RADIND) = ALL '+' AND                      
062100            MID-VKORDBTO-KOLLI (RADIND) = ALL '+' AND                     
062210            MID-KDEMBTYP      (RADIND) = ALL '+'                          
062300           CONTINUE                                                       
062400         ELSE                                                             
062500           PERFORM DA-SKAPA-4316                                          
062600           PERFORM IMS-ISRT-XXDL-4316                                     
062700           MOVE MID-IDKOLLI (RADIND) TO MOD-IDKOLLI-SENAST                
062800         END-IF                                                           
062900         ADD +1      TO RADIND                                            
063000       END-PERFORM                                                        
063100     CONTINUE.                                                            
063200     EJECT                                                                
063300                                                                          
063400 DA-SKAPA-4316 SECTION.                                                   
063410     MOVE 'STA DA-SKAPA  '      TO WS-FELTEXT                             
063500                                                                          
063600     MOVE LOW-VALUE               TO IO-AREA                              
063700     MOVE ALL '+'                 TO 4316-WDGX4316                        
063800     MOVE W-IDPRODNR              TO 4316-IDPRODNR                        
063900     MOVE '002'                   TO 4316-IDPTYP                          
064000     COMPUTE 4316-IDKOLLI = MID-IDKOLLI (RADIND) + 99000                  
064100     MOVE LOW-VALUE               TO 4316-LOWVALUE                        
064200     MOVE ZERO                    TO 4316-KDTRSTAT                        
064300     MOVE +312                    TO 4316-LL                              
064400     MOVE LOW-VALUE               TO 4316-Z1                              
064500                                     4316-Z2                              
064600     MOVE 'W4T315  '              TO 4316-KDTRANS                         
064700     MOVE '4392'                  TO 4316-IDTRANS                         
064800     MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                        
064900     MOVE ZERO                    TO 4316-A-MID-IDANSTNR-UT               
065000     MOVE MID-IDPRODNR-UT         TO 4316-A-MID-IDPRODNR-IN               
065100                                     4316-A-MID-IDPRODNR-UT               
065200     MOVE MID-IDDISTR-UT          TO 4316-A-MID-IDDISTR-IN                
065300                                     4316-A-MID-IDDISTR-UT                
065400     MOVE MID-IDKUNDNR-UT         TO 4316-A-MID-IDKUNDNR-IN               
065500                                     4316-A-MID-IDKUNDNR-UT               
065600     MOVE MID-IDORDNR-UT          TO 4316-A-MID-IDORDNR-IN                
065700                                     4316-A-MID-IDORDNR-UT                
065710     MOVE MID-IDDC-UT             TO 4316-A-MID-IDDC-IN                   
065720                                     4316-A-MID-IDDC-UT                   
065800     MOVE 4316-IDKOLLI            TO 4316-A-MID-IDKOLLI-IN                
065900                                     4316-A-MID-IDKOLLI-UT                
066000     MOVE '4301'                  TO 4316-A-MID-IDTRANS-START             
066100     MOVE MID-KDKOLLI (RADIND)    TO 4316-A-MID-KDKOLLI                   
066200     MOVE WSTAB-VKORDBTO (RADIND) TO 4316-A-MID-VKORDBTO-KOLLI            
066300     MOVE JA                      TO 4316-A-MID-FLSISTAK                  
066400     MOVE 'U'                     TO 4316-A-MID-PRTVAL-FOLJEFL            
066500                                     4316-A-MID-PRTVAL-ADRESSFL           
066600                                                                          
066700     IF  MID-KDEMBTYP (RADIND) = ALL '+'                                  
066800       MOVE WSEMB-KDEMBTYP (RADIND) TO 4316-A-MID-KDEMBTYP                
066900     ELSE                                                                 
067000       MOVE MID-KDEMBTYP (RADIND) TO 4316-A-MID-KDEMBTYP                  
067100     END-IF                                                               
067200     MOVE 1                       TO IX                                   
067300     PERFORM UNTIL                                                        
067400      NOT ( IX < MAX-4316-IND + 1 )                                       
067500       MOVE ALL '+'               TO 4316-A-MID-RAD (IX)                  
067600       ADD +1                     TO IX                                   
067700     END-PERFORM                                                          
067800     CONTINUE.                                                            
067900     EJECT                                                                
068000                                                                          
068100 E-VISA-FOERSTA-KOLLI SECTION.                                            
068110     MOVE 'STA E-VISA-   '      TO WS-FELTEXT                             
068200                                                                          
068300     MOVE +1             TO RADIND                                        
068400     PERFORM UNTIL                                                        
068500      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
068600       MOVE RADIND      TO MOD-IDKOLLI (RADIND)                           
068700       ADD +1           TO RADIND                                         
068800     END-PERFORM                                                          
068900     CONTINUE.                                                            
069000     EJECT                                                                
069100                                                                          
069200 F-VISA-NAESTA-KOLLI SECTION.                                             
069210     MOVE 'STA F-VISA-NA '      TO WS-FELTEXT                             
069300                                                                          
069400     IF MID-KDKOLLI        (MAX-RADIND) = ALL '+'  AND                    
069500        MID-VKORDBTO-KOLLI (MAX-RADIND) = ALL '+'  AND                    
069600        MID-KDEMBTYP       (MAX-RADIND) = ALL '+'                         
069700       MOVE JA               TO WS-FLKLAR-TEST                            
069800       MOVE MFS-RENSA-FAELT  TO MOD-IDKOLLI-SENAST                        
069900                                                                          
070000     ELSE                                                                 
070100       MOVE MID-IDKOLLI (MAX-RADIND) TO MOD-IDKOLLI-SENAST                
070200       MOVE +1             TO RADIND                                      
070300                                                                          
070400       PERFORM UNTIL                                                      
070500        NOT ( RADIND < MAX-RADIND-PLUS-1 )                                
070600         COMPUTE MOD-IDKOLLI (RADIND) =                                   
070700                 MID-IDKOLLI (MAX-RADIND) + RADIND                        
070800         ADD +1            TO RADIND                                      
070900       END-PERFORM                                                        
071000     END-IF                                                               
071100     CONTINUE.                                                            
071200     EJECT                                                                
071300 S01-ROER-EJ-FAELT SECTION.                                               
071400                                                                          
071500     MOVE +1                    TO RADIND                                 
071600                                                                          
071700     PERFORM UNTIL                                                        
071800      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
071900       MOVE MFS-ROER-EJ-FAELT   TO  MOD-IDKOLLI        (RADIND)           
072000                                                                          
072100       IF  MID-KDKOLLI (RADIND) NOT = ALL '+'                             
072200         MOVE MFS-ROER-EJ-FAELT TO  MOD-KDKOLLI        (RADIND)           
072300       END-IF                                                             
072400       IF  MID-VKORDBTO-KOLLI (RADIND) NOT = ALL '+'                      
072500         MOVE MFS-ROER-EJ-FAELT TO  MOD-VKORDBTO-KOLLI (RADIND)           
072600       END-IF                                                             
072700       IF  MID-KDEMBTYP (RADIND) NOT = ALL '+'                            
072800         MOVE MFS-ROER-EJ-FAELT TO  MOD-KDEMBTYP       (RADIND)           
072900       END-IF                                                             
073000       ADD +1                   TO RADIND                                 
073100     END-PERFORM                                                          
073200     CONTINUE.                                                            
073300     EJECT                                                                
073400 S02-FORMATETS-ATTR SECTION.                                              
073500                                                                          
073600     MOVE +1                    TO RADIND                                 
073700                                                                          
073800     PERFORM UNTIL                                                        
073900      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
074000       MOVE MFS-FORMATETS-ATTR TO MOD-KDKOLLI-ATTR                        
074100       (RADIND)                                                           
074200                                  MOD-VKORDBTO-KOLLI-ATTR                 
074300       (RADIND)                                                           
074400                                  MOD-KDEMBTYP-ATTR                       
074500       (RADIND)                                                           
074600                                                                          
074700       ADD +1                 TO RADIND                                   
074800     END-PERFORM                                                          
074900     CONTINUE.                                                            
075000     EJECT                                                                
075100 S91-SKAPA-TOM-004 SECTION.                                               
075110     MOVE 'STA S91-SKAPA '      TO WS-FELTEXT                             
075200                                                                          
075300     MOVE '004'              TO W-IDPTYP-4316                             
075400     MOVE ZERO               TO W-IDKOLLI-4316                            
075500     PERFORM IMS-GET-XXDL-4316-L-BLANK                                    
075600                                                                          
075700     IF 4316-C-MID-RAD (MAX-4316-IND-004) NOT = ALL '+'                   
075800       MOVE LOW-VALUE               TO IO-AREA                            
075900       MOVE ALL '+'                 TO 4316-WDGX4316                      
076000       MOVE MID-IDPRODNR-UT         TO 4316-IDPRODNR                      
076100       MOVE '004'                   TO 4316-IDPTYP                        
076200       MOVE ZERO                    TO 4316-IDKOLLI                       
076300       MOVE LOW-VALUE               TO 4316-LOWVALUE                      
076400       MOVE ZERO                    TO 4316-KDTRSTAT                      
076500       MOVE +346                    TO 4316-LL                            
076600       MOVE LOW-VALUE               TO 4316-Z1                            
076700       MOVE LOW-VALUE               TO 4316-Z2                            
076800       MOVE 'W4T398X'               TO 4316-KDTRANS                       
076900       MOVE '4392'                  TO 4316-IDTRANS                       
077000       MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                      
077100                                                                          
077200       MOVE MID-IDORDNR-UT       TO 4316-C-MID-IDORDNR-IN                 
077300                                    4316-C-MID-IDORDNR-UT                 
077400                                                                          
077500       MOVE MID-IDDISTR-UT       TO 4316-C-MID-IDDISTR-IN                 
077600                                    4316-C-MID-IDDISTR-UT                 
077700                                                                          
077800       MOVE MID-IDKUNDNR-UT      TO 4316-C-MID-IDKUNDNR-IN                
077900                                    4316-C-MID-IDKUNDNR-UT                
078000                                                                          
078100                                                                          
078200       MOVE MID-IDPRODNR-UT      TO 4316-C-MID-IDPRODNR-IN                
078300                                    4316-C-MID-IDPRODNR-UT                
078400                                                                          
078500       MOVE ZERO                 TO 4316-C-MID-IDKOLLI-IN                 
078600                                    4316-C-MID-IDKOLLI-UT                 
078700                                                                          
078710                                                                          
078720       MOVE SPACE                TO 4316-C-MID-FLSVAR                     
078800       PERFORM IMS-ISRT-XXDL-4316-STAT-II                                 
078900     END-IF                                                               
079000     CONTINUE.                                                            
079100     EJECT                                                                
079200 S99-NAESTA-TRANS SECTION.                                                
079210     MOVE 'STA S99-NAESTA'      TO WS-FELTEXT                             
079300                                                                          
079400     IF WS-FLKLAR                                                         
079500       PERFORM IMS-GET-XXDK-4311                                          
079600       PERFORM IMS-GET-XXDK-4312                                          
079700                                                                          
079800       IF ((4312-KDBEHAND-GRUND = 0 OR 2)                                 
079900       AND (4312-KDBEHAND-AVVIK = 0 OR 2)                                 
080000       AND (4312-KDBEHAND-RAD   = 0 OR 2)                                 
080100       AND (4312-KDBEHAND-DEL   = 0 OR 2)                                 
080200       AND (4312-KDBEHAND-URS   = 0 OR 2))                                
080300         MOVE 4312-IDTRANS  TO WS-IDTRANS-MOD                             
080400         PERFORM IMS-DLET-XXDK-4312                                       
080500                                                                          
080600         PERFORM IMS-GET-XXDL-4315                                        
080700         PERFORM S91-SKAPA-TOM-004                                        
080800                                                                          
080900         MOVE '001'     TO W-IDPTYP-4316-MIN                              
081000         MOVE '004'     TO W-IDPTYP-4316-MAX                              
081100         PERFORM IMS-GET-XXDL-4316-INTERV-BLANK                           
081200                                                                          
081300         PERFORM UNTIL                                                    
081400          NOT ( SEGMENT-FINNS )                                           
081500           MOVE +1           TO 4316-KDTRSTAT                             
081600           PERFORM IMS-REPL-XXDL                                          
081700           PERFORM IMS-GET-XXDL-4316-INTERV-GE                            
081800         END-PERFORM                                                      
081900         PERFORM IMS-GET-XXDJ-4305                                        
082000         PERFORM IMS-GET-XXDJ-4306                                        
082100         MOVE +3 TO 4306-KDPACLAS                                         
082200         PERFORM IMS-REPL-XXDJ                                            
082300                                                                          
082400         MOVE MFS-KDMFSFOR    TO PTOP-KDMFSFOR                            
082500         PERFORM IMS-INSERT-MSG-ALT-PCB                                   
082600*********************************************************                 
082700                                                                          
082800*** FINNS DET FLER ORDER SOM LIGGER PÅ KÖ FÖR BEARBETNING                 
082900*** LÄGGS DEN FÖRSTA ORDERN UT PÅ DEN BILD SOM STÅR                       
083000*** I TUR FÖR BEARBETNING                                                 
083100*** KVAL MED USERID                                                       
083200                                                                          
083300         PERFORM IMS-GET-XXDK-4311                                        
083400         MOVE MSG-SIGNON-USERID TO W-WDGXKEY-IDUSER-4312                  
083500         PERFORM IMS-GET-XXDK-4312-STAT-GE-F                              
083600                                                                          
083700         PERFORM UNTIL                                                    
083800          NOT ( (((SEGMENT-FINNS) AND (4312-KDBEHAND-AVVIK = +3           
083900           OR                                                             
084000            4312-KDBEHAND-RAD = +3 OR 4312-KDBEHAND-DEL = +3              
084100            OR 4312-KDBEHAND-URS = +3 OR 4312-KDBEHAND-KOL =              
084200            +3)) OR ((SEGMENT-FINNS) AND (4312-IDTRANS =                  
084300            '4302' ))) )                                                  
084400           PERFORM IMS-GET-XXDK-4312-STAT-GE                              
084500         END-PERFORM                                                      
084600         IF SEGMENT-FINNS                                                 
084700           IF 4312-KDBEHAND-AVVIK = 1                                     
084800             MOVE 'W4O39101'         TO MFS-IDMOD                         
084900             MOVE M4391-MOD-LAENGD TO MSG-KVLL                            
085000             MOVE '4391'             TO M4391-MOD-IDTRANS                 
085100             MOVE 4312-IDPRODNR      TO WS-IDPRODNR                       
085200             MOVE WS-IDPRODNR        TO M4391-MOD-IDPRODNR-UT             
085300             MOVE 4312-IDDISTR       TO WS-IDDISTR                        
085400             MOVE WS-IDDISTR         TO M4391-MOD-IDDISTR-UT              
085500             MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                       
085600             MOVE WS-IDKUNDNR        TO M4391-MOD-IDKUNDNR-UT             
085700             MOVE 4312-KDFRAKT       TO WS-KDFRAKT                        
085800             MOVE WS-KDFRAKT         TO M4391-MOD-KDFRAKT-UT              
085900             MOVE 4312-IDKUNDRF      TO M4391-MOD-IDORDNR-UT              
086000             MOVE 4312-KDORDKL       TO WS-KDORDKL                        
086100             MOVE WS-KDORDKL         TO M4391-MOD-KDORDKL-UT              
086110             MOVE W-IDDC-4311        TO M4391-MOD-IDDC-UT                 
086200                                                                          
086300             INSPECT M4391-MOD-IDPRODNR-UT REPLACING                      
086400                                     LEADING ZERO BY SPACE                
086500             INSPECT M4391-MOD-IDDISTR-UT REPLACING                       
086600                                     LEADING ZERO BY SPACE                
086700             INSPECT M4391-MOD-IDKUNDNR-UT REPLACING                      
086800                                     LEADING ZERO BY SPACE                
086900             INSPECT M4391-MOD-KDFRAKT-UT REPLACING                       
087000                                     LEADING ZERO BY SPACE                
087100             INSPECT M4391-MOD-IDORDNR-UT REPLACING                       
087200                                     LEADING ZERO BY SPACE                
087300           ELSE                                                           
087400             EVALUATE TRUE                                                
087500             WHEN 4312-KDBEHAND-AVVIK = 4                                 
087600               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
087700               MOVE WS-IDPRODNR        TO PTOP1-IDPRODNR-IN               
087800               PTOP1-IDPRODNR-UT                                          
087900               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
088000               MOVE WS-IDDISTR         TO PTOP1-IDDISTR-UT                
088100               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
088200               MOVE WS-IDKUNDNR        TO PTOP1-IDKUNDNR-UT               
088300               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
088400               MOVE WS-KDFRAKT         TO PTOP1-KDFRAKT-UT                
088500               MOVE 4312-IDKUNDRF      TO PTOP1-IDORDNR-UT                
088600               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
088700               MOVE WS-KDORDKL         TO PTOP1-KDORDKL-UT                
088710               MOVE W-IDDC-4311        TO PTOP1-IDDC-UT                   
088800               MOVE MFS-KDMFSFOR       TO PTOP1-KDMFSFOR                  
088900               MOVE WS-STARTA-4391     TO WS-MSG-CALL                     
089000             WHEN 4312-KDBEHAND-RAD = 1                                   
089100               MOVE 'W4O39301'         TO MFS-IDMOD                       
089200               MOVE M4393-MOD-LAENGD TO MSG-KVLL                          
089300               MOVE '4393'             TO M4393-MOD-IDTRANS               
089400               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
089500               MOVE WS-IDPRODNR        TO M4393-MOD-IDPRODNR-UT           
089600               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
089700               MOVE WS-IDDISTR         TO M4393-MOD-IDDISTR-UT            
089800               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
089900               MOVE WS-IDKUNDNR        TO M4393-MOD-IDKUNDNR-UT           
090000               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
090100               MOVE WS-KDFRAKT         TO M4393-MOD-KDFRAKT-UT            
090200               MOVE 4312-IDKUNDRF      TO M4393-MOD-IDORDNR-UT            
090300               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
090400               MOVE WS-KDORDKL         TO M4393-MOD-KDORDKL-UT            
090410               MOVE W-IDDC-4311        TO M4393-MOD-IDDC-UT               
090500                                                                          
090600               INSPECT M4393-MOD-IDPRODNR-UT REPLACING                    
090700                                       LEADING ZERO BY SPACE              
090800               INSPECT M4393-MOD-IDDISTR-UT REPLACING                     
090900                                       LEADING ZERO BY SPACE              
091000               INSPECT M4393-MOD-IDKUNDNR-UT REPLACING                    
091100                                       LEADING ZERO BY SPACE              
091200               INSPECT M4393-MOD-KDFRAKT-UT REPLACING                     
091300                                       LEADING ZERO BY SPACE              
091400               INSPECT M4393-MOD-IDORDNR-UT REPLACING                     
091500                                       LEADING ZERO BY SPACE              
091600             WHEN 4312-KDBEHAND-URS = 1                                   
091700               MOVE 'W4O39401' TO MFS-IDMOD                               
091800               MOVE M4394-MOD-LAENGD TO MSG-KVLL                          
091900               MOVE '4394'             TO M4394-MOD-IDTRANS               
092000               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
092100               MOVE WS-IDPRODNR        TO M4394-MOD-IDPRODNR-UT           
092200               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
092300               MOVE WS-IDDISTR         TO M4394-MOD-IDDISTR-UT            
092400               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
092500               MOVE WS-IDKUNDNR        TO M4394-MOD-IDKUNDNR-UT           
092600               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
092700               MOVE WS-KDFRAKT         TO M4394-MOD-KDFRAKT-UT            
092800               MOVE 4312-IDKUNDRF      TO M4394-MOD-IDORDNR-UT            
092900               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
093000               MOVE WS-KDORDKL         TO M4394-MOD-KDORDKL-UT            
093010               MOVE W-IDDC-4311        TO M4394-MOD-IDDC-UT               
093100                                                                          
093200               INSPECT M4394-MOD-IDPRODNR-UT REPLACING                    
093300                                       LEADING ZERO BY SPACE              
093400               INSPECT M4394-MOD-IDDISTR-UT REPLACING                     
093500                                       LEADING ZERO BY SPACE              
093600               INSPECT M4394-MOD-IDKUNDNR-UT REPLACING                    
093700                                       LEADING ZERO BY SPACE              
093800               INSPECT M4394-MOD-KDFRAKT-UT REPLACING                     
093900                                       LEADING ZERO BY SPACE              
094000               INSPECT M4394-MOD-IDORDNR-UT REPLACING                     
094100                                       LEADING ZERO BY SPACE              
094200             WHEN 4312-KDBEHAND-DEL = 1                                   
094300               MOVE 'W4O39501' TO MFS-IDMOD                               
094400               MOVE M4395-MOD-LAENGD TO MSG-KVLL                          
094500               MOVE '4395'             TO M4395-MOD-IDTRANS               
094600               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
094700               MOVE WS-IDPRODNR        TO M4395-MOD-IDPRODNR-UT           
094800               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
094900               MOVE WS-IDDISTR         TO M4395-MOD-IDDISTR-UT            
095000               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
095100               MOVE WS-IDKUNDNR        TO M4395-MOD-IDKUNDNR-UT           
095200               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
095300               MOVE WS-KDFRAKT         TO M4395-MOD-KDFRAKT-UT            
095400               MOVE 4312-IDKUNDRF      TO M4395-MOD-IDORDNR-UT            
095500               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
095600               MOVE WS-KDORDKL         TO M4395-MOD-KDORDKL-UT            
095610               MOVE W-IDDC-4311        TO M4395-MOD-IDDC-UT               
095700                                                                          
095800               INSPECT M4395-MOD-IDPRODNR-UT REPLACING                    
095900                                       LEADING ZERO BY SPACE              
096000               INSPECT M4395-MOD-IDDISTR-UT REPLACING                     
096100                                       LEADING ZERO BY SPACE              
096200               INSPECT M4395-MOD-IDKUNDNR-UT REPLACING                    
096300                                       LEADING ZERO BY SPACE              
096400               INSPECT M4395-MOD-KDFRAKT-UT REPLACING                     
096500                                       LEADING ZERO BY SPACE              
096600               INSPECT M4395-MOD-IDORDNR-UT REPLACING                     
096700                                       LEADING ZERO BY SPACE              
096800              WHEN OTHER                                                  
096900               MOVE 'W4O39201' TO MFS-IDMOD                               
097000               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
097100               MOVE '4392'             TO MOD-IDTRANS                     
097200               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
097300               MOVE WS-IDPRODNR        TO MOD-IDPRODNR-UT                 
097400               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
097500               MOVE WS-IDDISTR         TO MOD-IDDISTR-UT                  
097600               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
097700               MOVE WS-IDKUNDNR        TO MOD-IDKUNDNR-UT                 
097800               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
097900               MOVE WS-KDFRAKT         TO MOD-KDFRAKT-UT                  
098000               MOVE 4312-IDKUNDRF      TO MOD-IDORDNR-UT                  
098100               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
098200               MOVE WS-KDORDKL         TO MOD-KDORDKL-UT                  
098210               MOVE W-IDDC-4311        TO MOD-IDDC-UT                     
098300                                                                          
098400               INSPECT MOD-IDPRODNR-UT REPLACING                          
098500                                       LEADING ZERO BY SPACE              
098600               INSPECT MOD-IDDISTR-UT REPLACING                           
098700                                       LEADING ZERO BY SPACE              
098800               INSPECT MOD-IDKUNDNR-UT REPLACING                          
098900                                       LEADING ZERO BY SPACE              
099000               INSPECT MOD-KDFRAKT-UT REPLACING                           
099100                                       LEADING ZERO BY SPACE              
099200               INSPECT MOD-IDORDNR-UT REPLACING                           
099300                                       LEADING ZERO BY SPACE              
099400                                                                          
099500               PERFORM E-VISA-FOERSTA-KOLLI                               
099600               PERFORM S02-FORMATETS-ATTR                                 
099700             END-EVALUATE                                                 
099800           END-IF                                                         
099900         ELSE                                                             
100000           MOVE 'W4O30102'      TO MFS-IDMOD                              
100100           MOVE M4301-MOD-LAENGD TO MSG-KVLL                              
100200           MOVE '4301'             TO M4301-MOD-IDTRANS                   
100201           MOVE MFS-RENSA-FAELT    TO M4301-MOD-IDDC-IN                   
100202                                      M4301-MOD-IDDC-UT                   
100300           MOVE INF-1(INDX)        TO M4301-MOD-TEMFSINF                  
100400         END-IF                                                           
100500       ELSE                                                               
100600         MOVE +2 TO 4312-KDBEHAND-KOL                                     
100700         PERFORM IMS-REPL-XXDK                                            
100800         MOVE FEL-4 (INDX) TO MOD-TEMFSFEL                                
100900         PERFORM S02-FORMATETS-ATTR                                       
101000         MOVE MAX-MOD-LAENGD TO MSG-KVLL                                  
101100       END-IF                                                             
101200     ELSE                                                                 
101300       PERFORM S02-FORMATETS-ATTR                                         
101400       MOVE MAX-MOD-LAENGD TO MSG-KVLL                                    
101500     END-IF                                                               
101600     CONTINUE.                                                            
101700     EJECT                                                                
101800* IMS SEKTIONER                                                           
101900     SKIP3                                                                
102000 IMS-GET-MSG SECTION.                                                     
102100     MOVE '  QC' TO GODK-STATUSKODER                                      
102200     CALL CBLTDLI USING GU MSG-PCB MSG-IO-AREA                            
102300     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
102400     PERFORM IMS-STATUSKONTROLL                                           
102500     CONTINUE.                                                            
102600     SKIP3                                                                
102700 IMS-INSERT-MSG SECTION.                                                  
102800     IF ENGLISH-TEXT                                                      
102900       MOVE NEJ TO MFS-KDHUVOMR                                           
103000     END-IF                                                               
103100     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
103200     MOVE SPACE TO GODK-STATUSKODER                                       
103300     CALL CBLTDLI USING ISRT MSG-PCB MSG-IO-AREA MFS-IDMOD                
103400     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
103500     PERFORM IMS-STATUSKONTROLL                                           
103600     CONTINUE.                                                            
103700     SKIP3                                                                
103800 IMS-INSERT-MSG-ALT-PCB SECTION.                                          
103900     IF ENGLISH-TEXT                                                      
104000       MOVE NEJ TO MFS-KDHUVOMR                                           
104100     END-IF                                                               
104200     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
104300     MOVE SPACE TO GODK-STATUSKODER                                       
104400     CALL CBLTDLI USING ISRT ALT-PCB P-TO-P-SW                            
104500     MOVE ALT-STATUS-CODE TO STATUS-WS                                    
104600     PERFORM IMS-STATUSKONTROLL                                           
104700     CONTINUE.                                                            
104800     SKIP3                                                                
104900 IMS-INSERT-MSG-ALT1-PCB SECTION.                                         
105000     MOVE SPACE TO GODK-STATUSKODER                                       
105100     CALL CBLTDLI USING ISRT ALT1-PCB P-TO-P-SW1                          
105200     MOVE ALT1-STATUS-CODE TO STATUS-WS                                   
105300     PERFORM IMS-STATUSKONTROLL                                           
105400     CONTINUE.                                                            
105500     EJECT                                                                
105600 IMS-GET-XXDJ-4305 SECTION.                                               
105700     STRING 'WLXXDJ01(WDGXKEY  =' W-WDGXKEY-4305-X ')'                    
105800            DELIMITED BY SIZE INTO SSA1                                   
105900     MOVE '  '   TO GODK-STATUSKODER                                      
106000     CALL CBLTDLI USING GU XXDJ-PCB DLI-IO-AREA SSA1                      
106100     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
106200     PERFORM IMS-STATUSKONTROLL                                           
106300     CONTINUE.                                                            
106400     SKIP3                                                                
106500 IMS-GET-XXDJ-4306 SECTION.                                               
106600     STRING 'WLXXDJ11(WDGXKEY  =' W-WDGXKEY-4306-X ')'                    
106700            DELIMITED BY SIZE INTO SSA1                                   
106800     MOVE '  '   TO GODK-STATUSKODER                                      
106900     CALL CBLTDLI USING GHNP XXDJ-PCB DLI-IO-AREA SSA1                    
107000     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
107100     PERFORM IMS-STATUSKONTROLL                                           
107200     CONTINUE.                                                            
107300     SKIP3                                                                
107400 IMS-REPL-XXDJ SECTION.                                                   
107500     MOVE '  '   TO GODK-STATUSKODER                                      
107600     CALL CBLTDLI USING REPL XXDJ-PCB DLI-IO-AREA                         
107700     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
107800     PERFORM IMS-STATUSKONTROLL                                           
107900     CONTINUE.                                                            
108000                                                                          
108100     EJECT                                                                
108200 IMS-GET-XXDK-4311 SECTION.                                               
108300     STRING 'WLXXDK01(WDGXKEY  =' W-WDGXKEY-4311-X ')'                    
108400            DELIMITED BY SIZE INTO SSA1                                   
108500     MOVE '  '     TO GODK-STATUSKODER                                    
108600     CALL CBLTDLI USING GU XXDK-PCB DLI-IO-AREA SSA1                      
108700     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
108800     PERFORM IMS-STATUSKONTROLL                                           
108900     CONTINUE.                                                            
109000     SKIP3                                                                
109100 IMS-GET-XXDK-4312-GE    SECTION.                                         
109200     STRING 'WLXXDK11(WDGXKEY  =' W-WDGXKEY-4312-X ')'                    
109300            DELIMITED BY SIZE INTO SSA1                                   
109400     MOVE '  GE'   TO GODK-STATUSKODER                                    
109500     CALL CBLTDLI USING GHNP XXDK-PCB DLI-IO-AREA SSA1                    
109600     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
109700     PERFORM IMS-STATUSKONTROLL                                           
109800     CONTINUE.                                                            
109900     SKIP3                                                                
109910 IMS-GET-XXDK-4312 SECTION.                                               
109920     STRING 'WLXXDK11(WDGXKEY  =' W-WDGXKEY-4312-X ')'                    
109930            DELIMITED BY SIZE INTO SSA1                                   
109940     MOVE '  '     TO GODK-STATUSKODER                                    
109950     CALL CBLTDLI USING GHNP XXDK-PCB DLI-IO-AREA SSA1                    
109960     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
109970     PERFORM IMS-STATUSKONTROLL                                           
109980     CONTINUE.                                                            
109990     SKIP3                                                                
110000 IMS-GET-XXDK-4312-STAT-GE SECTION.                                       
110100     STRING 'WLXXDK11(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'               
110200            DELIMITED BY SIZE INTO SSA1                                   
110300     MOVE '  GE'   TO GODK-STATUSKODER                                    
110400     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA SSA1                     
110500     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
110600     PERFORM IMS-STATUSKONTROLL                                           
110700     CONTINUE.                                                            
110800                                                                          
110900 IMS-GET-XXDK-4312-STAT-GE-F SECTION.                                     
111000     STRING 'WLXXDK11*F(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'             
111100            DELIMITED BY SIZE INTO SSA1                                   
111200     MOVE '  GE'   TO GODK-STATUSKODER                                    
111300     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA SSA1                     
111400     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
111500     PERFORM IMS-STATUSKONTROLL                                           
111600     CONTINUE.                                                            
111700                                                                          
111800 IMS-DLET-XXDK-4312 SECTION.                                              
111900     MOVE '  '   TO GODK-STATUSKODER                                      
112000     CALL CBLTDLI USING DLET XXDK-PCB DLI-IO-AREA                         
112100     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
112200     PERFORM IMS-STATUSKONTROLL                                           
112300     CONTINUE.                                                            
112400     SKIP3                                                                
112500 IMS-REPL-XXDK SECTION.                                                   
112600     MOVE '  '   TO GODK-STATUSKODER                                      
112700     CALL CBLTDLI USING REPL XXDK-PCB DLI-IO-AREA                         
112800     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
112900     PERFORM IMS-STATUSKONTROLL                                           
113000     CONTINUE.                                                            
113100                                                                          
113200     EJECT                                                                
113300 IMS-GET-XXDL-4315 SECTION.                                               
113400     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
113500            DELIMITED BY SIZE INTO SSA1                                   
113600     MOVE '  '     TO GODK-STATUSKODER                                    
113700     CALL CBLTDLI USING GU XXDL-PCB DLI-IO-AREA SSA1                      
113800     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
113900     PERFORM IMS-STATUSKONTROLL                                           
114000     CONTINUE.                                                            
114100     SKIP3                                                                
114200 IMS-GET-XXDL-4316-L-BLANK SECTION.                                       
114300     STRING 'WLXXDL11*L(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
114400            DELIMITED BY SIZE INTO SSA1                                   
114500     MOVE '  '     TO GODK-STATUSKODER                                    
114600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA SSA1                    
114700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
114800     PERFORM IMS-STATUSKONTROLL                                           
114900     CONTINUE.                                                            
115000     SKIP3                                                                
115100 IMS-GET-XXDL-4316-INTERV-GE SECTION.                                     
115200     STRING 'WLXXDL11(WDGXKEY >=' W-WDGXKEY-4316-X-MIN                    
115300                    '&WDGXKEY <=' W-WDGXKEY-4316-X-MAX ')'                
115400            DELIMITED BY SIZE INTO SSA1                                   
115500     MOVE '  GE'     TO GODK-STATUSKODER                                  
115600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA SSA1                    
115700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
115800     PERFORM IMS-STATUSKONTROLL                                           
115900     CONTINUE.                                                            
116000     SKIP3                                                                
116100 IMS-GET-XXDL-4316-INTERV-BLANK SECTION.                                  
116200     STRING 'WLXXDL11*F(WDGXKEY >=' W-WDGXKEY-4316-X-MIN                  
116300                    '&WDGXKEY <=' W-WDGXKEY-4316-X-MAX ')'                
116400            DELIMITED BY SIZE INTO SSA1                                   
116500     MOVE '  '       TO GODK-STATUSKODER                                  
116600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA SSA1                    
116700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
116800     PERFORM IMS-STATUSKONTROLL                                           
116900     CONTINUE.                                                            
117000     EJECT                                                                
117100 IMS-ISRT-XXDL-4316-STAT-II  SECTION.                                     
117200                                                                          
117300     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
117400            DELIMITED BY SIZE INTO SSA1                                   
117500     MOVE 'WLXXDL11 '   TO SSA2                                           
117600     MOVE '  II'   TO GODK-STATUSKODER                                    
117700     CALL CBLTDLI USING ISRT XXDL-PCB DLI-IO-AREA SSA1 SSA2               
117800     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
117900     PERFORM IMS-STATUSKONTROLL                                           
118000     CONTINUE.                                                            
118100     SKIP3                                                                
118200 IMS-ISRT-XXDL-4316          SECTION.                                     
118300                                                                          
118400     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
118500            DELIMITED BY SIZE INTO SSA1                                   
118600     MOVE 'WLXXDL11 '   TO SSA2                                           
118700     MOVE '  '     TO GODK-STATUSKODER                                    
118800     CALL CBLTDLI USING ISRT XXDL-PCB DLI-IO-AREA SSA1 SSA2               
118900     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
119000     PERFORM IMS-STATUSKONTROLL                                           
119100     CONTINUE.                                                            
119200     SKIP3                                                                
119300 IMS-REPL-XXDL SECTION.                                                   
119400     MOVE '  '   TO GODK-STATUSKODER                                      
119500     CALL CBLTDLI USING REPL XXDL-PCB DLI-IO-AREA                         
119600     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
119700     PERFORM IMS-STATUSKONTROLL                                           
119800     CONTINUE.                                                            
119900     EJECT                                                                
120000 IMS-GET-EMBB SECTION.                                                    
120100     STRING 'WLEMBB01(KDKOLLI  =' W-KDKOLLI-WDK5 ')'                      
120200            DELIMITED BY SIZE INTO SSA1                                   
120300     MOVE '  GE' TO GODK-STATUSKODER                                      
120400     CALL CBLTDLI USING GHU EMBB-PCB DLI-IO-AREA SSA1                     
120500     MOVE EMBB-STATUS-CODE TO STATUS-WS                                   
120600     PERFORM IMS-STATUSKONTROLL                                           
120700     CONTINUE.                                                            
120800     EJECT                                                                
120900 IMS-STATUSKONTROLL SECTION.                                              
121000     SET STATUS-IX TO 1                                                   
121100     SEARCH GODK-STATUS AT END CALL FELLOG                                
121200     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS CONTINUE                    
121300     END-SEARCH                                                           
121600     CONTINUE.                                                            
