000100*                  * CONVERTED BY VILMAII *                               
000200*                  * TO PURE COBOLCODE    *                               
000300     SKIP3                                                                
000400 ID DIVISION.                                                             
000500     SKIP2                                                                
000600 PROGRAM-ID.     W4039300.                                                
000700*              PROGRAM CONVERTED BY                                       
000800*              COBOL CONVERSION AID PO 5785-ABJ                           
000900*              CONVERSION DATE 05/25/91 11:01:21.                         
001000*AUTHOR.         LOTTA LANDSTEN.                                          
001100*DATE-WRITTEN.   DEC -85.                                                 
001200                                                                          
001300*    REMARKS.                                                             
001400*                                                                         
001500*    FUNKTION.                                                            
001600*        BILD 4393.                                                       
001700*        PACKNINGSRAPPORTERING ORDERVIS                                   
001800*        EXPORT RAD.                                                      
001900*                                                                         
002000*                                                                         
002100*    INDATA.                                                              
002200*        TRANSAKTION: W4T393                                              
002300*        MID:         W4I39301-MID.                                       
002400*                                                                         
002500*    UTDATA.                                                              
002600*        TRANSAKTION: W0T605                                              
002700*        MOD:         W4O39301-MOD                                        
002800*                     W4O39401-MOD                                        
002900*                     W4O39501-MOD                                        
003000*                     W4O39601-MOD                                        
003100*                     W4O30201-MOD                                        
003200*                     RXOXXX01-MOD.                                       
003300*    SKIP3                                                                
003400 ENVIRONMENT DIVISION.                                                    
003500     SKIP3                                                                
003600 DATA DIVISION.                                                           
003700     EJECT                                                                
003800 WORKING-STORAGE SECTION.                                                 
003810                                                                          
003900*    -- CHECKED BY WY2000                                                 
004000 77  INDENT-I PIC X(40) VALUE                                             
004100     'W4039300 91/05/25 TIME 09.41 VILMAII'.                              
004200***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
004300*                                                                         
004400 77  PROGRAM-NAMN REDEFINES INDENT-I                                      
004500                                 PIC X(8).                                
004600 77    INDX                      PIC S9(9)   VALUE +0   COMP SYNC.        
004700 77    RADIND                    PIC S9(9)   VALUE +0   COMP SYNC.        
004800 77    MAX-RADIND                PIC S9(9)   VALUE +13  COMP SYNC.        
004900 77    MAX-RADIND-PLUS-1         PIC S9(9)   VALUE +14  COMP SYNC.        
005000 77    MAX-MOD-LAENGD            PIC S9(4)   VALUE +408 COMP SYNC.        
005100 77    MIN-MOD-LAENGD            PIC S9(4)   VALUE +48  COMP SYNC.        
005200 77    M4302-MOD-LAENGD          PIC S9(4)   VALUE +111 COMP SYNC.        
005300 77    M4391-MOD-LAENGD          PIC S9(4)   VALUE +84  COMP SYNC.        
005400 77    M4394-MOD-LAENGD          PIC S9(4)   VALUE +82  COMP SYNC.        
005500 77    M4395-MOD-LAENGD          PIC S9(4)   VALUE +84  COMP SYNC.        
005600 77    M4396-MOD-LAENGD          PIC S9(4)   VALUE +84  COMP SYNC.        
005700 77    4316-IND                  PIC S9(9)   VALUE +0   COMP SYNC.        
005800 77    MAX-4316-IND              PIC S9(9)   VALUE +12  COMP SYNC.        
005900 77    4316-IND-004              PIC S9(9)   VALUE +0   COMP SYNC.        
006000 77    MAX-4316-IND-004          PIC S9(9)   VALUE +26  COMP SYNC.        
006100 77    MAX-4316-IND-004-PLUS-ETT PIC S9(9)   VALUE +27  COMP SYNC.        
006200 77    WS-IDPURAD                PIC S9(5).                               
006300 77    WS-IDPURAD-TOM            PIC S9(5).                               
006400 77    WS-FLREPLACE              PIC X.                                   
006500 77    RAETT                     PIC X       VALUE 'R'.                   
006600 77    FEL                       PIC X       VALUE 'F'.                   
006700 77    JA                        PIC X       VALUE 'J'.                   
006800 77    NEJ                       PIC X       VALUE 'N'.                   
006900 01  WS-MSG-CALL-GRP.                                                     
007000   03  WS-MSG-CALL               PIC X.                                   
007100     88  VISA-NAESTA-BILD                    VALUE '0'.                   
007200     88  STARTA-4301                         VALUE '1'.                   
007300     88  STARTA-4302                         VALUE '2'.                   
007400     88  STARTA-4303                         VALUE '3'.                   
007500     88  STARTA-4391                         VALUE '4'.                   
007600     88  STARTA-4392                         VALUE '5'.                   
007700     88  STARTA-4393                         VALUE '6'.                   
007800     88  STARTA-4394                         VALUE '7'.                   
007900     88  STARTA-4395                         VALUE '8'.                   
008000     88  STARTA-4396                         VALUE '9'.                   
008100   03  WS-VISA-NAESTA-BILD       PIC X       VALUE '0'.                   
008200   03  WS-STARTA-4301            PIC X       VALUE '1'.                   
008300   03  WS-STARTA-4302            PIC X       VALUE '2'.                   
008400   03  WS-STARTA-4303            PIC X       VALUE '3'.                   
008500   03  WS-STARTA-4391            PIC X       VALUE '4'.                   
008600   03  WS-STARTA-4392            PIC X       VALUE '5'.                   
008700   03  WS-STARTA-4393            PIC X       VALUE '6'.                   
008800   03  WS-STARTA-4394            PIC X       VALUE '7'.                   
008900   03  WS-STARTA-4395            PIC X       VALUE '8'.                   
009000   03  WS-STARTA-4396            PIC X       VALUE '9'.                   
009100     EJECT                                                                
009200 01    FILLER                    PIC X(16)                                
009300                                 VALUE 'WS-MODNAMN'.                      
009400 01    WS-MODNAMN.                                                        
009500   03    FILLER                  PIC X       VALUE 'W'.                   
009600   03    WS-MOD-IDTRANS-POS-1    PIC X       VALUE SPACE.                 
009700   03    FILLER                  PIC X       VALUE 'O'.                   
009800   03    WS-MOD-IDTRANS-POS-2-4  PIC X(3)    VALUE SPACE.                 
009900   03    FILLER                  PIC XX      VALUE '01'.                  
010000                                                                          
010100 01    FILLER                    PIC X(16)                                
010200                                 VALUE 'WS-IDTRANS-MOD'.                  
010300 01    WS-IDTRANS-MOD.                                                    
010400   03    WS-IDTRANS-POS-1-MOD    PIC X       VALUE SPACE.                 
010500   03    WS-IDTRANS-POS-2-4-MOD  PIC X(3)    VALUE SPACE.                 
010600     EJECT                                                                
010700 01    DYNAMISKA-SUBPROGRAM.                                              
010800   03    CBLTDLI                 PIC X(8)    VALUE 'CBLTDLI '.            
010900   03    FELLOG                  PIC X(8)    VALUE 'FELLOG  '.            
011000     EJECT                                                                
011100 01    FILLER                    PIC X(16)   VALUE 'DIVERSE'.             
011200 01    DIVERSE.                                                           
011300   03    WS-IDDC                 PIC X(2).                                
011400   03    WS-IDPRODNR             PIC S9(7)   VALUE ZERO.                  
011410   03    WS-PRTVAL               PIC X(2)    VALUE SPACE.                 
011500                                                                          
011600   03    WS-INDATA-TEST          PIC X       VALUE SPACE.                 
011700         88  WS-INDATA-FEL                   VALUE 'F'.                   
011800         88  WS-INDATA-RAETT                 VALUE 'R'.                   
011900                                                                          
012000   03    MAX-ANT-RAD             PIC S9(9)   VALUE +100.                  
012100   03    WS-ANT-RAD-REST         PIC S9(9)   VALUE ZERO.                  
012200   03    WS-ANT-RAD-INT          PIC S9(9)   VALUE ZERO.                  
012300   03    WS-TOM-SISTA            PIC 9(4)    VALUE ZERO.                  
012400                                                                          
012500   03    WS-FROM                 PIC 9(4)    VALUE ZERO.                  
012600   03    WS-TOM                  PIC 9(4)    VALUE ZERO.                  
012700                                                                          
012800   03    WS-IDTRANS              PIC X(4)    VALUE SPACE.                 
012900         88  WS-EGEN-BILD        VALUE '4393'.                            
013000                                                                          
013100   03    WS-FLREPL-TEST          PIC X       VALUE SPACE.                 
013200         88  WS-FLREPL                       VALUE 'J'.                   
013300                                                                          
013400   03    WS-FLKLAR-TEST          PIC X       VALUE SPACE.                 
013500         88  WS-FLKLAR                       VALUE 'J'.                   
013600                                                                          
013700   03    WS-FLWDE4-TEST          PIC X       VALUE SPACE.                 
013800         88  WS-FLWDE4-ANN                   VALUE 'J'.                   
013900                                                                          
014000   03    WS-RADNR-SEKV           PIC 9(5)    VALUE ZERO.                  
014100   03    WS-RADNR-SEKV-ANN       PIC 9(5)    VALUE ZERO.                  
014200   03    WS-KVORDRAD             PIC S9(5)   VALUE ZERO.                  
014300   03    WS-KVORDRAD-ANN         PIC S9(5)   VALUE ZERO.                  
014400   03    WS-INTERV-TOM           PIC 9(4)    VALUE ZERO.                  
014500   03    WS-FLANNULL             PIC X       VALUE SPACE.                 
014600   03    WS-IDKOLLI              PIC S9(5)   VALUE ZERO.                  
014700   03    WS-KVLEVART             PIC S9(6)   VALUE ZERO.                  
014800                                                                          
014900   03    WS-IDDISTR              PIC 9(4)    VALUE ZERO.                  
015000   03    WS-IDKUNDNR             PIC 9(6)    VALUE ZERO.                  
015100   03    WS-KDFRAKT              PIC 9(2)    VALUE ZERO.                  
015200   03    WS-KDORDKL              PIC 9       VALUE ZERO.                  
015300                                                                          
015400                                                                          
015500     EJECT                                                                
015600 01    FILLER                    PIC X(16)                                
015700                                 VALUE 'NYCKLAR-TILL-DLI'.                
015800 01    NYCKLAR-TILL-DLI.                                                  
015900                                                                          
016000   03    W-WDGXKEY-4305-X.                                                
016100     05    FILLER                PIC X(4)    VALUE '4305'.                
016200     05    W-IDDC-4305           PIC X(2).                                
016300     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
016400                                                                          
016500   03    W-WDGXKEY-4306-X.                                                
016600     05    W-IDPRODNR-4306       PIC S9(7)   VALUE ZERO  COMP-3.          
016700     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
016800                                                                          
016900   03    W-WDGXKEY-4308-X.                                                
017000     05    W-IDRADNR-ORD-TOM     PIC S9(5)   VALUE ZERO  COMP-3.          
017100     05    FILLER                PIC X(7)    VALUE LOW-VALUE.             
017200                                                                          
017300   03    W-WDGXKEY-4311-X.                                                
017400     05    FILLER                PIC X(4)    VALUE '4311'.                
017500     05    W-IDDC-4311           PIC X(2).                                
017600     05    FILLER                PIC X(24)   VALUE LOW-VALUE.             
017700                                                                          
017800   03    W-WDGXKEY-4312-X.                                                
017900     05    W-IDPRODNR-4312       PIC S9(7)   VALUE ZERO  COMP-3.          
018000     05    FILLER                PIC X(6)    VALUE LOW-VALUE.             
018100                                                                          
018200   03    W-WDGXKEY-IDUSER-4312   PIC X(8)    VALUE SPACE.                 
018300                                                                          
018400   03    W-WDGXKEY-4314-X.                                                
018500     05    W-IDRADNR-4314        PIC S9(5)   VALUE ZERO  COMP-3.          
018600     05    FILLER                PIC X(7)    VALUE LOW-VALUE.             
018700                                                                          
018800   03    W-WDGXKEY-4315-X.                                                
018900     05    FILLER                PIC X(4)    VALUE '4315'.                
019000     05    FILLER                PIC X(26)   VALUE LOW-VALUE.             
019100                                                                          
019200   03    W-WDGXKEY-4316-X.                                                
019300     05    W-IDPRODNR-4316       PIC S9(7)   VALUE ZERO  COMP-3.          
019400     05    W-IDPTYP-4316         PIC X(3)    VALUE SPACE.                 
019500     05    W-IDKOLLI-4316        PIC S9(5)   VALUE ZERO  COMP-3.          
019600     05    FILLER                PIC X(10)   VALUE LOW-VALUE.             
019700                                                                          
019800   03    W-WDGXKEY-4316-X-KOL-MIN.                                        
019900     05    W-IDPRODNR-4316-KOL-MIN PIC S9(7)   VALUE ZERO  COMP-3.        
020000     05    W-IDPTYP-4316-KOL-MIN   PIC X(3)    VALUE '002'.               
020100     05    W-IDKOLLI-4316-KOL-MIN  PIC S9(5)   VALUE ZERO  COMP-3.        
020200     05    FILLER                  PIC X(10)   VALUE LOW-VALUE.           
020300                                                                          
020400   03    W-WDGXKEY-4316-X-MIN.                                            
020500     05    W-IDPRODNR-4316-MIN   PIC S9(7)   VALUE ZERO  COMP-3.          
020600     05    W-IDPTYP-4316-MIN     PIC X(3)    VALUE '002'.                 
020700     05    FILLER                PIC X(13)   VALUE LOW-VALUE.             
020800                                                                          
020900   03    W-WDGXKEY-4316-X-MAX.                                            
021000     05    W-IDPRODNR-4316-MAX   PIC S9(7)   VALUE ZERO  COMP-3.          
021100     05    W-IDPTYP-4316-MAX     PIC X(3)    VALUE SPACE.                 
021200     05    FILLER                PIC X(13)   VALUE HIGH-VALUE.            
021300                                                                          
021400   03    W-WDE4B1KY-X.                                                    
021500     05    W-IDPRODNR-WDE4B1     PIC S9(7)   VALUE ZERO  COMP-3.          
021600     05    W-IDPURAD-WDE4B1      PIC S9(5)   VALUE ZERO  COMP-3.          
021700                                                                          
021800     EJECT                                                                
021900 01    FILLER                    PIC X(16)   VALUE 'MEDDELANDE'.          
022000 01    MEDDELANDE.                                                        
022100                                                                          
022200   03    FEL1.                                                            
022300      05    FILLER               PIC X(40)   VALUE                        
022400           '748. UPPLYSTA FÄLT FEL'.                                      
022500      05    FILLER               PIC X(40)   VALUE                        
022600           '748. HIGH LIGHTED FIELD REQUIRED'.                            
022700   03    FILLER  REDEFINES FEL1.                                          
022800      05    FEL-1                PIC X(40)   OCCURS 2.                    
022900                                                                          
023000   03    FEL2.                                                            
023100      05    FILLER               PIC X(40)   VALUE                        
023200           '762. GÅ TILL BÖRJA OM-BILDEN'.                                
023300      05    FILLER               PIC X(40)   VALUE                        
023400           '762. DISTR-CUST-ORDER DOES NOT EXISTS'.                       
023500   03    FILLER  REDEFINES FEL2.                                          
023600      05    FEL-2                PIC X(40)   OCCURS 2.                    
023700                                                                          
023800   03    FEL3.                                                            
023900      05    FILLER               PIC X(40)   VALUE                        
024000           '754. FEL I NYCKEL BÖRJA FRÅN GRUND-BILD'.                     
024100      05    FILLER               PIC X(40)   VALUE                        
024200           '754. WRONG KEY START WITH FIRST SCREEN'.                      
024300   03    FILLER  REDEFINES FEL3.                                          
024400      05    FEL-3                PIC X(40)   OCCURS 2.                    
024500                                                                          
024600   03    FEL4.                                                            
024700      05    FILLER               PIC X(40)   VALUE                        
024800           '750. INGÅNG VIA ANNAN MENY'.                                  
024900      05    FILLER               PIC X(40)   VALUE                        
025000           '750. CHOOSE OTHER MENU'.                                      
025100   03    FILLER  REDEFINES FEL4.                                          
025200      05    FEL-4                PIC X(40)   OCCURS 2.                    
025300     EJECT                                                                
025400   03    FEL5.                                                            
025500      05    FILLER               PIC X(40)   VALUE                        
025600           '760. UPPGIFTER SAKNAS'.                                       
025700      05    FILLER               PIC X(40)   VALUE                        
025800           '760. INFORMATION MISSING'.                                    
025900   03    FILLER  REDEFINES FEL5.                                          
026000      05    FEL-5                PIC X(40)   OCCURS 2.                    
026100                                                                          
026200   03    INF1.                                                            
026300      05    FILLER               PIC X(40)   VALUE                        
026400           'UPPDATERING UTFÖRD   '.                                       
026500      05    FILLER               PIC X(40)   VALUE                        
026600           'UPDATING DONE  '.                                             
026700   03    FILLER  REDEFINES INF1.                                          
026800      05    INF-1                PIC X(40)   OCCURS 2.                    
026900                                                                          
027000     EJECT                                                                
027100******************************************************************        
027200*                                                                         
027300*                AREOR FÖR MFS OCH SKÄRMHANTERING                         
027400*                                                                         
027500 01    FILLER                    PIC X(16)   VALUE 'MFS-WS'.              
027600     SKIP3                                                                
027700 01    FILLER                    PIC X(16)                                
027800                                 VALUE 'MID W4I39301 MID'.                
027900*01    -COPY W4I39301                                                     
028000     EJECT                                                                
028100*01    -COPY WMSGAREA                                                     
028200     EJECT                                                                
028300*  03  MOD -COPY W4O39301   -RED MSG-AREA                                 
028400     EJECT                                                                
028500*  03  MOD -COPY W4O30202   -RED MSG-AREA -PRE M4302-                     
028600     EJECT                                                                
028700*  03  MOD -COPY W4O39101   -RED MSG-AREA -PRE M4391-                     
028800     EJECT                                                                
028900*  03  MOD -COPY W4O39401   -RED MSG-AREA -PRE M4394-                     
029000     EJECT                                                                
029100*  03  MOD -COPY W4O39501   -RED MSG-AREA -PRE M4395-                     
029200     EJECT                                                                
029300*  03  MOD -COPY W4O39601   -RED MSG-AREA -PRE M4396-                     
029400     EJECT                                                                
029500 01    FILLER                    PIC X(16)   VALUE 'P-TO-P-SW'.           
029600 01    P-TO-P-SW.                                                         
029700       03  PTOP-LL               PIC S9(4)   VALUE +17 COMP SYNC.         
029800       03  PTOP-Z1               PIC X       VALUE LOW-VALUE.             
029900       03  PTOP-Z2               PIC X       VALUE LOW-VALUE.             
030000       03  PTOP-TRANSKOD         PIC X(7)    VALUE 'W0T605U'.             
030100       03  FILLER                PIC X       VALUE SPACE.                 
030200       03  FILLER                PIC X(4)    VALUE '4393'.                
030300       03  PTOP-KDMFSFOR         PIC X.                                   
030400     EJECT                                                                
030500 01  FILLER                      PIC X(16)   VALUE 'P-TO-P-SW1'.          
030600 01  P-TO-P-SW1.                                                          
030700       03  PTOP1-LL              PIC S9(4)   VALUE +187 COMP SYNC.        
030800       03  PTOP1-Z1              PIC X       VALUE LOW-VALUE.             
030900       03  PTOP1-Z2              PIC X       VALUE LOW-VALUE.             
031000       03  PTOP1-TRANSKOD        PIC X(7)    VALUE 'W4T391U'.             
031100       03  FILLER                PIC X       VALUE SPACE.                 
031200       03  FILLER                PIC X(4)    VALUE '4301'.                
031300       03  PTOP1-KDMFSFOR        PIC X.                                   
031400       03  PTOP1-IDPRODNR-IN     PIC X(7).                                
031500       03  PTOP1-IDPRODNR-UT     PIC X(7).                                
031600       03  PTOP1-IDDISTR-UT      PIC X(4).                                
031700       03  PTOP1-IDKUNDNR-UT     PIC X(6).                                
031800       03  PTOP1-KDFRAKT-UT      PIC X(2).                                
031900       03  PTOP1-IDORDNR-UT      PIC X(5).                                
032000       03  PTOP1-KDORDKL-UT      PIC X(1).                                
032010       03  PTOP1-IDDC-UT         PIC X(2).                                
032020       03  PTOP1-PRTVAL-ADRESSFL PIC X(2).                                
032100       03  FILLER                PIC X(136)  VALUE ALL '+'.               
032200     EJECT                                                                
032300 01    FILLER                    PIC X(16)   VALUE 'P-TO-P-SW2'.          
032400 01    P-TO-P-SW2.                                                        
032500       03  PTOP2-LL              PIC S9(4)   VALUE +89 COMP SYNC.         
032600       03  PTOP2-Z1              PIC X       VALUE LOW-VALUE.             
032700       03  PTOP2-Z2              PIC X       VALUE LOW-VALUE.             
032800       03  PTOP2-TRANSKOD        PIC X(7)    VALUE 'W4T396U'.             
032900       03  FILLER                PIC X       VALUE SPACE.                 
033000       03  FILLER                PIC X(4)    VALUE '4393'.                
033100       03  PTOP2-KDMFSFOR        PIC X(1).                                
033200       03  PTOP2-IDPRODNR-IN     PIC X(7).                                
033300       03  PTOP2-IDPRODNR-UT     PIC X(7).                                
033400       03  PTOP2-IDDISTR-UT      PIC X(4).                                
033500       03  PTOP2-IDKUNDNR-UT     PIC X(6).                                
033600       03  PTOP2-KDFRAKT-UT      PIC X(2).                                
033700       03  PTOP2-IDORDNR-UT      PIC X(5).                                
033800       03  PTOP2-KDORDKL-UT      PIC X(1).                                
033810       03  PTOP2-IDDC-UT         PIC X(2).                                
033820       03  PTOP2-PRTVAL-ADRESSFL PIC X(2).                                
033900     EJECT                                                                
034000*01    -COPY WMFSAREA                                                     
034100     EJECT                                                                
034200******************************************************************        
034300*                                                                         
034400*        ARBETS-AREOR TILL IMS-SEKTIONERNA                                
034500*                                                                         
034600 01    IMS-WS.                                                            
034700   03    FILLER                  PIC X(16)   VALUE 'IMS-WS     '.         
034800     SKIP3                                                                
034900*                        **** STATUS-KOD FRÅN IMS                         
035000   03    STATUS-WS               PIC XX.                                  
035100     88    SEGMENT-FINNS                     VALUE '  '.                  
035200     88    SEGMENT-SAKNAS                    VALUE 'GE'.                  
035300     SKIP3                                                                
035400   03    GODK-STATUSKODER.                                                
035500     05    GODK-STATUS OCCURS 5 INDEXED BY STATUS-IX PIC XX.              
035600     SKIP3                                                                
035700 01    SSA1                      PIC X(96).                               
035800 01    SSA2                      PIC X(64).                               
035900 01    SSA3                      PIC X(64).                               
036000     EJECT                                                                
036100*                            IMS FUNKTIONSKODER                           
036200*01    -COPY W0003                                                        
036300     EJECT                                                                
036400*                            DLI INPUT-OUTPUT AREOR                       
036500 01    FILLER                    PIC X(16)   VALUE                        
036600                                 'DLI-IOAREA-1'.                          
036700 01    DLI-IO-AREA-1.                                                     
036800   03    IO-AREA-1               PIC X(370)  VALUE SPACE.                 
036900     SKIP3                                                                
037000*  03    XXDJ01 -COPY WDGX4305   -RED IO-AREA-1                           
037100     EJECT                                                                
037200*  03    XXDJ11 -COPY WDGX4306   -RED IO-AREA-1                           
037300     EJECT                                                                
037400*  03    XXDJ21 -COPY WDGX4308   -RED IO-AREA-1                           
037500     EJECT                                                                
037600*  03    XXDL11 -COPY WDGX4316   -RED IO-AREA-1                           
037700     EJECT                                                                
037800*    08  AREA   -COPY W4I31501    -RED 4316-FILLER -PRE 4316-A-           
037900     EJECT                                                                
038000*    08  AREA   -COPY W4I31401    -RED 4316-FILLER -PRE 4316-B-           
038100     EJECT                                                                
038200*    08  AREA   -COPY W4I39801    -RED 4316-FILLER -PRE 4316-C-           
038300     EJECT                                                                
038400 01    FILLER                    PIC X(16)   VALUE                        
038500                                 'DLI-IOAREA-2'.                          
038600 01    DLI-IO-AREA-2.                                                     
038700   03    IO-AREA-2               PIC X(100)  VALUE SPACE.                 
038800     SKIP3                                                                
038900*  03    XXDK11 -COPY WDGX4312   -RED IO-AREA-2                           
039000     EJECT                                                                
039100*  03    XXDK21 -COPY WDGX4314   -RED IO-AREA-2                           
039200     EJECT                                                                
039300 01    FILLER                    PIC X(16)   VALUE                        
039400                                 'DLI-IOAREA-3'.                          
039500 01    DLI-IO-AREA-3.                                                     
039600   03    IO-AREA-3               PIC X(202)  VALUE SPACE.                 
039700     SKIP3                                                                
039800*  03    SEQB-AREA   -COPY WDE4B1      -RED IO-AREA-3                     
039900     EJECT                                                                
040000 LINKAGE SECTION.                                                         
040100*01    -COPY W0009     -PRE MSG-                                          
040200     EJECT                                                                
040300*01    -COPY W0009     -PRE ALT-                                          
040400     EJECT                                                                
040500*01    -COPY W0009     -PRE ALT1-                                         
040600     EJECT                                                                
040700*01    -COPY W0009     -PRE ALT2-                                         
040800     EJECT                                                                
040900*01    -COPY W0008     -PRE XXDJ-                                         
041000        05 FILLER                PIC X.                                   
041100     EJECT                                                                
041200*01    -COPY W0008     -PRE XXDK-                                         
041300        05 FILLER                PIC X.                                   
041400     EJECT                                                                
041500*01    -COPY W0008     -PRE XXDL-                                         
041600        05 FILLER                PIC X.                                   
041700     EJECT                                                                
041800*01    -COPY W0008     -PRE WDE4B-                                        
041900        05 FILLER                PIC X.                                   
042000     EJECT                                                                
042100 PROCEDURE DIVISION USING MSG-PCB ALT-PCB ALT1-PCB ALT2-PCB               
042200                          XXDJ-PCB XXDK-PCB XXDL-PCB WDE4B-PCB.           
042300                                                                          
042400     ENTRY 'DLITCBL' USING MSG-PCB ALT-PCB ALT1-PCB ALT2-PCB              
042500                           XXDJ-PCB XXDK-PCB XXDL-PCB WDE4B-PCB.          
042600                                                                          
042700     PERFORM IMS-GET-MSG                                                  
042800                                                                          
042900     IF SEGMENT-FINNS                                                     
043000       PERFORM A-INIT-SPARA-INPUT                                         
043100       IF (MID-IDPRODNR-UT NUMERIC                                        
043200       AND MID-IDDISTR-UT  NUMERIC                                        
043300       AND MID-IDKUNDNR-UT NUMERIC                                        
043400       AND MID-KDFRAKT-UT  NUMERIC                                        
043500       AND MID-IDORDNR-UT NUMERIC                                         
043600       AND MID-KDORDKL-UT  NUMERIC                                        
043610       AND MID-IDDC-UT  NUMERIC)                                          
043700                                                                          
043900         MOVE MID-IDDC-UT           TO W-IDDC-4305                        
044000                                       W-IDDC-4311                        
044010                                       WS-IDDC                            
044100         MOVE MID-IDPRODNR-UT       TO WS-IDPRODNR                        
044200         MOVE WS-IDPRODNR           TO W-IDPRODNR-4306                    
044300                                       W-IDPRODNR-4312                    
044400                                       W-IDPRODNR-4316                    
044500                                       W-IDPRODNR-4316-KOL-MIN            
044600                                       W-IDPRODNR-4316-MIN                
044700                                       W-IDPRODNR-4316-MAX                
044800                                       W-IDPRODNR-WDE4B1                  
044900         MOVE MFS-IDTRANS  TO WS-IDTRANS                                  
045000         IF WS-EGEN-BILD                                                  
045100         AND MFS-UPDATE                                                   
045200           IF MID-RAPP-RAD NOT = ALL '+'                                  
045300             PERFORM B-INDATA-KOLL                                        
045400             IF WS-INDATA-RAETT                                           
045500               PERFORM C-REL-KOLL-INIT                                    
045600               IF 4312-IDTRANS = '4302'                                   
045700                 PERFORM D-REL-KOLL-INRAPP                                
045800               ELSE                                                       
045900                 PERFORM E-REL-KOLL-MANUELL                               
046000               END-IF                                                     
046100               IF WS-INDATA-RAETT                                         
046200                 MOVE +3    TO   4312-KDBEHAND-RAD                        
046300                 PERFORM IMS-REPL-XXDK                                    
046400                 PERFORM G-FLERA-KOLLI                                    
046500                 PERFORM S99-NAESTA-TRANS                                 
046600               ELSE                                                       
046700                 IF MOD-TEMFSFEL = FEL-2 (INDX)                           
046800                   CONTINUE                                               
046900                 ELSE                                                     
047000                   MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                      
047100                 END-IF                                                   
047200                 PERFORM S05-ROER-EJ-FAELT                                
047300                 MOVE MAX-MOD-LAENGD TO MSG-KVLL                          
047400               END-IF                                                     
047500             ELSE                                                         
047600               MOVE FEL-1 (INDX) TO MOD-TEMFSFEL                          
047700               PERFORM S05-ROER-EJ-FAELT                                  
047800               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
047900             END-IF                                                       
048000           ELSE                                                           
048100             MOVE FEL-5 (INDX) TO MOD-TEMFSFEL                            
048200           END-IF                                                         
048300         ELSE                                                             
048400           MOVE FEL-4 (INDX) TO MOD-TEMFSFEL                              
048500           MOVE MFS-IDTRANS TO WS-IDTRANS-MOD                             
048600           MOVE WS-IDTRANS-POS-1-MOD TO WS-MOD-IDTRANS-POS-1              
048700           MOVE WS-IDTRANS-POS-2-4-MOD TO                                 
048800                               WS-MOD-IDTRANS-POS-2-4                     
048900           MOVE WS-MODNAMN TO MFS-IDMOD                                   
049000           MOVE MIN-MOD-LAENGD TO MSG-KVLL                                
049100         END-IF                                                           
049200       ELSE                                                               
049300         MOVE FEL-3 (INDX) TO MOD-TEMFSFEL                                
049400         PERFORM S05-ROER-EJ-FAELT                                        
049500         MOVE MAX-MOD-LAENGD TO MSG-KVLL                                  
049600       END-IF                                                             
049700       EVALUATE TRUE                                                      
049800       WHEN VISA-NAESTA-BILD PERFORM IMS-INSERT-MSG                       
049900         CONTINUE                                                         
050000       WHEN STARTA-4391      PERFORM IMS-INSERT-MSG-ALT1-PCB              
050100         CONTINUE                                                         
050200       WHEN STARTA-4392      PERFORM IMS-INSERT-MSG-ALT2-PCB              
050300         CONTINUE                                                         
050400       END-EVALUATE                                                       
050500     END-IF                                                               
050600     MOVE ZERO TO RETURN-CODE                                             
050700     GOBACK                                                               
050800     CONTINUE.                                                            
050900     EJECT                                                                
051000 A-INIT-SPARA-INPUT SECTION.                                              
051100     IF MSG-DUBBLA-TRANSKODER                                             
051200       MOVE MSG-INDATA-MINUS-2-TRANSKODER TO MID-W4I39301                 
051300       MOVE MSG-IDTRANS-2        TO MFS-IDTRANS                           
051400       MOVE MSG-KDMFSFOR-2       TO MFS-KDMFSFOR                          
051500       MOVE MSG-IDPFK            TO MFS-IDPFK                             
051600     ELSE                                                                 
051700       MOVE MSG-INDATA-MINUS-1-TRANSKOD  TO MID-W4I39301                  
051800       MOVE MSG-IDTRANS-1 TO MFS-IDTRANS                                  
051900       MOVE MSG-KDMFSFOR-1 TO MFS-KDMFSFOR                                
052000       MOVE ' '            TO MFS-IDPFK                                   
052100     END-IF                                                               
052200     MOVE MSG-KDTRTYP          TO MFS-KDTRTYP                             
052300     MOVE LOW-VALUE TO MSG-AREA                                           
052400     MOVE 'W4O39301' TO MFS-IDMOD                                         
052500     MOVE '4393' TO MOD-IDTRANS                                           
052600     MOVE WS-VISA-NAESTA-BILD            TO WS-MSG-CALL                   
052700                                                                          
052800     IF SWEDISH-TEXT                                                      
052900       MOVE +1 TO INDX                                                    
053000     ELSE                                                                 
053100       MOVE +2 TO INDX                                                    
053200     END-IF                                                               
053300     INSPECT MID-IDPRODNR-UT REPLACING LEADING SPACE BY ZERO              
053400     INSPECT MID-IDDISTR-UT  REPLACING LEADING SPACE BY ZERO              
053500     INSPECT MID-IDKUNDNR-UT REPLACING LEADING SPACE BY ZERO              
053600     INSPECT MID-KDFRAKT-UT  REPLACING LEADING SPACE BY ZERO              
053700     INSPECT MID-IDORDNR-UT  REPLACING LEADING SPACE BY ZERO              
053800     INSPECT MID-IDRADNR-SENAST                                           
053900                             REPLACING LEADING SPACE BY ZERO              
054000                                                                          
054100     MOVE MID-IDPRODNR-UT    TO MOD-IDPRODNR-UT                           
054200     MOVE MID-IDDISTR-UT     TO MOD-IDDISTR-UT                            
054300     MOVE MID-IDKUNDNR-UT    TO MOD-IDKUNDNR-UT                           
054400     MOVE MID-KDFRAKT-UT     TO MOD-KDFRAKT-UT                            
054500     MOVE MID-IDORDNR-UT     TO MOD-IDORDNR-UT                            
054600     MOVE MID-KDORDKL-UT     TO MOD-KDORDKL-UT                            
054610     MOVE MID-IDDC-UT        TO MOD-IDDC-UT                               
054620     MOVE MID-PRTVAL-ADRESSFL                                             
054630                             TO MOD-PRTVAL-ADRESSFL                       
054631                                                                          
054640     MOVE MID-PRTVAL-ADRESSFL  TO WS-PRTVAL                               
054700                                                                          
054800     INSPECT MOD-IDPRODNR-UT REPLACING LEADING ZERO BY SPACE              
054900     INSPECT MOD-IDDISTR-UT  REPLACING LEADING ZERO BY SPACE              
055000     INSPECT MOD-IDKUNDNR-UT REPLACING LEADING ZERO BY SPACE              
055100     INSPECT MOD-KDFRAKT-UT  REPLACING LEADING ZERO BY SPACE              
055200     INSPECT MOD-IDORDNR-UT  REPLACING LEADING ZERO BY SPACE              
055300                                                                          
055400     IF  MID-FLETTKOLLI = ALL '+'                                         
055500       MOVE MFS-RENSA-FAELT   TO MOD-FLETTKOLLI                           
055600     ELSE                                                                 
055700       MOVE MFS-ROER-EJ-FAELT TO MOD-FLETTKOLLI                           
055800     END-IF                                                               
055810                                                                          
055900     IF  MID-KVORDRAD = ALL '+'                                           
056000       MOVE +0                TO WS-KVORDRAD                              
056100       MOVE MFS-RENSA-FAELT   TO MOD-KVORDRAD                             
056200     ELSE                                                                 
056300       MOVE MID-KVORDRAD      TO WS-KVORDRAD                              
056400       MOVE MFS-ROER-EJ-FAELT TO MOD-KVORDRAD                             
056500     END-IF                                                               
056600     IF  MID-IDRADNR-SENAST = ALL '+'                                     
056700       MOVE MFS-RENSA-FAELT   TO MOD-IDRADNR-SENAST                       
056800     ELSE                                                                 
056900       MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR-SENAST                       
057000     END-IF                                                               
057100     MOVE MFS-RENSA-FAELT   TO MOD-TEMFSFEL                               
057200                               MOD-TEMFSINF                               
057300                                                                          
057400     MOVE +1                TO RADIND                                     
057500                                                                          
057600     PERFORM UNTIL                                                        
057700      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
057800       MOVE MFS-RENSA-FAELT   TO MOD-IDRADNR-FOM  (RADIND)                
057900                                 MOD-IDRADNR-TOM  (RADIND)                
058000                                 MOD-IDKOLLI      (RADIND)                
058100                                 MOD-KVLEVART     (RADIND)                
058200                                 MOD-FLRADDEL     (RADIND)                
058300       ADD +1                 TO RADIND                                   
058400     END-PERFORM                                                          
058500     CONTINUE.                                                            
058600     EJECT                                                                
058700 B-INDATA-KOLL SECTION.                                                   
058800                                                                          
058900     MOVE +1         TO RADIND                                            
059000     MOVE RAETT                 TO WS-INDATA-TEST                         
059100                                                                          
059200     PERFORM UNTIL                                                        
059300      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
059400       IF MID-RAD (RADIND) NOT = ALL '+'                                  
059500                                                                          
059600         IF MID-IDRADNR-FOM (RADIND) = ALL '+'                            
059700           MOVE FEL                   TO WS-INDATA-TEST                   
059800           MOVE MFS-NUM-FAELT-FEL TO                                      
059900                                MOD-IDRADNR-FOM-ATTR (RADIND)             
060000         ELSE                                                             
060100           IF MID-IDRADNR-FOM (RADIND) NUMERIC                            
060200             MOVE MFS-NUM-FAELT-RAETT TO                                  
060300                                  MOD-IDRADNR-FOM-ATTR (RADIND)           
060400           ELSE                                                           
060500             MOVE FEL                TO WS-INDATA-TEST                    
060600             MOVE MFS-NUM-FAELT-FEL  TO MOD-IDRADNR-FOM-ATTR              
060700             (RADIND)                                                     
060800           END-IF                                                         
060900         END-IF                                                           
061000         IF MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                        
061100           IF MID-IDRADNR-TOM (RADIND) NUMERIC                            
061200             MOVE MFS-NUM-FAELT-RAETT TO                                  
061300                                  MOD-IDRADNR-TOM-ATTR (RADIND)           
061400           ELSE                                                           
061500             MOVE FEL                TO WS-INDATA-TEST                    
061600             MOVE MFS-NUM-FAELT-FEL  TO MOD-IDRADNR-TOM-ATTR              
061700             (RADIND)                                                     
061800           END-IF                                                         
061900         END-IF                                                           
062000         IF MID-IDKOLLI (RADIND) NOT = ALL '+'                            
062100           IF  MID-IDKOLLI (RADIND) NUMERIC                               
062200           AND MID-IDKOLLI (RADIND) > 0                                   
062300             MOVE MFS-NUM-FAELT-RAETT TO                                  
062400                                  MOD-IDKOLLI-ATTR (RADIND)               
062500           ELSE                                                           
062600             MOVE FEL                TO WS-INDATA-TEST                    
062700             MOVE MFS-NUM-FAELT-FEL  TO MOD-IDKOLLI-ATTR (RADIND)         
062800           END-IF                                                         
062900         END-IF                                                           
063000         IF MID-KVLEVART (RADIND) NOT = ALL '+'                           
063100           IF MID-KVLEVART (RADIND) NUMERIC                               
063200             MOVE MFS-NUM-FAELT-RAETT TO                                  
063300                                  MOD-KVLEVART-ATTR (RADIND)              
063400           ELSE                                                           
063500             MOVE FEL                TO WS-INDATA-TEST                    
063600             MOVE MFS-NUM-FAELT-FEL  TO MOD-KVLEVART-ATTR                 
063700             (RADIND)                                                     
063800           END-IF                                                         
063900         END-IF                                                           
064000         IF MID-FLRADDEL (RADIND) NOT = ALL '+'                           
064100           IF MID-FLRADDEL (RADIND) = 'X'                                 
064200             MOVE MFS-ALFA-FAELT-RAETT TO                                 
064300                                  MOD-FLRADDEL-ATTR (RADIND)              
064400           ELSE                                                           
064500             MOVE FEL               TO WS-INDATA-TEST                     
064600             MOVE MFS-ALFA-FAELT-FEL TO                                   
064700                                     MOD-FLRADDEL-ATTR (RADIND)           
064800           END-IF                                                         
064900         END-IF                                                           
065000       END-IF                                                             
065100       ADD +1          TO RADIND                                          
065200     END-PERFORM                                                          
065300     CONTINUE.                                                            
065400     EJECT                                                                
065500 C-REL-KOLL-INIT SECTION.                                                 
065600                                                                          
065700****** KOLL OM ORDERN ÄR MANUELL                                          
065800                                                                          
065900     PERFORM IMS-GET-XXDK-4311                                            
066000     PERFORM IMS-GET-XXDK-4312                                            
066100     CONTINUE.                                                            
066200                                                                          
066300     EJECT                                                                
066400 D-REL-KOLL-INRAPP SECTION.                                               
066500                                                                          
066600     IF MID-IDRADNR-SENAST = ALL '+'                                      
066700       MOVE +0             TO WS-RADNR-SEKV                               
066800     ELSE                                                                 
066900       MOVE MID-IDRADNR-SENAST TO WS-RADNR-SEKV                           
067000     END-IF                                                               
067100     ADD  +1        TO WS-RADNR-SEKV                                      
067200     MOVE +1        TO RADIND                                             
067300                                                                          
067400     PERFORM IMS-GET-XXDJ-4305                                            
067500     PERFORM IMS-GET-XXDJ-4306                                            
067600     MOVE 4306-FLANNULL    TO WS-FLANNULL                                 
067700                                                                          
067800     PERFORM UNTIL                                                        
067900      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
068000       IF MID-RAD (RADIND) NOT = ALL '+'                                  
068100         PERFORM DA-KOLL-KOMB                                             
068200         PERFORM DB-KOLL-4312                                             
068300         PERFORM DC-KOLL-SEKV                                             
068400                                                                          
068500         IF MID-IDRADNR-TOM (RADIND) = ALL '+'                            
068600           MOVE MID-IDRADNR-FOM (RADIND) TO                               
068700                     WS-RADNR-SEKV                                        
068800         ELSE                                                             
068900           MOVE MID-IDRADNR-TOM (RADIND) TO                               
069000                     WS-RADNR-SEKV                                        
069100         END-IF                                                           
069200         IF WS-INDATA-RAETT                                               
069300           MOVE MID-IDRADNR-FOM (RADIND) TO W-IDPURAD-WDE4B1              
069400           PERFORM IMS-GU-WDE4B                                           
069500                                                                          
069600           IF MID-KVLEVART (RADIND) = ALL '+'                             
069700                                                                          
069800             IF SEQB-KVAVBART = +1                                        
069900               IF MID-FLRADDEL (RADIND) NOT = ALL '+'                     
070000                 MOVE FEL    TO WS-INDATA-TEST                            
070100                 MOVE MFS-ALFA-FAELT-FEL TO                               
070200                              MOD-FLRADDEL-ATTR (RADIND)                  
070300               END-IF                                                     
070400             END-IF                                                       
070500           ELSE                                                           
070600             IF MID-KVLEVART (RADIND) > SEQB-KVAVBART                     
070700             OR MID-KVLEVART (RADIND) = SEQB-KVAVBART                     
070800               MOVE FEL    TO WS-INDATA-TEST                              
070900               MOVE MFS-NUM-FAELT-FEL TO                                  
071000                            MOD-KVLEVART-ATTR (RADIND)                    
071100             END-IF                                                       
071200           END-IF                                                         
071300         END-IF                                                           
071400         ADD +1       TO WS-RADNR-SEKV                                    
071500                                                                          
071600       END-IF                                                             
071700       ADD +1                  TO RADIND                                  
071800     END-PERFORM                                                          
071900     IF  4306-FLANNULL = 'J' OR 'Y'                                       
072000       PERFORM DD-KOLLA-ANNULL                                            
072100     END-IF                                                               
072200     CONTINUE.                                                            
072300     EJECT                                                                
072400 DA-KOLL-KOMB SECTION.                                                    
072500                                                                          
072600                                                                          
072700     IF MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                            
072800       IF MID-IDRADNR-TOM (RADIND) < MID-IDRADNR-FOM (RADIND)             
072900         MOVE FEL             TO WS-INDATA-TEST                           
073000         MOVE MFS-NUM-FAELT-FEL  TO                                       
073100                            MOD-IDRADNR-TOM-ATTR (RADIND)                 
073200       ELSE                                                               
073300         IF MID-FLRADDEL (RADIND) NOT = ALL '+'                           
073400           MOVE FEL             TO WS-INDATA-TEST                         
073500           MOVE MFS-ALFA-FAELT-FEL  TO                                    
073600                              MOD-FLRADDEL-ATTR (RADIND)                  
073700         END-IF                                                           
073800         IF MID-KVLEVART (RADIND) NOT = ALL '+'                           
073900           MOVE FEL             TO WS-INDATA-TEST                         
074000           MOVE MFS-NUM-FAELT-FEL  TO                                     
074100                              MOD-KVLEVART-ATTR (RADIND)                  
074200         END-IF                                                           
074300       END-IF                                                             
074400     END-IF                                                               
074500     IF MID-IDKOLLI (RADIND) NOT = ALL '+'                                
074600       IF MID-KVLEVART (RADIND) NOT = ALL '+'                             
074700         IF MID-KVLEVART (RADIND) = 0                                     
074800           MOVE FEL                TO WS-INDATA-TEST                      
074900           MOVE MFS-NUM-FAELT-FEL TO                                      
075000                                MOD-IDKOLLI-ATTR (RADIND)                 
075100         END-IF                                                           
075200       END-IF                                                             
075300       IF MID-FLRADDEL (RADIND) NOT = ALL '+'                             
075400         MOVE FEL                TO WS-INDATA-TEST                        
075500         MOVE MFS-ALFA-FAELT-FEL TO                                       
075600                              MOD-FLRADDEL-ATTR (RADIND)                  
075700       END-IF                                                             
075800     ELSE                                                                 
075900       IF  MID-KVLEVART (RADIND)  = ALL '+'                               
076000       AND MID-FLRADDEL (RADIND)  = ALL '+'                               
076100         MOVE FEL             TO WS-INDATA-TEST                           
076200         MOVE MFS-NUM-FAELT-FEL TO                                        
076300                            MOD-IDKOLLI-ATTR (RADIND)                     
076400       ELSE                                                               
076500         IF (MID-KVLEVART (RADIND)  = ALL '+' OR > 1)                     
076600           IF MID-FLRADDEL (RADIND) = ALL '+'                             
076700             MOVE FEL             TO WS-INDATA-TEST                       
076800             MOVE MFS-NUM-FAELT-FEL TO                                    
076900                                MOD-IDKOLLI-ATTR (RADIND)                 
077000           END-IF                                                         
077100         ELSE                                                             
077200           IF MID-KVLEVART (RADIND)  = ZERO                               
077300             IF MID-FLRADDEL (RADIND)  = 'X'                              
077400               MOVE FEL             TO WS-INDATA-TEST                     
077500               MOVE MFS-NUM-FAELT-FEL TO                                  
077600                            MOD-KVLEVART-ATTR (RADIND)                    
077700               MOVE MFS-ALFA-FAELT-FEL TO                                 
077800                            MOD-FLRADDEL-ATTR (RADIND)                    
077900             END-IF                                                       
078000           END-IF                                                         
078100           IF (MID-KVLEVART (RADIND)  = 1)                                
078200             MOVE FEL             TO WS-INDATA-TEST                       
078300             MOVE MFS-NUM-FAELT-FEL TO                                    
078400                          MOD-KVLEVART-ATTR (RADIND)                      
078500             MOVE MFS-NUM-FAELT-FEL TO                                    
078600                          MOD-IDKOLLI-ATTR (RADIND)                       
078700           END-IF                                                         
078800         END-IF                                                           
078900       END-IF                                                             
079000     END-IF                                                               
079100     CONTINUE.                                                            
079200     EJECT                                                                
079300 DB-KOLL-4312 SECTION.                                                    
079400                                                                          
079500                                                                          
079600     IF MID-IDRADNR-FOM (RADIND) > 4312-KVORDRAD                          
079700       MOVE FEL             TO WS-INDATA-TEST                             
079800       MOVE MFS-NUM-FAELT-FEL  TO                                         
079900                          MOD-IDRADNR-FOM-ATTR (RADIND)                   
080000     END-IF                                                               
080100     IF MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                            
080200       IF MID-IDRADNR-TOM (RADIND) > 4312-KVORDRAD                        
080300         MOVE FEL             TO WS-INDATA-TEST                           
080400         MOVE MFS-NUM-FAELT-FEL  TO                                       
080500                            MOD-IDRADNR-TOM-ATTR (RADIND)                 
080600       END-IF                                                             
080700     END-IF                                                               
080800     IF MID-IDRADNR-FOM (RADIND) = 4312-KVORDRAD                          
080900       MOVE JA              TO WS-FLKLAR-TEST                             
081000     END-IF                                                               
081100     IF MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                            
081200       IF MID-IDRADNR-TOM (RADIND) = 4312-KVORDRAD                        
081300         MOVE JA              TO WS-FLKLAR-TEST                           
081400       END-IF                                                             
081500     END-IF                                                               
081600     CONTINUE.                                                            
081700     EJECT                                                                
081800 DC-KOLL-SEKV SECTION.                                                    
081900                                                                          
082000**** FINNS ANNULLATIONER - KONTROLL AV STIGANDE SEKV                      
082100**** FINNS INGA ANNULLATIONER - KONTROLL AV STRÄNGT STIGANDE SEKV         
082200                                                                          
082300     IF WS-FLANNULL = 'J' OR 'Y'                                          
082400       IF MID-IDRADNR-FOM (RADIND) < WS-RADNR-SEKV                        
082500         MOVE FEL          TO WS-INDATA-TEST                              
082600         MOVE MFS-NUM-FAELT-FEL  TO                                       
082700                            MOD-IDRADNR-FOM-ATTR (RADIND)                 
082800       END-IF                                                             
082900     ELSE                                                                 
083000       IF MID-IDRADNR-FOM (RADIND) NOT = WS-RADNR-SEKV                    
083100         MOVE FEL          TO WS-INDATA-TEST                              
083200         MOVE MFS-NUM-FAELT-FEL  TO                                       
083300                            MOD-IDRADNR-FOM-ATTR (RADIND)                 
083400       END-IF                                                             
083500     END-IF                                                               
083600     CONTINUE.                                                            
083700     EJECT                                                                
083800 DD-KOLLA-ANNULL SECTION.                                                 
083900                                                                          
084000     IF MID-IDRADNR-SENAST = ALL '+'                                      
084100       MOVE 0             TO WS-RADNR-SEKV                                
084200       PERFORM IMS-GET-XXDJ-4308-F                                        
084300       PERFORM UNTIL                                                      
084400        NOT ( SEGMENT-FINNS AND 4308-KVANNANT NOT = ZERO )                
084500         PERFORM IMS-GET-XXDJ-4308                                        
084600       END-PERFORM                                                        
084700       IF  SEGMENT-SAKNAS                                                 
084800         MOVE +99999     TO 4308-IDRADNR-ORD-FROM                         
084900                            4308-IDRADNR-ORD-TOM                          
085000       END-IF                                                             
085100     ELSE                                                                 
085200       MOVE MID-IDRADNR-SENAST TO WS-RADNR-SEKV                           
085300                                  W-IDRADNR-ORD-TOM                       
085400       PERFORM IMS-GET-XXDJ-4308-KVAL-F                                   
085500       PERFORM UNTIL                                                      
085600        NOT ( SEGMENT-FINNS AND 4308-KVANNANT NOT = ZERO )                
085700         PERFORM IMS-GET-XXDJ-4308                                        
085800       END-PERFORM                                                        
085900       IF  SEGMENT-SAKNAS                                                 
086000         MOVE +99999     TO 4308-IDRADNR-ORD-FROM                         
086100                            4308-IDRADNR-ORD-TOM                          
086200       END-IF                                                             
086300     END-IF                                                               
086400     ADD  +1              TO WS-RADNR-SEKV                                
086500     MOVE +1              TO RADIND                                       
086600                                                                          
086700     PERFORM UNTIL                                                        
086800      NOT ( RADIND < MAX-RADIND-PLUS-1 AND WS-INDATA-RAETT )              
086900       IF MID-RAD (RADIND) NOT = ALL '+'                                  
087000         IF MID-IDRADNR-TOM (RADIND) = ALL '+'                            
087100           MOVE MID-IDRADNR-FOM (RADIND) TO                               
087200                            MID-IDRADNR-TOM (RADIND)                      
087300         END-IF                                                           
087400         IF WS-RADNR-SEKV = MID-IDRADNR-FOM (RADIND)                      
087500         OR WS-RADNR-SEKV = 4308-IDRADNR-ORD-FROM                         
087600           CONTINUE                                                       
087700         ELSE                                                             
087800           MOVE FEL       TO WS-INDATA-TEST                               
087900           MOVE MFS-NUM-FAELT-FEL TO                                      
088000                    MOD-IDRADNR-FOM (RADIND)                              
088100         END-IF                                                           
088200         IF WS-INDATA-RAETT                                               
088300                                                                          
088400           IF MID-IDRADNR-FOM (RADIND) <                                  
088500                          4308-IDRADNR-ORD-FROM                           
088600             IF MID-IDRADNR-TOM (RADIND) <                                
088700                            4308-IDRADNR-ORD-FROM                         
088800               MOVE MID-IDRADNR-TOM (RADIND) TO                           
088900                                WS-RADNR-SEKV                             
089000               ADD +1           TO WS-RADNR-SEKV                          
089100               ADD +1           TO RADIND                                 
089200             ELSE                                                         
089300               MOVE FEL         TO WS-INDATA-TEST                         
089400               MOVE MFS-NUM-FAELT-FEL TO                                  
089500                        MOD-IDRADNR-TOM (RADIND)                          
089600             END-IF                                                       
089700           ELSE                                                           
089800             EVALUATE TRUE                                                
089900             WHEN MID-IDRADNR-FOM (RADIND) > 4308-IDRADNR-ORD-TOM         
090000               MOVE 4308-IDRADNR-ORD-TOM TO                               
090100                                WS-RADNR-SEKV                             
090200               ADD +1           TO WS-RADNR-SEKV                          
090300               PERFORM IMS-GET-XXDJ-4308                                  
090400               PERFORM UNTIL                                              
090500                NOT ( SEGMENT-FINNS AND 4308-KVANNANT NOT = ZERO          
090600                 )                                                        
090700                 PERFORM IMS-GET-XXDJ-4308                                
090800               END-PERFORM                                                
090900               IF SEGMENT-SAKNAS                                          
091000                 MOVE +99999     TO 4308-IDRADNR-ORD-FROM                 
091100                                    4308-IDRADNR-ORD-TOM                  
091200               END-IF                                                     
091300              WHEN OTHER                                                  
091400               MOVE FEL         TO WS-INDATA-TEST                         
091500               MOVE MFS-NUM-FAELT-FEL TO                                  
091600                        MOD-IDRADNR-FOM (RADIND)                          
091700             END-EVALUATE                                                 
091800           END-IF                                                         
091900         END-IF                                                           
092000       ELSE                                                               
092100         ADD +1       TO RADIND                                           
092200       END-IF                                                             
092300     END-PERFORM                                                          
092400     IF WS-INDATA-RAETT                                                   
092500       IF WS-RADNR-SEKV > 4312-KVORDRAD                                   
092600*****      SLUT PÅ RAPP                                                   
092700         MOVE JA      TO WS-FLKLAR-TEST                                   
092800       ELSE                                                               
092900         IF SEGMENT-FINNS                                                 
093000           IF WS-RADNR-SEKV = 4308-IDRADNR-ORD-FROM                       
093100             MOVE 4308-IDRADNR-ORD-TOM TO WS-RADNR-SEKV                   
093200             ADD +1                    TO WS-RADNR-SEKV                   
093300             PERFORM IMS-GET-XXDJ-4308                                    
093400             PERFORM UNTIL                                                
093500              NOT ( SEGMENT-FINNS AND 4308-KVANNANT NOT = ZERO )          
093600               PERFORM IMS-GET-XXDJ-4308                                  
093700             END-PERFORM                                                  
093800             PERFORM UNTIL                                                
093900              NOT ( SEGMENT-FINNS AND WS-RADNR-SEKV =                     
094000                4308-IDRADNR-ORD-FROM )                                   
094100               MOVE 4308-IDRADNR-ORD-TOM TO WS-RADNR-SEKV                 
094200               ADD +1                    TO WS-RADNR-SEKV                 
094300               PERFORM IMS-GET-XXDJ-4308                                  
094400               PERFORM UNTIL                                              
094500                NOT ( SEGMENT-FINNS AND 4308-KVANNANT NOT = ZERO          
094600                 )                                                        
094700                 PERFORM IMS-GET-XXDJ-4308                                
094800               END-PERFORM                                                
094900             END-PERFORM                                                  
095000             IF SEGMENT-FINNS                                             
095100********            FORTSÄTT RAPPORTERA                                   
095200               CONTINUE                                                   
095300             ELSE                                                         
095400               IF WS-RADNR-SEKV > 4312-KVORDRAD                           
095500********               SLUT PÅ RAPPORTERING                               
095600                 MOVE JA      TO WS-FLKLAR-TEST                           
095700               ELSE                                                       
095800                 CONTINUE                                                 
095900               END-IF                                                     
096000             END-IF                                                       
096100           ELSE                                                           
096200             CONTINUE                                                     
096300           END-IF                                                         
096400         ELSE                                                             
096500           CONTINUE                                                       
096600         END-IF                                                           
096700       END-IF                                                             
096800     END-IF                                                               
096900     CONTINUE.                                                            
097000     EJECT                                                                
097100 E-REL-KOLL-MANUELL SECTION.                                              
097200                                                                          
097300     IF MID-IDRADNR-SENAST = ALL '+'                                      
097400       MOVE +0             TO WS-RADNR-SEKV                               
097500     ELSE                                                                 
097600       MOVE MID-IDRADNR-SENAST TO WS-RADNR-SEKV                           
097700     END-IF                                                               
097800     ADD  +1        TO WS-RADNR-SEKV                                      
097900     MOVE +1        TO RADIND                                             
098000                                                                          
098100     PERFORM UNTIL                                                        
098200      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
098300       IF MID-RAD (RADIND) NOT = ALL '+'                                  
098400         PERFORM DA-KOLL-KOMB                                             
098500                                                                          
098600         IF MID-IDRADNR-FOM (RADIND) < WS-RADNR-SEKV                      
098700           MOVE FEL    TO WS-INDATA-TEST                                  
098800           MOVE MFS-NUM-FAELT-FEL TO                                      
098900                        MOD-IDRADNR-FOM-ATTR (RADIND)                     
099000         END-IF                                                           
099100         IF WS-INDATA-RAETT                                               
099200                                                                          
099300           PERFORM UNTIL                                                  
099400            NOT ( WS-RADNR-SEKV < MID-IDRADNR-FOM (RADIND) AND            
099500              WS-INDATA-RAETT )                                           
099600             MOVE WS-RADNR-SEKV TO W-IDPURAD-WDE4B1                       
099700             PERFORM IMS-GU-WDE4B-STAT-GE                                 
099800                                                                          
099900             IF SEGMENT-FINNS AND SEQB-KVAVBART > 0                       
100000               MOVE FEL    TO WS-INDATA-TEST                              
100100               MOVE MFS-NUM-FAELT-FEL TO                                  
100200                            MOD-IDRADNR-FOM-ATTR (RADIND)                 
100300             END-IF                                                       
100400             IF SEGMENT-FINNS AND SEQB-KVAVBART = 0                       
100500               ADD +1        TO WS-KVORDRAD                               
100600             END-IF                                                       
100700             ADD +1          TO WS-RADNR-SEKV                             
100800           END-PERFORM                                                    
100900           IF WS-RADNR-SEKV > MID-IDRADNR-FOM (RADIND)                    
101000             MOVE FEL    TO WS-INDATA-TEST                                
101100             MOVE MFS-NUM-FAELT-FEL TO                                    
101200                          MOD-IDRADNR-FOM-ATTR (RADIND)                   
101300           ELSE                                                           
101400             IF MID-IDRADNR-TOM (RADIND) = ALL '+'                        
101500               MOVE MID-IDRADNR-FOM (RADIND) TO                           
101600                                WS-INTERV-TOM                             
101700             ELSE                                                         
101800               MOVE MID-IDRADNR-TOM (RADIND) TO                           
101900                                WS-INTERV-TOM                             
102000             END-IF                                                       
102100             PERFORM UNTIL                                                
102200              NOT ( (WS-RADNR-SEKV < WS-INTERV-TOM OR                     
102300               WS-RADNR-SEKV =                                            
102400                WS-INTERV-TOM) AND WS-INDATA-RAETT )                      
102500               MOVE WS-RADNR-SEKV TO W-IDPURAD-WDE4B1                     
102600               PERFORM IMS-GU-WDE4B-STAT-GE                               
102700                                                                          
102800               IF (SEGMENT-SAKNAS)                                        
102900               OR (SEGMENT-FINNS AND SEQB-KVAVBART = 0)                   
103000                                                                          
103100                 IF SEGMENT-FINNS                                         
103200                   ADD +1       TO WS-KVORDRAD                            
103300                 END-IF                                                   
103400                 MOVE FEL    TO WS-INDATA-TEST                            
103500                 MOVE MFS-NUM-FAELT-FEL TO                                
103600                          MOD-IDRADNR-FOM-ATTR (RADIND)                   
103700               ELSE                                                       
103800                 ADD +1       TO WS-KVORDRAD                              
103900               END-IF                                                     
104000               ADD +1          TO WS-RADNR-SEKV                           
104100             END-PERFORM                                                  
104200           END-IF                                                         
104300           IF WS-INDATA-RAETT                                             
104400                                                                          
104500             IF MID-KVLEVART (RADIND) = ALL '+'                           
104600                                                                          
104700               IF SEQB-KVAVBART = +1                                      
104800                 IF MID-FLRADDEL (RADIND) NOT = ALL '+'                   
104900                   MOVE FEL    TO WS-INDATA-TEST                          
105000                   MOVE MFS-ALFA-FAELT-FEL TO                             
105100                                MOD-FLRADDEL-ATTR (RADIND)                
105200                 END-IF                                                   
105300               END-IF                                                     
105400             ELSE                                                         
105500               IF MID-KVLEVART (RADIND) > SEQB-KVAVBART                   
105600               OR MID-KVLEVART (RADIND) = SEQB-KVAVBART                   
105700                 MOVE FEL    TO WS-INDATA-TEST                            
105800                 MOVE MFS-NUM-FAELT-FEL TO                                
105900                      MOD-KVLEVART-ATTR (RADIND)                          
106000               END-IF                                                     
106100             END-IF                                                       
106200           END-IF                                                         
106300         END-IF                                                           
106400       END-IF                                                             
106500       ADD +1             TO RADIND                                       
106600     END-PERFORM                                                          
106700     IF WS-INDATA-RAETT                                                   
106800       IF 4312-KVORDRAD = WS-KVORDRAD                                     
106900         MOVE JA          TO WS-FLKLAR-TEST                               
107000       ELSE                                                               
107100         PERFORM EA-KOLL-WDE4-ANN                                         
107200       END-IF                                                             
107300     END-IF                                                               
107400     CONTINUE.                                                            
107500     EJECT                                                                
107600***************************************************************           
107700*** HÄR KONTROLLERAS OM MANUELLA ORDER EV ÄR FÄRDIGRAPP.                  
107800*** DET KAN VARA SÅ ATT ALLA RADER EFTER DEN SENAST INNRAPP.              
107900*** ÄR ANNULLERADE (SEQB-KVAVBART = 0) I DETTA FALL ÄR                    
108000*** ORDERNS ALLA RADER RAPP.                                              
108100***************************************************************           
108200 EA-KOLL-WDE4-ANN SECTION.                                                
108300                                                                          
108400     MOVE JA          TO WS-FLWDE4-TEST                                   
108500     MOVE WS-RADNR-SEKV TO WS-RADNR-SEKV-ANN                              
108600     MOVE WS-KVORDRAD   TO WS-KVORDRAD-ANN                                
108700                                                                          
108800     PERFORM UNTIL                                                        
108900      NOT ( WS-KVORDRAD-ANN < 4312-KVORDRAD AND WS-FLWDE4-ANN )           
109000       MOVE WS-RADNR-SEKV-ANN  TO W-IDPURAD-WDE4B1                        
109100       PERFORM IMS-GU-WDE4B-STAT-GE                                       
109200                                                                          
109300       IF SEGMENT-FINNS                                                   
109400         IF SEQB-KVAVBART = 0                                             
109500           ADD +1          TO WS-KVORDRAD-ANN                             
109600         ELSE                                                             
109700           MOVE NEJ        TO WS-FLWDE4-TEST                              
109800         END-IF                                                           
109900       END-IF                                                             
110000       ADD +1              TO WS-RADNR-SEKV-ANN                           
110100     END-PERFORM                                                          
110200     IF WS-FLWDE4-ANN                                                     
110300       MOVE JA            TO WS-FLKLAR-TEST                               
110400     ELSE                                                                 
110500       MOVE WS-KVORDRAD   TO MOD-KVORDRAD                                 
110600     END-IF                                                               
110700     CONTINUE.                                                            
110800     EJECT                                                                
110900 G-FLERA-KOLLI SECTION.                                                   
111000                                                                          
111100     MOVE +1          TO RADIND                                           
111200     PERFORM IMS-GET-XXDL-4315                                            
111300                                                                          
111400     PERFORM UNTIL                                                        
111500      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
111600       IF MID-RAD (RADIND) NOT = ALL '+'                                  
111700*** KOLLI                                                                 
111800         IF MID-IDKOLLI (RADIND) NOT = ALL '+'                            
111900           PERFORM GA-4316-KOLLI                                          
112000         END-IF                                                           
112100         PERFORM GB-4316-AVVIK                                            
112200                                                                          
112300*** DELNING                                                               
112400         IF MID-FLRADDEL (RADIND) NOT = ALL '+'                           
112500           PERFORM GC-FIXA-4312                                           
112600           PERFORM GD-4314-DELN                                           
112700         END-IF                                                           
112800         IF MID-IDRADNR-TOM (RADIND) = ALL '+'                            
112900           MOVE MID-IDRADNR-FOM (RADIND) TO                               
113000                            MOD-IDRADNR-SENAST                            
113100         ELSE                                                             
113200           MOVE MID-IDRADNR-TOM (RADIND) TO                               
113300                            MOD-IDRADNR-SENAST                            
113400         END-IF                                                           
113500       END-IF                                                             
113600       ADD +1        TO RADIND                                            
113700     END-PERFORM                                                          
113800     CONTINUE.                                                            
113900     EJECT                                                                
114000 GA-4316-KOLLI SECTION.                                                   
114100                                                                          
114200     MOVE '002'                TO W-IDPTYP-4316                           
114300     MOVE MID-IDKOLLI (RADIND) TO W-IDKOLLI-4316                          
114400     PERFORM IMS-GET-XXDL-4316-F                                          
114500     MOVE +1              TO 4316-IND                                     
114600     MOVE MAX-ANT-RAD     TO WS-ANT-RAD-REST                              
114700     MOVE NEJ             TO WS-FLREPL-TEST                               
114800                                                                          
114900     IF SEGMENT-FINNS                                                     
115000                                                                          
115100       IF 4316-A-MID-RAD (MAX-4316-IND) = ALL '+'                         
115200                                                                          
115300         PERFORM UNTIL                                                    
115400          NOT ( ((4316-IND < MAX-4316-IND OR 4316-IND =                   
115500            MAX-4316-IND) AND (4316-A-MID-RAD (4316-IND) NOT =            
115600            ALL '+' )) )                                                  
115700           IF 4316-A-MID-IDRADNR-TOM (4316-IND) = ALL '+'                 
115800             MOVE +1   TO WS-ANT-RAD-INT                                  
115900           ELSE                                                           
116000             MOVE 4316-A-MID-IDRADNR-FOM (4316-IND)                       
116100                       TO WS-FROM                                         
116200             MOVE 4316-A-MID-IDRADNR-TOM (4316-IND)                       
116300                       TO WS-TOM                                          
116400             COMPUTE WS-ANT-RAD-INT =                                     
116500                     WS-TOM - WS-FROM + 1                                 
116600           END-IF                                                         
116700           COMPUTE WS-ANT-RAD-REST = WS-ANT-RAD-REST -                    
116800                                     WS-ANT-RAD-INT                       
116900           ADD +1            TO 4316-IND                                  
117000         END-PERFORM                                                      
117100         IF WS-ANT-RAD-REST = 0                                           
117200           MOVE +1         TO 4316-IND                                    
117300           MOVE MAX-ANT-RAD  TO WS-ANT-RAD-REST                           
117400           PERFORM GAA-KOLL-003                                           
117500         ELSE                                                             
117600           MOVE JA     TO WS-FLREPL-TEST                                  
117700           PERFORM GAB-KOLLI-002                                          
117800         END-IF                                                           
117900       ELSE                                                               
118000         PERFORM GAA-KOLL-003                                             
118100                                                                          
118200       END-IF                                                             
118300     ELSE                                                                 
118400       PERFORM S01-4316-002                                               
118500       PERFORM GAB-KOLLI-002                                              
118600     END-IF                                                               
118700     CONTINUE.                                                            
118800     EJECT                                                                
118900 GAA-KOLL-003 SECTION.                                                    
119000                                                                          
119100     PERFORM IMS-GET-XXDL-4315                                            
119200     MOVE '003'                TO W-IDPTYP-4316                           
119300     PERFORM IMS-GET-XXDL-4316-L                                          
119400                                                                          
119500     IF SEGMENT-FINNS                                                     
119600                                                                          
119700       IF 4316-B-MID-RAD (MAX-4316-IND) = ALL '+'                         
119800                                                                          
119900         PERFORM UNTIL                                                    
120000          NOT ( ((4316-IND < MAX-4316-IND OR 4316-IND =                   
120100            MAX-4316-IND) AND (4316-B-MID-RAD (4316-IND) NOT =            
120200            ALL '+' )) )                                                  
120300           IF 4316-B-MID-IDRADNR-TOM (4316-IND) = ALL '+'                 
120400             MOVE +1   TO WS-ANT-RAD-INT                                  
120500           ELSE                                                           
120600             MOVE 4316-B-MID-IDRADNR-FOM (4316-IND)                       
120700                       TO WS-FROM                                         
120800             MOVE 4316-B-MID-IDRADNR-TOM (4316-IND)                       
120900                       TO WS-TOM                                          
121000             COMPUTE WS-ANT-RAD-INT = WS-TOM - WS-FROM + 1                
121100             CONTINUE                                                     
121200           END-IF                                                         
121300           COMPUTE WS-ANT-RAD-REST =                                      
121400                   WS-ANT-RAD-REST - WS-ANT-RAD-INT                       
121500           ADD +1            TO 4316-IND                                  
121600         END-PERFORM                                                      
121700         IF WS-ANT-RAD-REST = 0                                           
121800           MOVE MAX-ANT-RAD  TO WS-ANT-RAD-REST                           
121900           MOVE +1           TO 4316-IND                                  
122000           PERFORM S02-4316-003                                           
122100           PERFORM GAC-KOLLI-003                                          
122200         ELSE                                                             
122300           MOVE JA     TO WS-FLREPL-TEST                                  
122400           PERFORM GAC-KOLLI-003                                          
122500         END-IF                                                           
122600       ELSE                                                               
122700         PERFORM S02-4316-003                                             
122800         PERFORM GAC-KOLLI-003                                            
122900       END-IF                                                             
123000     ELSE                                                                 
123100       PERFORM S02-4316-003                                               
123200       PERFORM GAC-KOLLI-003                                              
123300     END-IF                                                               
123400     CONTINUE.                                                            
123500     EJECT                                                                
123600 GAB-KOLLI-002 SECTION.                                                   
123700                                                                          
123800     MOVE MID-IDRADNR-FOM (RADIND) TO WS-FROM                             
123900                                                                          
124000     IF  MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                           
124100       MOVE MID-IDRADNR-TOM (RADIND) TO WS-TOM                            
124200     ELSE                                                                 
124300       MOVE MID-IDRADNR-FOM (RADIND) TO WS-FROM                           
124400     END-IF                                                               
124500     COMPUTE WS-ANT-RAD-INT = WS-TOM - WS-FROM + 1                        
124600                                                                          
124700     IF WS-ANT-RAD-INT > WS-ANT-RAD-REST                                  
124800       PERFORM GAD-MAX-200-RAD                                            
124900     ELSE                                                                 
125000       MOVE MID-IDRADNR-FOM (RADIND)                                      
125100                     TO 4316-A-MID-IDRADNR-FOM (4316-IND)                 
125200                                                                          
125300                                                                          
125400       IF  MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                         
125500         IF  MID-IDRADNR-TOM (RADIND) >                                   
125600             MID-IDRADNR-FOM (RADIND)                                     
125700           MOVE MID-IDRADNR-TOM (RADIND)                                  
125800                    TO 4316-A-MID-IDRADNR-TOM (4316-IND)                  
125900         END-IF                                                           
126000       END-IF                                                             
126100       IF  MID-KVLEVART (RADIND) NOT = ALL '+'                            
126200         MOVE MID-KVLEVART (RADIND)                                       
126300                  TO 4316-A-MID-KVLEVART (4316-IND)                       
126400       END-IF                                                             
126500       IF  WS-FLREPL                                                      
126600         PERFORM IMS-REPL-XXDL                                            
126700       ELSE                                                               
126800         PERFORM IMS-ISRT-XXDL-4316-STAT-BLANK                            
126900       END-IF                                                             
127000     END-IF                                                               
127100     CONTINUE.                                                            
127200     EJECT                                                                
127300 GAC-KOLLI-003 SECTION.                                                   
127400                                                                          
127500     MOVE MID-IDRADNR-FOM (RADIND) TO WS-FROM                             
127600                                                                          
127700     IF  MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                           
127800       MOVE MID-IDRADNR-TOM (RADIND) TO WS-TOM                            
127900     ELSE                                                                 
128000       MOVE MID-IDRADNR-FOM (RADIND) TO WS-FROM                           
128100     END-IF                                                               
128200     COMPUTE WS-ANT-RAD-INT = WS-TOM - WS-FROM + 1                        
128300                                                                          
128400     IF WS-ANT-RAD-INT > WS-ANT-RAD-REST                                  
128500       PERFORM GAD-MAX-200-RAD                                            
128600     ELSE                                                                 
128700       MOVE MID-IDRADNR-FOM (RADIND)                                      
128800                     TO 4316-B-MID-IDRADNR-FOM (4316-IND)                 
128900                                                                          
129000                                                                          
129100       IF  MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                         
129200         IF  MID-IDRADNR-TOM (RADIND) >                                   
129300             MID-IDRADNR-FOM (RADIND)                                     
129400           MOVE MID-IDRADNR-TOM (RADIND)                                  
129500                    TO 4316-B-MID-IDRADNR-TOM (4316-IND)                  
129600         END-IF                                                           
129700       END-IF                                                             
129800       IF  MID-KVLEVART (RADIND) NOT = ALL '+'                            
129900         MOVE MID-KVLEVART (RADIND)                                       
130000                  TO 4316-B-MID-KVLEVART (4316-IND)                       
130100       END-IF                                                             
130200       IF  WS-FLREPL                                                      
130300         PERFORM IMS-REPL-XXDL                                            
130400       ELSE                                                               
130500         PERFORM IMS-ISRT-XXDL-4316-STAT-II                               
130600       END-IF                                                             
130700     END-IF                                                               
130800     CONTINUE.                                                            
130900     EJECT                                                                
131000 GAD-MAX-200-RAD SECTION.                                                 
131100                                                                          
131200***** ANTALET RADER I KOLLI-POSTEN FÅR EJ ÖVERSTIGA 200                   
131300***** UPPLÄGGNING AV ORDER SOM HAR ANNULLERADE RADER                      
131400***** MEN SOM INNEHÅLLER FLER ÄN 200 RADER                                
131500                                                                          
131600     MOVE WS-TOM       TO WS-TOM-SISTA                                    
131700     COMPUTE WS-TOM = WS-FROM + WS-ANT-RAD-REST - 1                       
131800                                                                          
131900     IF 4316-IDPTYP = '002'                                               
132000       MOVE WS-FROM    TO                                                 
132100               4316-A-MID-IDRADNR-FOM (4316-IND)                          
132200                                                                          
132300       IF WS-FROM NOT = WS-TOM                                            
132400         MOVE  WS-TOM  TO                                                 
132500                  4316-A-MID-IDRADNR-TOM (4316-IND)                       
132600       END-IF                                                             
132700       IF WS-FLREPL                                                       
132800         PERFORM IMS-REPL-XXDL                                            
132900       ELSE                                                               
133000         PERFORM IMS-ISRT-XXDL-4316-STAT-BLANK                            
133100       END-IF                                                             
133200     ELSE                                                                 
133300       MOVE WS-FROM    TO                                                 
133400               4316-B-MID-IDRADNR-FOM (4316-IND)                          
133500                                                                          
133600       IF WS-FROM NOT = WS-TOM                                            
133700         MOVE  WS-TOM  TO                                                 
133800                  4316-B-MID-IDRADNR-TOM (4316-IND)                       
133900       END-IF                                                             
134000       IF WS-FLREPL                                                       
134100         PERFORM IMS-REPL-XXDL                                            
134200       ELSE                                                               
134300         PERFORM IMS-ISRT-XXDL-4316-STAT-II                               
134400       END-IF                                                             
134500     END-IF                                                               
134600     MOVE MAX-ANT-RAD          TO WS-ANT-RAD-REST                         
134700     MOVE +1                   TO 4316-IND                                
134800                                                                          
134900*****  SKAPA KOLLI-POSTER TILLS ALLA RADER I INTERVALLET                  
135000*****  ÄR PLACERADE I PT = 2 ELLER 3 HÄR SKAPAS EV FLERA PT=3             
135100                                                                          
135200     PERFORM UNTIL                                                        
135300      NOT ( WS-TOM < WS-TOM-SISTA )                                       
135400       PERFORM S02-4316-003                                               
135500       COMPUTE WS-FROM = WS-TOM + 1                                       
135600       COMPUTE WS-ANT-RAD-INT = WS-TOM-SISTA - WS-FROM + 1                
135700                                                                          
135800       IF WS-ANT-RAD-INT > WS-ANT-RAD-REST                                
135900         COMPUTE WS-TOM = WS-FROM + WS-ANT-RAD-REST - 1                   
136000         MOVE WS-FROM TO                                                  
136100                 4316-B-MID-IDRADNR-FOM (4316-IND)                        
136200                                                                          
136300         IF WS-FROM NOT = WS-TOM                                          
136400           MOVE  WS-TOM  TO                                               
136500                    4316-B-MID-IDRADNR-TOM (4316-IND)                     
136600         END-IF                                                           
136700       ELSE                                                               
136800         MOVE WS-TOM-SISTA   TO WS-TOM                                    
136900         MOVE WS-FROM TO                                                  
137000                 4316-B-MID-IDRADNR-FOM (4316-IND)                        
137100                                                                          
137200         IF WS-FROM NOT = WS-TOM                                          
137300           MOVE  WS-TOM  TO                                               
137400                    4316-B-MID-IDRADNR-TOM (4316-IND)                     
137500         END-IF                                                           
137600       END-IF                                                             
137700       PERFORM IMS-ISRT-XXDL-4316-STAT-II                                 
137800       MOVE MAX-ANT-RAD     TO WS-ANT-RAD-REST                            
137900       MOVE +1           TO 4316-IND                                      
138000     END-PERFORM                                                          
138100     CONTINUE.                                                            
138200     EJECT                                                                
138300 GB-4316-AVVIK SECTION.                                                   
138400                                                                          
138500     PERFORM GBA-HAEMTA-4316                                              
138600     MOVE MID-IDRADNR-FOM (RADIND) TO W-IDPURAD-WDE4B1                    
138700     PERFORM IMS-GU-WDE4B                                                 
138800                                                                          
138900     IF MID-KVLEVART (RADIND) = ALL '+'                                   
139000       PERFORM GBB-EV-BEH-AVV-VID-UTSKR                                   
139100     ELSE                                                                 
139200       PERFORM GBC-BEH-FYSAVV                                             
139300     END-IF                                                               
139400     IF WS-FLREPLACE = JA                                                 
139500       PERFORM IMS-REPL-XXDL                                              
139600     ELSE                                                                 
139700       PERFORM IMS-ISRT-XXDL-4316-STAT-BLANK                              
139800     END-IF                                                               
139900     CONTINUE.                                                            
140000     EJECT                                                                
140100 GBA-HAEMTA-4316                         SECTION.                         
140200                                                                          
140300     PERFORM IMS-GET-XXDL-4315                                            
140400     MOVE '004'      TO W-IDPTYP-4316                                     
140500     MOVE ZERO       TO W-IDKOLLI-4316                                    
140600     MOVE JA         TO WS-FLREPLACE                                      
140700     PERFORM IMS-GET-XXDL-4316-L                                          
140800     MOVE +1         TO 4316-IND-004                                      
140900                                                                          
141000     PERFORM UNTIL                                                        
141100      NOT ( (4316-C-MID-IDRADNR (4316-IND-004) NOT = ALL '+'              
141200        ) AND (4316-IND-004 < MAX-4316-IND-004-PLUS-ETT) )                
141300       ADD +1                      TO 4316-IND-004                        
141400     END-PERFORM                                                          
141410                                                                          
141500     IF 4316-IND-004 > MAX-4316-IND-004                                   
141501*      4398-TRANS FORTSÄTTER I YTTERLIGARE EN 4398-TRANS.                 
141502       MOVE JA                    TO 4316-C-MID-FLSVAR                    
141503       PERFORM IMS-REPL-XXDL                                              
141510                                                                          
141600       PERFORM S03-4316-004                                               
141700       MOVE +1       TO 4316-IND-004                                      
141800       MOVE NEJ      TO WS-FLREPLACE                                      
141900     END-IF                                                               
142000     CONTINUE.                                                            
142100     EJECT                                                                
142200 GBB-EV-BEH-AVV-VID-UTSKR                SECTION.                         
142300                                                                          
142400     MOVE MID-IDRADNR-FOM (RADIND)       TO WS-IDPURAD                    
142500                                                                          
142600     IF MID-IDRADNR-TOM (RADIND) = ALL '+'                                
142700       MOVE MID-IDRADNR-FOM (RADIND)     TO WS-IDPURAD-TOM                
142800     ELSE                                                                 
142900       MOVE MID-IDRADNR-TOM (RADIND)     TO WS-IDPURAD-TOM                
143000     END-IF                                                               
143010                                                                          
143100     PERFORM UNTIL                                                        
143200      ( WS-IDPURAD > WS-IDPURAD-TOM )                                     
143300       IF SEQB-KVBEART > SEQB-KVAVBART + SEQB-KVANNANT                    
143400         MOVE WS-IDPURAD    TO 4316-C-MID-IDRADNR (4316-IND-004)          
143500         MOVE 0             TO 4316-C-MID-KVORAPP (4316-IND-004)          
143600         PERFORM GBBA-RAKNA-UPP-4316-IND-004                              
143700       END-IF                                                             
143800       ADD 1                TO WS-IDPURAD                                 
143900                                                                          
144000       IF WS-IDPURAD NOT > WS-IDPURAD-TOM                                 
144100         MOVE WS-IDPURAD       TO W-IDPURAD-WDE4B1                        
144200         PERFORM IMS-GN-WDE4B                                             
144300       END-IF                                                             
144400     END-PERFORM                                                          
144500     CONTINUE.                                                            
144600     EJECT                                                                
144700 GBBA-RAKNA-UPP-4316-IND-004                   SECTION.                   
144800                                                                          
144900     IF 4316-IND-004 = MAX-4316-IND-004                                   
144901                                                                          
144910*      4398-TRANS FORTSÄTTER I YTTERLIGARE EN 4398-TRANS.                 
144920       MOVE JA                    TO 4316-C-MID-FLSVAR                    
144930       PERFORM IMS-REPL-XXDL                                              
144940                                                                          
145000       IF WS-FLREPLACE = JA                                               
145100         PERFORM IMS-REPL-XXDL                                            
145200       ELSE                                                               
145300         PERFORM IMS-ISRT-XXDL-4316-STAT-BLANK                            
145400       END-IF                                                             
145500       PERFORM S03-4316-004                                               
145600       MOVE +1                      TO 4316-IND-004                       
145700       MOVE NEJ                     TO WS-FLREPLACE                       
145800     ELSE                                                                 
145900       ADD +1                       TO 4316-IND-004                       
146000     END-IF                                                               
146100     CONTINUE.                                                            
146200     EJECT                                                                
146300 GBC-BEH-FYSAVV                          SECTION.                         
146400                                                                          
146500     MOVE MID-IDRADNR-FOM (RADIND)                                        
146600                     TO 4316-C-MID-IDRADNR (4316-IND-004)                 
146700                                                                          
146800     COMPUTE WS-KVLEVART = SEQB-KVAVBART - MID-KVLEVART (RADIND)          
146900     MOVE WS-KVLEVART   TO 4316-C-MID-KVORAPP (4316-IND-004)              
147000     CONTINUE.                                                            
147100     EJECT                                                                
147200 GC-FIXA-4312 SECTION.                                                    
147300                                                                          
147400     PERFORM IMS-GET-XXDK-4312                                            
147500                                                                          
147600     IF  4312-KDBEHAND-DEL NOT = +1                                       
147700       MOVE +1           TO 4312-KDBEHAND-DEL                             
147800       PERFORM IMS-REPL-XXDK                                              
147900     END-IF                                                               
148000     CONTINUE.                                                            
148100     EJECT                                                                
148200 GD-4314-DELN SECTION.                                                    
148300                                                                          
148400     MOVE MID-IDRADNR-FOM (RADIND) TO 4314-IDRADNR                        
148500     MOVE LOW-VALUE                TO 4314-LOWVALUE                       
148600     MOVE +1                       TO 4314-KDBEHAND-RAD                   
148700                                                                          
148800     IF  MID-KVLEVART (RADIND) = ALL '+'                                  
148900       MOVE MID-IDRADNR-FOM (RADIND) TO W-IDPURAD-WDE4B1                  
149000       PERFORM IMS-GU-WDE4B                                               
149100       MOVE SEQB-KVAVBART     TO 4314-KVLEVART                            
149200     ELSE                                                                 
149300       MOVE MID-KVLEVART (RADIND) TO 4314-KVLEVART                        
149400     END-IF                                                               
149500     PERFORM IMS-ISRT-XXDK-4314                                           
149600     CONTINUE.                                                            
149700                                                                          
149800     EJECT                                                                
149900 S01-4316-002 SECTION.                                                    
150000                                                                          
150100     MOVE LOW-VALUE               TO IO-AREA-1                            
150200     MOVE ALL '+'                 TO 4316-WDGX4316                        
150300     MOVE MID-IDPRODNR-UT         TO 4316-IDPRODNR                        
150400     MOVE '002'                   TO 4316-IDPTYP                          
150500     MOVE LOW-VALUE               TO 4316-LOWVALUE                        
150600     MOVE ZERO                    TO 4316-KDTRSTAT                        
150700     MOVE +312                    TO 4316-LL                              
150800     MOVE LOW-VALUE               TO 4316-Z1                              
150900     MOVE LOW-VALUE               TO 4316-Z2                              
151000     MOVE 'W4T315'                TO 4316-KDTRANS                         
151100     MOVE '4393'                  TO 4316-IDTRANS                         
151200     MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                        
151300                                                                          
151400     MOVE ZERO                 TO 4316-A-MID-IDANSTNR-UT                  
151500                                                                          
151600     MOVE MID-IDORDNR-UT       TO 4316-A-MID-IDORDNR-IN                   
151700                                  4316-A-MID-IDORDNR-UT                   
151800                                                                          
151900     MOVE MID-IDDISTR-UT       TO 4316-A-MID-IDDISTR-IN                   
152000                                  4316-A-MID-IDDISTR-UT                   
152100                                                                          
152200     MOVE MID-IDKUNDNR-UT      TO 4316-A-MID-IDKUNDNR-IN                  
152300                                  4316-A-MID-IDKUNDNR-UT                  
152400                                                                          
152500     MOVE MID-IDKOLLI (RADIND) TO 4316-IDKOLLI                            
152600                                  4316-A-MID-IDKOLLI-IN                   
152700                                  4316-A-MID-IDKOLLI-UT                   
152800                                                                          
152900     MOVE MID-IDPRODNR-UT      TO 4316-A-MID-IDPRODNR-IN                  
153000                                  4316-A-MID-IDPRODNR-UT                  
153010     MOVE MID-IDDC-UT          TO 4316-A-MID-IDDC-IN                      
153020                                  4316-A-MID-IDDC-UT                      
153100     MOVE 'U'                  TO 4316-A-MID-PRTVAL-FOLJEFL               
153200     MOVE WS-PRTVAL            TO 4316-A-MID-PRTVAL-ADRESSFL              
153300     CONTINUE.                                                            
153400                                                                          
153500                                                                          
153600     EJECT                                                                
153700 S02-4316-003    SECTION.                                                 
153800                                                                          
153900     MOVE LOW-VALUE               TO IO-AREA-1                            
154000     MOVE ALL '+'                 TO 4316-WDGX4316                        
154100     MOVE MID-IDPRODNR-UT         TO 4316-IDPRODNR                        
154200     MOVE '003'                   TO 4316-IDPTYP                          
154300     MOVE LOW-VALUE               TO 4316-LOWVALUE                        
154400     MOVE ZERO                    TO 4316-KDTRSTAT                        
154500     MOVE +277                    TO 4316-LL                              
154600     MOVE LOW-VALUE               TO 4316-Z1                              
154700     MOVE LOW-VALUE               TO 4316-Z2                              
154800     MOVE 'W4T314'                TO 4316-KDTRANS                         
154900     MOVE '4393'                  TO 4316-IDTRANS                         
155000     MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                        
155100                                                                          
155200     MOVE ZERO                 TO 4316-B-MID-IDANSTNR-UT                  
155300                                                                          
155400     MOVE MID-IDORDNR-UT       TO 4316-B-MID-IDORDNR-IN                   
155500                                  4316-B-MID-IDORDNR-UT                   
155600                                                                          
155700     MOVE MID-IDDISTR-UT       TO 4316-B-MID-IDDISTR-IN                   
155800                                  4316-B-MID-IDDISTR-UT                   
155900                                                                          
156000     MOVE MID-IDKUNDNR-UT      TO 4316-B-MID-IDKUNDNR-IN                  
156100                                  4316-B-MID-IDKUNDNR-UT                  
156110     MOVE MID-IDDC-UT          TO 4316-B-MID-IDDC-IN                      
156120                                  4316-B-MID-IDDC-UT                      
156200                                                                          
156300     IF  MID-IDKOLLI (RADIND) NOT = ALL '+'                               
156400       MOVE MID-IDKOLLI (RADIND) TO 4316-IDKOLLI                          
156500                                    4316-B-MID-IDKOLLI-IN                 
156600                                    4316-B-MID-IDKOLLI-UT                 
156700     ELSE                                                                 
156800       MOVE WS-IDKOLLI           TO 4316-IDKOLLI                          
156900                                    4316-B-MID-IDKOLLI-IN                 
157000                                    4316-B-MID-IDKOLLI-UT                 
157100     END-IF                                                               
157200     MOVE MID-IDPRODNR-UT         TO 4316-B-MID-IDPRODNR-IN               
157300                                     4316-B-MID-IDPRODNR-UT               
157400     MOVE 'J'                     TO 4316-B-MID-FLFORTSK                  
157500     MOVE 0                       TO 4316-B-MID-IDRADNR-FOM-S             
157600     MOVE 0                       TO 4316-B-MID-IDRADNR-TOM-S             
157700     MOVE 0                       TO 4316-B-MID-KVLEVART-S                
157800     MOVE 'UU'                    TO 4316-B-MID-KDPRTVAL-FOLJEFL          
157900     MOVE WS-PRTVAL               TO 4316-B-MID-KDPRTVAL-ADRESSFL         
158000     CONTINUE.                                                            
158100                                                                          
158200                                                                          
158300     EJECT                                                                
158400 S03-4316-004 SECTION.                                                    
158500                                                                          
158600     MOVE LOW-VALUE               TO IO-AREA-1                            
158700     MOVE ALL '+'                 TO 4316-WDGX4316                        
158800     MOVE MID-IDPRODNR-UT         TO 4316-IDPRODNR                        
158900     MOVE '004'                   TO 4316-IDPTYP                          
159000     MOVE ZERO                    TO 4316-IDKOLLI                         
159100     MOVE LOW-VALUE               TO 4316-LOWVALUE                        
159200     MOVE ZERO                    TO 4316-KDTRSTAT                        
159300     MOVE +346                    TO 4316-LL                              
159400     MOVE LOW-VALUE               TO 4316-Z1                              
159500     MOVE LOW-VALUE               TO 4316-Z2                              
159600     MOVE 'W4T398X'               TO 4316-KDTRANS                         
159700     MOVE '4393'                  TO 4316-IDTRANS                         
159800     MOVE MFS-KDMFSFOR            TO 4316-KDMFSFOR                        
159900                                                                          
160000     MOVE MID-IDORDNR-UT       TO 4316-C-MID-IDORDNR-IN                   
160100                                  4316-C-MID-IDORDNR-UT                   
160200                                                                          
160300     MOVE MID-IDDISTR-UT       TO 4316-C-MID-IDDISTR-IN                   
160400                                  4316-C-MID-IDDISTR-UT                   
160500                                                                          
160600     MOVE MID-IDKUNDNR-UT      TO 4316-C-MID-IDKUNDNR-IN                  
160700                                  4316-C-MID-IDKUNDNR-UT                  
160800                                                                          
160900                                                                          
161000     MOVE MID-IDPRODNR-UT      TO 4316-C-MID-IDPRODNR-IN                  
161100                                  4316-C-MID-IDPRODNR-UT                  
161200                                                                          
161300     MOVE ZERO                 TO 4316-C-MID-IDKOLLI-IN                   
161400                                  4316-C-MID-IDKOLLI-UT                   
161410                                                                          
161420     MOVE SPACE                TO 4316-C-MID-FLSVAR                       
161500     CONTINUE.                                                            
161600                                                                          
161700     EJECT                                                                
161800 S04-FORMATETS-ATTR SECTION.                                              
161900                                                                          
162000     MOVE +1               TO RADIND                                      
162100                                                                          
162200     PERFORM UNTIL                                                        
162300      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
162400       MOVE MFS-FORMATETS-ATTR TO MOD-IDRADNR-FOM-ATTR (RADIND)           
162500       MOVE MFS-FORMATETS-ATTR TO MOD-IDRADNR-TOM-ATTR (RADIND)           
162600       MOVE MFS-FORMATETS-ATTR TO MOD-IDKOLLI-ATTR (RADIND)               
162700       MOVE MFS-FORMATETS-ATTR TO MOD-KVLEVART-ATTR (RADIND)              
162800       MOVE MFS-FORMATETS-ATTR TO MOD-FLRADDEL-ATTR (RADIND)              
162900       ADD +1                 TO RADIND                                   
163000     END-PERFORM                                                          
163100     CONTINUE.                                                            
163200     EJECT                                                                
163300 S05-ROER-EJ-FAELT SECTION.                                               
163400                                                                          
163500     IF  MID-KVORDRAD NOT = ALL '+'                                       
163600       MOVE MFS-ROER-EJ-FAELT TO MOD-KVORDRAD                             
163700     END-IF                                                               
163800     IF  MID-IDRADNR-SENAST NOT = ALL '+'                                 
163900       MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR-SENAST                       
164000     END-IF                                                               
164100     MOVE +1                TO RADIND                                     
164200                                                                          
164300     PERFORM UNTIL                                                        
164400      NOT ( RADIND < MAX-RADIND-PLUS-1 )                                  
164500       IF  MID-IDRADNR-FOM (RADIND) NOT = ALL '+'                         
164600         MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR-FOM (RADIND)               
164700       END-IF                                                             
164800       IF  MID-IDRADNR-TOM (RADIND) NOT = ALL '+'                         
164900         MOVE MFS-ROER-EJ-FAELT TO MOD-IDRADNR-TOM (RADIND)               
165000       END-IF                                                             
165100       IF  MID-IDKOLLI (RADIND) NOT = ALL '+'                             
165200         MOVE MFS-ROER-EJ-FAELT TO MOD-IDKOLLI (RADIND)                   
165300       END-IF                                                             
165400       IF  MID-KVLEVART (RADIND) NOT = ALL '+'                            
165500         MOVE MFS-ROER-EJ-FAELT TO MOD-KVLEVART (RADIND)                  
165600       END-IF                                                             
165700       IF  MID-FLRADDEL (RADIND) NOT = ALL '+'                            
165800         MOVE MFS-ROER-EJ-FAELT TO MOD-FLRADDEL (RADIND)                  
165900       END-IF                                                             
166000       ADD +1                 TO RADIND                                   
166100     END-PERFORM                                                          
166200     CONTINUE.                                                            
166300     EJECT                                                                
166400 S90-SKAPA-TOM-003 SECTION.                                               
166500                                                                          
166600     MOVE '002'      TO W-IDPTYP-4316-MIN                                 
166700     MOVE '002'      TO W-IDPTYP-4316-MAX                                 
166800     PERFORM IMS-GET-XXDL-4316-INTERV                                     
166900                                                                          
167000     PERFORM UNTIL                                                        
167100      NOT ( SEGMENT-FINNS )                                               
167200       MOVE '003'              TO W-IDPTYP-4316                           
167300       MOVE 4316-IDKOLLI       TO W-IDKOLLI-4316                          
167400       PERFORM IMS-GET-XXDL-4316-L                                        
167500                                                                          
167600       IF SEGMENT-FINNS                                                   
167700         IF 4316-B-MID-RAD (MAX-4316-IND) NOT = ALL '+'                   
167800           MOVE '4393'        TO 4316-IDTRANS                             
167900                                                                          
168000           MOVE +1            TO 4316-IND                                 
168100                                                                          
168200           PERFORM UNTIL                                                  
168300            NOT ( 4316-IND < MAX-4316-IND OR 4316-IND =                   
168400              MAX-4316-IND )                                              
168500             MOVE ALL '+'    TO 4316-B-MID-RAD (4316-IND)                 
168600             ADD +1          TO 4316-IND                                  
168700           END-PERFORM                                                    
168800           PERFORM IMS-ISRT-XXDL-4316-STAT-II                             
168900         END-IF                                                           
169000       ELSE                                                               
169100         IF 4316-A-MID-RAD (MAX-4316-IND) NOT = ALL '+'                   
169200           MOVE '003'         TO 4316-IDPTYP                              
169300           MOVE 'W4T314'      TO 4316-KDTRANS                             
169400           MOVE +273          TO 4316-LL                                  
169500           MOVE '4393'        TO 4316-IDTRANS                             
169600           MOVE '+'           TO 4316-B-MID-FLSISTAK                      
169700           MOVE 'J'           TO 4316-B-MID-FLFORTSK                      
169800           MOVE 0             TO 4316-B-MID-IDRADNR-FOM-S                 
169900           MOVE 0             TO 4316-B-MID-IDRADNR-TOM-S                 
170000           MOVE 0             TO 4316-B-MID-KVLEVART-S                    
170100           MOVE 'UU'          TO 4316-B-MID-KDPRTVAL-FOLJEFL              
170200           MOVE WS-PRTVAL     TO 4316-B-MID-KDPRTVAL-ADRESSFL             
170300                                                                          
170400           MOVE +1        TO 4316-IND                                     
170500                                                                          
170600           PERFORM UNTIL                                                  
170700            NOT ( 4316-IND < MAX-4316-IND OR 4316-IND =                   
170800              MAX-4316-IND )                                              
170900             MOVE ALL '+'    TO 4316-B-MID-RAD (4316-IND)                 
171000             ADD +1          TO 4316-IND                                  
171100           END-PERFORM                                                    
171200           PERFORM IMS-ISRT-XXDL-4316-STAT-II                             
171300         END-IF                                                           
171400       END-IF                                                             
171500       MOVE '002'               TO W-IDPTYP-4316-KOL-MIN                  
171600       MOVE W-IDKOLLI-4316      TO W-IDKOLLI-4316-KOL-MIN                 
171700       MOVE '002'               TO W-IDPTYP-4316-MAX                      
171800       PERFORM IMS-GET-XXDL-4316-INTERV-KOL-F                             
171900     END-PERFORM                                                          
172000     CONTINUE.                                                            
172100     EJECT                                                                
172200 S91-SKAPA-TOM-004 SECTION.                                               
172300                                                                          
172400     MOVE '004'              TO W-IDPTYP-4316                             
172500     MOVE ZERO               TO W-IDKOLLI-4316                            
172600     PERFORM IMS-GET-XXDL-4316-L-BLANK                                    
172700                                                                          
172800     IF 4316-C-MID-RAD (MAX-4316-IND-004) NOT = ALL '+'                   
172900       PERFORM S03-4316-004                                               
173000       PERFORM IMS-ISRT-XXDL-4316-STAT-II                                 
173100     END-IF                                                               
173200     CONTINUE.                                                            
173300     EJECT                                                                
173400 S99-NAESTA-TRANS SECTION.                                                
173500                                                                          
173600     IF  WS-FLKLAR                                                        
173700       PERFORM IMS-GET-XXDK-4312                                          
173800                                                                          
173900**** VID 0-NING AV ALLA RADER HAR INGEN PT=002 SKAPATS                    
174000**** KDBEHAND-KOL SÄTTS DÅ OM FRÅN 1 TILL 0                               
174100       IF  4312-KDBEHAND-KOL = 1                                          
174200       AND 4312-KDBEHAND-DEL = 0                                          
174300         MOVE '002'      TO W-IDPTYP-4316-MIN                             
174400                            W-IDPTYP-4316-MAX                             
174500         PERFORM IMS-GET-XXDL-4316-INTERV-F                               
174600         IF SEGMENT-SAKNAS                                                
174700           MOVE 0        TO 4312-KDBEHAND-KOL                             
174800           PERFORM IMS-REPL-XXDK                                          
174900           PERFORM IMS-GET-XXDK-4312                                      
175000         END-IF                                                           
175100       END-IF                                                             
175200       IF ((4312-KDBEHAND-GRUND = 0 OR 2)                                 
175300       AND (4312-KDBEHAND-AVVIK = 0 OR 2)                                 
175400       AND (4312-KDBEHAND-URS   = 0 OR 2)                                 
175500       AND (4312-KDBEHAND-DEL   = 0 OR 2)                                 
175600       AND (4312-KDBEHAND-KOL   = 0 OR 2))                                
175700         PERFORM S90-SKAPA-TOM-003                                        
175800         PERFORM S91-SKAPA-TOM-004                                        
175900                                                                          
176000         MOVE '002'      TO W-IDPTYP-4316-MIN                             
176100         MOVE '004'      TO W-IDPTYP-4316-MAX                             
176200         PERFORM IMS-GET-XXDL-4316-INTERV-BLANK                           
176300                                                                          
176400         PERFORM UNTIL                                                    
176500          NOT ( SEGMENT-FINNS )                                           
176600           MOVE +1           TO 4316-KDTRSTAT                             
176700           PERFORM IMS-REPL-XXDL                                          
176800           PERFORM IMS-GET-XXDL-4316-INTERV                               
176900         END-PERFORM                                                      
177000         PERFORM IMS-GET-XXDJ-4305                                        
177100         PERFORM IMS-GET-XXDJ-4306                                        
177200         MOVE +3 TO 4306-KDPACLAS                                         
177300         PERFORM IMS-REPL-XXDJ                                            
177400                                                                          
177500         MOVE 4312-IDTRANS  TO WS-IDTRANS-MOD                             
177600         PERFORM IMS-DLET-XXDK                                            
177700                                                                          
177800         MOVE MFS-KDMFSFOR    TO PTOP-KDMFSFOR                            
177900         PERFORM IMS-INSERT-MSG-ALT-PCB                                   
178000*********************************************************                 
178100                                                                          
178200*** FINNS DET FLER ORDER SOM LIGGER PÅ KÖ FÖR BEARBETNING                 
178300*** LÄGGS DEN FÖRSTA ORDERN UT PÅ DEN BILD SOM STÅR                       
178400*** I TUR FÖR BEARBETNING                                                 
178500*** KVAL MED USERID                                                       
178600                                                                          
178700         MOVE MSG-SIGNON-USERID TO W-WDGXKEY-IDUSER-4312                  
178800         PERFORM IMS-GET-XXDK-4312-STAT-GE-F                              
178900                                                                          
179000         PERFORM UNTIL                                                    
179100          NOT ( (((SEGMENT-FINNS) AND (4312-KDBEHAND-AVVIK = +3           
179200           OR                                                             
179300            4312-KDBEHAND-RAD = +3 OR 4312-KDBEHAND-DEL = +3              
179400            OR 4312-KDBEHAND-URS = +3 OR 4312-KDBEHAND-KOL =              
179500            +3)) OR ((SEGMENT-FINNS) AND (4312-IDTRANS =                  
179600            '4301' OR 4312-IDTRANS = '4303' ))) )                         
179700           PERFORM IMS-GET-XXDK-4312-STAT-GE                              
179800         END-PERFORM                                                      
179900         IF SEGMENT-FINNS                                                 
180000           IF 4312-KDBEHAND-AVVIK = 1                                     
180100             MOVE 'W4O39101'         TO MFS-IDMOD                         
180200             MOVE M4391-MOD-LAENGD TO MSG-KVLL                            
180300             MOVE '4391'             TO M4391-MOD-IDTRANS                 
180400             MOVE 4312-IDPRODNR      TO WS-IDPRODNR                       
180500             MOVE WS-IDPRODNR        TO M4391-MOD-IDPRODNR-UT             
180600             MOVE 4312-IDDISTR       TO WS-IDDISTR                        
180700             MOVE WS-IDDISTR         TO M4391-MOD-IDDISTR-UT              
180800             MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                       
180900             MOVE WS-IDKUNDNR        TO M4391-MOD-IDKUNDNR-UT             
181000             MOVE 4312-KDFRAKT       TO WS-KDFRAKT                        
181100             MOVE WS-KDFRAKT         TO M4391-MOD-KDFRAKT-UT              
181200             MOVE 4312-IDKUNDRF      TO M4391-MOD-IDORDNR-UT              
181300             MOVE 4312-KDORDKL       TO WS-KDORDKL                        
181400             MOVE WS-KDORDKL         TO M4391-MOD-KDORDKL-UT              
181410             MOVE WS-IDDC            TO M4391-MOD-IDDC-UT                 
181420             MOVE WS-PRTVAL          TO M4391-MOD-PRTVAL-ADRESSFL         
181500                                                                          
181600             INSPECT M4391-MOD-IDPRODNR-UT REPLACING                      
181700                                     LEADING ZERO BY SPACE                
181800             INSPECT M4391-MOD-IDDISTR-UT REPLACING                       
181900                                     LEADING ZERO BY SPACE                
182000             INSPECT M4391-MOD-IDKUNDNR-UT REPLACING                      
182100                                     LEADING ZERO BY SPACE                
182200             INSPECT M4391-MOD-KDFRAKT-UT REPLACING                       
182300                                     LEADING ZERO BY SPACE                
182400             INSPECT M4391-MOD-IDORDNR-UT REPLACING                       
182500                                     LEADING ZERO BY SPACE                
182600           ELSE                                                           
182700             EVALUATE TRUE                                                
182800             WHEN 4312-KDBEHAND-AVVIK = 4                                 
182900               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
183000               MOVE WS-IDPRODNR        TO PTOP1-IDPRODNR-IN               
183100                                          PTOP1-IDPRODNR-UT               
183200               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
183300               MOVE WS-IDDISTR         TO PTOP1-IDDISTR-UT                
183400               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
183500               MOVE WS-IDKUNDNR        TO PTOP1-IDKUNDNR-UT               
183600               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
183700               MOVE WS-KDFRAKT         TO PTOP1-KDFRAKT-UT                
183800               MOVE 4312-IDKUNDRF      TO PTOP1-IDORDNR-UT                
183900               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
184000               MOVE WS-KDORDKL         TO PTOP1-KDORDKL-UT                
184010               MOVE WS-IDDC            TO PTOP1-IDDC-UT                   
184020               MOVE WS-PRTVAL          TO PTOP1-PRTVAL-ADRESSFL           
184100               MOVE MFS-KDMFSFOR       TO PTOP1-KDMFSFOR                  
184200               MOVE WS-STARTA-4391     TO WS-MSG-CALL                     
184300             WHEN 4312-KDBEHAND-RAD = 1                                   
184400               MOVE 'W4O39301'         TO MFS-IDMOD                       
184500               MOVE MAX-MOD-LAENGD TO MSG-KVLL                            
184600               MOVE '4393'             TO MOD-IDTRANS                     
184700               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
184800               MOVE WS-IDPRODNR        TO MOD-IDPRODNR-UT                 
184900               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
185000               MOVE WS-IDDISTR         TO MOD-IDDISTR-UT                  
185100               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
185200               MOVE WS-IDKUNDNR        TO MOD-IDKUNDNR-UT                 
185300               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
185400               MOVE WS-KDFRAKT         TO MOD-KDFRAKT-UT                  
185500               MOVE 4312-IDKUNDRF      TO MOD-IDORDNR-UT                  
185600               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
185700               MOVE WS-KDORDKL         TO MOD-KDORDKL-UT                  
185710               MOVE WS-IDDC            TO MOD-IDDC-UT                     
185720               MOVE WS-PRTVAL          TO MOD-PRTVAL-ADRESSFL             
185800                                                                          
185900               MOVE MFS-RENSA-FAELT    TO MOD-IDRADNR-SENAST              
186000                                          MOD-FLETTKOLLI                  
186100                                          MOD-KVORDRAD                    
186200                                                                          
186300               INSPECT MOD-IDPRODNR-UT REPLACING                          
186400                                       LEADING ZERO BY SPACE              
186500               INSPECT MOD-IDDISTR-UT REPLACING                           
186600                                       LEADING ZERO BY SPACE              
186700               INSPECT MOD-IDKUNDNR-UT REPLACING                          
186800                                       LEADING ZERO BY SPACE              
186900               INSPECT MOD-KDFRAKT-UT REPLACING                           
187000                                       LEADING ZERO BY SPACE              
187100               INSPECT MOD-IDORDNR-UT REPLACING                           
187200                                       LEADING ZERO BY SPACE              
187300                                                                          
187400               PERFORM S04-FORMATETS-ATTR                                 
187500                                                                          
187600             WHEN 4312-KDBEHAND-URS = 1                                   
187700               MOVE 'W4O39401' TO MFS-IDMOD                               
187800               MOVE M4394-MOD-LAENGD TO MSG-KVLL                          
187900               MOVE '4394'             TO M4394-MOD-IDTRANS               
188000               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
188100               MOVE WS-IDPRODNR        TO M4394-MOD-IDPRODNR-UT           
188200               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
188300               MOVE WS-IDDISTR         TO M4394-MOD-IDDISTR-UT            
188400               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
188500               MOVE WS-IDKUNDNR        TO M4394-MOD-IDKUNDNR-UT           
188600               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
188700               MOVE WS-KDFRAKT         TO M4394-MOD-KDFRAKT-UT            
188800               MOVE 4312-IDKUNDRF      TO M4394-MOD-IDORDNR-UT            
188900               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
189000               MOVE WS-KDORDKL         TO M4394-MOD-KDORDKL-UT            
189010               MOVE WS-IDDC            TO M4394-MOD-IDDC-UT               
189020               MOVE WS-PRTVAL        TO M4394-MOD-PRTVAL-ADRESSFL         
189100                                                                          
189200               INSPECT M4394-MOD-IDPRODNR-UT REPLACING                    
189300                                       LEADING ZERO BY SPACE              
189400               INSPECT M4394-MOD-IDDISTR-UT REPLACING                     
189500                                       LEADING ZERO BY SPACE              
189600               INSPECT M4394-MOD-IDKUNDNR-UT REPLACING                    
189700                                       LEADING ZERO BY SPACE              
189800               INSPECT M4394-MOD-KDFRAKT-UT REPLACING                     
189900                                       LEADING ZERO BY SPACE              
190000               INSPECT M4394-MOD-IDORDNR-UT REPLACING                     
190100                                       LEADING ZERO BY SPACE              
190200             WHEN 4312-KDBEHAND-DEL = 1                                   
190300               MOVE 'W4O39501' TO MFS-IDMOD                               
190400               MOVE M4395-MOD-LAENGD TO MSG-KVLL                          
190500               MOVE '4395'             TO M4395-MOD-IDTRANS               
190600               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
190700               MOVE WS-IDPRODNR        TO M4395-MOD-IDPRODNR-UT           
190800               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
190900               MOVE WS-IDDISTR         TO M4395-MOD-IDDISTR-UT            
191000               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
191100               MOVE WS-IDKUNDNR        TO M4395-MOD-IDKUNDNR-UT           
191200               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
191300               MOVE WS-KDFRAKT         TO M4395-MOD-KDFRAKT-UT            
191400               MOVE 4312-IDKUNDRF      TO M4395-MOD-IDORDNR-UT            
191500               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
191600               MOVE WS-KDORDKL         TO M4395-MOD-KDORDKL-UT            
191610               MOVE WS-IDDC            TO M4395-MOD-IDDC-UT               
191620               MOVE WS-PRTVAL        TO M4395-MOD-PRTVAL-ADRESSFL         
191700                                                                          
191800               INSPECT M4395-MOD-IDPRODNR-UT REPLACING                    
191900                                       LEADING ZERO BY SPACE              
192000               INSPECT M4395-MOD-IDDISTR-UT REPLACING                     
192100                                       LEADING ZERO BY SPACE              
192200               INSPECT M4395-MOD-IDKUNDNR-UT REPLACING                    
192300                                       LEADING ZERO BY SPACE              
192400               INSPECT M4395-MOD-KDFRAKT-UT REPLACING                     
192500                                       LEADING ZERO BY SPACE              
192600               INSPECT M4395-MOD-IDORDNR-UT REPLACING                     
192700                                       LEADING ZERO BY SPACE              
192800              WHEN OTHER                                                  
192900               MOVE 'W4O39601' TO MFS-IDMOD                               
193000               MOVE M4396-MOD-LAENGD TO MSG-KVLL                          
193100               MOVE '4396'             TO M4396-MOD-IDTRANS               
193200               MOVE 4312-IDPRODNR      TO WS-IDPRODNR                     
193300               MOVE WS-IDPRODNR        TO M4396-MOD-IDPRODNR-UT           
193400               MOVE 4312-IDDISTR       TO WS-IDDISTR                      
193500               MOVE WS-IDDISTR         TO M4396-MOD-IDDISTR-UT            
193600               MOVE 4312-IDKUNDNR      TO WS-IDKUNDNR                     
193700               MOVE WS-IDKUNDNR        TO M4396-MOD-IDKUNDNR-UT           
193800               MOVE 4312-KDFRAKT       TO WS-KDFRAKT                      
193900               MOVE WS-KDFRAKT         TO M4396-MOD-KDFRAKT-UT            
194000               MOVE 4312-IDKUNDRF      TO M4396-MOD-IDORDNR-UT            
194100               MOVE 4312-KDORDKL       TO WS-KDORDKL                      
194200               MOVE WS-KDORDKL         TO M4396-MOD-KDORDKL-UT            
194210               MOVE WS-IDDC            TO M4396-MOD-IDDC-UT               
194220               MOVE WS-PRTVAL      TO M4396-MOD-PRTVAL-ADRESSFL           
194300                                                                          
194400               INSPECT M4396-MOD-IDPRODNR-UT REPLACING                    
194500                                       LEADING ZERO BY SPACE              
194600               INSPECT M4396-MOD-IDDISTR-UT REPLACING                     
194700                                       LEADING ZERO BY SPACE              
194800               INSPECT M4396-MOD-IDKUNDNR-UT REPLACING                    
194900                                       LEADING ZERO BY SPACE              
195000               INSPECT M4396-MOD-KDFRAKT-UT REPLACING                     
195100                                       LEADING ZERO BY SPACE              
195200               INSPECT M4396-MOD-IDORDNR-UT REPLACING                     
195300                                       LEADING ZERO BY SPACE              
195400                                                                          
195500             END-EVALUATE                                                 
195600           END-IF                                                         
195700         ELSE                                                             
195800           MOVE 'W4O30202'      TO MFS-IDMOD                              
195900           MOVE M4302-MOD-LAENGD TO MSG-KVLL                              
196000           MOVE '4302'             TO M4302-MOD-IDTRANS                   
196100           MOVE INF-1 (INDX)       TO M4302-MOD-TEMFSINF                  
196200         END-IF                                                           
196300       ELSE                                                               
196400         MOVE +2 TO 4312-KDBEHAND-RAD                                     
196500         PERFORM IMS-REPL-XXDK                                            
196600                                                                          
196700         IF 4312-KDBEHAND-URS = +1                                        
196800           MOVE 'W4O39401' TO MFS-IDMOD                                   
196900           MOVE M4394-MOD-LAENGD TO MSG-KVLL                              
197000           MOVE '4394'             TO M4394-MOD-IDTRANS                   
197100           MOVE MID-IDPRODNR-UT    TO M4394-MOD-IDPRODNR-UT               
197200           MOVE MID-IDDISTR-UT     TO M4394-MOD-IDDISTR-UT                
197300           MOVE MID-IDKUNDNR-UT    TO M4394-MOD-IDKUNDNR-UT               
197400           MOVE MID-KDFRAKT-UT     TO M4394-MOD-KDFRAKT-UT                
197500           MOVE MID-IDORDNR-UT     TO M4394-MOD-IDORDNR-UT                
197600           MOVE MID-KDORDKL-UT     TO M4394-MOD-KDORDKL-UT                
197620           MOVE MID-IDDC-UT        TO M4394-MOD-IDDC-UT                   
197630           MOVE WS-PRTVAL          TO M4394-MOD-PRTVAL-ADRESSFL           
197700                                                                          
197800           INSPECT M4394-MOD-IDPRODNR-UT REPLACING                        
197900                                   LEADING ZERO BY SPACE                  
198000           INSPECT M4394-MOD-IDDISTR-UT REPLACING                         
198100                                   LEADING ZERO BY SPACE                  
198200           INSPECT M4394-MOD-IDKUNDNR-UT REPLACING                        
198300                                   LEADING ZERO BY SPACE                  
198400           INSPECT M4394-MOD-KDFRAKT-UT REPLACING                         
198500                                   LEADING ZERO BY SPACE                  
198600           INSPECT M4394-MOD-IDORDNR-UT REPLACING                         
198700                                   LEADING ZERO BY SPACE                  
198800                                                                          
198900         ELSE                                                             
199000           EVALUATE TRUE                                                  
199100           WHEN 4312-KDBEHAND-DEL = +1                                    
199200             MOVE 'W4O39501' TO MFS-IDMOD                                 
199300             MOVE M4395-MOD-LAENGD TO MSG-KVLL                            
199400             MOVE '4395'             TO M4395-MOD-IDTRANS                 
199500             MOVE MID-IDPRODNR-UT    TO M4395-MOD-IDPRODNR-UT             
199600             MOVE MID-IDDISTR-UT     TO M4395-MOD-IDDISTR-UT              
199700             MOVE MID-IDKUNDNR-UT    TO M4395-MOD-IDKUNDNR-UT             
199800             MOVE MID-KDFRAKT-UT     TO M4395-MOD-KDFRAKT-UT              
199900             MOVE MID-IDORDNR-UT     TO M4395-MOD-IDORDNR-UT              
200000             MOVE MID-KDORDKL-UT     TO M4395-MOD-KDORDKL-UT              
200010             MOVE MID-IDDC-UT        TO M4395-MOD-IDDC-UT                 
200020             MOVE WS-PRTVAL          TO M4395-MOD-PRTVAL-ADRESSFL         
200100                                                                          
200200             INSPECT M4395-MOD-IDPRODNR-UT REPLACING                      
200300                                     LEADING ZERO BY SPACE                
200400             INSPECT M4395-MOD-IDDISTR-UT REPLACING                       
200500                                     LEADING ZERO BY SPACE                
200600             INSPECT M4395-MOD-IDKUNDNR-UT REPLACING                      
200700                                     LEADING ZERO BY SPACE                
200800             INSPECT M4395-MOD-KDFRAKT-UT REPLACING                       
200900                                     LEADING ZERO BY SPACE                
201000             INSPECT M4395-MOD-IDORDNR-UT REPLACING                       
201100                                     LEADING ZERO BY SPACE                
201200                                                                          
201300           WHEN 4312-KDBEHAND-KOL = +1                                    
201400             MOVE MID-IDPRODNR-UT    TO PTOP2-IDPRODNR-IN                 
201500                                        PTOP2-IDPRODNR-UT                 
201600             MOVE MID-IDDISTR-UT     TO PTOP2-IDDISTR-UT                  
201700             MOVE MID-IDKUNDNR-UT    TO PTOP2-IDKUNDNR-UT                 
201800             MOVE MID-KDFRAKT-UT     TO PTOP2-KDFRAKT-UT                  
201900             MOVE MID-IDORDNR-UT     TO PTOP2-IDORDNR-UT                  
202000             MOVE MID-KDORDKL-UT     TO PTOP2-KDORDKL-UT                  
202010             MOVE MID-IDDC-UT        TO PTOP2-IDDC-UT                     
202020             MOVE WS-PRTVAL          TO PTOP2-PRTVAL-ADRESSFL             
202100             MOVE MFS-KDMFSFOR       TO PTOP2-KDMFSFOR                    
202200             MOVE WS-STARTA-4392     TO WS-MSG-CALL                       
202300           END-EVALUATE                                                   
202400         END-IF                                                           
202500       END-IF                                                             
202600     ELSE                                                                 
202700       MOVE MAX-MOD-LAENGD TO MSG-KVLL                                    
202800       PERFORM S04-FORMATETS-ATTR                                         
202900     END-IF                                                               
203000     CONTINUE.                                                            
203100     EJECT                                                                
203200* IMS SEKTIONER                                                           
203300     SKIP3                                                                
203400 IMS-GET-MSG SECTION.                                                     
203500     MOVE '  QC' TO GODK-STATUSKODER                                      
203600     CALL CBLTDLI USING GU MSG-PCB MSG-IO-AREA                            
203700     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
203800     PERFORM IMS-STATUSKONTROLL                                           
203900     CONTINUE.                                                            
204000     SKIP3                                                                
204100 IMS-INSERT-MSG SECTION.                                                  
204200     IF ENGLISH-TEXT                                                      
204300       MOVE NEJ TO MFS-KDHUVOMR                                           
204400     END-IF                                                               
204500     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
204600     MOVE SPACE TO GODK-STATUSKODER                                       
204700     CALL CBLTDLI USING ISRT MSG-PCB MSG-IO-AREA MFS-IDMOD                
204800     MOVE MSG-STATUS-CODE TO STATUS-WS                                    
204900     PERFORM IMS-STATUSKONTROLL                                           
205000     CONTINUE.                                                            
205100     SKIP3                                                                
205200 IMS-INSERT-MSG-ALT-PCB SECTION.                                          
205300     MOVE LOW-VALUE TO MSG-KDZ1 MSG-KDZ2                                  
205400     MOVE SPACE TO GODK-STATUSKODER                                       
205500     CALL CBLTDLI USING ISRT ALT-PCB P-TO-P-SW                            
205600     MOVE ALT-STATUS-CODE TO STATUS-WS                                    
205700     PERFORM IMS-STATUSKONTROLL                                           
205800     CONTINUE.                                                            
205900     SKIP2                                                                
206000 IMS-INSERT-MSG-ALT1-PCB SECTION.                                         
206100     MOVE SPACE TO GODK-STATUSKODER                                       
206200     CALL CBLTDLI USING ISRT ALT1-PCB P-TO-P-SW1                          
206300     MOVE ALT1-STATUS-CODE TO STATUS-WS                                   
206400     PERFORM IMS-STATUSKONTROLL                                           
206500     CONTINUE.                                                            
206600     EJECT                                                                
206700 IMS-INSERT-MSG-ALT2-PCB SECTION.                                         
206800     MOVE SPACE TO GODK-STATUSKODER                                       
206900     CALL CBLTDLI USING ISRT ALT2-PCB P-TO-P-SW2                          
207000     MOVE ALT2-STATUS-CODE TO STATUS-WS                                   
207100     PERFORM IMS-STATUSKONTROLL                                           
207200     CONTINUE.                                                            
207300     SKIP3                                                                
207400 IMS-GET-XXDJ-4305 SECTION.                                               
207500                                                                          
207600     STRING 'WLXXDJ01(WDGXKEY  =' W-WDGXKEY-4305-X ')'                    
207700            DELIMITED BY SIZE INTO SSA1                                   
207800     MOVE '  '   TO GODK-STATUSKODER                                      
207900     CALL CBLTDLI USING GU XXDJ-PCB DLI-IO-AREA-1 SSA1                    
208000     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
208100     PERFORM IMS-STATUSKONTROLL                                           
208200     CONTINUE.                                                            
208300     SKIP3                                                                
208400 IMS-GET-XXDJ-4306 SECTION.                                               
208500                                                                          
208600     STRING 'WLXXDJ11*F(WDGXKEY  =' W-WDGXKEY-4306-X ')'                  
208700            DELIMITED BY SIZE INTO SSA1                                   
208800     MOVE '  '   TO GODK-STATUSKODER                                      
208900     CALL CBLTDLI USING GHNP XXDJ-PCB DLI-IO-AREA-1 SSA1                  
209000     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
209100     PERFORM IMS-STATUSKONTROLL                                           
209200     CONTINUE.                                                            
209300     EJECT                                                                
209400 IMS-GET-XXDJ-4308-F SECTION.                                             
209500                                                                          
209600     STRING 'WLXXDJ11*F(WDGXKEY  =' W-WDGXKEY-4306-X ')'                  
209700            DELIMITED BY SIZE INTO SSA1                                   
209800     MOVE 'WLXXDJ21 '    TO SSA2                                          
209900     MOVE '  ' TO GODK-STATUSKODER                                        
210000     CALL CBLTDLI USING GNP XXDJ-PCB DLI-IO-AREA-1 SSA1 SSA2              
210100     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
210200     PERFORM IMS-STATUSKONTROLL                                           
210300     CONTINUE.                                                            
210400     SKIP3                                                                
210500 IMS-GET-XXDJ-4308 SECTION.                                               
210600                                                                          
210700     STRING 'WLXXDJ11(WDGXKEY  =' W-WDGXKEY-4306-X ')'                    
210800            DELIMITED BY SIZE INTO SSA1                                   
210900     MOVE 'WLXXDJ21 '    TO SSA2                                          
211000     MOVE '  GE' TO GODK-STATUSKODER                                      
211100     CALL CBLTDLI USING GNP XXDJ-PCB DLI-IO-AREA-1 SSA1 SSA2              
211200     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
211300     PERFORM IMS-STATUSKONTROLL                                           
211400     CONTINUE.                                                            
211500     SKIP3                                                                
211600 IMS-GET-XXDJ-4308-KVAL-F SECTION.                                        
211700                                                                          
211800     STRING 'WLXXDJ11*F(WDGXKEY  =' W-WDGXKEY-4306-X ')'                  
211900            DELIMITED BY SIZE INTO SSA1                                   
212000     STRING 'WLXXDJ21(WDGXKEY  >' W-WDGXKEY-4308-X ')'                    
212100            DELIMITED BY SIZE INTO SSA2                                   
212200     MOVE '  GE' TO GODK-STATUSKODER                                      
212300     CALL CBLTDLI USING GNP XXDJ-PCB DLI-IO-AREA-1 SSA1 SSA2              
212400     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
212500     PERFORM IMS-STATUSKONTROLL                                           
212600     CONTINUE.                                                            
212700     EJECT                                                                
212800 IMS-REPL-XXDJ SECTION.                                                   
212900     MOVE '  '   TO GODK-STATUSKODER                                      
213000     CALL CBLTDLI USING REPL XXDJ-PCB DLI-IO-AREA-1                       
213100     MOVE XXDJ-STATUS-CODE TO STATUS-WS                                   
213200     PERFORM IMS-STATUSKONTROLL                                           
213300     CONTINUE.                                                            
213400     SKIP3                                                                
213500 IMS-GET-XXDK-4311 SECTION.                                               
213600                                                                          
213700     STRING 'WLXXDK01(WDGXKEY  =' W-WDGXKEY-4311-X ')'                    
213800            DELIMITED BY SIZE INTO SSA1                                   
213900     MOVE '  '     TO GODK-STATUSKODER                                    
214000     CALL CBLTDLI USING GU XXDK-PCB DLI-IO-AREA-2 SSA1                    
214100     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
214200     PERFORM IMS-STATUSKONTROLL                                           
214300     CONTINUE.                                                            
214400     SKIP3                                                                
214500 IMS-GET-XXDK-4312 SECTION.                                               
214600                                                                          
214700     STRING 'WLXXDK11*F(WDGXKEY  =' W-WDGXKEY-4312-X ')'                  
214800            DELIMITED BY SIZE INTO SSA1                                   
214900     MOVE '  '     TO GODK-STATUSKODER                                    
215000     CALL CBLTDLI USING GHNP XXDK-PCB DLI-IO-AREA-2 SSA1                  
215100     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
215200     PERFORM IMS-STATUSKONTROLL                                           
215300     CONTINUE.                                                            
215400     EJECT                                                                
215500 IMS-GET-XXDK-4312-STAT-GE SECTION.                                       
215600     STRING 'WLXXDK11(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'               
215700            DELIMITED BY SIZE INTO SSA1                                   
215800     MOVE '  GE'   TO GODK-STATUSKODER                                    
215900     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA-2 SSA1                   
216000     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
216100     PERFORM IMS-STATUSKONTROLL                                           
216200     CONTINUE.                                                            
216300     SKIP3                                                                
216400 IMS-GET-XXDK-4312-STAT-GE-F SECTION.                                     
216500     STRING 'WLXXDK11*F(IDUSER   =' W-WDGXKEY-IDUSER-4312 ')'             
216600            DELIMITED BY SIZE INTO SSA1                                   
216700     MOVE '  GE'   TO GODK-STATUSKODER                                    
216800     CALL CBLTDLI USING GNP XXDK-PCB DLI-IO-AREA-2 SSA1                   
216900     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
217000     PERFORM IMS-STATUSKONTROLL                                           
217100     CONTINUE.                                                            
217200     EJECT                                                                
217300 IMS-DLET-XXDK SECTION.                                                   
217400     MOVE '  '   TO GODK-STATUSKODER                                      
217500     CALL CBLTDLI USING DLET XXDK-PCB DLI-IO-AREA-2                       
217600     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
217700     PERFORM IMS-STATUSKONTROLL                                           
217800     CONTINUE.                                                            
217900     SKIP3                                                                
218000 IMS-ISRT-XXDK-4314  SECTION.                                             
218100                                                                          
218200     STRING 'WLXXDK01(WDGXKEY  =' W-WDGXKEY-4311-X ')'                    
218300            DELIMITED BY SIZE INTO SSA1                                   
218400     STRING 'WLXXDK11(WDGXKEY  =' W-WDGXKEY-4312-X ')'                    
218500            DELIMITED BY SIZE INTO SSA2                                   
218600     MOVE 'WLXXDK21 '   TO SSA3                                           
218700     MOVE '  '   TO GODK-STATUSKODER                                      
218800     CALL CBLTDLI USING ISRT XXDK-PCB DLI-IO-AREA-2                       
218900                          SSA1 SSA2 SSA3                                  
219000     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
219100     PERFORM IMS-STATUSKONTROLL                                           
219200     CONTINUE.                                                            
219300     SKIP3                                                                
219400 IMS-REPL-XXDK SECTION.                                                   
219500     MOVE '  '   TO GODK-STATUSKODER                                      
219600     CALL CBLTDLI USING REPL XXDK-PCB DLI-IO-AREA-2                       
219700     MOVE XXDK-STATUS-CODE TO STATUS-WS                                   
219800     PERFORM IMS-STATUSKONTROLL                                           
219900     CONTINUE.                                                            
220000     EJECT                                                                
220100 IMS-GET-XXDL-4315 SECTION.                                               
220200                                                                          
220300     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
220400            DELIMITED BY SIZE INTO SSA1                                   
220500     MOVE '  '     TO GODK-STATUSKODER                                    
220600     CALL CBLTDLI USING GU XXDL-PCB DLI-IO-AREA-1 SSA1                    
220700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
220800     PERFORM IMS-STATUSKONTROLL                                           
220900     CONTINUE.                                                            
221000     SKIP3                                                                
221100 IMS-GET-XXDL-4316-F SECTION.                                             
221200                                                                          
221300     STRING 'WLXXDL11*F(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
221400            DELIMITED BY SIZE INTO SSA1                                   
221500     MOVE '  GE'     TO GODK-STATUSKODER                                  
221600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
221700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
221800     PERFORM IMS-STATUSKONTROLL                                           
221900     CONTINUE.                                                            
222000     SKIP3                                                                
222100 IMS-GET-XXDL-4316-L SECTION.                                             
222200                                                                          
222300     STRING 'WLXXDL11*L(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
222400            DELIMITED BY SIZE INTO SSA1                                   
222500     MOVE '  GE'     TO GODK-STATUSKODER                                  
222600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
222700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
222800     PERFORM IMS-STATUSKONTROLL                                           
222900     CONTINUE.                                                            
223000     EJECT                                                                
223100 IMS-GET-XXDL-4316-L-BLANK SECTION.                                       
223200                                                                          
223300     STRING 'WLXXDL11*L(WDGXKEY  =' W-WDGXKEY-4316-X ')'                  
223400            DELIMITED BY SIZE INTO SSA1                                   
223500     MOVE '  '     TO GODK-STATUSKODER                                    
223600     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
223700     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
223800     PERFORM IMS-STATUSKONTROLL                                           
223900     CONTINUE.                                                            
224000     SKIP3                                                                
224100 IMS-GET-XXDL-4316-INTERV SECTION.                                        
224200                                                                          
224300     STRING 'WLXXDL11(WDGXKEY  >' W-WDGXKEY-4316-X-MIN                    
224400                    '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'                
224500            DELIMITED BY SIZE INTO SSA1                                   
224600     MOVE '  GE'     TO GODK-STATUSKODER                                  
224700     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
224800     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
224900     PERFORM IMS-STATUSKONTROLL                                           
225000     CONTINUE.                                                            
225100     SKIP3                                                                
225200 IMS-GET-XXDL-4316-INTERV-F SECTION.                                      
225300                                                                          
225400     STRING 'WLXXDL11*F(WDGXKEY  >' W-WDGXKEY-4316-X-MIN                  
225500                      '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'              
225600            DELIMITED BY SIZE INTO SSA1                                   
225700     MOVE '  GE'     TO GODK-STATUSKODER                                  
225800     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
225900     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
226000     PERFORM IMS-STATUSKONTROLL                                           
226100     CONTINUE.                                                            
226200     EJECT                                                                
226300 IMS-GET-XXDL-4316-INTERV-KOL-F SECTION.                                  
226400                                                                          
226500     STRING 'WLXXDL11*F(WDGXKEY  >' W-WDGXKEY-4316-X-KOL-MIN              
226600                      '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'              
226700            DELIMITED BY SIZE INTO SSA1                                   
226800     MOVE '  GE'     TO GODK-STATUSKODER                                  
226900     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
227000     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
227100     PERFORM IMS-STATUSKONTROLL                                           
227200     CONTINUE.                                                            
227300     SKIP3                                                                
227400 IMS-GET-XXDL-4316-INTERV-BLANK SECTION.                                  
227500                                                                          
227600     STRING 'WLXXDL11*F(WDGXKEY  >' W-WDGXKEY-4316-X-MIN                  
227700                      '&WDGXKEY  <' W-WDGXKEY-4316-X-MAX ')'              
227800            DELIMITED BY SIZE INTO SSA1                                   
227900     MOVE '  '     TO GODK-STATUSKODER                                    
228000     CALL CBLTDLI USING GHNP XXDL-PCB DLI-IO-AREA-1 SSA1                  
228100     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
228200     PERFORM IMS-STATUSKONTROLL                                           
228300     CONTINUE.                                                            
228400     EJECT                                                                
228500 IMS-ISRT-XXDL-4316-STAT-BLANK  SECTION.                                  
228600                                                                          
228700     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
228800            DELIMITED BY SIZE INTO SSA1                                   
228900     MOVE 'WLXXDL11 '   TO SSA2                                           
229000     MOVE '  '   TO GODK-STATUSKODER                                      
229100     CALL CBLTDLI USING ISRT XXDL-PCB DLI-IO-AREA-1 SSA1 SSA2             
229200     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
229300     PERFORM IMS-STATUSKONTROLL                                           
229400     CONTINUE.                                                            
229500     SKIP3                                                                
229600 IMS-ISRT-XXDL-4316-STAT-II  SECTION.                                     
229700                                                                          
229800     STRING 'WLXXDL01(WDGXKEY  =' W-WDGXKEY-4315-X ')'                    
229900            DELIMITED BY SIZE INTO SSA1                                   
230000     MOVE 'WLXXDL11 '   TO SSA2                                           
230100     MOVE '  II'   TO GODK-STATUSKODER                                    
230200     CALL CBLTDLI USING ISRT XXDL-PCB DLI-IO-AREA-1 SSA1 SSA2             
230300     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
230400     PERFORM IMS-STATUSKONTROLL                                           
230500     CONTINUE.                                                            
230600     SKIP3                                                                
230700 IMS-REPL-XXDL SECTION.                                                   
230800                                                                          
230900     MOVE '  '   TO GODK-STATUSKODER                                      
231000     CALL CBLTDLI USING REPL XXDL-PCB DLI-IO-AREA-1                       
231100     MOVE XXDL-STATUS-CODE TO STATUS-WS                                   
231200     PERFORM IMS-STATUSKONTROLL                                           
231300     CONTINUE.                                                            
231400     EJECT                                                                
231500 IMS-GU-WDE4B SECTION.                                                    
231600                                                                          
231700     STRING 'WDE4B1  (WDE4B1KY =' W-WDE4B1KY-X ')'                        
231800            DELIMITED BY SIZE INTO SSA1                                   
231900     MOVE '  '     TO GODK-STATUSKODER                                    
232000     CALL CBLTDLI USING GU WDE4B-PCB DLI-IO-AREA-3 SSA1                   
232100     MOVE WDE4B-STATUS-CODE TO STATUS-WS                                  
232200     PERFORM IMS-STATUSKONTROLL                                           
232300     CONTINUE.                                                            
232400     SKIP3                                                                
232500 IMS-GN-WDE4B SECTION.                                                    
232600                                                                          
232700     STRING 'WDE4B1  (WDE4B1KY =' W-WDE4B1KY-X ')'                        
232800            DELIMITED BY SIZE INTO SSA1                                   
232900     MOVE '  '     TO GODK-STATUSKODER                                    
233000     CALL CBLTDLI USING GN WDE4B-PCB DLI-IO-AREA-3 SSA1                   
233100     MOVE WDE4B-STATUS-CODE TO STATUS-WS                                  
233200     PERFORM IMS-STATUSKONTROLL                                           
233300     CONTINUE.                                                            
233400     SKIP3                                                                
233500 IMS-GU-WDE4B-STAT-GE SECTION.                                            
233600                                                                          
233700     STRING 'WDE4B1  (WDE4B1KY =' W-WDE4B1KY-X ')'                        
233800            DELIMITED BY SIZE INTO SSA1                                   
233900     MOVE '  GE'     TO GODK-STATUSKODER                                  
234000     CALL CBLTDLI USING GU WDE4B-PCB DLI-IO-AREA-3 SSA1                   
234100     MOVE WDE4B-STATUS-CODE TO STATUS-WS                                  
234200     PERFORM IMS-STATUSKONTROLL                                           
234300     CONTINUE.                                                            
234400     EJECT                                                                
234500 IMS-STATUSKONTROLL SECTION.                                              
234600     SET STATUS-IX TO 1                                                   
234700     SEARCH GODK-STATUS AT END CALL FELLOG                                
234800     WHEN GODK-STATUS (STATUS-IX) = STATUS-WS CONTINUE                    
234900     END-SEARCH                                                           
235000     CONTINUE.                                                            
