000100*COMPOPT PRINTCL=NO                                                       
000400 ID  DIVISION.                                                            
000500     SKIP2                                                                
000600 PROGRAM-ID.    W980WS00.                                                 
001000*AUTHOR.        KJELL                                                     
001100*DATE-WRITTEN.  AUG 1984.                                                 
001200*REMARKS.                                                                 
001300*    TESTDRIVER FÖR W980WSPC                                              
001400     SKIP2                                                                
001500 ENVIRONMENT DIVISION.                                                    
001600 INPUT-OUTPUT SECTION.                                                    
001700 FILE-CONTROL.                                                            
001800     SELECT INFIL                        ASSIGN TO UT-S-SYSIN.            
001900     SKIP2                                                                
002000 DATA DIVISION.                                                           
002100 FILE SECTION.                                                            
002200     SKIP3                                                                
002300 FD  INFIL                                                                
002400     RECORDING      F                                                     
002500     BLOCK CONTAINS 0.                                                    
002600 01  INBUFF         PIC X(80).                                            
002700     EJECT                                                                
002800 WORKING-STORAGE SECTION.                                                 
002810*    -- CHECKED BY WY2000                                                 
002900     SKIP3                                                                
003000 77  INDENT-I PIC X(40) VALUE                                             
003100     'W980WS00 91/05/25 TIME 12.54 VILMAII'.                              
003200***  STATEMENT ABOVE GENERATED BY VILMAII CONVERTER                       
003300*                                                                         
003400*                                                                         
003500 77  PROGRAM-NAMN                REDEFINES INDENT-I                       
003600                                 PIC X(6).                                
003700*                                      GENERERAT PROGRAM-NAMN.            
003800                                                                          
003900 01  GENERELLA-KONSTANTER.                                                
004000     03  JA                      PIC X(1)    VALUE 'J'.                   
004100     03  NEJ                     PIC X(1)    VALUE 'N'.                   
004200                                                                          
004300 01  DYNAMISKA-SUBPROGRAM.                                                
004400     03  W980WSPC                PIC X(8)    VALUE 'W980WSPC'.            
004500                                                                          
004600 01  END-OF-FILE-SWITCHAR.                                                
004700     03  INFIL-EOF              PIC X(1)    VALUE 'N'.                    
004800                                                                          
004900 01  INPOST                     PIC X(80).                                
005000                                                                          
005100 01  WNAMN.                                                               
005200     03  LNAMN                  PIC S9(4) COMP.                           
005300     03  NAMN                   PIC X(25).                                
005400                                                                          
005500 01  WATTR.                                                               
005600     03  LATTR                  PIC S9(4) COMP.                           
005700     03  ATTR                   PIC X(25).                                
005800                                                                          
005900 01  WVARDE.                                                              
006000     03  LVARDE                 PIC S9(4) COMP.                           
006100     03  VARDE                  PIC X(25).                                
006200 01  FILLER                     PIC X(250).                               
006300                                                                          
006400 01  FUNKTIONSKODER.                                                      
006500     03 FUNK                    PIC X(4) VALUE '    '.                    
006600     03 FLOAD                   PIC X(4) VALUE 'LOAD'.                    
006700     03 FSAVE                   PIC X(4) VALUE 'SAVE'.                    
006800                                                                          
006900 01  RKOD                       PIC X.                                    
007000                                                                          
007100     EJECT                                                                
007200 PROCEDURE DIVISION.                                                      
007300                                                                          
007400     OPEN INPUT INFIL                                                     
007500     PERFORM LASIN                                                        
007600     PERFORM UNTIL                                                        
007700      NOT ( INFIL-EOF = NEJ )                                             
007800       MOVE SPACE TO FUNK NAMN ATTR VARDE                                 
007900       UNSTRING INPOST DELIMITED BY ALL SPACE                             
008000       INTO FUNK NAMN ATTR VARDE                                          
008100       MOVE ZERO TO TALLY                                                 
008200       INSPECT NAMN TALLYING TALLY FOR CHARACTERS BEFORE SPACE            
008300       MOVE TALLY TO LNAMN  ADD 2 TO LNAMN                                
008400       MOVE ZERO TO TALLY                                                 
008500       INSPECT ATTR TALLYING TALLY FOR CHARACTERS BEFORE SPACE            
008600       MOVE TALLY TO LATTR  ADD 2 TO LATTR                                
008700       MOVE ZERO TO TALLY                                                 
008800       INSPECT VARDE TALLYING TALLY FOR CHARACTERS BEFORE SPACE           
008900       MOVE TALLY TO LVARDE  ADD 2 TO LVARDE                              
009000       CALL W980WSPC USING FUNK RKOD WNAMN WATTR WVARDE                   
009100       DISPLAY '----------------------'                                   
009200       DISPLAY 'F: ' FUNK                                                 
009300       DISPLAY 'R: ' RKOD                                                 
009400       DISPLAY 'N: ' LNAMN ' ' NAMN                                       
009500       DISPLAY 'A: ' LATTR ' ' ATTR                                       
009600       DISPLAY 'V: ' LVARDE ' ' VARDE                                     
009700       PERFORM LASIN                                                      
009800     END-PERFORM                                                          
009900     GOBACK                                                               
010000     CONTINUE.                                                            
010100     EJECT                                                                
010200 LASIN SECTION.                                                           
010300                                                                          
010400     READ INFIL INTO INPOST                                               
010500     AT END MOVE JA TO INFIL-EOF                                          
010600     END-READ                                                             
010700     CONTINUE.                                                            
