***********************************************************************         
* CREATED BY V028439   ON 01/12/19  AT 16:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CROSSINDEX ONLINE               '                               
W0F107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T107 7',                                           +        
               8='W0T107 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T107U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T107  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0F107   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CROSSINDEX ONLINE',                                    +        
               POS=(1,14),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partid',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Suppl.no',                                             +        
               POS=(4,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDLEVIN  DFLD  POS=(4,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Suppl.ref',                                            +        
               POS=(4,18),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BELEVIN  DFLD  POS=(4,28),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
IDLEVUT  DFLD  POS=(5,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
BELEVUT  DFLD  POS=(5,28),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNRNX  DFLD  POS=(6,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
BELEVNX  DFLD  POS=(6,8),LTH=30,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNX  DFLD  POS=(6,43),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDBENNX  DFLD  POS=(6,71),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDFRAD5  DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TIRAD5   DFLD  POS=(7,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Partid',                                               +        
               POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Plcd Suppl  Sq Suppl.ref',                             +        
               POS=(8,33),LTH=24,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Manuf.c',                                              +        
               POS=(8,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KDFTAG1  DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LEVNR1   DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BENR1    DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
BELEV1   DFLD  POS=(9,48),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLTLVM1  DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR2   DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG2  DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR2   DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENR2    DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV2   DFLD  POS=(10,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM2  DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR3   DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG3  DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR3   DFLD  POS=(11,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENR3    DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV3   DFLD  POS=(11,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM3  DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR4   DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG4  DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR4   DFLD  POS=(12,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENR4    DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV4   DFLD  POS=(12,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM4  DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR5   DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG5  DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR5   DFLD  POS=(13,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENNR5   DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV5   DFLD  POS=(13,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM5  DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR6   DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG6  DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR6   DFLD  POS=(14,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENNR6   DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV6   DFLD  POS=(14,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM6  DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR7   DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG7  DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR7   DFLD  POS=(15,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENNR7   DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV7   DFLD  POS=(15,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM7  DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR8   DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG8  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR8   DFLD  POS=(16,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENNR8   DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV8   DFLD  POS=(16,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM8  DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR9   DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDFTAG9  DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR9   DFLD  POS=(17,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BENNR9   DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BELEV9   DFLD  POS=(17,48),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLTLVM9  DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Update',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Plcd Suppl  Sq Suppl.ref',                             +        
               POS=(18,32),LTH=24,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Manuf.c D',                                            +        
               POS=(18,72),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ARTNRU   DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDFTAGU  DFLD  POS=(19,35),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEVNRU   DFLD  POS=(19,37),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
BENNRU   DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
BELEVU   DFLD  POS=(19,47),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
FLTLVMU  DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
CMDU     DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pf10 WHELP  PF12 Logoff',                              +        
               POS=(21,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM    DFLD  POS=(23,63),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
TID      DFLD  POS=(23,72),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O10701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I10701,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0F107                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTIN,                                                +        
               LTH=9                                                            
         MFLD  IDLEVIN,                                                +        
               LTH=5                                                            
         MFLD  BELEVIN,                                                +        
               LTH=30                                                           
         MFLD  IDARTUT,                                                +        
               LTH=9                                                            
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  BELEVUT,                                                +        
               LTH=30                                                           
         MFLD  LEVNRNX,                                                +        
               LTH=5                                                            
         MFLD  BELEVNX,                                                +        
               LTH=30                                                           
         MFLD  IDARTNX,                                                +        
               LTH=9                                                            
         MFLD  IDBENNX,                                                +        
               LTH=1                                                            
         MFLD  KDFRAD5,                                                +        
               LTH=1                                                            
         MFLD  TIRAD5,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG1,                                                +        
               LTH=1                                                            
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  BENR1,                                                  +        
               LTH=1                                                            
         MFLD  BELEV1,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM1,                                                +        
               LTH=1                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG2,                                                +        
               LTH=1                                                            
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  BENR2,                                                  +        
               LTH=1                                                            
         MFLD  BELEV2,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM2,                                                +        
               LTH=1                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG3,                                                +        
               LTH=1                                                            
         MFLD  LEVNR3,                                                 +        
               LTH=5                                                            
         MFLD  BENR3,                                                  +        
               LTH=1                                                            
         MFLD  BELEV3,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM3,                                                +        
               LTH=1                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG4,                                                +        
               LTH=1                                                            
         MFLD  LEVNR4,                                                 +        
               LTH=5                                                            
         MFLD  BENR4,                                                  +        
               LTH=1                                                            
         MFLD  BELEV4,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM4,                                                +        
               LTH=1                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG5,                                                +        
               LTH=1                                                            
         MFLD  LEVNR5,                                                 +        
               LTH=5                                                            
         MFLD  BENNR5,                                                 +        
               LTH=1                                                            
         MFLD  BELEV5,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM5,                                                +        
               LTH=1                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG6,                                                +        
               LTH=1                                                            
         MFLD  LEVNR6,                                                 +        
               LTH=5                                                            
         MFLD  BENNR6,                                                 +        
               LTH=1                                                            
         MFLD  BELEV6,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM6,                                                +        
               LTH=1                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG7,                                                +        
               LTH=1                                                            
         MFLD  LEVNR7,                                                 +        
               LTH=5                                                            
         MFLD  BENNR7,                                                 +        
               LTH=1                                                            
         MFLD  BELEV7,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM7,                                                +        
               LTH=1                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG8,                                                +        
               LTH=1                                                            
         MFLD  LEVNR8,                                                 +        
               LTH=5                                                            
         MFLD  BENNR8,                                                 +        
               LTH=1                                                            
         MFLD  BELEV8,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM8,                                                +        
               LTH=1                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  KDFTAG9,                                                +        
               LTH=1                                                            
         MFLD  LEVNR9,                                                 +        
               LTH=5                                                            
         MFLD  BENNR9,                                                 +        
               LTH=1                                                            
         MFLD  BELEV9,                                                 +        
               LTH=30                                                           
         MFLD  FLTLVM9,                                                +        
               LTH=1                                                            
         MFLD  ARTNRU,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFTAGU,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRU,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BENNRU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BELEVU,                                                 +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLTLVMU,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDU,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I10701 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F107),                                           +        
               OPT=2,                                                  +        
               NXT=W0O10701                                                     
MID      LPAGE SOR=(W0F107)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '01071',                                                +        
               LTH=5                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEVUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BELEVIN,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BELEVUT,                                               +        
               '                              '),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  LEVNRNX,                                                +        
               LTH=5                                                            
         MFLD  BELEVNX,                                                +        
               LTH=30                                                           
         MFLD  IDARTNX,                                                +        
               LTH=9                                                            
         MFLD  IDBENNX,                                                +        
               LTH=1                                                            
         MFLD  KDFRAD5,                                                +        
               LTH=1                                                            
         MFLD  TIRAD5,                                                 +        
               LTH=5                                                            
         MFLD  (ARTNRU,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFTAGU,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNRU,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BENNRU,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BELEVU,                                                +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLTLVMU,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDU,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
