*        FORMAT FÖR KLOCK-START AV TRANSAR                                      
*                                                                               
         PRINT NOGEN                                                            
W0F507   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','W0T507  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T507 7','W0T507 8','W0T501  ', *        
               'WHELP   ','W0T507  ','/RCL.   ','W0T501  ','W0T502  ', *        
               'W0T503  ','W0T504  ','W0T505  ','W0T506  ','W0T507  ', *        
               'W0T508  ','W0T509  ','WHELP   ','W0T507X ','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         STACK ON                                                               
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,11)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'start av transar  ',                                   *        
               POS=(01,12),LTH=0018,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT)                             
         DFLD  'Trans   ',                                             *        
               POS=(02,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD0211  DFLD  POS=(02,11),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Indata ',                                              *        
               POS=(02,20),LTH=0007,ATTR=(NUM,PROT)                             
FLD0228  DFLD  POS=(02,28),LTH=0050,ATTR=(ALPHA)                                
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         STACK OFF                                                              
         DEV   TYPE=3270-A7,                                           *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','W0T507  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T507 7','W0T507 8','W0T501  ', *        
               'WHELP   ','W0T507  ','/RCL.   ','W0T501  ','W0T502  ', *        
               'W0T503  ','W0T504  ','W0T505  ','W0T506  ','W0T507  ', *        
               'W0T508  ','W0T509  ','WHELP   ','W0T507X ','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         UNSTACK                                                                
         FMTEND                                                                 
         EJECT                                                                  
W0I50701 MSG   TYPE=INPUT,                                             *        
               SOR=W0F507,                                             *        
               OPT=2,                                                  *        
               NXT=W0O50701                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'7'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '05071',LTH=0005                                                 
         MFLD  (FLD0211,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD0228,'++++++++++'),LTH=0050,FILL=C' '                        
         MSGEND                                                                 
         EJECT                                                                  
W0O50701 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F507,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50701,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0211,LTH=0008                                                 
         MFLD  FLD0228,LTH=0050                                                 
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         END                                                                    
