         TITLE 'DOKUMENTBESKRIVNING             '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W0F552   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T552 7',                                           +        
               8='W0T552 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T551  ',                                          +        
               14='W0T552  ',                                          +        
               15='W0T553  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T555  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DOKUMENTBESKRIVNING ',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'TYP ',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0209  DFLD  POS=(2,9),LTH=8,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ID',                                                   +        
               POS=(2,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0223  DFLD  POS=(2,23),LTH=8,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0309  DFLD  POS=(3,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=8,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0411  DFLD  POS=(4,11),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0420  DFLD  POS=(4,20),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0429  DFLD  POS=(4,29),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Typ ',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Id',                                                   +        
               POS=(5,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'User',                                                 +        
               POS=(5,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Datum   Tid     Dokumentbeskrivning ',                 +        
               POS=(5,32),LTH=36,                                      +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
COL1206  DFLD  POS=(6,12),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL2206  DFLD  POS=(6,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3206  DFLD  POS=(6,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4006  DFLD  POS=(6,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4806  DFLD  POS=(6,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
COL1207  DFLD  POS=(7,12),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL2207  DFLD  POS=(7,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3207  DFLD  POS=(7,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4007  DFLD  POS=(7,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4807  DFLD  POS=(7,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
COL1208  DFLD  POS=(8,12),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL2208  DFLD  POS=(8,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3208  DFLD  POS=(8,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4008  DFLD  POS=(8,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4808  DFLD  POS=(8,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
COL1209  DFLD  POS=(9,12),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL2209  DFLD  POS=(9,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3209  DFLD  POS=(9,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4009  DFLD  POS=(9,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4809  DFLD  POS=(9,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1210  DFLD  POS=(10,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2210  DFLD  POS=(10,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3210  DFLD  POS=(10,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4010  DFLD  POS=(10,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4810  DFLD  POS=(10,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1211  DFLD  POS=(11,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2211  DFLD  POS=(11,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3211  DFLD  POS=(11,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4011  DFLD  POS=(11,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4811  DFLD  POS=(11,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1212  DFLD  POS=(12,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2212  DFLD  POS=(12,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3212  DFLD  POS=(12,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4012  DFLD  POS=(12,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4812  DFLD  POS=(12,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1213  DFLD  POS=(13,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2213  DFLD  POS=(13,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3213  DFLD  POS=(13,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4013  DFLD  POS=(13,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4813  DFLD  POS=(13,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1214  DFLD  POS=(14,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2214  DFLD  POS=(14,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3214  DFLD  POS=(14,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4014  DFLD  POS=(14,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4814  DFLD  POS=(14,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1215  DFLD  POS=(15,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2215  DFLD  POS=(15,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3215  DFLD  POS=(15,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4015  DFLD  POS=(15,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4815  DFLD  POS=(15,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1216  DFLD  POS=(16,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2216  DFLD  POS=(16,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3216  DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4016  DFLD  POS=(16,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4816  DFLD  POS=(16,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1217  DFLD  POS=(17,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2217  DFLD  POS=(17,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3217  DFLD  POS=(17,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4017  DFLD  POS=(17,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4817  DFLD  POS=(17,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1218  DFLD  POS=(18,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2218  DFLD  POS=(18,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3218  DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4018  DFLD  POS=(18,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4818  DFLD  POS=(18,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1219  DFLD  POS=(19,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2219  DFLD  POS=(19,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3219  DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4019  DFLD  POS=(19,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4819  DFLD  POS=(19,48),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '                F7=Första sida  F8=Nästa sida   F10=Whe+        
               lp                      ',                              +        
               POS=(21,02),                                            +        
               LTH=0079,                                               +        
               ATTR=(NUM,PROT)                                                  
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O55201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F552,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I55201,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=8                                                            
         MFLD  FLD0309,                                                +        
               LTH=8                                                            
         MFLD  FLD0223,                                                +        
               LTH=8                                                            
         MFLD  FLD0323,                                                +        
               LTH=8                                                            
         MFLD  FLD0402,                                                +        
               LTH=8                                                            
         MFLD  FLD0411,                                                +        
               LTH=8                                                            
         MFLD  FLD0420,                                                +        
               LTH=8                                                            
         MFLD  FLD0429,                                                +        
               LTH=8                                                            
         MFLD  COL0206,                                                +        
               LTH=8                                                            
         MFLD  COL1206,                                                +        
               LTH=8                                                            
         MFLD  COL2206,                                                +        
               LTH=8                                                            
         MFLD  COL3206,                                                +        
               LTH=6                                                            
         MFLD  COL4006,                                                +        
               LTH=6                                                            
         MFLD  COL4806,                                                +        
               LTH=25                                                           
         MFLD  COL0207,                                                +        
               LTH=8                                                            
         MFLD  COL1207,                                                +        
               LTH=8                                                            
         MFLD  COL2207,                                                +        
               LTH=8                                                            
         MFLD  COL3207,                                                +        
               LTH=6                                                            
         MFLD  COL4007,                                                +        
               LTH=6                                                            
         MFLD  COL4807,                                                +        
               LTH=25                                                           
         MFLD  COL0208,                                                +        
               LTH=8                                                            
         MFLD  COL1208,                                                +        
               LTH=8                                                            
         MFLD  COL2208,                                                +        
               LTH=8                                                            
         MFLD  COL3208,                                                +        
               LTH=6                                                            
         MFLD  COL4008,                                                +        
               LTH=6                                                            
         MFLD  COL4808,                                                +        
               LTH=25                                                           
         MFLD  COL0209,                                                +        
               LTH=8                                                            
         MFLD  COL1209,                                                +        
               LTH=8                                                            
         MFLD  COL2209,                                                +        
               LTH=8                                                            
         MFLD  COL3209,                                                +        
               LTH=6                                                            
         MFLD  COL4009,                                                +        
               LTH=6                                                            
         MFLD  COL4809,                                                +        
               LTH=25                                                           
         MFLD  COL0210,                                                +        
               LTH=8                                                            
         MFLD  COL1210,                                                +        
               LTH=8                                                            
         MFLD  COL2210,                                                +        
               LTH=8                                                            
         MFLD  COL3210,                                                +        
               LTH=6                                                            
         MFLD  COL4010,                                                +        
               LTH=6                                                            
         MFLD  COL4810,                                                +        
               LTH=25                                                           
         MFLD  COL0211,                                                +        
               LTH=8                                                            
         MFLD  COL1211,                                                +        
               LTH=8                                                            
         MFLD  COL2211,                                                +        
               LTH=8                                                            
         MFLD  COL3211,                                                +        
               LTH=6                                                            
         MFLD  COL4011,                                                +        
               LTH=6                                                            
         MFLD  COL4811,                                                +        
               LTH=25                                                           
         MFLD  COL0212,                                                +        
               LTH=8                                                            
         MFLD  COL1212,                                                +        
               LTH=8                                                            
         MFLD  COL2212,                                                +        
               LTH=8                                                            
         MFLD  COL3212,                                                +        
               LTH=6                                                            
         MFLD  COL4012,                                                +        
               LTH=6                                                            
         MFLD  COL4812,                                                +        
               LTH=25                                                           
         MFLD  COL0213,                                                +        
               LTH=8                                                            
         MFLD  COL1213,                                                +        
               LTH=8                                                            
         MFLD  COL2213,                                                +        
               LTH=8                                                            
         MFLD  COL3213,                                                +        
               LTH=6                                                            
         MFLD  COL4013,                                                +        
               LTH=6                                                            
         MFLD  COL4813,                                                +        
               LTH=25                                                           
         MFLD  COL0214,                                                +        
               LTH=8                                                            
         MFLD  COL1214,                                                +        
               LTH=8                                                            
         MFLD  COL2214,                                                +        
               LTH=8                                                            
         MFLD  COL3214,                                                +        
               LTH=6                                                            
         MFLD  COL4014,                                                +        
               LTH=6                                                            
         MFLD  COL4814,                                                +        
               LTH=25                                                           
         MFLD  COL0215,                                                +        
               LTH=8                                                            
         MFLD  COL1215,                                                +        
               LTH=8                                                            
         MFLD  COL2215,                                                +        
               LTH=8                                                            
         MFLD  COL3215,                                                +        
               LTH=6                                                            
         MFLD  COL4015,                                                +        
               LTH=6                                                            
         MFLD  COL4815,                                                +        
               LTH=25                                                           
         MFLD  COL0216,                                                +        
               LTH=8                                                            
         MFLD  COL1216,                                                +        
               LTH=8                                                            
         MFLD  COL2216,                                                +        
               LTH=8                                                            
         MFLD  COL3216,                                                +        
               LTH=6                                                            
         MFLD  COL4016,                                                +        
               LTH=6                                                            
         MFLD  COL4816,                                                +        
               LTH=25                                                           
         MFLD  COL0217,                                                +        
               LTH=8                                                            
         MFLD  COL1217,                                                +        
               LTH=8                                                            
         MFLD  COL2217,                                                +        
               LTH=8                                                            
         MFLD  COL3217,                                                +        
               LTH=6                                                            
         MFLD  COL4017,                                                +        
               LTH=6                                                            
         MFLD  COL4817,                                                +        
               LTH=25                                                           
         MFLD  COL0218,                                                +        
               LTH=8                                                            
         MFLD  COL1218,                                                +        
               LTH=8                                                            
         MFLD  COL2218,                                                +        
               LTH=8                                                            
         MFLD  COL3218,                                                +        
               LTH=6                                                            
         MFLD  COL4018,                                                +        
               LTH=6                                                            
         MFLD  COL4818,                                                +        
               LTH=25                                                           
         MFLD  COL0219,                                                +        
               LTH=8                                                            
         MFLD  COL1219,                                                +        
               LTH=8                                                            
         MFLD  COL2219,                                                +        
               LTH=8                                                            
         MFLD  COL3219,                                                +        
               LTH=6                                                            
         MFLD  COL4019,                                                +        
               LTH=6                                                            
         MFLD  COL4819,                                                +        
               LTH=25                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I55201 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F552),                                           +        
               OPT=2,                                                  +        
               NXT=W0O55201                                                     
DGI2     LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '05521',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0309,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0223,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0323,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0411,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0420,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0429,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
