         TITLE 'VCCS MENY FÖR WHELP'                                            
         PRINT NOGEN                                                            
W0F504   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','WHELP2 X','W0T501  ',*        
               'W0T501  ','W0T501  ','WHELP2 7','WHELP2 8','VCMD    ', *        
               'WHELP2 X','WHELP2 X','/RCL.   ','MEMOCIT ','MEMOCAS ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','RHELP   ','WHELP2 X','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         STACK ON,FORM                                                          
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,25)),FILL=NONE                                       
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäöéü'                                
         DFLD  'PULS  WHELP     ',                                     *        
               POS=(01,02)                                                      
FLD0119  DFLD  POS=(01,19),LTH=0040,ATTR=PROT                                   
         DFLD  'VCCS                 ',POS=(01,60)                              
FLD0202  DFLD  POS=(02,02),LTH=0022,ATTR=PROT                                   
IDTRANS  DFLD  POS=(02,25),LTH=0005,ATTR=(ALPHA,MOD)                            
FLD0302  DFLD  POS=(03,02),LTH=0022,ATTR=PROT                                   
FLD0402  DFLD  POS=(04,02),LTH=0079,ATTR=PROT                                   
FLD0502  DFLD  POS=(05,02),LTH=0079,ATTR=PROT                                   
FLD0602  DFLD  POS=(06,02),LTH=0079,ATTR=PROT                                   
FLD0702  DFLD  POS=(07,02),LTH=0079,ATTR=PROT                                   
FLD0802  DFLD  POS=(08,02),LTH=0079,ATTR=PROT                                   
FLD0902  DFLD  POS=(09,02),LTH=0079,ATTR=PROT                                   
FLD1002  DFLD  POS=(10,02),LTH=0079,ATTR=PROT                                   
FLD1102  DFLD  POS=(11,02),LTH=0079,ATTR=PROT                                   
FLD1202  DFLD  POS=(12,02),LTH=0079,ATTR=PROT                                   
FLD1302  DFLD  POS=(13,02),LTH=0079,ATTR=PROT                                   
FLD1402  DFLD  POS=(14,02),LTH=0079,ATTR=PROT                                   
FLD1502  DFLD  POS=(15,02),LTH=0079,ATTR=PROT                                   
FLD1602  DFLD  POS=(16,02),LTH=0079,ATTR=PROT                                   
FLD1702  DFLD  POS=(17,02),LTH=0079,ATTR=PROT                                   
FLD1802  DFLD  POS=(18,02),LTH=0079,ATTR=PROT                                   
FLD1902  DFLD  POS=(19,02),LTH=0079,ATTR=PROT                                   
FLD2002  DFLD  POS=(20,02),LTH=0079,ATTR=PROT                                   
FLD2102  DFLD  POS=(21,02),LTH=0079,ATTR=PROT                                   
FLD2202  DFLD  POS=(22,02),LTH=0079,ATTR=PROT                                   
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  'VCCS ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         STACK OFF                                                              
         DEV   TYPE=3270-A7,                                           *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','WHELP2 X','W0T501  ',*        
               'W0T501  ','W0T501  ','WHELP2 7','WHELP2 8','VCMD    ', *        
               'WHELP2 X','WHELP2 X','/RCL.   ','MEMOCIT ','MEMOCAS ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','WHELP2 X','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         UNSTACK FORM,DELETE                                                    
         FMTEND                                                                 
         EJECT                                                                  
W0I50401 MSG   TYPE=INPUT,                                             *        
               SOR=W0F504,                                             *        
               OPT=2,                                                  *        
               NXT=W0O50401                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'WHELP   ',LTH=008                                               
         MFLD  IDTRANS,LTH=0005,FILL=C'0'                                       
         MSGEND                                                                 
         EJECT                                                                  
W0O50401 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         STACK ON,MENY                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Parts-huvud-meny / Parts-master-menu    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,'      Menyer för                              *        
               Menus for                  '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'00001 Parts gemensamma system           00002 *        
               Parts General Systems'),                                *        
               LTH=0079                                                         
         MFLD  (FLD0702,'10001 Beredning                         10002 *        
               Parts Planning'),                                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'15001 Katalog                           15002 *        
               Catalogue'),                                            *        
               LTH=0079                                                         
         MFLD  (FLD0902,'21001 Anskaffning                       21002 *        
               Procurement'),                                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'30001 Marknadsföring                    30002 *        
               Marketing'),                                            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'40001 Distribution                      40002 *        
               Distribution      '),                                   *        
               LTH=0079                                                         
         MFLD  (FLD1202,'51001 Ekonomiavdelning                  51002 *        
               Accounting department'),                                *        
               LTH=0079                                                         
         MFLD  (FLD1302,'61001 Inleverans                        61002 *        
               Goods Receiving Supply Terminal'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1402,'63001 Inleverans DC                     63002 *        
               Goods Receiving DC  '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'91001 Externa användare                 91002 *        
               External Users'),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'92001 Externa användare distribution    92002 *        
               External Users Distribution'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'93001 Volvo Svenska Bil                 93002 *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'99001 Externa system (ej Parts)         99002 *        
               External Systems (non Parts)'),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,'F1=Hjälp/Help    F2=Info./News    F7=Backward *        
                    F8=Forward       F9=        '),                    *        
               LTH=0079                                                         
         MFLD  (FLD2202,'F10=WHELP        F12=LOGOFF       F13=MEMOVIT *        
                    F14=MEMOVCP      F22=RHELP  '),                    *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         STACK OFF                                                              
         EJECT                                                                  
W0O504N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         UNSTACK MENY,KEEP                                                      
         EJECT                                                                  
WMENY    MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         UNSTACK MENY,KEEP                                                      
         EJECT                                                                  
WMENU    MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         UNSTACK MENY                                                           
         EJECT                                                                  
W0O50400 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för parts gemensamma system        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'01001 Meny för koncern och lager info.'),     *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'05001 Meny för systemutveckling'),            *        
               LTH=0079                                                         
         MFLD  (FLD0902,'06001 Meny för allmänna startbilder'),        *        
               LTH=0079                                                         
         MFLD  (FLD1002,'07001 Meny för styrning och listbeställning'),*        
               LTH=0079                                                         
         MFLD  (FLD1102,'08001 Meny för text-tabeller'),               *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N00 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for parts general info             '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'01002 Menu for company and warehouse info.'), *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'05002 Menu for system development'),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'06002 Menu for general start screens'),       *        
               LTH=0079                                                         
         MFLD  (FLD1002,'07002 Menu for planning and list request'),   *        
               LTH=0079                                                         
         MFLD  (FLD1102,'08002 Menu for text tables'),                 *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5040A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för koncern och lagerinformation   '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,'01071 Crossindex online         '),           *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N0A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for Company and Warehouse infor.   '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,'01072 Crossindex online         '),           *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5040M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för systemutveckling   '),               *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'05011 SIGN ON = Tala om vem man är'),         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'05021 För att byta PASSWORD'),                *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,'05101 Saldoinformation                '),     *        
               LTH=0079                                                         
         MFLD  (FLD0802,'05111 Registrera/visa user-info       '),     *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,'05131 Ändra/visa user                 '),     *        
               LTH=0079                                                         
         MFLD  (FLD1102,'05141 Security update                 '),     *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'                                        05511 *        
               Hjälpinformation för VCCS bilder'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                        05521 *        
               Dokumentbeskrivning   '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        05531 *        
               Uppdatera dokument    '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                        05551 *        
               Kopiera/Ta bort dokument'),                             *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,'                                      '),     *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N0M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for system development '),               *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'05012 SIGN ON to identify yourself'),         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'05022 To change your PASSWORD'),              *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,'05102 Stock balance information        '),    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'05112 Register/show user information   '),    *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,'05132 Change/show user info            '),    *        
               LTH=0079                                                         
         MFLD  (FLD1102,'05142 Security update                 '),     *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'05212 Web response time log             05512 *        
               Help information for VCCS screens '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                        05522 *        
               Document description  '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        05532 *        
               Update document    '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                        05552 *        
               Copy/Delete document'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5040P MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för allmänna startbilder           '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'06011 Återstart av listor'),                  *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'06041 Överföring av delsaldo'),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'06051 Starta packningsrapportering'),         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'06061 SOP aktivering av BMP '),               *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1102,'06081 Starta printer dir. lev. '),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'06211 Dispatcher kontroll och start'),        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'06221 Dispatcher visa transkö      '),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'06231 Dispatcher feltrans  '),                *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N0P MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for general start screens          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'06012 Reprint lists'),                        *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                          '),                 *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD0702,'06042                         '),             *        
               LTH=0079                                                         
         MFLD  (FLD0802,'06052 Start of pack reporting '),             *        
               LTH=0079                                                         
         MFLD  (FLD0902,'06062 SOP activation of BMP   '),             *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD1102,'06082 Start printer supplier  '),             *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'06232 Dispatcher order error'),               *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5040S MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Styrnings- och listbeställningsmeny     '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'07011 Säkerhetskontroll-uppdatering           *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'07021 Lägg upp och ändra rutin                *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'07031 Visa rutiner                            *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'07041 Lägg upp och ändra job                  *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'07051 Lägg upp datakort                       *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD0902,'07061 Tag bort datakort                       *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1002,'07071 Fixprogram för VCCS dataavd.            *        
                                               '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1102,'07081 Lista/starta job                        *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'07091 Starta job                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1402,'                                              *        
                                '),                                    *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                              *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2202,'07911 Baslagerlista                           *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N0S MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Styrnings- och listbeställningsmeny     '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5040V MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Texttabellmeny                          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08011 Personkoder'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'08031 Försäkranstext'),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'08041 Textuppdatering frakt      '),          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'08051 Textuppdatering förrådsdata'),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'08071 Textuppdatering emballage  '),          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'08081 Textuppdatering lastbärare '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'08091 Textuppdatering lev. villkor'),         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'08111 Uppdatering av restorderstyrning'),     *        
               LTH=0079                                                         
         MFLD  (FLD1502,'08121 Fråga på restorderstyrning        08321 *        
               Dataregistrering anskaffning'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1602,'08131 Orderbekräftelsetexter      '),         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'08141 Ransoneringsfaktor          '),         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                '),           *        
               LTH=0079                                                         
         MFLD  (FLD1902,'08161 Bearing information       '),           *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N0V MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'TEXT TABLE MENU                         '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08012 Personal codes'),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'08032 Certifications'),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'08042 Update freight text'),                  *        
               LTH=0079                                                         
         MFLD  (FLD0802,'08052 Packing instructions '),                *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                  '),         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'08072 Update text packing material'),         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'08082 Update text freight carrier'),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'08092 Update text terms of delivery'),        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'08132 Order confirmation description'),       *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,'08152 Steering table for B2C  '),             *        
               LTH=0079                                                         
         MFLD  (FLD1902,'08162 Bearing information     '),             *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50410 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för berednings system              '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'01071 Crossindex online '),                   *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'11001 Meny för beredning'),                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'12001 Meny för strukturer (sats)'),           *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N10 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for parts planning                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'01072 Crossindex online '),                   *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'11002 Menu for parts planning'),              *        
               LTH=0079                                                         
         MFLD  (FLD0702,'12002 Menu for kits             '),           *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5041A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för beredning                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'11011 Beredningsinformation             11211 *        
               Benämningsreg, sökning benämning'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0502,'11021 Ersättningsinfo ersätts av        11221 *        
               Översättning benämning'),                               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'11031 Ersättningsinfo ersätter                *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        11311 *        
               Byte benämningsnummer'),                                *        
               LTH=0079                                                         
         MFLD  (FLD0802,'11051 Crossref, MPNR / VCC-Ford         11321 *        
               Proper shipping name  '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1002,'11071 Främmande beteckningar 1          11421 *        
               Artiklar per projekt/äo'),                              *        
               LTH=0079                                                         
         MFLD  (FLD1102,'11081 Främmande beteckningar 2                *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        11511 *        
               Marknadsstruktur      '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1302,'11111 Uppdatering statnummer                  *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1402,'11121 Byte svensk benämning/homonymkod  11531 *        
               Projekt registrering  '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1502,'11131 Ersättningsregistrering           11541 *        
               Crossref, beredning/funktionsgrupp'),                   *        
               LTH=0079                                                         
         MFLD  (FLD1602,'11141 Artikel till baslagermarknad      11551 *        
               Uppdatera planner id      '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1702,'11151 Artikelinformation nypon          11561 *        
               Ordergenerering       '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,'11171 Ändring artikel                   11611 *        
               Artiklar per ÄO / projekt '),                           *        
               LTH=0079                                                         
         MFLD  (FLD2002,'11181 Artikelinfo. KEMI                       *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N1A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for parts planning                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'11012 Information for parts planning    11212 *        
               Descript. reg, search descript  '),                     *        
               LTH=0079                                                         
         MFLD  (FLD0502,'11022 Supersessions; superseded by      11222 *        
               Translation description'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'11032 Supersessions; supersedes               *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        11312 *        
               Change description number'),                            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'11052 Crossref, MPNR / VCC-Ford         11322 *        
               Proper Shipping Name  '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        11422 *        
               Part number project/DCN'),                              *        
               LTH=0079                                                         
         MFLD  (FLD1002,'11072 Cross index by supplier                 *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1102,'11082 Cross index by Volvo part No.     11512 *        
               Market structure      '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1302,'11112 Update statistical No.            11532 *        
               Project registration  '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1402,'11122 Change Swedish descr./hom. code   11542 *        
               Cross ref planner/Func group'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'11132 Registration of supersessions           *        
                                                 '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1602,'11142 Parts reg basic stock market      11562 *        
               Basic stock order     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1702,'11152 Part information                        *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'11162 Parts Registry                    11612 *        
               Part number DCN/project'),                              *        
               LTH=0079                                                         
         MFLD  (FLD1902,'11172 Change part information                 *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD2002,'11182 Part info. chemistry                    *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5041D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för beredning                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'12011 Listbeställning struktur          12211 *        
               Struktur ingår i'),                                     *        
               LTH=0079                                                         
         MFLD  (FLD0502,'12021 Listbeställning T-SPEC            12221 *        
               Byte i struktur'),                                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'12111 Uppdatera strukturnummer          12311 *        
               Köbild förpackning'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD1502,'12121 Visa/Uppdatera radinformation'),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,'12141 Strukturhistorik'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1802,'12151 Visa/Uppdatera förpackning'),           *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N1D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for parts planning                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        12212 *        
               Part included in structure'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        12222 *        
               Change in structure       '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'12112 Registration structure No.'),           *        
               LTH=0079                                                         
         MFLD  (FLD1502,'12122 Registration structure lines'),         *        
               LTH=0079                                                         
         MFLD  (FLD1602,'12132 Structure lines'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'12142 New and old structure lines'),          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'12152 Registration of Packaging'),            *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5041M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för katalog                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'15011 Rubrik, sökning-sökord                  *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0502,'15021 Rubrik, sökning-grupp             15221 *        
               Lån katalog-grupp               '),                     *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        15231 *        
               Listbeställning, Lexikon        '),                     *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        15241 *        
               Listbeställning, redaktör       '),                     *        
               LTH=0079                                                         
         MFLD  (FLD0802,'15051 Tilläggstext, sökning             15251 *        
               Katalog ombrytning              '),                     *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        15261 *        
               Katalogbenämning översättning   '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        15311 *        
               Katalogidentitet'),                                     *        
               LTH=0079                                                         
         MFLD  (FLD1102,'15081 Fotnot, fråga på text             15321 *        
               Vadis/katalog sökbegrepp'),                             *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        15331 *        
               Genereringstabell för VADIS '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'15111 Katalogavsnitt                    15411 *        
               Artikelfråga i katalog'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1502,'15121 Katalograder, uppdatering         15421 *        
               Artikelfråga master'),                                  *        
               LTH=0079                                                         
         MFLD  (FLD1602,'15131 Radnotering & sidhänvisning       15431 *        
               Model Info Master     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1702,'15141 Avsnittshuvud                           *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD1802,'15151 Vadis/avsn-kolumn sökbegrepp            *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        15511 *        
               Katalogavsnitt, omnumrering    '),                      *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        15521 *        
               Lån avsnitt                    '),                      *        
               LTH=0079                                                         
         MFLD  (FLD2102,'15181 Avsnittsrubriker, utskrift              *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD2202,'15191 Katalogavsnitt, utskrift          15611 *        
               Illustrationsregister          '),                      *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N1M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for catalogue                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'15012 Heading, search by word                 *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0502,'15022 Heading, search by number'),            *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        15232 *        
               Order check list, lexicon  '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        15242 *        
               Order check list, editor'),                             *        
               LTH=0079                                                         
         MFLD  (FLD0802,'15052 Additional text, search by word         *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        15262 *        
               Catalogue descr. translation'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        15312 *        
               Catalogue identity'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD1102,'15082 Footnote, text search'),                *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'15112 Catalogue text block              15412 *        
               Part information, catalogue'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'15122 Catalogue lines, updating         15422 *        
               Part information, master'),                             *        
               LTH=0079                                                         
         MFLD  (FLD1602,'15132 Line notes & Page reference       15432 *        
               Model Info Master          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'15142 Text-block heading area                 *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        15512 *        
               Catalogue text-block renumber'),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        15522 *        
               Copy text-block (loan)'),                               *        
               LTH=0079                                                         
         MFLD  (FLD2102,'15182 Text-block headings, print              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'15192 Text-block hardcopy print         15612 *        
               Illustration register'),                                *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'21011 Anskaffning artikelinformation    21211 *        
               Beställningsinformation'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0502,'21021 Anskaffning lager information     21221 *        
               Grafisk orderingång'),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'21031 Leveransplan                      21231 *        
               Prognosinformation'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'21041 Orderingång                       21241 *        
               Excl AK on replacement'),                               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'21051 Säsongssimulering                 21251 *        
               Restorder/tpo               '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'21061 Leveransbesked                    21261 *        
               Obekräftad TPO              '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'21071 Orderingång                       21271 *        
               Obekräftad proforma         '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'21081 Inleverans historik               21281 *        
               Totalbehov per artikel        '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'21091 Orderingång uppdatering           21291 *        
               Skrot-beordr                     '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1302,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'21111 Leverantörsinformation                  *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'21121 Prisinformation per leverantör          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'21131 Delivery plan transmissions       21331 *        
               Anskaffning/Inköp            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1702,'21141 Delete/create supplier            21341 *        
               Uppdatering anskaffningsdata-3'),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'21151 Uppdatering leverantörsdata       21361 *        
               Pb-plan                      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        21371 *        
               Säsongsanalys Pb-plan        '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        21381 *        
               Uppdatering anskaffningsdata DC'),                      *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        21391 *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'21012 Procurement parts information     21212 *        
               Info. about orders to suppliers'),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'21022 Procurement stock information     21222 *        
               Graphical order statistics'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'21032 Delivery schedule                 21232 *        
               Forecast information'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0702,'21042 Incoming order statistics         21242 *        
               Excl AK on replacement'),                               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'21052 Simulation of season variations   21252 *        
               Backorder/TPO               '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'21062 Delivery promises                 21262 *        
               Unconfirmed TPO:s           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'21072 Incoming order statistics         21272 *        
               Unconfirmed offers          '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'21082 Historical info about deliveries  21282 *        
               Total demand per part         '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'21092 Update incoming order             21292 *        
               Scrap order                      '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1302,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'21112 Information about suppliers       21312 *        
               Update procurement data-1    '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'21122 Price info per suppliers          21322 *        
               Update procurement data-2    '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'21132 Delivery plan transmissions             *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1702,'21142 Delete/create supplier            21342 *        
               Update procurement data      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'21152 Update supplier information             *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'21162 Supplier terms                    21362 *        
               Pb-plan                      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'21172 Delivery plan transmission CN     21372 *        
               Season analysis Pb-plan      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'21182 Delete/create supplier CN         21382 *        
               Update procurer information DC'),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'21192 Steering of mail messages         21392 *        
               Deliv. sched.                '),                        *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'21411 Nya artiklar                            *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0502,'21421 Artiklar hos inköp                      *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'21431 Parametrar för säkerhetslager           *        
                                 '),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'21441 Säkerhetslagerberäkning Div             *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'21461 Artiklar saknar FP-instruktion          *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'21471                                         *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'21481 Parametrar för automatskrot             *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                              *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1302,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'21511 Uppdatering konto/säk.fakt        21711 *        
               Larm                         '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'21521 Crossref. ansk/funktionsgrupp     21721 *        
               Larm leveransprecision       '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'21412 New parts (per procurer)                *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0502,'21422 Parts in purchase department            *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'21432 Safety Stock Parameters                 *        
                                 '),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                              *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0802,'21452 Holidays per country                    *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                              *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'21472 Delivery schedule proposals             *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'21492 Blocked del. periods per supp           *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1302,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'                                        21712 *        
               Alarms                       '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'21522 Cross ref. proc/function group          *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'21532 Stocking policy                         *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,'21582 Demand per week and DC                  *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'23011 Satser i orderkö                  23211 *        
               Urval TPO-info          '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23021 Satsorder - åtgärd                23221 *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0602,'23031 Satsorderrader - åtgärd           23231 *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        23241 *        
               Urval sortimentanalys     '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,'23111 Campaign                                *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'23121 Campaign - market                 23321 *        
               Supplier groups              '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23131 Campaign Info - Overview          23331 *        
               Parts in supplier group      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23141 Campaign Info - Detail            23341 *        
               Part included in supplier group'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'23151 Campaign Information - Part       23351 *        
               Direct delivery control      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'23161 Create Campaign Group             23361 *        
               Parts groups for del block   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'23171 Campaign information part         23371 *        
               Parts with delivery block    '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        23381 *        
               Part included in del block grp'),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        23391 *        
               Delivery block control        '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'23012 Kits in order queue               23212 *        
               Select TPO information  '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23022 Kit order change                  23222 *        
               Part info dep. on choice'),                             *        
               LTH=0079                                                         
         MFLD  (FLD0602,'23032 Kit order lines change            23232 *        
               Selection supplier info   '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        23252 *        
               SPFU Manual Update        '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,'23112 Campaign                                *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1402,'23122 Campaign - market                 23322 *        
               Supplier groups              '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23132 Campaign Info - Overview          23332 *        
               Parts in supplier group      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23142 Campaign Info - Detail            23342 *        
               Part included in supplier group'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'23152 Campaign Information - Part       23352 *        
               Direct delivery control      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'23162 Create Campaign Group             23362 *        
               Parts groups for del block   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'23172 Campaign information part         23372 *        
               Parts with delivery block    '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        23382 *        
               Part included in del block grp'),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        23392 *        
               Delivery block control        '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        23611 *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23421 Efterfrågan/Prognos DC'),               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'23441 Cross Docking         '),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        23651 *        
               DC Group                  '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0902,'23461 Refillpunkter DC                  23661 *        
               Destocking steering       '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'23471 Refillkvanter DC                  23671 *        
               Stocking steering       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1102,'23481 Select Part Information DC        23681 *        
               DC Table Steering       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1202,'23491 Transfer Steering         '),           *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'23511                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23521                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23531                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1702,'23541                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1802,'23551                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1902,'23561                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2002,'23571                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2102,'23581                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2202,'23591                   '),                   *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'23412 Part information DC               23612 *        
               Total stock balance info NDC'),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23422 Demand/forecast DC                23622 *        
               By pass refill orders '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'23432 Release Refillorder               23632 *        
               Refill information NDC NA'),                            *        
               LTH=0079                                                         
         MFLD  (FLD0702,'23442 Cross Docking                     23642 *        
               Refill information       '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        23652 *        
               DC Group              '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'23462 Refill point DC                   23662 *        
               Destocking steering       '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'23472 Refill quantity DC                23672 *        
               Stocking steering       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1102,'23482 Select Part Information DC        23682 *        
               DC Table Steering       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1202,'23492 Transfer Steering          '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'23512 Purchase proposal menu NA         23712 *        
               Purchase proposal menu'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23522 Purchase NDC                      23722 *        
               Purchase NDC/SDC'),                                     *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23532 On order NDC                      23732 *        
               Purchase list DC'),                                     *        
               LTH=0079                                                         
         MFLD  (FLD1702,'23542 Refill eta inquiry NDC'),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'23552 Season analyse NDC    '),               *        
               LTH=0079                                                         
         MFLD  (FLD1902,'23562 Incoming order statistics '),           *        
               LTH=0079                                                         
         MFLD  (FLD2002,'23572 Parts planning NDC                23772 *        
               Parts planning per DC'),                                *        
               LTH=0079                                                         
         MFLD  (FLD2102,'23582 On order from local vendors NDC'),      *        
               LTH=0079                                                         
         MFLD  (FLD2202,'23592 Refill transfers NDC      '),           *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042I MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'23811 Purchase proposal menu DC Group         *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23821 Purchase DC Group     '),               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                '),           *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                '),           *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'23911 Purchase proposal menu CDC              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23921 Purchase CDC          '),               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23931 Refill info CDC   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                        '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                        '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                        '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                        '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                        '),                   *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                        '),                   *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2I MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'23812 Purchase proposal Menu DC Group         *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'23822 Purchase DC Group                       *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                              *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                              *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                               '),            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                               '),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'23912 Purchase proposal menu CDC              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1502,'23922 Purchase CDC          '),               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'23932 Refill info CDC     '),                 *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                     '),      *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                '),           *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042J MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning Kina               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'Endast engelska bilder finns'),               *        
               LTH=0022                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2J MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'24012 Parts Information                 24212 *        
               Agreements                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'24022 Procurement Stock Information     24222 *        
               Parts information depending on choice'),                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'24032 Delivery schedule                 24232 *        
               Selection supplier info        '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'24042 Incoming Order Statistics               *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'24052 Season analysis DC                24252 *        
               Backorder Information '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'24062 Delivery Promises        '),            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'24072 Incoming order statistics'),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        24282 *        
               Demand per part       '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'                                        24312 *        
               Updating of Procurement Data '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                        24322 *        
               Trend and Pb adjustments '),                            *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        24332 *        
               Updating of procurement data '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                        24392 *        
               Delivery schedule         '),                           *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5042K MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för anskaffning Kina               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'Endast engelska bilder finns'),               *        
               LTH=0022                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N2K MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for procurement                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'24412 New parts                               *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'24422 Parts at the purchasing dept            *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                              *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                              *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0902,'24462 Parts that miss prepacking info         *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1002,'24472 Delivery schedule proposals '),         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'                                        24712 *        
               Alerts                '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1502,'24522 Assignment of procurer ID         24722 *        
               Alerts delivery deviation '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                          '),                 *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'24552 DC Segment Table Steering '),           *        
               LTH=0079                                                         
         MFLD  (FLD1902,'24562 Safety stock DC       '),               *        
               LTH=0079                                                         
         MFLD  (FLD2002,'24572 Refill quantity DC                      *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                     '),      *        
               LTH=0079                                                         
         MFLD  (FLD2202,'24592 Scrap order              '),            *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50430 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för marknadsföring      '),              *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'31001 Meny för marknadsföring'),              *        
               LTH=0079                                                         
         MFLD  (FLD0702,'32001 Meny för artikelstatistik'),            *        
               LTH=0079                                                         
         MFLD  (FLD0802,'33001 Meny för AMC prissättning'),            *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N30 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for marketing                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'31002 Menu for marketing'),                   *        
               LTH=0079                                                         
         MFLD  (FLD0502,'32002                   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD0602,'33002 Menu for AMC pricing     '),            *        
               LTH=0079                                                         
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5043A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för marknadsföring                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'31011 Prisfråga för marknadsföring      31211 *        
               Exchange Customer accounts  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0602,'31031 Artikelinformation från Dealers   31231 *        
               Exchange Point adjustment   '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        31241 *        
               Exchange Extended lead-time'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        31251 *        
               Exchange Receiving codes    '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        31261 *        
               Exchange Point parameters'),                            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        31271 *        
               Exchange Pending Inv/Cre      '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'31111 Radiokoder                              *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'31121 Radiotyper                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                             '),              *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                             '),              *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                               '),            *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N3A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for marketing                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'31012 Price query marketing             31212 *        
               Exchange Customer accounts  ').                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                              *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'31032 Parts info at Dealers             31232 *        
               Exchange Point adjustment   '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        31242 *        
               Exchange Extended lead-time'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        31252 *        
               Exchange Receiving codes    '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        31262 *        
               Exchange Point parameters'),                            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        31272 *        
               Exchange Pending Inv/Cre      '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'31112 Radio codes                             *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD1502,'31122 Radio types                             *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                              *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5043B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för marknadsföring                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        31711 *        
               Bytes Status gods           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'31521 Ingående bytesart. per prodnr     31721 *        
               Bytes Godkännande            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0702,'31541 Exchange Leakage/Surplus                *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        31761 *        
               Bytes Reg. av objektreturer'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        31771 *        
               Exchange History              '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'31611 Främmande beteckning bytes              *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'31621 Listning främmande bet. bytes     31821 *        
               Bytes Clearing'),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        31831 *        
               Bytes proforma'),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'31641 Exchange Oversea Transits         31841 *        
               Exchange received invoice'),                            *        
               LTH=0079                                                         
         MFLD  (FLD1802,'31651 Exchange Total Core Balance 1     31851 *        
               List Exchange Clearing'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1902,'31661 Exchange Total Core Balance 2           *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'31671 Exchange Scrapping Info                 *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'31681 Exchange Investment Info                *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'31691 Exchange Point Evolution Info           *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N3B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for marketing                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'31512 Update Identification             31712 *        
               Return Status        '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0502,'31522 Exchange parts / prodnr           31722 *        
               Return Approval      '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'31532 Update identification             31732 *        
               Exchange Identification'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0702,'31542 Exchange Leakage/Surplus                *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        31762 *        
               Exchange Reg. of core return  '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        31772 *        
               Exchange History              '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'31612 Foreign Designation Exchange            *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'31622 List Foreign Designation XCH      31822 *        
               Exchange Clearing             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        31832 *        
               Exchange proforma             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'31642 Exchange Oversea Transits         31842 *        
               Exchange received invoice     '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'31652 Exchange Total Core Balance 1     31852 *        
               List exchange clearing        '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'31662 Exchange Total Core Balance 2           *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'31672 Exchange Scrapping Info                 *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'31682 Investment Info                         *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'31692 Exchange Point Evolution Info           *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5043D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för artikelstatistik'),                  *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'32011 Art.Stat. Katalog över urval'),         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'32021 Art.Stat. Urval Funktionsgrp'),         *        
               LTH=0079                                                         
         MFLD  (FLD0602,'32031 Art.Stat. Urval Artikel     '),         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'32041 Art.Stat. Urval Storsäljare '),         *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'32111 Art.Stat. Justering         '),         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'32121 Art.Stat. Delbudget         '),         *        
               LTH=0079                                                         
         MFLD  (FLD1602,'32131 Art.Stat. Säsong            '),         *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N3D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for marketing                      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'32012 Part stat. Selection table        32212 *        
               Part stat. Sales follow up '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'32022 Part stat. Funktion group'),            *        
               LTH=0079                                                         
         MFLD  (FLD0602,'32032 Part stat. Select part'),               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'32042 Part atat. Select bestseller'),         *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'32112 Part stat. Adjustment'),                *        
               LTH=0079                                                         
         MFLD  (FLD1502,'32122 Part stat. Partbalance'),               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'32132 Part stat. Season '),                   *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5043G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för AMC prissättning               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,'                                        33221 *        
               Prisbok       '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,'33041 Art. Stat. Artikel/Prisomr'),           *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'33111 Betalarregister '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1502,'33121 Prisområde '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'33131 Pris artikelnummer'),                   *        
               LTH=0079                                                         
         MFLD  (FLD1702,'33141 Artikel transfer rabatt'),              *        
               LTH=0079                                                         
         MFLD  (FLD1802,'33151 Normal rabatt prisområde'),             *        
               LTH=0079                                                         
         MFLD  (FLD1902,'33161 Transfer rabatt     '),                 *        
               LTH=0079                                                         
         MFLD  (FLD2002,'33171 Artikelrabatt       '),                 *        
               LTH=0079                                                         
         MFLD  (FLD2102,'33181 SJK- STD-pris procentpålägg'),          *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N3G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for pricing                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                              *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        33222 *        
               Pricebook       '),                                     *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,'33042 Part. Stat. Partno/Pricearea'),         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'33052 Dealer net price            '),         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'33062 Update dealer net           '),         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'33072 Non priced parts            '),         *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'33112 Payer register                    33312 *        
               Art. Stat price area '),                                *        
               LTH=0079                                                         
         MFLD  (FLD1502,'33122 Price area    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'33132 Price part number'),                    *        
               LTH=0079                                                         
         MFLD  (FLD1702,'33142 Part transfer discount '),              *        
               LTH=0079                                                         
         MFLD  (FLD1802,'33152 Normal discount price area'),           *        
               LTH=0079                                                         
         MFLD  (FLD1902,'33162 Transfer condition'),                   *        
               LTH=0079                                                         
         MFLD  (FLD2002,'33172 Part discount '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'33182 SJK/STD Price percentincrease'),        *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50440 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för distributionssystem '),              *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'41001 Meny för distribution artikel'),        *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42001 Meny för order   '),                    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43001 Meny för packning'),                    *        
               LTH=0079                                                         
         MFLD  (FLD0902,'44001 Meny för kundinformation'),             *        
               LTH=0079                                                         
         MFLD  (FLD1002,'45001 Meny för orderbehandling'),             *        
               LTH=0079                                                         
         MFLD  (FLD1102,'46001 Meny för utleverans lagret'),           *        
               LTH=0079                                                         
         MFLD  (FLD1202,'47001 Meny för leveransanmärkningar'),        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N40 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for distribution system'),               *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'41002 Menu for distribution parts'),          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42002 Menu for orders  '),                    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43002 Menu for packing '),                    *        
               LTH=0079                                                         
         MFLD  (FLD0902,'44002 Menu for customer information'),        *        
               LTH=0079                                                         
         MFLD  (FLD1002,'45002 Menu for order processing'),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'46002 Menu for goods delivery warehouse'),    *        
               LTH=0079                                                         
         MFLD  (FLD1202,'47002 Menu for discrepancy reports'),         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för distribution artikel           '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'41011 Lagerinformation                  41211 *        
               Kvalitet Lagerindelning  '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'41021 Förpackningsinformation           41221 *        
               Kvalitet Lagerkontroll   '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0602,'41031 Saldoinfo för distribution        41231 *        
               Kvalitet Felaktiga artiklar'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'41041 Artikelinf för distribution'),          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'41052 SDC information                  '),    *        
               LTH=0079                                                         
         MFLD  (FLD0902,'41062 SDC information                  '),    *        
               LTH=0079                                                         
         MFLD  (FLD1002,'41072 SDC information                  '),    *        
               LTH=0079                                                         
         MFLD  (FLD1102,'41081 Buffertinformation               '),    *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'41111 Kollikod fråga/uppdatering        41311 *        
               Artikelfråga VOR           '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1802,'41151 Kvalitet Felkod Lager            '),    *        
               LTH=0079                                                         
         MFLD  (FLD1902,'41161 Felkod Kontrollrapport           '),    *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for distribution parts             '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'41012 Information for warehouse         41212 *        
               Quality warehouse zones  '),                            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'41022 Information for packing group     41222 *        
               Quality warehouse control   '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0602,'41032 Balance data for distribution     41232 *        
               Quality incorrect parts     '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'41042 Item information for distribution'),    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'41052 Warehouse SDC                    '),    *        
               LTH=0079                                                         
         MFLD  (FLD0902,'41062 Balance information              '),    *        
               LTH=0079                                                         
         MFLD  (FLD1002,'41072 Treatment information            '),    *        
               LTH=0079                                                         
         MFLD  (FLD1102,'41082 Buffer information               '),    *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'41112 Case codes; info and updating     41312 *        
               Part query VOR              '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                  '),         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD1802,'41152 Quality error codes warehouse     41412 *        
               Parts not sent to MIC       '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'41162 Error code inspection report     '),    *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderläggning                  '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42011 Ändring orderhuvud                42211 *        
               Orderhuvud VOR/förbiorder      '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'42021 Tillägg orderrader                      *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42031 Svarsbild tillägg orderrader      42231 *        
               Svarsbild VOR/förbiorder       '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42041 Annullation/ändring order         42241 *        
               Avvikelse VOR                  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42051 Tidssättning order                42251 *        
               VOR Deviation Internal         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        42261 *        
               VOR Deviation SC               '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        42271 *        
               VOR Deviation Purchase Planning'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        42281 *        
               VOR Deviation Question         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'42111 Orderhuvud 1                      42311 *        
               Orderhuvud special             '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'42131 Svarsbild                         42331 *        
               Svarsbild specialorder         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'42141 Orderhuvud 2                            *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order entry                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42012 Order head amendment              42212 *        
               Order head bypass/VOR          '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'42022 Order lines addition                    *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42032 Answer order entry                42232 *        
               Answer order entry             '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42042 Order line cancel/amendment       42242 *        
               VOR deviation                  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42052 Set time on order                 42252 *        
               VOR Deviation Internal         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        42262 *        
               VOR Deviation SC               '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        42272 *        
               VOR Deviation Purchase Planning'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        42282 *        
               VOR Deviation Question         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'42112 Order head 1                      42312 *        
               Special order head             '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'42132 Answer order entry                42332 *        
               Answer special order entry     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'42142 Order head 2                            *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044E MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderläggning                  '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42411 Orderhuvud extern                 42611 *        
               Proformahuvud registrering     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        42621 *        
               Proformarad registrering       '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42431 Svarsbild externorder                   *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42441 Tillägg orderrader extern         42641 *        
               Proformahuvud ändring/borttag  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42451 Annullation orderrader extern     42651 *        
               Proformarad ändring/borttag    '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0902,'42461 Svarsbild tillägg externorder     42661 *        
               Proformahuvud komplettering 1  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        42671 *        
               Proformahuvud komplettering 2  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        42681 *        
               Proformahuvud komplettering 3  '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,'                                        42711 *        
               VOR Role Definition            '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4E MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order entry                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42412 Order head external               42612 *        
               Proforma head registration     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        42622 *        
               Proforma line registration     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42432 Answer order entry                      *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42442 Order line addition external      42642 *        
               Proforma head amendment/cancel '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42452 Order line cancellation           42652 *        
               Proforma line amendment/cancel '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0902,'42462 Answer order line addition        42662 *        
               Proforma head completion 1     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        42672 *        
               Proforma head completion 2     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        42682 *        
               Proforma head completion 3     '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,'                                        42712 *        
               VOR Role Definition            '),                      *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044F MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderläggning                  '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42811 Obekr/distr. utskr/fråga                *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'42821 Fråga orderbekräftelse/order            *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42831 Fråga orderbekräftelse/art.             *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42841 Fråga orderbekr. på fiche               *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4F MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order entry                    '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'42812 Order conf/distr. print                 *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'42822 Order confirmation/order                *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42832 Order confirmation/part No.             *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'42842 Order confirmation/fiche                *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för packningsrapportering          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'43011 Packrapp. ordervis Sve. grund     43211 *        
               Ej rapporterade rader per order'),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43021 Packrapp. ordervis exp. grund     43221 *        
               Packunderlag huvud'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43031 P-rapp. div. order udda grund     43231 *        
               Packunderlag rader'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'43041 P-rapp. sats-order, brist         43241 *        
               Påbörjade ej avslutade order'),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43051 Börja om                          43251 *        
               Bekräfta nollor'),                                      *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        43261 *        
               Delivery note steering table'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'43111 Dela order                        43311 *        
               Kollirapportering bandstation'),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'43121 Dela order fråga/ändring          43321 *        
               Rätta rapporterade kolli'),                             *        
               LTH=0079                                                         
         MFLD  (FLD1602,'43131 Pack-rapportering av orderdelar   43331 *        
               Listning kolliflagga'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1702,'43141 Kollirapportering 1               43341 *        
               Flytta kolli i färdiglagret'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'43151 Kollirapportering 2                     *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1902,'43161 Kollirättning                     43361 *        
               Rätta rapp. flerkolliuppg.'),                           *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'43181 Kontroll ej rapporterat           43381 *        
               Kollirapp. bandstation Sverige'),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for packing                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        43212 *        
               Non reported lines/order     '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43022 Packing reporting per order       43222 *        
               Packing report head       '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43032 Packing reporting various         43232 *        
               Packing report lines'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        43242 *        
               Started not finished orders  '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43052 Re-start packing reporting        43252 *        
               Confirm zeroes'),                                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                        43262 *        
               Delivery note steering table'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'43112 Split of order                    43312 *        
               Case reporting strapping     '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'43122 Split of order; quest & update    43322 *        
               Correct reported cases'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'43132 Pack reporting of order parts     43332 *        
               Info printout case labels'),                            *        
               LTH=0079                                                         
         MFLD  (FLD1702,'43142 Case reporting 1                        *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'43152 Case reporting 2                        *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD1902,'43162 Case corrrection                  43362 *        
               Correct coll. case strapp.'),                           *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,'43182 Control not reported                    *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för packning                       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'43411 Skapa följesedel                  43611 *        
               Produktionsklasstabell         '),                      *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43421 Skapa packad orderlista           43621 *        
               Definiera huvudlagerområde'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43431 Flytta rader i kolli              43631 *        
               Definition av produktionstid'),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'43441 Visa samkollin                    43641 *        
               Regler för PRC              '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43451 Visa kollin i samlingskolli       43651 *        
               Printer per PRC        '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0902,'43461 Case label No. registration       43661 *        
               Produktionskanalsstyrtabell'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'43471 Change of transport id            43671 *        
               Wops uppgifter/kundinformation'),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,'43481 Printning bar code                43681 *        
               Fråga/uppdatera arbetstid     '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        43691 *        
               Ändra dagliga arbetstider'),                            *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'43511 Utskrift av plocksats       '),         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'43521 Orderkö i produktionskanal '),          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'43531 Manuellt uttag av plocksats '),         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'43541 Satsorderkö i produktionskanal'),       *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,'43561 Rader specialemballage'),               *        
               LTH=0079                                                         
         MFLD  (FLD2002,'43571 Order delad per PRC'),                  *        
               LTH=0079                                                         
         MFLD  (FLD2102,'43581 Byggtider för satser'),                 *        
               LTH=0079                                                         
         MFLD  (FLD2202,'43591 Annullation av utskrivna rader'),       *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for packing                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        43612 *        
               Production class table       '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43422 Create packed order list          43622 *        
               Main warehouse area def   '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43432 Move lines in packed case         43632 *        
               Production time def '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0702,'43442 Show mixed packing                43642 *        
               Rules for PRC                '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43452 Show cases in mixed packing       43652 *        
               Printer per PRC     '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0902,'43462 Case label No. registration       43662 *        
               PRC table           '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1002,'43472 Change of transport id            43672 *        
               Customer file       '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1102,'43482 Printing bar code                 43682 *        
               Agreed working hours'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'43512 Printing of picking unit'),             *        
               LTH=0079                                                         
         MFLD  (FLD1502,'43522 Order queue in PRC         '),          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'43532 Manual printing of PU '),               *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,'43572 Orders split per PRC  '),               *        
               LTH=0079                                                         
         MFLD  (FLD2102,'43582 Production time kits  '),               *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044I MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för packning                       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'43811 Synkronisering PRC/status'),            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43821 Synkronisering PRC/rader '),            *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43831 Planering dagorder'),                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'43841 Bemanning per PRC'),                    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43851 Dagens transportvolym    '),            *        
               LTH=0079                                                         
         MFLD  (FLD0902,'43861 Planering bulkorder/ptid '),            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'43871 Planering bulkorder/rader'),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'43881 Listbeställning WOPS     '),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,'43891 Knyta packare till skift '),            *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4I MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for packing                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'43812 Synchronization PRC stat '),            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'43822 Synchronization PRC lines'),            *        
               LTH=0079                                                         
         MFLD  (FLD0602,'43832 Planning daily orders'),                *        
               LTH=0079                                                         
         MFLD  (FLD0702,'43842 Personnel per PRC           '),         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'43852 Today s transport volume     '),        *        
               LTH=0079                                                         
         MFLD  (FLD0902,'43862 Bulk order planning p-time'),           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'43872 Bulk order planning lines '),           *        
               LTH=0079                                                         
         MFLD  (FLD1102,'43882 Order of WOPS lists      '),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,'43892 Tie a picker to a shift       '),       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044J MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för kund                           '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'Endast engelska bilder finns'),               *        
               LTH=0022                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4J MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for customer                       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'44012 Refill/transfer ord-rel. days     44212 *        
               Customer master query DC     '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0502,'44022 DC Information 1                  44222 *        
               Customer master query FC     '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'44032 DC Information 2                        *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0702,'44042 DC Information 3                        *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'44052 DC Return exceptions                    *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0902,'44062 Define case info for web print          *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1002,'44072 Destocking parameters                   *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1102,'44082 DC Lead times                           *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1202,'44092 Update F/C factors                      *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'44112 Goods receiver info. 1            44312 *        
               Direct del parameter mainten  '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'44122 District information                    *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'44132 Goods receiver info. 2            44412 *        
               LDC Steering parameters       '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'44142 Goods receiver LDC info           44562 *        
               Shipping document             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'44152 Goods receiver DC info.           44572 *        
               Ship Document:Freight/Ins cost'),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'44162 First DC connections              44822 *        
               Fin.Customer - Goods Receiver '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'44172 Goods receiver FC info.           44832 *        
               Cash on delivery customer     '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'44182 Goods marking                     44842 *        
               Transport route (zone) customer'),                      *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderbehandling                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'45011 Fråga på order allmänt            45211 *        
               Ej fakturerade rader   '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0502,'45021 Fråga på order artiklar                 *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'45031 Fråga på order värde                    *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD0702,'45041 Fråga på order kundinfo                 *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                              *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1002,'45071 Arkivering PU                           *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1102,'45081 Fråga på kolli              '),         *        
               LTH=0079                                                         
         MFLD  (FLD1202,'45091 Fråga på artikel             '),        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'45111 Fråga på distrikt/värde                 *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD1502,'45121 Fråga på distrikt/rader                 *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD1602,'45131 Fråga på distrikt/status                *        
                               '),                                     *        
               LTH=0079                                                         
         MFLD  (FLD1702,'45141 Fråga på distrikt/transport             *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1802,'45151 Fråga på distrikt/kolli                 *        
                             '),                                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD2002,'45171 Fråga på distrikt/tid                   *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        45381 *        
               Tull-id urval                    '),                    *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4M MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order processing               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'45012 Query order general               45212 *        
               Not invoiced orders       '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'45022 Query order part No.                    *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'45032 Query order value                       *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0702,'45042 Query order name/address   '),          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                  '),         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'45072 Filed packing lists'),                  *        
               LTH=0079                                                         
         MFLD  (FLD1102,'45082 Query order cases          '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'45092 Query ordered part No.         '),      *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'45112 Query district/value                    *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD1502,'45122 Query district/lines                    *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1602,'45132 Query district/status                   *        
                              '),                                      *        
               LTH=0079                                                         
         MFLD  (FLD1702,'45142 Query district/transport                *        
                                       '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1802,'45152 Query district/cases                    *        
                                 '),                                   *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2002,'45172 Query district/time   '),               *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044N MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderbehandling                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        45611 *        
               Fråga på lastning 1 '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                              *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                     '),      *        
               LTH=0079                                                         
         MFLD  (FLD0702,'45441 Fråga på distrikt/utlastningsomr.'),    *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'45511 Fråga på transportör              45711 *        
               Fråga på    RO/TPO  '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                        45721 *        
               Uppdatera   RO/TPO  '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        45731 *        
               Reserverade RO/TPO  '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                        45741 *        
               Frisläppta  RO/TPO'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                        45751 *        
               Fråga på    RO/Datum'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        45761 *        
               Backorder queue     '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        45781 *        
               LDC Backorder Release'),                                *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4N MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order processing               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        45612 *        
               Query loading 1      '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                              *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'45442 Query district/loading area   '),       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                       '),    *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'45512 Query district/transporter        45712 *        
               Query backorder/TPO   '),                               *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                        45722 *        
               Update   Backorder/TPO'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        45732 *        
               Reserved Backorder/TPO'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                        45742 *        
               Released Backorder/TPO'),                               *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                        45752 *        
               Query backorder/date   '),                              *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        45762 *        
               Backorder queue        '),                              *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        45782 *        
               LDC Backorder Release'),                                *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044O MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för orderbehandling                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'45811 Fråga uppdatera transport'),            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'45821 Fråga på transport '),                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4O MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for order processing               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'45812 Query/update transport   '),            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'45822 Query transport   '),                   *        
               LTH=0079                                                         
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044P MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för utleverans lagret              '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                   '),        *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        46221 *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        46231 *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        46241 *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                '),                           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'46111 Utskrift fraktsedlar                    *        
                                               '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                               '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                              *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                   '),        *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4P MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for goods delivery warehouse       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        46222 *        
               Ship doc info                '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        46232 *        
               Shipments per district       '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        46242 *        
               Transports and shipping      '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        46252 *        
               Cross index shipping/invoice '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1502,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1602,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                '),           *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044R MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för utleverans lagret              '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'46511 Definiera lastområde/ställage     46711 *        
               Ej återrapporterade lastningar 1'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0502,'46521 Rapportera ruta full              46721 *        
               Ej återrapporterade lastningar 2'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0602,'46531 Order planning per transport      46731 *        
               Lastningsrelease 3 transport'),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'46541 Order planning per PRC  '),             *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1102,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1202,'              '),                             *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'46611 Definiera transport lastområde '),      *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'46631 Lastningsrelease 2 transport            *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'46641 Avsluta Fakt/Last transport             *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'46661 Påbörjade lastbärare     '),            *        
               LTH=0079                                                         
         MFLD  (FLD2002,'46671 Transportinformation        '),         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'46681 Transport information - NDC '),         *        
               LTH=0079                                                         
         MFLD  (FLD2202,'46691 Bill of Lading               '),        *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4R MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for goods delivery warehouse       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'46512 Define loading area               46712 *        
               Not reported loadings  1   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'46522 Report full square                46722 *        
               Not reported loadings  2     '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'46532 Order planning per transport      46732 *        
               Loading 3 transport          '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0702,'46542 Order planning per PRC    '),           *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                   '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                  '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'46612 Define transport   '),                  *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'46632 Load release 2 per transport            *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'46642 Close transport; start inv.             *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'46662 Started carriers             '),        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'46672 Delivery notes summary       '),        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'46682 Transport information - NDC  '),        *        
               LTH=0079                                                         
         MFLD  (FLD2202,'46692 Bill of Lading            '),           *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044S MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för leveransanmärkningar'),        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'47011 Ansvarig-tabell                   47211 *        
               Kö obeh. lev-anm-rader      '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'47021 Analysnummer                      47221 *        
               Lev-anm-rad - detalj        '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0602,'47031 Listutskrift - Lev.anm.art        47231 *        
               Lev-anm-rad - text          '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'47041 Registrering lev.anm.             47241 *        
               Fråga på lev-anm-artikel    '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'47051 Lev.anm internuppackning          47251 *        
               Visa kolli-information      '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'47061 Tidsgränser bildvisning           47261 *        
               Fråga kreditnota            '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        47271 *        
               Fråga faktura               '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'47111 Distrikt/Status                   47311 *        
               Visa sändningskö            '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'47121 Lev. anm. 1                       47321 *        
               Visa sändningsinnehåll      '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1602,'47131 Lev. anm. 2                       47331 *        
               Registrera sändning         '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'47141 Tilläggskostnader                 47341 *        
               Visa kollikö                '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'47151 Returtillstånd                    47351 *        
               Visa kolliinnehåll          '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'47161 Krediterat/Debiterat              47361 *        
               Visa returtillståndskö      '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,'47171 Approve discrepancy lines         47371 *        
               Behandla returtillstånd     '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'47181 Approve discr. lines-text         47381 *        
               Rapportera inläggningslista '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                        47391 *        
               Ident/upd of part no 100    '),                         *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4S MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for discrepancy reports            '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'47012 Responsible tabel                 47212 *        
               Queue rem.discr.lines       '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0502,'47022 Analysis number                   47222 *        
               Discr.line - detail         '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0602,'47032 Lists - Discrepancy               47232 *        
               Discrepancy - text          '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0702,'47042 Registration discrepancies        47242 *        
               Discrepancy Part number     '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'47052 Return permission                 47252 *        
               Case information            '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'47062 Time limits                       47262 *        
               Query credit note           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,'47072 Price the handling fee            47272 *        
               Query invoice               '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1102,'47082 Value limits for print of CN            *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1202,'47092 Query the handling fee                  *        
                                           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'47112 District/Status                   47312 *        
               Show return queue           '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1502,'47122 Discrepancy note 1                47322 *        
               Location status             '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1602,'47132 Discrepancy note 2                47332 *        
               Registration return         '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'47142 Additional costs                  47342 *        
               Show case queue             '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'47152 Return permit                     47352 *        
               Show return contents        '),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'47162 Credit/Debit                      47362 *        
               Show return permission queue'),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,'47172 Approve discrepancy lines         47372 *        
               Treat return permission     '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'47182 Approve discr. lines-text         47382 *        
               Report binning list         '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2202,'47192 Handling fee steering             47392 *        
               Ident/upd of part no 100    '),                         *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044T MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för leveransanmärkningar'),        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'47411 Reg. Mott. returer - returterm'),       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'47421 Skapa/Fylla på kollin'),                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'47431 Lastningsrelease'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0702,'47441 Visa returtillståndskö'),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'47451 Proforma return of returns'),           *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,'47481 Show status bining list'),              *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4T MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for discrepancy reports            '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'47412 Receiving returns - RT'),               *        
               LTH=0079                                                         
         MFLD  (FLD0502,'47422 Confirm cases'),                        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'47432 Shipping release'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0702,'47442 External queue - RP'),                  *        
               LTH=0079                                                         
         MFLD  (FLD0802,'47452 Proforma return of returns'),           *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,'47482 Show status bining list'),              *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'47512 Parts Matrix           '),              *        
               LTH=0079                                                         
         MFLD  (FLD1502,'47522 Return Code Matrix     '),              *        
               LTH=0079                                                         
         MFLD  (FLD1602,'47532 Leadtime claim and returns '),          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'47542 Discrepancy codes referral matrix'),    *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5044Y MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för NOAC                           '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,'49011 Aktiva order               '),          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'49021 Fysiska avvikelser         '),          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'49031 RO-RELEASE fråga           '),          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'49041 RO-RELEASE ändring         '),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                                 '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N4Y MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for NOAC                           '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,'49012 Active orders      '),                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'49022 Physical deviations '),                 *        
               LTH=0079                                                         
         MFLD  (FLD0702,'49032 Backorder release query   '),           *        
               LTH=0079                                                         
         MFLD  (FLD0802,'49042 Backorder release change'),             *        
               LTH=0079                                                         
         MFLD  (FLD0902,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5045A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för ekonomiavdelning               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'51011 Inventeringsinformation                 *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0502,'51021 Lagerbokföringsinformation        51221 *        
               Existing price                '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'51031 Frågecentral                            *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'51041 Pris och beställningsinformation  51311 *        
               Betalare                    '),                         *        
               LTH=0079                                                         
         MFLD  (FLD0802,'51051 Inventeringsjusteringar           51321 *        
               Landingcost                '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'51061 Inventeringar online                    *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'51071 Inleveransinformation                   *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,'51081 Uppdatering utredningssaldo             *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'51091 Fiktiv clearing'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'51111 Prisuppdatering                   51411 *        
               Förpackningskostnad/FP-typ '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'51121 Prisuppdatering borttag           51421 *        
               Extra förpackningskost/artikel'),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'51131 Fjolårets pris/best-info          51431 *        
               Emballagekost/Detaljkod    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'51141 Spis fråga/ändra art förslag      51441 *        
               Förpackningskostnad/FP/grupp'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'51151 Spis fråga/godk pris förslag            *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        51511 *        
               Omläggning bytes              '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,'51191 Price update  not mainvendor'),         *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N5A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for accounting department          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'51012 Inventory information                   *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'51022 Stock accounting information      51222 *        
               Existing price                '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'51032 Query central                     51232 *        
               Monthly currency rate      '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'51042 Price and ordering information          *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'51052 Old stocktaking adjustments       51252 *        
               Existing price            '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0902,'51062 Stocktaking adjustment                  *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'51072 Delivery information                    *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1102,'51082 Update investigation balance            *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1202,'51092 Fictive clearing'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'51112 Update price                      51312 *        
               Financial customer              '),                     *        
               LTH=0079                                                         
         MFLD  (FLD1502,'51122 Update remove price                     *        
                                      '),                              *        
               LTH=0079                                                         
         MFLD  (FLD1602,'51132 Last year price/order info.       51332 *        
               Financial steering parms   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'51142 Query/change part suggestion      51342 *        
               Financial steering parms 2 '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'51152 Query/approve price suggestion    51352 *        
               Financial Steering Parms 3 '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        51362 *        
               Financial Steering Parms 4 '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                        51372 *        
               Financial Steering Parms 5 '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,'51191 Price update, not mainvendor            *        
                                              '),                      *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5045B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för ekonomiavdelning               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'51611 Balance-log selection                   *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0502,'51621 Balance-log overview - 1                *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'51631 Balance-log overview - 2                *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,'51661 Correction of wrong balances            *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N5B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for accounting department          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        51612 *        
               Balance-log selection      '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'51452 Std price process parameter       51622 *        
               Balance-log overview - 1      '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        51632 *        
               Balance-log overview - 2   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,'                                        51662 *        
               Correction of wrong balances'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'51512 Exchange Subtitute a spare part         *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5045D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för ekonomiavdelning               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'52011 Price and value adjustments       52211 *        
               Economical prm - chng/del'),                            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'52021 Ändra lokalt produktslag'),             *        
               LTH=0079                                                         
         MFLD  (FLD0602,'52031 Inventory value, accounting NA'),       *        
               LTH=0079                                                         
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'52051 Inventory value, accounting '),         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'52061 Update Price               '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'52071 Remove Price               '),          *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'52111 Economical errors - overview '),        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'52121 Economical errors - detail   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'52131 Economical prm - overview    '),        *        
               LTH=0079                                                         
         MFLD  (FLD1702,'52141 Economical main event - reg  '),        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'52151 Economical sub event - reg   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'52161 Economical level - reg       '),        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'52171 Economical client - reg      '),        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'52181 Economical profile - chng    '),        *        
               LTH=0079                                                         
         MFLD  (FLD2202,'52191 Economical level prm - chng  '),        *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N5D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for accounting department          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'52012 Price and value adjustments       52212 *        
               Economical prm - chng/del'),                            *        
               LTH=0079                                                         
         MFLD  (FLD0502,'52022 Local product code adjustments    52222 *        
               Orderno/district-customer r3 update'),                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'52032 Inventory value, accounting NA    52232 *        
               Orderno/district-customer r3 list  '),                  *        
               LTH=0079                                                         
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'52052 Inventory value, accounting'),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'52062 Update Price               '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'52072 Remove Price               '),          *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'52112 Economical errors - overview '),        *        
               LTH=0079                                                         
         MFLD  (FLD1502,'52122 Economical errors - detail   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1602,'52132 Economical prm - overview    '),        *        
               LTH=0079                                                         
         MFLD  (FLD1702,'52142 Economical main event - reg  '),        *        
               LTH=0079                                                         
         MFLD  (FLD1802,'52152 Economical sub event - reg   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'52162 Economical level - reg       '),        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'52172 Economical client - reg      '),        *        
               LTH=0079                                                         
         MFLD  (FLD2102,'52182 Economical profile - chng    '),        *        
               LTH=0079                                                         
         MFLD  (FLD2202,'52192 Economical level prm - chng  '),        *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5045F MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för ekonomiavdelning               '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'52851 Prime count update         '),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'52861 Re-count update            '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N5F MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for accounting department          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,' '),LTH=0001                                           
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,' '),LTH=0001                                           
         MFLD  (FLD0702,' '),LTH=0001                                           
         MFLD  (FLD0802,'52852 Prime count update         '),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'52862 Re-count update            '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5045G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för ekonomi inventering            '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                      '),     *        
               LTH=0079                                                         
         MFLD  (FLD0502,'53021 Inventeringskö         '),              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'53031 Inventeringskö översikt    '),          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'53041 Begäran om inventering'),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'53051 Uppdatering från urvalsfilen'),         *        
               LTH=0079                                                         
         MFLD  (FLD0902,'53061 Nollade artiklar     '),                *        
               LTH=0079                                                         
         MFLD  (FLD1002,'53071 SDC Goods receiving history'),          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'53081 Automatic adjustment       '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'53091 Inventory queue 2          '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'53111 Inventory Adjustments Working '),       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'53121 Inventory Adjustments History '),       *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N5G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for accounting department          '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        53212 *        
               Reset Inventory Adjustments'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'53022 Inventory queue        '),              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'53032 Inv. queue overview        '),          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'53042 Request of inventory  '),               *        
               LTH=0079                                                         
         MFLD  (FLD0802,'53052 Update from selection file '),          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'53062 Zero reporting             '),          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'53072 SDC Goods receiving history'),          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'53082 Automatic adjustment       '),          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'53092 Inventory queue 2          '),          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'53112 Inventory Adjustments Working '),       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'53122 Inventory Adjustments History '),       *        
               LTH=0079                                                         
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för Inleverans                     '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'61011 Administrera vagn                 61211 *        
               Lossningsinfo - visa/rätta'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'61021 Flytta kolli                      61221 *        
               Skapa flaggor - parti'),                                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61031 Ersätta flagga - Inleverans       61231 *        
               Kolliöversikt artikel/parti'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61041 Registrera utplock - VOR          61241 *        
               Reg/scan kolli på vagn/plac'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61051 Definiera styrparametrar          61251 *        
               Reg/scan parti på vagn/plac'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'61061 Definiera placering               61261 *        
               Visa placeringshistorik    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'61071 Fråga på placering                      *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'61081 Fråga på förbehandlingsadr              *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD1202,'61091 Arbetsrapports information              *        
                          '),                                          *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'61111 Registrera följesedelsinfo        61311 *        
               Kolliöversikt vagn - lista'),                           *        
               LTH=0079                                                         
         MFLD  (FLD1502,'61121 Registrera 1 leverantör           61321 *        
               Prio kö'),                                              *        
               LTH=0079                                                         
         MFLD  (FLD1602,'61131 Registrera flera leverantörer     61331 *        
               Kolliöversikt partiåtgärder'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'61141 Rätta följesedelsinfo                   *        
                                                '),                    *        
               LTH=0079                                                         
         MFLD  (FLD1802,'61151 Förb lossning - aktivering        61351 *        
               Ta bort kolli'),                                        *        
               LTH=0079                                                         
         MFLD  (FLD1902,'61161 Registrera följesedel med kto     61361 *        
               Skapa kolli - förbehandling'),                          *        
               LTH=0079                                                         
         MFLD  (FLD2002,'61171 Registrering R34 transar          61371 *        
               Skapa diversekolli'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD2102,'61181 Backa R32 rapportering                  *        
                          '),                                          *        
               LTH=0079                                                         
         MFLD  (FLD2202,'61191 Makulera parti                    61391 *        
               Mottagningskontroll   '),                               *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for goods receiving                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'61012 Administer trolley                61212 *        
               Unloading info Show/correct'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'61022 Move cases                        61222 *        
               Create labels - Batch      '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61032 Replace labels goods receiving    61232 *        
               Case survey part/batch     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61042 Register picking - VOR            61242 *        
               Reg/Scan case on trolley   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61052 Define steering parameters        61252 *        
               Reg/Scan batch on trolley  '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'61062 Define location                   61262 *        
               Show location history'),                                *        
               LTH=0079                                                         
         MFLD  (FLD1002,'61072 Inquiry location'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1102,'61082 Inquiry pre-treatment address'),        *        
               LTH=0079                                                         
         MFLD  (FLD1202,'61092 Receiving report information'),         *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'61112 Register delivery note info       61312 *        
               Case survey trolley - list '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'61122 Register one supplier             61322 *        
               Priority queue '),                                      *        
               LTH=0079                                                         
         MFLD  (FLD1602,'61132 Register several suppliers        61332 *        
               Case survey batch activities'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'61142 Correct delivery note info'),           *        
               LTH=0079                                                         
         MFLD  (FLD1802,'61152 Pre-treatm unloading - activation 61352 *        
               Delete cases'),                                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'61162 Register delivery note w.account  61362 *        
               Create cases - pre-treatment'),                         *        
               LTH=0079                                                         
         MFLD  (FLD2002,'61172 Registration R34-transactions     61372 *        
               Create miscellaneous case   '),                         *        
               LTH=0079                                                         
         MFLD  (FLD2102,'61182 Back out of R32 reporting'),            *        
               LTH=0079                                                         
         MFLD  (FLD2202,'61192 Cancel a received lot             61392 *        
               Goods receiving control '),                             *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för inleverans                     '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'61411 Skapa inläggningslista            61611 *        
               Hanteringskod registrering'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'61421 Rapportera inläggningslista       61621 *        
               Buffertinformation   '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61431 Rapportera kolli                  61631 *        
               Lagerdata registrering'),                               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61441 Rapportera inlagt                 61641 *        
               Replenishment proposals '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61451 Rapportera diverse kolli          61651 *        
               Inleveransinformation'),                                *        
               LTH=0079                                                         
         MFLD  (FLD0902,'61461 Slutrapp utan avvikelse           61661 *        
               Etikett registrering       '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'61471 Slutrapp med avvikelse            61671 *        
               Etikett registrering 2     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'61481 Transportanmärkningar             61681 *        
               Etikett utskrift           '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        61691 *        
               Part Measurements   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'61511 Justera saldo på plockplats             *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD1502,'61521 Påfyllning CDC/SVS                      *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD1602,'61531 Lossning påfyllningsgods          61731 *        
               Ersätta flagga - påfyllning'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'61541 Manuell påfyllning CDC/SVS        61741 *        
               Goods for direct del via CDC'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'61551 Hist. förflyttningar CDC/SVS      61751 *        
               Goods for direct del via CDC'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        61761 *        
               Goods scan direct del via CDC'),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,'61571 Def. param. uppf. SVS                   *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD2102,'61581 Definiera Gate Styrning                 *        
                                        '),                            *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6B MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for goods receiving                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                        61612 *        
               Handling code registration'),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        61622 *        
               Buffer Information '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61432 Report case                       61632 *        
               Stock registration'),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61442 Report binned goods               61642 *        
               Replenishment proposals '),                             *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61452 Report miscellaneous goods        61652 *        
               Goods receiving information'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'61462 Final reporting                   61662 *        
               Label registration  '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1002,'61472 Final reporting with deviation    61672 *        
               Label registration 2'),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        61682 *        
               Label printing      '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        61692 *        
               Part Measurements   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'                                        61732 *        
               Print labels'),                                         *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                        61742 *        
               Goods for direct del via CDC'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                        61752 *        
               Goods for direct del via CDC'),                         *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                        61762 *        
               Goods scan direct del via CDC'),                        *        
               LTH=0079                                                         
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046C MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för inleverans                     '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'61811 Visa/uppdatera förpackningstyp          *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'61821 Registrering FP-emballage               *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61831 Förpackningsinstruktion                 *        
                                     '),                               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61841 Visa/koppla artiklar                    *        
                                            '),                        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61851 Visa levnr/artnr per emballage          *        
                                    '),                                *        
               LTH=0079                                                         
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6C MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for goods receiving                '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'61812                                         *        
                                         '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0502,'61822                                         *        
                                  '),                                  *        
               LTH=0079                                                         
         MFLD  (FLD0602,'61832                                         *        
                                 '),                                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'61842                                         *        
                                   '),                                 *        
               LTH=0079                                                         
         MFLD  (FLD0802,'61852                                         *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'61862 Pref country of origin                  *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,' '),LTH=0001                                           
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för kvalitet                       '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'62011 Kontrollrapport sökbild           62211 *        
               Leverantör                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'62021 Kontrollrapport felrapport'),           *        
               LTH=0079                                                         
         MFLD  (FLD0602,'62031 Kontrollrapport bedömd'),               *        
               LTH=0079                                                         
         MFLD  (FLD0702,'62041 Kontrollrapport packning'),             *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,' '),LTH=0001                                           
         MFLD  (FLD1102,'62081 Manuell kreditering av kr'),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'62111 Artikelinfo Kvalitet              62311 *        
               Provplan                      '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'62121 Parts history Quality'),                *        
               LTH=0079                                                         
         MFLD  (FLD1602,'62131 Beredning Kvalitet'),                   *        
               LTH=0079                                                         
         MFLD  (FLD1702,'62141 Parts history quality per DC'),         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'62151 Summary stock check answers'),          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'62161 Quality blocked parts'),                *        
               LTH=0079                                                         
         MFLD  (FLD2002,'62171 Quality / packaging'),                  *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6D MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for quality                        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'62012 IR inquiry                        62212 *        
               Supplier information          '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'62022 IR error report        '),              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'62032 IR assessment            '),            *        
               LTH=0079                                                         
         MFLD  (FLD0702,'62042 IR packing         '),                  *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,' '),LTH=0001                                           
         MFLD  (FLD1002,'62072 IR description           '),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'62082 Manuel credit of IR'),                  *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'62112 Parts info. Quality               62312 *        
               Sample Plan                   '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'62122 Parts history Quality'),                *        
               LTH=0079                                                         
         MFLD  (FLD1602,'62132 Planning Quality'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1702,'62142 Parts history quality per DC'),         *        
               LTH=0079                                                         
         MFLD  (FLD1802,'62152 Summary stock check answers'),          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'62162 Quality blocked parts'),                *        
               LTH=0079                                                         
         MFLD  (FLD2002,'62172 Quality / packaging'),                  *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för SDC/NDC Inleverans             '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'63011 DC Goods receiving                63211 *        
               Quality Return/Scrap per DC   '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'63021 DC Unloading                      63221 *        
               Release Scrap Orders          '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'63031 DC Binning                        63231 *        
               Release Scrap Order high value'),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'63041 DC Lagerdata registrering         63241 *        
               Value limit for approvals     '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        63251 *        
               Scrap text                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'63061 DC Location inquiry      '),            *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                               '),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                               '),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,'63091 DC Lost case found                      *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'63111 Maintenance frequency table             *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'63121 List storagecode and update             *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'63131 Maintain location                       *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'63141 Add location                            *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'63151 Change location                         *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'63161 List free locations                     *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'63171 List locations                          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'63181 Copy location                           *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6G MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for SDC/NDC Goods Receiving        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'63012 DC Goods Receiving                63212 *        
               Quality Return/Scrap per DC   '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'63022 DC Unloading                      63222 *        
               Release Scrap Orders          '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'63032 DC Binning                        63232 *        
               Release Scrap Order high value'),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'63042 DC Stock data registration        63242 *        
               Value limit for approvals     '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'63052 DC Buffer information             63252 *        
               Scrap text                    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'63062 DC Location inquiry       '),           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'63072 DC Goods receiving history'),           *        
               LTH=0079                                                         
         MFLD  (FLD1102,'63082 DC Delivery blocking      '),           *        
               LTH=0079                                                         
         MFLD  (FLD1202,'63092 DC Lost case found                      *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'63112 Maintenance frequency table       63312 *        
               Report Binning list refill    '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'63122 Liststorage code and update       63322 *        
               Show Binning list refill      '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'63132 Maintain location                       *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'63142 Add location                            *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'63152 Change locations                        *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'63162 List free locations                     *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'63172 List locations                          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'63182 Copy location                           *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'63192 Part location history      '),          *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5046H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för SDC/NDC Inleverans             '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'63411 Maintenance frequency tableCDC          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'63421 List storagecode and updateCDC          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'63431 Maintain location CDC                   *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'63441 ADD location CDC                        *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'63451 Change location CDC                     *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'63461 List free locations CDC                 *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1002,'63471 List locations CDC       '),            *        
               LTH=0079                                                         
         MFLD  (FLD1102,'63481 Copy locations CDC       '),            *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'63511 DC Tree                                 *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N6H MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for SDC/NDC Goods Receiving        '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'63412 Maintenance frequency tableCDC          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0502,'63422 List storagecode and updateCDC          *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0602,'63432 Maintain location CDC                   *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0702,'63442 Add location CDC                        *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0802,'63452 Change locations CDC                    *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD0902,'63462 List free locations CDC   '),           *        
               LTH=0079                                                         
         MFLD  (FLD1002,'63472 List locations CDC        '),           *        
               LTH=0079                                                         
         MFLD  (FLD1102,'63482 Copy location CDC         '),           *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'63512 DC Tree                                 *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1802,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2002,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                              *        
                                             '),                       *        
               LTH=0079                                                         
         MFLD  (FLD2202,'                                 '),          *        
               LTH=0079                                                         
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O5049A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för externa användare              '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'91021 Artikel ersättes av'),                  *        
               LTH=0079                                                         
         MFLD  (FLD0702,'91031 Artikel ersätter'),                     *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,'91111 Tullrestitution'),                      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'91121 Artikel information'),                  *        
               LTH=0079                                                         
         MFLD  (FLD1102,' '),                                          *        
               LTH=0001                                                         
         MFLD  (FLD1202,'91141 Delivery information CDC '),            *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,'91211 Baslager marknadskö'),                  *        
               LTH=0079                                                         
         MFLD  (FLD1602,'91221 Baslager marknadskvant. reg.'),         *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,'                              '),             *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N9A MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for external users                 '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'                                   '),        *        
               LTH=0079                                                         
         MFLD  (FLD0502,' '),LTH=0001                                           
         MFLD  (FLD0602,'91022 Part superseded by'),                   *        
               LTH=0079                                                         
         MFLD  (FLD0702,'91032 Part supersedes'),                      *        
               LTH=0079                                                         
         MFLD  (FLD0802,' '),LTH=0001                                           
         MFLD  (FLD0902,'91112              '),                        *        
               LTH=0079                                                         
         MFLD  (FLD1002,'91122 Parts information'),                    *        
               LTH=0079                                                         
         MFLD  (FLD1102,'91132 Delivery information'),                 *        
               LTH=0079                                                         
         MFLD  (FLD1202,'91142 Delivery information CDC '),            *        
               LTH=0079                                                         
         MFLD  (FLD1302,'91152 Delivery information DC  '),            *        
               LTH=0079                                                         
         MFLD  (FLD1402,' '),LTH=0001                                           
         MFLD  (FLD1502,'91212 Basic stock market queue'),             *        
               LTH=0079                                                         
         MFLD  (FLD1602,'91222 Basic stock market quant. reg.'),       *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,'                            '),               *        
               LTH=0079                                                         
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50492 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för extern distribution            '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08131 Orderbekräftelsetexter            45011 *        
               Fråga på order allmänt     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        45021 *        
               Fråga på order artiklar    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42411 Orderhuvud extern                 45091 *        
               Fråga på artiklar          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        45111 *        
               Fråga på distrikt/värde'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42431 Svarsbild extern                  45141 *        
               Fråga på distrikt/transport'),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'42441 Tillägg orderrader extern         45151 *        
               Fråga på distrikt/kolli    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'42451 Annullation orderrader extern           *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        45711 *        
               Fråga på    RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'42811 Obekr. distr. utskr/fråga         45721 *        
               Uppdatera   RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1302,'42821 Fråga orderbekräftelse/order      45731 *        
               Reserverade RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1402,'42831 Fråga orderbekräftelse/art.       45741 *        
               Frisläppta  RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        49011 *        
               Aktiva order               '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N92 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for distribution,  external users  '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08132 Order confirmation description    45012 *        
               Query order general        '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        45022 *        
               Query order part No.       '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'42412 Order head external               45092 *        
               Query ordered part No.     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'                                        45112 *        
               Query district/value       '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'42432 Answer order entry                45142 *        
               Query district/transport   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0902,'42442 Order line addition external      45152 *        
               Query district/cases       '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'42452 Order line cancellation external        *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'                                        45712 *        
               Query backorder/TPO        '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'42812 Order conf / distr print          45722 *        
               Update   Backorder/TPO     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1302,'42822 Order confirmation / order        45732 *        
               Reserved Backorder/TPO     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1402,'42832 Order confirmation / part No.     45742 *        
               Released Backorder/TPO     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'                                              *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'                                        49012 *        
               Active orders              '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,' '),LTH=0001                                           
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50493 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för Volvo Personbilar Sverige AB   '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08131 Orderbekräftelsetexter            45011 *        
               Fråga på order allmänt     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        45021 *        
               Fråga på order artiklar    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        45081 *        
               Fråga på order kolli      '),                           *        
               LTH=0079                                                         
         MFLD  (FLD0702,'12211 Struktur ingår i                  45091 *        
               Fråga på artiklar          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        45111 *        
               Fråga på distrikt/värde'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0902,'31031 Artikelinformation från VR        45131 *        
               Fråga på distrikt/status   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        45141 *        
               Fråga på distrikt/transport'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'42411 Orderhuvud extern                 45151 *        
               Fråga på distrikt/kolli    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        45711 *        
               Fråga på    RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1302,'42431 Svarsbild extern                  45721 *        
               Uppdatera   RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1402,'42441 Tillägg orderrader extern         45731 *        
               Reserverade RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'42451 Annullation orderrader extern     45741 *        
               Frisläppta  RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'42461 Svarsbild tillägg externorder           *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                        49021 *        
               Fysiska avvikelser         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'42811 Obekr. distr. utskr/fråga         91021 *        
               Artikel ersättes av        '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'42821 Fråga orderbekräftelse/order      91031 *        
               Artikel ersätter           '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2002,'42831 Fråga orderbekräftelse/artikel    91121 *        
               Artikelinformation         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),                                          *        
               LTH=0001                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N93 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för Volvo Personbilar Sverige AB   '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny  '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'08131 Orderbekräftelsetexter            45011 *        
               Fråga på order allmänt     '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0502,'                                        45021 *        
               Fråga på order artiklar    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0602,'                                        45081 *        
               Fråga på orde3r kolli      '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0702,'12211 Struktur ingår i                  45091 *        
               Fråga på artiklar          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD0802,'                                        45111 *        
               Fråga på distrikt/värde'),                              *        
               LTH=0079                                                         
         MFLD  (FLD0902,'31031 Artikelinformation från VR        45131 *        
               Fråga på distrikt/status   '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1002,'                                        45141 *        
               Fråga på distrikt/transport'),                          *        
               LTH=0079                                                         
         MFLD  (FLD1102,'42411 Orderhuvud extern                 45151 *        
               Fråga på distrikt/kolli    '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                        45711 *        
               Fråga på    RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1302,'42431 Svarsbild extern                  45721 *        
               Uppdatera   RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1402,'42441 Tillägg orderrader extern         45731 *        
               Reserverade RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1502,'42451 Annullation orderrader extern     45741 *        
               Frisläppta  RO/TPO         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1602,'42461 Svarsbild tillägg externorder           *        
                                          '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1702,'                                        49021 *        
               Fysiska avvikelser         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1802,'42811 Obekr. distr. utskr/fråga         91021 *        
               Artikel ersättes av        '),                          *        
               LTH=0079                                                         
         MFLD  (FLD1902,'42821 Fråga orderbekräftelse/order      91031 *        
               Artikel ersätter           '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2002,'42831 Fråga orderbekräftelse/artikel    91121 *        
               Artikelinformation         '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2102,'                                        91132 *        
               Delivery information       '),                          *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50499 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Meny för externa system (ej Parts)      '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Välj bild eller meny'),                       *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'99400 PV System inköp meny'),                 *        
               LTH=0079                                                         
         MFLD  (FLD0502,'99410 PV System inköp bild 01'),              *        
               LTH=0079                                                         
         MFLD  (FLD0602,'99420 PV System inköp bild 02'),              *        
               LTH=0079                                                         
         MFLD  (FLD0702,'99430 PV System inköp bild 03'),              *        
               LTH=0079                                                         
         MFLD  (FLD0802,'99450 PV System inköp bild 05'),              *        
               LTH=0079                                                         
         MFLD  (FLD0902,'99460 PV MCM Artiklar för annullering'),      *        
               LTH=0079                                                         
         MFLD  (FLD1002,'99470 PV MCK Arkiverade annulleringar'),      *        
               LTH=0079                                                         
         MFLD  (FLD1102,'99480 PV MMU Utgående artiklar'),             *        
               LTH=0079                                                         
         MFLD  (FLD1202,'                                   '),        *        
               LTH=0079                                                         
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'99610 VOLVO AB Namnlex'),                     *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,'99710 VOLVO Personvagnar KDP'),               *        
               LTH=0079                                                         
         MFLD  (FLD1702,' '),LTH=0001                                           
         MFLD  (FLD1802,'                                    '),       *        
               LTH=0079                                                         
         MFLD  (FLD1902,'99980 VOLVO-BIL AB meny för Volvohandeln'),   *        
               LTH=0079                                                         
         MFLD  (FLD2002,'99990 VOLVO-BIL AB dmeny'),                   *        
               LTH=0079                                                         
         MFLD  (FLD2102,' '),LTH=0001                                           
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O50N99 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F504,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  IDTRANS,LTH=0005                                                 
         MFLD  (FLD0119,'Menu for external systems (non Parts)   '),   *        
               LTH=0040                                                         
         MFLD  (FLD0202,'Select screen or menu '),                     *        
               LTH=0022                                                         
         MFLD  (FLD0302,' '),LTH=0001                                           
         MFLD  (FLD0402,'99400 Volvo Car purchase menu'),              *        
               LTH=0079                                                         
         MFLD  (FLD0502,'99410 Volvo Car purchase picture 01'),        *        
               LTH=0079                                                         
         MFLD  (FLD0602,'99420 Volvo Car purchase picture 02'),        *        
               LTH=0079                                                         
         MFLD  (FLD0702,'99430 Volvo Car purchase picture 03'),        *        
               LTH=0079                                                         
         MFLD  (FLD0802,'99450 Volvo Car purchase picture 05'),        *        
               LTH=0079                                                         
         MFLD  (FLD0902,'99460 Volvo Car purchase picture MCM'),       *        
               LTH=0079                                                         
         MFLD  (FLD1002,'99470 Volvo Car purchase picture MCK'),       *        
               LTH=0079                                                         
         MFLD  (FLD1102,'99480 Volvo Car purchase picture MMU'),       *        
               LTH=0079                                                         
         MFLD  (FLD1202,' '),LTH=0001                                           
         MFLD  (FLD1302,' '),LTH=0001                                           
         MFLD  (FLD1402,'99610 Volvo AB name-lex'),                    *        
               LTH=0079                                                         
         MFLD  (FLD1502,' '),LTH=0001                                           
         MFLD  (FLD1602,' '),LTH=0001                                           
         MFLD  (FLD1702,'99710 Volvo Car KDP'),                        *        
               LTH=0079                                                         
         MFLD  (FLD1802,' '),LTH=0001                                           
         MFLD  (FLD1902,' '),LTH=0001                                           
         MFLD  (FLD2002,'99980 Volvo Car AB DMENYVH'),                 *        
               LTH=0079                                                         
         MFLD  (FLD2102,'99990 Volvo Car AB DMEMU'),                   *        
               LTH=0079                                                         
         MFLD  (FLD2202,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         END                                                                    
