*        MPP-USER-INIT-SYSTEM SECURITY                                          
*                                                                               
         PRINT NOGEN                                                            
W0F514   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','W0T501  ','W0T514U ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T514 7','W0T514 8','W0T501  ', *        
               'WHELP   ','W0T514U ','/RCL.   ','W0T511  ','W0T512  ', *        
               'W0T513  ','W0T514  ','W0T515  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T514U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,11)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäöé'                                 
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'Security update     ',                                 *        
               POS=(01,12),LTH=0020,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'User-id ',                                             *        
               POS=(02,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD0211  DFLD  POS=(02,11),LTH=0008,ATTR=(ALPHA)                                
FLD0311  DFLD  POS=(03,11),LTH=0008,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Kdarbtyp          ',                                   *        
               POS=(05,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0521  DFLD  POS=(05,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Kdarbtyp-Idlev    ',                                   *        
               POS=(06,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0621  DFLD  POS=(06,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Kdarbtyp-4352     ',                                   *        
               POS=(07,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0721  DFLD  POS=(07,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  '13 Uppdat user  14 Visa userkö  15 Egen ändring 16 Secu*        
               rity     17              18              19             *        
                20              21              10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O51401 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F514,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I51401,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0211,LTH=0008                                                 
         MFLD  FLD0311,LTH=0008                                                 
         MFLD  FLD0521,LTH=00010,ATTR=(YES)                                     
         MFLD  FLD0621,LTH=00010,ATTR=(YES)                                     
         MFLD  FLD0721,LTH=00010,ATTR=(YES)                                     
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W0I51401 MSG   TYPE=INPUT,                                             *        
               SOR=W0F514,                                             *        
               OPT=2,                                                  *        
               NXT=W0O51401                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'4'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '05111',LTH=5                                                    
         MFLD  (FLD0211,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0311,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0521,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD0621,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD0721,'++++++++'),LTH=0008,FILL=C' '                          
         MSGEND                                                                 
         END                                                                    
