         TITLE 'UPPDATERA DOKUMENT              '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W0F553   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T553 3',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T553 7',                                           +        
               8='W0T553 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T553U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T551  ',                                          +        
               14='W0T552  ',                                          +        
               15='W0T553  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T555  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T553U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRAN1  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDTRAN2  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRAN3  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRAN4  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPPDATERA DOKUMENT',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Typ ',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDOKTYI DFLD  POS=(2,9),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Id',                                                   +        
               POS=(2,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDOKI   DFLD  POS=(2,23),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sida',                                                 +        
               POS=(2,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDSIDI   DFLD  POS=(2,39),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDOKTYU DFLD  POS=(3,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDOKU   DFLD  POS=(3,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDSIDU   DFLD  POS=(3,39),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TEINFO   DFLD  POS=(5,1),LTH=1200,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'F3=Åter         F7=Första sida  F8=Nästa sida   F10=Whe+        
               lp        F11=Uppdatera ',                              +        
               POS=(21,02),                                            +        
               LTH=0079,                                               +        
               ATTR=(NUM,PROT)                                                  
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O55301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F553,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I55301,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRAN1,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN2,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN3,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN4,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDOKTYI,                                               +        
               LTH=8                                                            
         MFLD  IDDOKTYU,                                               +        
               LTH=8                                                            
         MFLD  IDDOKI,                                                 +        
               LTH=8                                                            
         MFLD  IDDOKU,                                                 +        
               LTH=8                                                            
         MFLD  IDSIDI,                                                 +        
               LTH=3                                                            
         MFLD  IDSIDU,                                                 +        
               LTH=3                                                            
         MFLD  TEINFO,                                                 +        
               LTH=1200                                                         
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I55301 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F553),                                           +        
               OPT=2,                                                  +        
               NXT=W0O55301                                                     
DGI2     LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRAN1,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRAN2,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRAN3,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRAN4,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '05531',                                                +        
               LTH=5                                                            
         MFLD  (IDDOKTYI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKTYU,                                               +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDOKI,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKU,                                                 +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDSIDI,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDU,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TEINFO,                                                 +        
               LTH=1200,                                               +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
