*        MPP-USER-INIT-SYSTEM EGEN-ÄNDRING                                      
*                                                                               
         PRINT NOGEN                                                            
W0F513   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','W0T501  ','W0T513U ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T513 7','W0T513 8','W0T501  ', *        
               'WHELP   ','W0T513U ','/RCL.   ','W0T513  ','W0T512  ', *        
               'W0T513  ','W0T514  ','W0T515  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T513U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,11)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäöé'                                 
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'Ändra/visa user     ',                                 *        
               POS=(01,12),LTH=0020,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'User-id ',                                             *        
               POS=(02,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD0211  DFLD  POS=(02,11),LTH=0008,ATTR=(ALPHA)                                
FLD0311  DFLD  POS=(03,11),LTH=0008,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Namn              ',                                   *        
               POS=(06,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0621  DFLD  POS=(06,21),LTH=0025,ATTR=(ALPHA)                                
         DFLD  'Avdelning         ',                                   *        
               POS=(07,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0721  DFLD  POS=(07,21),LTH=0005,ATTR=(ALPHA)                                
         DFLD  'Företag           ',                                   *        
               POS=(08,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0821  DFLD  POS=(08,21),LTH=0002,ATTR=(NUM,PROT)                             
         DFLD  'DC                ',                                   *        
               POS=(09,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD0921  DFLD  POS=(09,21),LTH=0002,ATTR=(ALPHA,PROT)                           
         DFLD  'Landskod/språk IMS',                                   *        
               POS=(10,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1021  DFLD  POS=(10,21),LTH=0002,ATTR=(NUM,PROT)                             
         DFLD  'Printer           ',                                   *        
               POS=(11,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1121  DFLD  POS=(11,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Start-dag',                                            *        
               POS=(11,51),LTH=0009,ATTR=(NUM,PROT)                             
FLD1161  DFLD  POS=(11,61),LTH=0006,ATTR=(NUM,PROT)                             
         DFLD  'Stil mall (web)   ',                                   *        
               POS=(12,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1221  DFLD  POS=(12,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Ändr-dag ',                                            *        
               POS=(12,51),LTH=0009,ATTR=(NUM,PROT)                             
FLD1261  DFLD  POS=(12,61),LTH=0006,ATTR=(NUM,PROT)                             
         DFLD  'ISO språkkod      ',                                   *        
               POS=(13,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1321  DFLD  POS=(13,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Ändr-tid ',                                            *        
               POS=(13,51),LTH=0009,ATTR=(NUM,PROT)                             
FLD1361  DFLD  POS=(13,61),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Terminal          ',                                   *        
               POS=(14,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1421  DFLD  POS=(14,21),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Printerplacering  ',                                   *        
               POS=(15,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1521  DFLD  POS=(15,21),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  'Lokal-dat',                                            *        
               POS=(15,51),LTH=0009,ATTR=(NUM,PROT)                             
FLD1561  DFLD  POS=(15,61),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Telefon-nummer    ',                                   *        
               POS=(16,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1621  DFLD  POS=(16,21),LTH=0020,ATTR=(ALPHA)                                
         DFLD  'Lokal-tid',                                            *        
               POS=(16,51),LTH=0009,ATTR=(NUM,PROT)                             
FLD1661  DFLD  POS=(16,61),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Telefax-nummer    ',                                   *        
               POS=(17,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1721  DFLD  POS=(17,21),LTH=0020,ATTR=(ALPHA)                                
         DFLD  'Tidzon            ',                                   *        
               POS=(18,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1821  DFLD  POS=(18,21),LTH=0002,ATTR=(NUM)                                  
         DFLD  'Måttkod           ',                                   *        
               POS=(19,02),LTH=0018,ATTR=(NUM,PROT)                             
FLD1921  DFLD  POS=(19,21),LTH=0001,ATTR=(ALPHA)                                
         DFLD  '13 Uppdat user  14 Visa userkö  15 Egen ändring 16 Secu*        
               rity     17 Visa nycklar  8              19             *        
                20              21              10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O51301 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F513,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I51301,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0211,LTH=0008                                                 
         MFLD  FLD0311,LTH=0008                                                 
         MFLD  FLD0621,LTH=0025                                                 
         MFLD  FLD0721,LTH=0005                                                 
         MFLD  FLD0821,LTH=0002                                                 
         MFLD  FLD0921,LTH=0002                                                 
         MFLD  FLD1021,LTH=0002                                                 
         MFLD  FLD1121,LTH=0008                                                 
         MFLD  FLD1221,LTH=0008                                                 
         MFLD  FLD1321,LTH=0002                                                 
         MFLD  FLD1421,LTH=0008                                                 
         MFLD  FLD1521,LTH=0003                                                 
         MFLD  FLD1621,LTH=0020                                                 
         MFLD  FLD1721,LTH=0020                                                 
         MFLD  FLD1821,LTH=0002                                                 
         MFLD  FLD1921,LTH=0001                                                 
         MFLD  FLD1161,LTH=0006                                                 
         MFLD  FLD1261,LTH=0006                                                 
         MFLD  FLD1361,LTH=0008                                                 
         MFLD  FLD1561,LTH=0008                                                 
         MFLD  FLD1661,LTH=0005                                                 
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W0I51301 MSG   TYPE=INPUT,                                             *        
               SOR=W0F513,                                             *        
               OPT=2,                                                  *        
               NXT=W0O51301                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'3'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '05131',LTH=5                                                    
         MFLD  (FLD0211,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0311,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0621,'+++++++++++++++++++++++++'),LTH=0025,FILL=C' '         
         MFLD  (FLD0721,'+++++'),LTH=0005,FILL=C' '                             
         MFLD  (FLD1021,'++'),LTH=0002,FILL=C' '                                
         MFLD  (FLD1121,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD1221,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD1321,'++'),LTH=0002,FILL=C' '                                
         MFLD  (FLD1421,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD1621,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1721,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1821,'++'),LTH=0002,FILL=C'1'                                
         MFLD  (FLD1921,'+'),LTH=0001,FILL=C'S'                                 
         MSGEND                                                                 
         END                                                                    
