***********************************************************************         
* CREATED BY PC40073   ON 99/01/27  AT 14:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LAGERSALDO                      '                               
W0F510   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T510 7',                                           +        
               8='W0T510 8',                                           +        
               9='W0T510 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0F510   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SALDOINFORMATION',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dc',                                                   +        
               POS=(2,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CDC',                                                  +        
               POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
IDDCE    DFLD  POS=(4,26),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCN    DFLD  POS=(4,30),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Ls   Disp    Oks    Ros   Ress   Efrs  Spant Qspant   U+        
               trs    Aks Akspav',                                     +        
               POS=(5,7),LTH=72,                                       +        
               ATTR=(PROT)                                                      
K6RAD    DFLD  POS=(6,2),LTH=77,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Oks-v  Oks-d  Oks-b Prea-v Prea-d Prea-b Prer-d prer-b +        
                Rf-art  Tpo-t Offert',                                 +        
               POS=(7,4),LTH=76,                                       +        
               ATTR=(PROT)                                                      
K9RADA   DFLD  POS=(8,2),LTH=56,                                       +        
               ATTR=(PROT)                                                      
K9RADB   DFLD  POS=(8,61),LTH=12,                                      +        
               ATTR=(PROT)                                                      
K9RADC   DFLD  POS=(8,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'DC',                                                   +        
               POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LS   Disp',                                            +        
               POS=(10,9),LTH=9,                                       +        
               ATTR=(PROT)                                                      
RUBK04   DFLD  POS=(10,20),LTH=5,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
RUBK05   DFLD  POS=(10,27),LTH=5,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
         DFLD  'Ros-d  Ros-b   Ress   Efrs Qspant   Utrs    Aks',      +        
               POS=(10,34),LTH=47,                                     +        
               ATTR=(PROT)                                                      
K7RAD1   DFLD  POS=(11,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
K7RAD2   DFLD  POS=(12,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD3   DFLD  POS=(13,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD4   DFLD  POS=(14,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD5   DFLD  POS=(15,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD6   DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD7   DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD8   DFLD  POS=(18,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD9   DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD10  DFLD  POS=(20,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD11  DFLD  POS=(21,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
K7RAD12  DFLD  POS=(22,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O51001 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F510,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I51001,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0F510                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDDCE,                                                  +        
               LTH=2                                                            
         MFLD  IDDCN,                                                  +        
               LTH=2                                                            
         MFLD  K6RAD,                                                  +        
               LTH=77                                                           
         MFLD  K9RADA,                                                 +        
               LTH=56                                                           
         MFLD  K9RADB,                                                 +        
               LTH=12                                                           
         MFLD  K9RADC,                                                 +        
               LTH=6                                                            
         MFLD  K7RAD1,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD2,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD3,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD4,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD5,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD6,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD7,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD8,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD9,                                                 +        
               LTH=79                                                           
         MFLD  K7RAD10,                                                +        
               LTH=79                                                           
         MFLD  K7RAD11,                                                +        
               LTH=79                                                           
         MFLD  K7RAD12,                                                +        
               LTH=79                                                           
         MFLD  RUBK04,                                                 +        
               LTH=5                                                            
         MFLD  RUBK05,                                                 +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I51001 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F510),                                           +        
               OPT=2,                                                  +        
               NXT=W0O51001                                                     
MID      LPAGE SOR=(W0F510)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '05101',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDCE,                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDCN,                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  RUBK04,                                                 +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  RUBK05,                                                 +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
