*        FORMAT FÖR TEST AV SUBPROGRAM                                          
*                                                                               
         PRINT NOGEN                                                            
W0F508   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','W0T508  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T508 7','W0T508 8','W0T501  ', *        
               'WHELP   ','W0T508U ','/RCL.   ','W0T501  ','W0T502  ', *        
               'W0T503  ','W0T504  ','W0T505  ','W0T506  ','W0T507  ', *        
               'W0T508  ','W0T509  ','WHELP   ','W0T508U ','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         STACK ON                                                               
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,11)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'Test av subprogram',                                   *        
               POS=(01,12),LTH=0018,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT)                             
         DFLD  'Program ',                                             *        
               POS=(02,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD0211  DFLD  POS=(02,11),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Indata ',                                              *        
               POS=(02,20),LTH=0007,ATTR=(NUM,PROT)                             
FLD0228  DFLD  POS=(02,28),LTH=0050,ATTR=(ALPHA)                                
FLD0311  DFLD  POS=(03,11),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0328  DFLD  POS=(03,28),LTH=0050,ATTR=(NUM,PROT,MOD)                         
FLD0502  DFLD  POS=(05,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0602  DFLD  POS=(06,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0702  DFLD  POS=(07,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0802  DFLD  POS=(08,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0902  DFLD  POS=(09,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1002  DFLD  POS=(10,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1102  DFLD  POS=(11,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1202  DFLD  POS=(12,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1302  DFLD  POS=(13,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1402  DFLD  POS=(14,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1502  DFLD  POS=(15,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1602  DFLD  POS=(16,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1702  DFLD  POS=(17,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1802  DFLD  POS=(18,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD1902  DFLD  POS=(19,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         STACK OFF                                                              
         DEV   TYPE=3270-A7,                                           *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','WINFO   ','W0T508  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T508 7','W0T508 8','W0T501  ', *        
               'WHELP   ','W0T508  ','/RCL.   ','W0T501  ','W0T502  ', *        
               'W0T503  ','W0T504  ','W0T505  ','W0T506  ','W0T507  ', *        
               'W0T508  ','W0T509  ','WHELP   ','W0T508  ','/RCL.   '),*        
               DSCA=X'0080',                                           *        
               SYSMSG=FSYSMSG                                                   
         UNSTACK                                                                
         FMTEND                                                                 
         EJECT                                                                  
W0I50801 MSG   TYPE=INPUT,                                             *        
               SOR=W0F508,                                             *        
               OPT=2,                                                  *        
               NXT=W0O50801                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'8'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '05081',LTH=0005                                                 
         MFLD  (FLD0211,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0311,LTH=0008,FILL=C' '                                       
         MFLD  FLD0228,LTH=0050,FILL=C'+'                                       
         MFLD  FLD0328,LTH=0050,FILL=C' '                                       
         MSGEND                                                                 
         EJECT                                                                  
W0O50801 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F508,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I50801,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0211,LTH=0008                                                 
         MFLD  FLD0311,LTH=0008                                                 
         MFLD  FLD0228,LTH=0050                                                 
         MFLD  FLD0328,LTH=0050                                                 
         MFLD  FLD0502,LTH=0079                                                 
         MFLD  FLD0602,LTH=0079                                                 
         MFLD  FLD0702,LTH=0079                                                 
         MFLD  FLD0802,LTH=0079                                                 
         MFLD  FLD0902,LTH=0079                                                 
         MFLD  FLD1002,LTH=0079                                                 
         MFLD  FLD1102,LTH=0079                                                 
         MFLD  FLD1202,LTH=0079                                                 
         MFLD  FLD1302,LTH=0079                                                 
         MFLD  FLD1402,LTH=0079                                                 
         MFLD  FLD1502,LTH=0079                                                 
         MFLD  FLD1602,LTH=0079                                                 
         MFLD  FLD1702,LTH=0079                                                 
         MFLD  FLD1802,LTH=0079                                                 
         MFLD  FLD1902,LTH=0079                                                 
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         END                                                                    
