         TITLE 'KOPIERA/TA BORT DOKUMENT        '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W0F555   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T555U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T551  ',                                          +        
               14='W0T552  ',                                          +        
               15='W0T553  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T555  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T555U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRAN1  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDTRAN2  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRAN3  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRAN4  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOPIERA/TA BORT DOKUMENT',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Typ ',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDOKTYI DFLD  POS=(2,9),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Id',                                                   +        
               POS=(2,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDOKI   DFLD  POS=(2,23),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
IDDOKTYU DFLD  POS=(3,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDOKU   DFLD  POS=(3,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kopiera från:',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Typ ',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDDOKTCI DFLD  POS=(6,7),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Id',                                                   +        
               POS=(6,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDOKCI  DFLD  POS=(6,21),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sida f.o.m',                                           +        
               POS=(6,31),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDSIDCFI DFLD  POS=(6,43),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sida t.o.m',                                           +        
               POS=(6,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDSIDCTI DFLD  POS=(6,60),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDOKTCU DFLD  POS=(7,7),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDDOKCU  DFLD  POS=(7,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDSIDCFU DFLD  POS=(7,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSIDCTU DFLD  POS=(7,60),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kopiera till:',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sida f.o.m',                                           +        
               POS=(9,31),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDSIDKFI DFLD  POS=(9,43),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sida t.o.m',                                           +        
               POS=(9,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDSIDKTI DFLD  POS=(9,60),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDSIDKFU DFLD  POS=(10,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDSIDKTU DFLD  POS=(10,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ta bort sida/or:',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sida f.o.m',                                           +        
               POS=(12,31),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDSIDBFI DFLD  POS=(12,43),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sida t.o.m',                                           +        
               POS=(12,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDSIDBTI DFLD  POS=(12,60),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDSIDBFU DFLD  POS=(13,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDSIDBTU DFLD  POS=(13,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ta bort hela dokumentet J/N:',                         +        
               POS=(15,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLBORT   DFLD  POS=(15,31),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '                                                F10=Whe+        
               lp        F11=Uppdatera ',                              +        
               POS=(21,02),                                            +        
               LTH=0079,                                               +        
               ATTR=(NUM,PROT)                                                  
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0I55501 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F555),                                           +        
               OPT=2,                                                  +        
               NXT=W0O55501                                                     
DGI2     LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRAN1,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRAN2,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRAN3,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRAN4,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '05551',                                                +        
               LTH=5                                                            
         MFLD  (IDDOKTYI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKTYU,                                               +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDOKI,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKU,                                                 +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDOKTCI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKTCU,                                               +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDOKCI,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDOKCU,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDSIDCFI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDCFU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSIDCTI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDCTU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSIDKFI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDKFU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSIDKTI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDKTU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSIDBFI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDBFU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSIDBTI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSIDBTU,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLBORT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0O55501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F555,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I55501,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRAN1,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN2,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN3,                                                +        
               LTH=1                                                            
         MFLD  IDTRAN4,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDOKTYI,                                               +        
               LTH=8                                                            
         MFLD  IDDOKTYU,                                               +        
               LTH=8                                                            
         MFLD  IDDOKI,                                                 +        
               LTH=8                                                            
         MFLD  IDDOKU,                                                 +        
               LTH=8                                                            
         MFLD  IDDOKTCI,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDOKTCU,                                               +        
               LTH=8                                                            
         MFLD  IDDOKCI,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDOKCU,                                                +        
               LTH=8                                                            
         MFLD  IDSIDCFI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDCFU,                                               +        
               LTH=3                                                            
         MFLD  IDSIDCTI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDCTU,                                               +        
               LTH=3                                                            
         MFLD  IDSIDKFI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDKFU,                                               +        
               LTH=3                                                            
         MFLD  IDSIDKTI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDKTU,                                               +        
               LTH=3                                                            
         MFLD  IDSIDBFI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDBFU,                                               +        
               LTH=3                                                            
         MFLD  IDSIDBTI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSIDBTU,                                               +        
               LTH=3                                                            
         MFLD  FLBORT,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
