*          DATA SET W0F606FII0 AT LEVEL 003 AS OF 89/10/24                      
*                                                                               
         PRINT NOGEN                                                            
W0F606   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'WHELP   ','W0T606U ','/RCL.   ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T606U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((05,15)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  '  SOP - AKTIVERING AV BMP',                            *        
               POS=(01,12),LTH=0025,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Process-namn',                                         *        
               POS=(05,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD0515  DFLD  POS=(05,15),LTH=0010,ATTR=(ALPHA)                                
         DFLD  'SOP-funktion',                                         *        
               POS=(06,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD0615  DFLD  POS=(06,15),LTH=0001,ATTR=(ALPHA)                                
         DFLD  'Best. datum ',                                         *        
               POS=(07,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD0715  DFLD  POS=(07,15),LTH=0006,ATTR=(ALPHA)                                
         DFLD  'Symbolvärden',                                         *        
               POS=(08,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD0815  DFLD  POS=(08,15),LTH=0500,ATTR=(ALPHA)                                
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O60601 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F606,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I60601,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0515,LTH=0012,ATTR=YES                                        
         MFLD  FLD0615,LTH=0004,ATTR=YES                                        
         MFLD  FLD0715,LTH=0008,ATTR=YES                                        
         MFLD  FLD0815,LTH=0502,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0I60601 MSG   TYPE=INPUT,                                             *        
               SOR=W0F606,                                             *        
               OPT=2,                                                  *        
               NXT=W0O60601                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'6'                                       
         MFLD  '  ',LTH=002                                                     
         MFLD  '06061',LTH=0005                                                 
         MFLD  (FLD0515,'++++++++++'),LTH=0010,FILL=C' '                        
         MFLD  (FLD0615,'+'),LTH=0001,FILL=C' '                                 
         MFLD  (FLD0715,'+'),LTH=0006,FILL=X'F0'                                
         MFLD  (FLD0815,'+'),LTH=0500,FILL=C' '                                 
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
