*          DATA SET W0F605FII0 AT LEVEL 002 AS OF 86/11/21                      
*                                                                               
         PRINT NOGEN                                                            
W0F605   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T605 7','W0T605 8','W0T501  ', *        
               'WHELP   ','W0T605U ','/RCL.   ','W0T601  ','W0T602  ', *        
               'W0T603  ','W0T604  ','W0T605  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T605U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,10)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'STARTA PACKNINGSRAPPORTERING',                         *        
               POS=(01,11),LTH=0028,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'PROD.NR',                                              *        
               POS=(02,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0210  DFLD  POS=(02,10),LTH=0007,ATTR=(NUM)                                  
         DFLD  'POSTTYP',                                              *        
               POS=(02,19),LTH=0007,ATTR=(NUM,PROT)                             
FLD0227  DFLD  POS=(02,27),LTH=0003,ATTR=(NUM)                                  
         DFLD  'KOLLI',                                                *        
               POS=(02,32),LTH=0005,ATTR=(NUM,PROT)                             
FLD0238  DFLD  POS=(02,38),LTH=0005,ATTR=(NUM)                                  
         DFLD  'STATUS',                                               *        
               POS=(02,45),LTH=0006,ATTR=(NUM,PROT)                             
FLD0252  DFLD  POS=(02,52),LTH=0001,ATTR=(NUM)                                  
FLD0310  DFLD  POS=(03,10),LTH=0007,ATTR=(NUM,PROT,MOD)                         
FLD0327  DFLD  POS=(03,27),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0338  DFLD  POS=(03,38),LTH=0005,ATTR=(NUM,PROT,MOD)                         
FLD0352  DFLD  POS=(03,52),LTH=0001,ATTR=(NUM,PROT,MOD)                         
         DFLD  'TAG BORT/STARTA',                                      *        
               POS=(05,02),LTH=0015,ATTR=(NUM,PROT)                             
FLD0518  DFLD  POS=(05,18),LTH=0003,ATTR=(ALPHA)                                
         DFLD  '(DEL/STA/INS)',                                        *        
               POS=(05,22),LTH=0013,ATTR=(NUM,PROT)                             
         DFLD  'PROD.NR',                                              *        
               POS=(06,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0610  DFLD  POS=(06,10),LTH=0007,ATTR=(NUM,PROT,MOD)                         
         DFLD  'POSTTYP',                                              *        
               POS=(06,19),LTH=0007,ATTR=(NUM,PROT)                             
FLD0627  DFLD  POS=(06,27),LTH=0003,ATTR=(NUM,PROT,MOD)                         
         DFLD  'KOLLI',                                                *        
               POS=(06,32),LTH=0005,ATTR=(NUM,PROT)                             
FLD0638  DFLD  POS=(06,38),LTH=0005,ATTR=(NUM,PROT,MOD)                         
         DFLD  'STATUS',                                               *        
               POS=(06,45),LTH=0006,ATTR=(NUM,PROT)                             
FLD0652  DFLD  POS=(06,52),LTH=0001,ATTR=(NUM,PROT,MOD)                         
         DFLD  'DATALÄNGD',                                            *        
               POS=(06,55),LTH=0009,ATTR=(NUM,PROT)                             
FLD0665  DFLD  POS=(06,65),LTH=0004,ATTR=(NUM,PROT,MOD)                         
FLD0710  DFLD  POS=(07,10),LTH=0007,ATTR=(NUM)                                  
FLD0727  DFLD  POS=(07,27),LTH=0003,ATTR=(NUM)                                  
FLD0738  DFLD  POS=(07,38),LTH=0005,ATTR=(NUM)                                  
FLD0752  DFLD  POS=(07,52),LTH=0001,ATTR=(NUM)                                  
FLD0765  DFLD  POS=(07,65),LTH=0004,ATTR=(NUM)                                  
         DFLD  'DATA:',                                                *        
               POS=(08,02),LTH=0005,ATTR=(NUM,PROT)                             
FLD0902  DFLD  POS=(09,02),LTH=0070,ATTR=(ALPHA,PROT,MOD)                       
FLD1002  DFLD  POS=(10,02),LTH=0070,ATTR=(ALPHA,PROT,MOD)                       
FLD1102  DFLD  POS=(11,02),LTH=0070,ATTR=(ALPHA,PROT,MOD)                       
FLD1202  DFLD  POS=(12,02),LTH=0070,ATTR=(ALPHA,PROT,MOD)                       
FLD1302  DFLD  POS=(13,02),LTH=0070,ATTR=(ALPHA,PROT,MOD)                       
FLD1502  DFLD  POS=(15,02),LTH=0070,ATTR=(ALPHA)                                
FLD1602  DFLD  POS=(16,02),LTH=0070,ATTR=(ALPHA)                                
FLD1702  DFLD  POS=(17,02),LTH=0070,ATTR=(ALPHA)                                
FLD1802  DFLD  POS=(18,02),LTH=0070,ATTR=(ALPHA)                                
FLD1902  DFLD  POS=(19,02),LTH=0070,ATTR=(ALPHA)                                
         DFLD  '13 LISTÅTERSTRT 14 FAKT-BEVAKN  15 FAKT-FLAGGA  16 HÖGL*        
               AGER     17 PACKN-RAPP   18 AKTIVER SOP  19             *        
                20              21              22 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O60501 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F605,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I60501,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0007                                                 
         MFLD  FLD0227,LTH=0002                                                 
         MFLD  FLD0327,LTH=0003                                                 
         MFLD  FLD0238,LTH=0002                                                 
         MFLD  FLD0338,LTH=0005                                                 
         MFLD  FLD0252,LTH=0002                                                 
         MFLD  FLD0352,LTH=0001                                                 
         MFLD  FLD0518,LTH=0004,ATTR=YES                                        
         MFLD  FLD0610,LTH=0007                                                 
         MFLD  FLD0710,LTH=0004,ATTR=YES                                        
         MFLD  FLD0627,LTH=0003                                                 
         MFLD  FLD0727,LTH=0004,ATTR=YES                                        
         MFLD  FLD0638,LTH=0005                                                 
         MFLD  FLD0738,LTH=0004,ATTR=YES                                        
         MFLD  FLD0652,LTH=0001                                                 
         MFLD  FLD0752,LTH=0004,ATTR=YES                                        
         MFLD  FLD0665,LTH=0004                                                 
         MFLD  FLD0765,LTH=0004,ATTR=YES                                        
         MFLD  FLD0902,LTH=0070                                                 
         MFLD  FLD1502,LTH=0072,ATTR=YES                                        
         MFLD  FLD1002,LTH=0070                                                 
         MFLD  FLD1602,LTH=0072,ATTR=YES                                        
         MFLD  FLD1102,LTH=0070                                                 
         MFLD  FLD1702,LTH=0072,ATTR=YES                                        
         MFLD  FLD1202,LTH=0070                                                 
         MFLD  FLD1802,LTH=0072,ATTR=YES                                        
         MFLD  FLD1302,LTH=0070                                                 
         MFLD  FLD1902,LTH=0072,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W0I60501 MSG   TYPE=INPUT,                                             *        
               SOR=W0F605,                                             *        
               OPT=2,                                                  *        
               NXT=W0O60501                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'5'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '06051',LTH=5                                                    
         MFLD  (FLD0210,'+++++++'),LTH=0007,FILL=C'0',JUST=R                    
         MFLD  FLD0310,LTH=0007,FILL=C' '                                       
         MFLD  (FLD0227,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0327,LTH=0003,FILL=C' '                                       
         MFLD  (FLD0238,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         MFLD  FLD0338,LTH=0005,FILL=C' '                                       
         MFLD  (FLD0252,'+'),LTH=0001,FILL=C' '                                 
         MFLD  FLD0352,LTH=0001,FILL=C' '                                       
         MFLD  (FLD0518,'+++'),LTH=0003,FILL=C' '                               
         MFLD  FLD0610,LTH=0007,FILL=C'0'                                       
         MFLD  FLD0627,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0638,LTH=0005,FILL=C'0'                                       
         MFLD  FLD0652,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0665,LTH=0004,FILL=C'0'                                       
         MFLD  (FLD0710,'+++++++'),LTH=0007,FILL=C'0',JUST=R                    
         MFLD  (FLD0727,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0738,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         MFLD  (FLD0752,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MFLD  (FLD0765,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  FLD0902,LTH=0070,FILL=C' '                                       
         MFLD  (FLD1502,'++++++++++++++++++++++++++++++++++++++++++++++*        
               ++++++++++++++++++++++++'),LTH=0070,FILL=C' '                    
         MFLD  FLD1002,LTH=0070,FILL=C' '                                       
         MFLD  (FLD1602,'++++++++++++++++++++++++++++++++++++++++++++++*        
               ++++++++++++++++++++++++'),LTH=0070,FILL=C' '                    
         MFLD  FLD1102,LTH=0070,FILL=C' '                                       
         MFLD  (FLD1702,'++++++++++++++++++++++++++++++++++++++++++++++*        
               ++++++++++++++++++++++++'),LTH=0070,FILL=C' '                    
         MFLD  FLD1202,LTH=0070,FILL=C' '                                       
         MFLD  (FLD1802,'++++++++++++++++++++++++++++++++++++++++++++++*        
               ++++++++++++++++++++++++'),LTH=0070,FILL=C' '                    
         MFLD  FLD1302,LTH=0070,FILL=C' '                                       
         MFLD  (FLD1902,'++++++++++++++++++++++++++++++++++++++++++++++*        
               ++++++++++++++++++++++++'),LTH=0070,FILL=C' '                    
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
