*          DATA SET W0F706FII0 AT LEVEL 008 AS OF 89/05/29                      
*                                                                               
         PRINT NOGEN                                                            
W0F706   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','R05T01  ',*        
               'W0T501  ','W0T501  ','W0T706 7','W0T706 8','W0T501  ', *        
               'WHELP   ','W0T706U ','/RCL.   ','W0T701  ','W0T702  ', *        
               'W0T703  ','W0T704  ','W0T705  ','W0T706  ','W0T707  ', *        
               'W0T708  ','W0T709  ','WHELP   ','W0T706U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,10)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'VISA/TA BORT DATA',                                    *        
               POS=(01,12),LTH=0017,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'RUTIN',                                                *        
               POS=(02,02),LTH=0005,ATTR=(NUM,PROT)                             
FLD0210  DFLD  POS=(02,10),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'JOBB',                                                 *        
               POS=(02,20),LTH=0004,ATTR=(NUM,PROT)                             
FLD0225  DFLD  POS=(02,25),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'KLART',                                                *        
               POS=(02,34),LTH=0005,ATTR=(NUM,PROT)                             
FLD0240  DFLD  POS=(02,40),LTH=0001,ATTR=(ALPHA)                                
FLD0310  DFLD  POS=(03,10),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0325  DFLD  POS=(03,25),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0005,ATTR=(NUM,PROT,MOD,NODISP)                  
         DO    15,SUF=05                                                        
COL02    DFLD  POS=(05,02),LTH=0005,ATTR=(NUM,PROT,MOD,NODISP)                  
COL08    DFLD  POS=(05,08),LTH=0001,ATTR=(ALPHA)                                
COL10    DFLD  POS=(05,10),LTH=0071,ATTR=(ALPHA,PROT)                           
         ENDDO                                                                  
         DFLD  '13 SÄKERHET     14 RUTIN UPPD   15 VISA RUTINER 16 JOBB*        
                UPPD    17 ÄNDRA DATA',                                *        
               POS=(21,02),LTH=0077,ATTR=(NUM,PROT)                             
         DFLD  '18 TA BORT DATA 19 JCL INPUT    20 STATUS JOBB  21 STAR*        
               TA JOBB  10 WHELP',                                     *        
               POS=(22,02),LTH=0072,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O70601 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F706,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I70601,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0008                                                 
         MFLD  FLD0225,LTH=0002                                                 
         MFLD  FLD0325,LTH=0008                                                 
         MFLD  FLD0240,LTH=0001                                                 
         MFLD  FLD0402,LTH=0005                                                 
         DO    15,SUF=05                                                        
         MFLD  COL02,LTH=0005                                                   
         MFLD  COL08,LTH=0001                                                   
         MFLD  COL10,LTH=0071                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O70602 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F706,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I70601,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0008                                                 
         MFLD  FLD0225,LTH=0002                                                 
         MFLD  FLD0325,LTH=0008                                                 
         MFLD  (FLD0240,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0I70601 MSG   TYPE=INPUT,                                             *        
               SOR=W0F706,                                             *        
               OPT=2,                                                  *        
               NXT=W0O70601                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'7'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'6'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '07061',LTH=0005                                                 
         MFLD  (FLD0210,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0310,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0225,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0325,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0240,'+'),LTH=0001,FILL=C' '                                 
         MFLD  (FLD0402,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         DO    15,SUF=05                                                        
         MFLD  (COL02,'+++++'),LTH=0005,FILL=C'0',JUST=R                        
         MFLD  (COL08,' '),LTH=0001                                             
         ENDDO                                                                  
         MSGEND                                                                 
         END                                                                    
