***********************************************************************         
* CREATED BY PC70375   ON 98/02/05  AT 08:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BEARING INFORMATION             '                               
W0N816   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T816  ',                                           +        
               8='W0t816  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T816U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T816U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((02,12)),                                       +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'BEARING INFORMATION',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Display:',                                             +        
               POS=(5,27),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Uppdate:',                                             +        
               POS=(5,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
CMDKOD1  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Bearing description',                                  +        
               POS=(6,6),LTH=19,                                       +        
               ATTR=(PROT)                                                      
BDESC1UT DFLD  POS=(6,27),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BDESC1IN DFLD  POS=(6,45),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
BDESC2UT DFLD  POS=(7,27),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BDESC2IN DFLD  POS=(7,45),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
CMDKOD2  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier name',                                        +        
               POS=(8,6),LTH=13,                                       +        
               ATTR=(PROT)                                                      
SUPPL1UT DFLD  POS=(8,27),LTH=11,                                      +        
               ATTR=(PROT)                                                      
SUPPL1IN DFLD  POS=(8,45),LTH=11,                                      +        
               ATTR=(NOPROT)                                                    
SUPPL2UT DFLD  POS=(9,27),LTH=10,                                      +        
               ATTR=(PROT)                                                      
SUPPL2IN DFLD  POS=(9,45),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
CMDKOD3  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Inside diameter',                                      +        
               POS=(10,6),LTH=15,                                      +        
               ATTR=(PROT)                                                      
INDIAUT  DFLD  POS=(10,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INDIAIN  DFLD  POS=(10,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMDKOD4  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Outer diameter',                                       +        
               POS=(11,6),LTH=14,                                      +        
               ATTR=(PROT)                                                      
OUTDIAUT DFLD  POS=(11,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
OUTDIAIN DFLD  POS=(11,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMDKOD5  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Delivery identity',                                    +        
               POS=(12,6),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DELID1UT DFLD  POS=(12,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DELID1IN DFLD  POS=(12,45),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DELID2UT DFLD  POS=(13,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DELID2IN DFLD  POS=(13,45),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
CMDKOD6  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Statistical No.',                                      +        
               POS=(14,6),LTH=15,                                      +        
               ATTR=(PROT)                                                      
STATNOUT DFLD  POS=(14,27),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATNOIN DFLD  POS=(14,45),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMDKOD7  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Weight (kg)',                                          +        
               POS=(15,6),LTH=11,                                      +        
               ATTR=(PROT)                                                      
WEIGHTUT DFLD  POS=(15,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEIGHTIN DFLD  POS=(15,45),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMDKOD8  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Country of origin',                                    +        
               POS=(16,6),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COUNTRUT DFLD  POS=(16,27),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COUNTRIN DFLD  POS=(16,45),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cancellation',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
CANCELFL DFLD  POS=(18,15),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O816N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0N816,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I816N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  BDESC1UT,                                               +        
               LTH=15                                                           
         MFLD  BDESC2UT,                                               +        
               LTH=15                                                           
         MFLD  SUPPL1UT,                                               +        
               LTH=11                                                           
         MFLD  SUPPL2UT,                                               +        
               LTH=10                                                           
         MFLD  INDIAUT,                                                +        
               LTH=6                                                            
         MFLD  OUTDIAUT,                                               +        
               LTH=6                                                            
         MFLD  DELID1UT,                                               +        
               LTH=8                                                            
         MFLD  DELID2UT,                                               +        
               LTH=8                                                            
         MFLD  STATNOUT,                                               +        
               LTH=9                                                            
         MFLD  WEIGHTUT,                                               +        
               LTH=8                                                            
         MFLD  COUNTRUT,                                               +        
               LTH=2                                                            
         MFLD  CMDKOD1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BDESC1IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BDESC2IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUPPL1IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUPPL2IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INDIAIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OUTDIAIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DELID1IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DELID2IN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATNOIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WEIGHTIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDKOD8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COUNTRIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CANCELFL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I816N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0N816),                                           +        
               OPT=2,                                                  +        
               NXT=W0O816N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '08162',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMDKOD1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BDESC1IN,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BDESC2IN,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMDKOD2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SUPPL1IN,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SUPPL2IN,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMDKOD3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INDIAIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMDKOD4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OUTDIAIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMDKOD5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DELID1IN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DELID2IN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDKOD6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATNOIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMDKOD7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (WEIGHTIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMDKOD8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COUNTRIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CANCELFL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
