*          DATA SET W0F811FII0 AT LEVEL 003 AS OF 89/10/26                      
*                                                                               
         PRINT NOGEN                                                            
W0F811   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T811 7','W0T811 8','W0T501  ', *        
               'WHELP   ','W0T811U ','/RCL.   ','W0T811  ','W0T812  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,08)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'UPPD. AV RESTORDERSTYRNING',                           *        
               POS=(01,12),LTH=0026,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Prio',                                                 *        
               POS=(02,02),LTH=0004,ATTR=(NUM,PROT)                             
FLD0208  DFLD  POS=(02,08),LTH=0003,ATTR=(NUM)                                  
         DFLD  'Borttag',                                              *        
               POS=(02,13),LTH=0007,ATTR=(NUM,PROT)                             
FLD0222  DFLD  POS=(02,22),LTH=0001,ATTR=(ALPHA)                                
FLD0308  DFLD  POS=(03,08),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0322  DFLD  POS=(03,22),LTH=0001,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0405  DFLD  POS=(04,05),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0408  DFLD  POS=(04,08),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0414  DFLD  POS=(04,14),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0420  DFLD  POS=(04,20),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0423  DFLD  POS=(04,23),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0426  DFLD  POS=(04,26),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0432  DFLD  POS=(04,32),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Benämning',                                            *        
               POS=(05,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0517  DFLD  POS=(05,17),LTH=0010,ATTR=(ALPHA)                                
         DFLD  'Fördeln.%',                                            *        
               POS=(05,31),LTH=0009,ATTR=(NUM,PROT)                             
FLD0543  DFLD  POS=(05,43),LTH=0003,ATTR=(NUM)                                  
         DFLD  'Prioriterad',                                          *        
               POS=(05,51),LTH=0011,ATTR=(NUM,PROT)                             
FLD0564  DFLD  POS=(05,64),LTH=0001,ATTR=(ALPHA)                                
         DFLD  'Äldst(veckor)',                                        *        
               POS=(06,02),LTH=0013,ATTR=(NUM,PROT)                             
FLD0617  DFLD  POS=(06,17),LTH=0002,ATTR=(NUM)                                  
         DFLD  'Konst(levb)',                                          *        
               POS=(06,31),LTH=0011,ATTR=(NUM,PROT)                             
FLD0643  DFLD  POS=(06,43),LTH=0004,ATTR=(NUM)                                  
         DFLD  'Kod  Ordertyp  Orderklass  Dist-fom  Dist-tom',        *        
               POS=(08,02),LTH=0045,ATTR=(NUM,PROT)                             
         DO    11,SUF=09                                                        
COL03    DFLD  POS=(09,03),LTH=0001,ATTR=(ALPHA)                                
COL10    DFLD  POS=(09,10),LTH=0001,ATTR=(NUM)                                  
COL20    DFLD  POS=(09,20),LTH=0001,ATTR=(NUM)                                  
COL31    DFLD  POS=(09,31),LTH=0004,ATTR=(NUM)                                  
COL41    DFLD  POS=(09,41),LTH=0004,ATTR=(NUM)                                  
COL51    DFLD  POS=(09,51),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
COL54    DFLD  POS=(09,54),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
COL57    DFLD  POS=(09,57),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
COL63    DFLD  POS=(09,63),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
         ENDDO                                                                  
         DFLD  '13 UPPD. STYRN.14 FRÅGA STYRN.  15             16      *        
                        17              18             19              *        
                20             21               10 WHELP    ',         *        
               POS=(21,02),LTH=0156,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O81101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F811,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I81101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0208,LTH=0003                                                 
         MFLD  FLD0308,LTH=0003                                                 
         MFLD  FLD0222,LTH=0001                                                 
         MFLD  FLD0322,LTH=0001                                                 
         MFLD  FLD0402,LTH=0001                                                 
         MFLD  FLD0405,LTH=0001                                                 
         MFLD  FLD0408,LTH=0004                                                 
         MFLD  FLD0414,LTH=0004                                                 
         MFLD  FLD0420,LTH=0001                                                 
         MFLD  FLD0423,LTH=0001                                                 
         MFLD  FLD0426,LTH=0004                                                 
         MFLD  FLD0432,LTH=0004                                                 
         MFLD  FLD0517,LTH=0012,ATTR=YES                                        
         MFLD  FLD0543,LTH=0005,ATTR=YES                                        
         MFLD  FLD0564,LTH=0003,ATTR=YES                                        
         MFLD  FLD0617,LTH=0004,ATTR=YES                                        
         MFLD  FLD0643,LTH=0006,ATTR=YES                                        
         DO    11,SUF=09                                                        
         MFLD  COL03,LTH=0003,ATTR=YES                                          
         MFLD  COL10,LTH=0003,ATTR=YES                                          
         MFLD  COL20,LTH=0003,ATTR=YES                                          
         MFLD  COL31,LTH=0006,ATTR=YES                                          
         MFLD  COL41,LTH=0006,ATTR=YES                                          
         MFLD  COL51,LTH=0001                                                   
         MFLD  COL54,LTH=0001                                                   
         MFLD  COL57,LTH=0004                                                   
         MFLD  COL63,LTH=0004                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0I81101 MSG   TYPE=INPUT,                                             *        
               SOR=W0F811,                                             *        
               OPT=2,                                                  *        
               NXT=W0O81101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'8'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '08111',LTH=5                                                    
         MFLD  (FLD0208,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0308,LTH=0003,FILL=C' ',JUST=R                                
         MFLD  (FLD0222,'+'),LTH=0001,FILL=C' '                                 
         MFLD  FLD0322,LTH=0001,FILL=C' '                                       
         MFLD  FLD0402,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0405,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0408,LTH=0004,FILL=C'0'                                       
         MFLD  FLD0414,LTH=0004,FILL=C'0'                                       
         MFLD  FLD0420,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0423,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0426,LTH=0004,FILL=C'0'                                       
         MFLD  FLD0432,LTH=0004,FILL=C'0'                                       
         MFLD  (FLD0517,'++++++++++'),LTH=0010,FILL=C' '                        
         MFLD  (FLD0543,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0564,'+'),LTH=0001,FILL=C' '                                 
         MFLD  (FLD0617,'++'),LTH=0002,FILL=C'0',JUST=R                         
         MFLD  (FLD0643,'++++'),LTH=0004,FILL=C' '                              
         DO    11,SUF=09                                                        
         MFLD  (COL03,'+'),LTH=0001,FILL=C' '                                   
         MFLD  (COL10,'+'),LTH=0001,FILL=C'0'                                   
         MFLD  (COL20,'+'),LTH=0001,FILL=C'0'                                   
         MFLD  (COL31,'++++'),LTH=0004,FILL=C'0',JUST=R                         
         MFLD  (COL41,'++++'),LTH=0004,FILL=C'0',JUST=R                         
         MFLD  (COL51,'0'),LTH=0001,FILL=C'0'                                   
         MFLD  (COL54,'0'),LTH=0001,FILL=C'0'                                   
         MFLD  (COL57,'0000'),LTH=0004,FILL=C'0',JUST=R                         
         MFLD  (COL63,'0000'),LTH=0004,FILL=C'0',JUST=R                         
         ENDDO                                                                  
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
