***********************************************************************         
* CREATED BY R035324   ON 91/11/21  AT 09:22                                    
***********************************************************************         
         TITLE 'RANSONERINGSTABELLER            '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W0F814   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T814 7',                                           +        
               8='W0T814 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T814U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T814  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,18)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ransoneringstabeller',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Ransoneringskod',                                      +        
               POS=(2,2),LTH=15,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDRFTABN DFLD  POS=(2,18),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
KDRFTAB  DFLD  POS=(3,18),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Aktuella ransoneringsfaktorer',                        +        
               POS=(5,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
BERFTAB  DFLD  POS=(5,32),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(5,58),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Fom-Tom',                                              +        
               POS=(7,15),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fom-Tom',                                              +        
               POS=(7,28),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fom-Tom',                                              +        
               POS=(7,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fom-Tom',                                              +        
               POS=(7,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fom-Tom',                                              +        
               POS=(7,67),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Klass 1',                                              +        
               POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
RERF11F  DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,18),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
RERF11T  DFLD  POS=(9,20),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
RERF12F  DFLD  POS=(9,26),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,31),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
RERF12T  DFLD  POS=(9,33),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
RERF13F  DFLD  POS=(9,39),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,44),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
RERF13T  DFLD  POS=(9,46),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
RERF14F  DFLD  POS=(9,52),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,57),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
RERF14T  DFLD  POS=(9,59),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
RERF15F  DFLD  POS=(9,65),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,70),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
RERF15T  DFLD  POS=(9,72),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ny RF',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RERF11N  DFLD  POS=(10,16),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF12N  DFLD  POS=(10,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF13N  DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF14N  DFLD  POS=(10,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF15N  DFLD  POS=(10,68),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Klass 2',                                              +        
               POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RERF21F  DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,18),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF21T  DFLD  POS=(11,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF22F  DFLD  POS=(11,26),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,31),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF22T  DFLD  POS=(11,33),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF23F  DFLD  POS=(11,39),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,44),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF23T  DFLD  POS=(11,46),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF24F  DFLD  POS=(11,52),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,57),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF24T  DFLD  POS=(11,59),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF25F  DFLD  POS=(11,65),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,70),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF25T  DFLD  POS=(11,72),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ny RF',                                                +        
               POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RERF21N  DFLD  POS=(12,16),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF22N  DFLD  POS=(12,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF23N  DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF24N  DFLD  POS=(12,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF25N  DFLD  POS=(12,68),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Klass 3',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RERF31F  DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,18),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF31T  DFLD  POS=(13,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF32F  DFLD  POS=(13,26),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(13,31),LTH=1,                                      +        
               ATTR=(ALPHA,PROT)                                                
RERF32T  DFLD  POS=(13,33),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF33F  DFLD  POS=(13,39),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,44),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF33T  DFLD  POS=(13,46),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF34F  DFLD  POS=(13,52),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,57),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF34T  DFLD  POS=(13,59),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF35F  DFLD  POS=(13,65),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,70),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF35T  DFLD  POS=(13,72),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ny RF',                                                +        
               POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RERF31N  DFLD  POS=(14,16),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF32N  DFLD  POS=(14,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF33N  DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF34N  DFLD  POS=(14,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF35N  DFLD  POS=(14,68),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Klass 4',                                              +        
               POS=(15,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RERF41F  DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,18),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF41T  DFLD  POS=(15,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF42F  DFLD  POS=(15,26),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,31),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF42T  DFLD  POS=(15,33),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF43F  DFLD  POS=(15,39),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,44),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF43T  DFLD  POS=(15,46),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF44F  DFLD  POS=(15,52),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,57),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF44T  DFLD  POS=(15,59),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF45F  DFLD  POS=(15,65),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,70),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF45T  DFLD  POS=(15,72),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ny RF',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RERF41N  DFLD  POS=(16,16),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF42N  DFLD  POS=(16,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF43N  DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF44N  DFLD  POS=(16,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF45N  DFLD  POS=(16,68),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TPO',                                                  +        
               POS=(17,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RERF51F  DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,18),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF51T  DFLD  POS=(17,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF52F  DFLD  POS=(17,26),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,31),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF52T  DFLD  POS=(17,33),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF53F  DFLD  POS=(17,39),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,44),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF53T  DFLD  POS=(17,46),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF54F  DFLD  POS=(17,52),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,57),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF54T  DFLD  POS=(17,59),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF55F  DFLD  POS=(17,65),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,70),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
RERF55T  DFLD  POS=(17,72),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ny RF',                                                +        
               POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RERF51N  DFLD  POS=(18,16),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF52N  DFLD  POS=(18,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF53N  DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF54N  DFLD  POS=(18,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RERF55N  DFLD  POS=(18,68),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Rans tabeller 17',                                  +        
               POS=(21,49),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W0I81401 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F814),                                           +        
               OPT=2,                                                  +        
               NXT=W0O81401                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '08141',                                                +        
               LTH=5                                                            
         MFLD  (KDRFTABN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  KDRFTAB,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BERFTAB,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RERF11F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF11T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF11N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF12F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF12T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF12N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF13F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF13T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF13N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF14F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF14T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF14N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF15F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF15T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF15N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF21F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF21T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF21N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF22F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF22T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF22N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF23F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF23T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF23N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF24F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF24T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF24N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF25F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF25T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF25N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF31F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF31T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF31N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF32F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF32T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF32N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF33F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF33T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF33N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF34F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF34T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF34N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF35F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF35T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF35N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF41F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF41T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF41N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF42F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF42T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF42N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF43F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF43T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF43N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF44F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF44T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF44N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF45F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF45T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF45N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF51F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF51T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF51N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF52F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF52T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF52N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF53F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF53T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF53N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF54F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF54T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF54N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF55F,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF55T,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RERF55N,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W0O81401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F814,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I81401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KDRFTABN,                                               +        
               LTH=3                                                            
         MFLD  KDRFTAB,                                                +        
               LTH=3                                                            
         MFLD  BERFTAB,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RERF11F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF11T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF11N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF12F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF12T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF12N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF13F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF13T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF13N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF14F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF14T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF14N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF15F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF15T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF15N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF21F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF21T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF21N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF22F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF22T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF22N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF23F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF23T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF23N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF24F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF24T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF24N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF25F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF25T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF25N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF31F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF31T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF31N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF32F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF32T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF32N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF33F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF33T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF33N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF34F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF34T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF34N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF35F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF35T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF35N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF41F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF41T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF41N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF42F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF42T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF42N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF43F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF43T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF43N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF44F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF44T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF44N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF45F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF45T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF45N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF51F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF51T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF51N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF52F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF52T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF52N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF53F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF53T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF53N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF54F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF54T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF54N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF55F,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF55T,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RERF55N,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
