***********************************************************************         
* CREATED BY R038450   ON 91/11/22  AT 17:13                                    
***********************************************************************         
         TITLE 'ORDERBEKRÄFTELSETEXTER          '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W0F813   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T813 7',                                           +        
               2='W0T501  ',                                           +        
               3='W0T813 3',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T813 7',                                           +        
               9='W0T501  ',                                           +        
               10='W0T501  ',                                          +        
               11='W0T813U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T813  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Orderbekräftelsetexter',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Obekr kod',                                            +        
               POS=(2,4),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KDORDBEI DFLD  POS=(2,14),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,17),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Vill du ta bort obekr koden? (J/N)',                   +        
               POS=(2,32),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLJANEJ  DFLD  POS=(2,69),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(2,71),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDSYSTEM DFLD  POS=(3,02),LTH=4,                                       +        
               ATTR=(PROT,MOD,NODISP)                                           
KDORDBEU DFLD  POS=(3,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Språk   Text',                                         +        
               POS=(6,3),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S',                                                    +        
               POS=(8,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
TEORDBEK DFLD  POS=(8,11),LTH=70,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'GB',                                                   +        
               POS=(9,3),LTH=2,                                        +        
               ATTR=(PROT)                                                      
TEORDBE1 DFLD  POS=(9,11),LTH=70,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'USA',                                                  +        
               POS=(10,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TEORDBE2 DFLD  POS=(10,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'E',                                                    +        
               POS=(11,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEORDBE3 DFLD  POS=(11,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F',                                                    +        
               POS=(12,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEORDBE4 DFLD  POS=(12,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'I',                                                    +        
               POS=(13,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEORDBE5 DFLD  POS=(13,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'P',                                                    +        
               POS=(14,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEORDBE6 DFLD  POS=(14,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'NL',                                                   +        
               POS=(15,3),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TEORDBE7 DFLD  POS=(15,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'SF',                                                   +        
               POS=(16,3),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TEORDBE8 DFLD  POS=(16,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'D',                                                    +        
               POS=(17,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEORDBE9 DFLD  POS=(17,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(18,2),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'PF3 Retur',                                            +        
               POS=(20,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(22,58)                                              
FLD2364  DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W0I81301 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F813),                                           +        
               OPT=2,                                                  +        
               NXT=W0O81301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '08131',                                                +        
               LTH=5                                                            
         MFLD  (KDORDBEI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLJANEJ,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDORDBEU,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (TEORDBEK,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE4,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE5,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE6,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE7,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE8,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (TEORDBE9,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (IDSYSTEM,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MSGEND                                                                 
W0O81301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F813,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I81301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KDORDBEI,                                               +        
               LTH=2                                                            
         MFLD  FLJANEJ,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDBEU,                                               +        
               LTH=2                                                            
         MFLD  TEORDBEK,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE1,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE2,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE3,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE4,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE5,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE6,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE7,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE8,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEORDBE9,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDSYSTEM,                                               +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
