***********************************************************************         
* CREATED BY PC40073   ON 97/05/14  AT 13:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DATAREGISTRERING ANSKAFFNING    '                               
W0F832   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T832 7',                                           +        
               8='W0T832 8',                                           +        
               9='W0T832 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T832  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T832  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0F832   DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DATAREGISTRERING ANSKAFFNING',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
DGIA0000 DFLD  POS=(5,2),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'R22  Beställning',                                     +        
               POS=(7,5),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'R23  Avtal',                                           +        
               POS=(8,5),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Välj transtyp med s  tryck pf 9',                      +        
               POS=(17,5),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tillbaka till WHELP  tryck pf 10',                     +        
               POS=(18,5),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O83201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0F832,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I83201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0F832                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I83201 MSG   TYPE=INPUT,                                             +        
               SOR=(W0F832),                                           +        
               OPT=2,                                                  +        
               NXT=W0O83201                                                     
MID      LPAGE SOR=(W0F832)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '08321',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'R01',                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'R17',                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'R22',                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'R23',                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
