*          DATA SET W0F809FII0 AT LEVEL 003 AS OF 88/02/19                      
         PRINT NOGEN                                                            
W0F809   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T801  ','W0T802  ','W0T803  ','W0T804  ',*        
               'W0T501  ','W0T501  ','W0T807  ','W0T808  ','W0T809  ', *        
               'WHELP   ','W0T809U ','/RCL.   ','W0T801  ','W0T802  ', *        
               'W0T803  ','W0T804  ','W0T501  ','W0T501  ','W0T807  ', *        
               'W0T808  ','W0T809  ','WHELP   ','W0T809U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,14)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'TEXTUPPDATERING  LEV.VILLKOR',                         *        
               POS=(01,10),LTH=0028,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'LEVVILLKOR',                                           *        
               POS=(02,02),LTH=0010,ATTR=(NUM,PROT)                             
FLD0214  DFLD  POS=(02,14),LTH=0001,ATTR=NUM                                    
         DFLD  'UPPDATERA?',                                           *        
               POS=(02,27),LTH=0010,ATTR=(NUM,PROT)                             
FLD0238  DFLD  POS=(02,38),LTH=0001,ATTR=(ALPHA,MOD)                            
         DFLD  '(Ä,N,B)',                                              *        
               POS=(02,42),LTH=0007,ATTR=(NUM,PROT)                             
FLD0315  DFLD  POS=(03,15),LTH=0001,ATTR=(NUM,PROT,MOD)                         
FLD0339  DFLD  POS=(03,39),LTH=0001,ATTR=(NUM,PROT,MOD)                         
         DFLD  'LEV.VILLKORS TEXT',                                    *        
               POS=(05,02),LTH=0017,ATTR=(NUM,PROT)                             
FLD0702  DFLD  POS=(07,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'SVE',                                                  *        
               POS=(07,40),LTH=0003,ATTR=(NUM,PROT)                             
FLD0902  DFLD  POS=(09,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'ENG',                                                  *        
               POS=(09,40),LTH=0003,ATTR=(NUM,PROT)                             
FLD1102  DFLD  POS=(11,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'FRA',                                                  *        
               POS=(11,40),LTH=0003,ATTR=(NUM,PROT)                             
FLD1302  DFLD  POS=(13,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'SPA',                                                  *        
               POS=(13,40),LTH=0003,ATTR=(NUM,PROT)                             
FLD1502  DFLD  POS=(15,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'TYS',                                                  *        
               POS=(15,40),LTH=0003,ATTR=(NUM,PROT)                             
FLD1702  DFLD  POS=(17,02),LTH=0035,ATTR=ALPHA                                  
         DFLD  'ITA',                                                  *        
               POS=(17,40),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  '1 PERSONKODER   2 DISTR/PERSKOD 3 FÖRSÄKR.TEXT  4 FRAKT*        
               TEXT     5               6               7 EMBALLAGETYP *        
                8 LASTBÄRARTYP  9 LEV.VILLKOR   10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O80901 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0F809,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I80901,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0214,LTH=0001                                                 
         MFLD  FLD0238,LTH=0001                                                 
         MFLD  FLD0315,LTH=0001                                                 
         MFLD  FLD0339,LTH=0001                                                 
         MFLD  FLD0702,LTH=0037,ATTR=YES                                        
         MFLD  FLD0902,LTH=0037,ATTR=YES                                        
         MFLD  FLD1102,LTH=0037,ATTR=YES                                        
         MFLD  FLD1302,LTH=0037,ATTR=YES                                        
         MFLD  FLD1502,LTH=0037,ATTR=YES                                        
         MFLD  FLD1702,LTH=0037,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W0I80901 MSG   TYPE=INPUT,                                             *        
               SOR=W0F809,                                             *        
               OPT=2,                                                  *        
               NXT=W0O80901                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'8'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'9'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '08091',LTH=5                                                    
         MFLD  (FLD0214,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MFLD  FLD0315,LTH=0001,FILL=C'0'                                       
         MFLD  (FLD0238,'+'),LTH=0001                                           
         MFLD  FLD0339,LTH=0001,FILL=C' '                                       
         MFLD  (FLD0702,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MFLD  (FLD0902,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MFLD  (FLD1102,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MFLD  (FLD1302,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MFLD  (FLD1502,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MFLD  (FLD1702,'+++++++++++++++++++++++++++++++++++'),        *        
               LTH=0035,FILL=C' '                                               
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
