***********************************************************************         
* CREATED BY R030186   ON 91/10/21  AT 08:19                                    
***********************************************************************         
         TITLE 'DATAREG ANSKAFFNING R85         '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W0FR85   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T832 7',                                           +        
               8='W0T832 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T832U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0FR85   DPAGE CURSOR=((7,31)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DATAREGISTRERING ANSKAFFNING',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'R85   JUSTERA ORDERINGÅNG',                            +        
               POS=(5,10),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artikelnummer',                                        +        
               POS=(7,10),LTH=13,                                      +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(7,31),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Tecken',                                               +        
               POS=(9,10),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDBEHX   DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'p = plus   m = minus',                                 +        
               POS=(9,40),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Orderingångstyp',                                      +        
               POS=(10,10),LTH=15,                                     +        
               ATTR=(PROT)                                                      
KDOI     DFLD  POS=(10,31),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '11 = progn påv C1  21 = progn påv C2',                 +        
               POS=(10,40),LTH=36,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 = diverse C1    23 = diverse C2',                   +        
               POS=(11,40),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '14 = sats C1',                                         +        
               POS=(12,40),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '24 = sats C2',                                         +        
               POS=(12,59),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Avbokningsperiod',                                     +        
               POS=(13,10),LTH=16,                                     +        
               ATTR=(PROT)                                                      
TIAAP1   DFLD  POS=(13,31),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ÅÅP',                                                  +        
               POS=(13,40),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Antal att justera',                                    +        
               POS=(14,10),LTH=17,                                     +        
               ATTR=(PROT)                                                      
KVOI     DFLD  POS=(14,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'För uppdatering  tryck pf 11',                         +        
               POS=(17,10),LTH=28,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Åter till registreringsmeny  tryck pf 7',              +        
               POS=(18,10),LTH=39,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '05',                                                   +        
               POS=(21,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0OR8501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0FR85,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0IR8501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0FR85                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNR,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDBEHX,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDOI,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAAP1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVOI,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0IR8501 MSG   TYPE=INPUT,                                             +        
               SOR=(W0FR85),                                           +        
               OPT=2,                                                  +        
               NXT=W0OR8501                                                     
MID      LPAGE SOR=(W0FR85)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '083B1',                                                +        
               LTH=5                                                            
         MFLD  'R85',                                                  +        
               LTH=3                                                            
         MFLD  (IDARTNR,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBEHX,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDOI,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAAP1,                                                +        
               '+++++'),                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVOI,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
