*        WEB RESPONSE TIME LOG                                                  
*                                                                               
*                                                                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W0N521   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T521 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T521 6',                                           +        
               7='W0T521 7',                                           +        
               8='W0T521 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,05)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'WEB RESPONSE TIME LOG',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(ALPHA,PROT)                                                
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(ALPHA,PROT,HI)                                             
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Date',                                                 +        
               POS=(2,8),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
REGDATIN DFLD  POS=(2,13),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Time',                                                 +        
               POS=(2,20),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
REGTIDIN DFLD  POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'User id',                                              +        
               POS=(2,32),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDUSERIN DFLD  POS=(2,40),LTH=8,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Sort resp',                                            +        
               POS=(2,49),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'time',                                                 +        
               POS=(3,54),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLSORTIN DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Link',                                                 +        
               POS=(2,61),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
LINKIN   DFLD  POS=(2,66),LTH=15,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
REGDATUT DFLD  POS=(3,13),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
REGTIDUT DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDUSERUT DFLD  POS=(3,40),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLSORTUT DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
LINKUT   DFLD  POS=(3,66),LTH=15,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'DC',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Date',                                                 +        
               POS=(5,5),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Time',                                                 +        
               POS=(5,12),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'User id',                                              +        
               POS=(5,19),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Resp',                                                 +        
               POS=(4,28),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'time',                                                 +        
               POS=(5,28),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Link',                                                 +        
               POS=(5,35),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Url',                                                  +        
               POS=(5,61),LTH=3,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DO    14                                                               
DC       DFLD  POS=(06,02),LTH=0002,ATTR=(ALPHA,PROT)                           
REGDAT   DFLD  POS=(06,05),LTH=0006,ATTR=(NUM,PROT)                             
REGTID   DFLD  POS=(06,12),LTH=0006,ATTR=(NUM,PROT)                             
USER     DFLD  POS=(06,19),LTH=0008,ATTR=(ALPHA,PROT)                           
MILSEC   DFLD  POS=(06,28),LTH=0006,ATTR=(NUM,PROT)                             
WEBSCR   DFLD  POS=(06,35),LTH=0025,ATTR=(ALPHA,PROT)                           
WEBURL   DFLD  POS=(06,61),LTH=0020,ATTR=(ALPHA,PROT)                           
         ENDDO                                                                  
         DFLD  'AVERAGE RESPONSE TIME',                                +        
               POS=(20,2),                                             +        
               LTH=21,                                                 +        
               ATTR=(ALPHA,PROT)                                                
AVGRETI  DFLD  POS=(20,24),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F4=LATEST  F6=PREVIOUS  F7=FIRST  F8=NEXT  F10=WHELP', +        
               POS=(21,02),                                            +        
               LTH=52,                                                 +        
               ATTR=(ALPHA,PROT)                                                
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(ALPHA,PROT,HI)                                             
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(ALPHA,PROT,HI)                                             
         FMTEND                                                                 
W0O521N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0N521,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I521N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  REGDATIN,                                               +        
               LTH=6                                                            
         MFLD  REGTIDIN,                                               +        
               LTH=6                                                            
         MFLD  IDUSERIN,                                               +        
               LTH=8                                                            
         MFLD  FLSORTIN,                                               +        
               LTH=1                                                            
         MFLD  LINKIN,                                                 +        
               LTH=15                                                           
         MFLD  LINKDM,                                                 +        
               LTH=35                                                           
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  REGDATUT,                                               +        
               LTH=6                                                            
         MFLD  REGTIDUT,                                               +        
               LTH=6                                                            
         MFLD  IDUSERUT,                                               +        
               LTH=8                                                            
         MFLD  FLSORTUT,                                               +        
               LTH=1                                                            
         MFLD  LINKUT,                                                 +        
               LTH=15                                                           
         MFLD  LINKDY,                                                 +        
               LTH=35                                                           
         DO 14                                                                  
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  REGDAT,                                                 +        
               LTH=6                                                            
         MFLD  REGTID,                                                 +        
               LTH=6                                                            
         MFLD  USER,                                                   +        
               LTH=8                                                            
         MFLD  MILSEC,                                                 +        
               LTH=6                                                            
         MFLD  WEBSCR,                                                 +        
               LTH=25                                                           
         MFLD  WEBSCD,                                                 +        
               LTH=25                                                           
         MFLD  WEBURL,                                                 +        
               LTH=20                                                           
         MFLD  WEBURD,                                                 +        
               LTH=30                                                           
         ENDDO                                                                  
         MFLD  AVGRETI,                                                +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I521N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0N521),                                           +        
               OPT=2,                                                  +        
               NXT=W0O521N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '05212',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (REGDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (REGTIDIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDUSERIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLSORTIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LINKIN,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LINKDM,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
