***********************************************************************         
* CREATED BY PC35324   ON 94/12/21  AT 15:37                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ÄNDRING BATCH/ONLINE            '                               
W0N603   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T603U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T603 7',                                           +        
               8='W0T603 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T603U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T601  ',                                          +        
               14='W0T602  ',                                          +        
               15='W0T603  ',                                          +        
               16='W0T604  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T603U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((6,33)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CHANGE BATCH/ONLINE FLA',                              +        
               POS=(1,14),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr Cust-n  DC Ship-NO Batch',                       +        
               POS=(5,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ready    FK KL   Q-cases   Ord-value',                 +        
               POS=(5,37),LTH=36,                                      +        
               ATTR=(PROT)                                                      
COL0306  DFLD  POS=(6,3),LTH=23,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2706  DFLD  POS=(6,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3206  DFLD  POS=(6,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3706  DFLD  POS=(6,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4106  DFLD  POS=(6,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4506  DFLD  POS=(6,46),LTH=27,                                      +        
               ATTR=(PROT)                                                      
COL0307  DFLD  POS=(7,3),LTH=23,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2707  DFLD  POS=(7,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3207  DFLD  POS=(7,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3707  DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4107  DFLD  POS=(7,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4507  DFLD  POS=(7,46),LTH=27,                                      +        
               ATTR=(PROT)                                                      
COL0308  DFLD  POS=(8,3),LTH=23,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2708  DFLD  POS=(8,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3208  DFLD  POS=(8,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3708  DFLD  POS=(8,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4108  DFLD  POS=(8,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4508  DFLD  POS=(8,46),LTH=27,                                      +        
               ATTR=(PROT)                                                      
COL0309  DFLD  POS=(9,3),LTH=23,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2709  DFLD  POS=(9,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3209  DFLD  POS=(9,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL3709  DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4109  DFLD  POS=(9,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL4509  DFLD  POS=(9,46),LTH=27,                                      +        
               ATTR=(PROT)                                                      
COL0310  DFLD  POS=(10,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2710  DFLD  POS=(10,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3210  DFLD  POS=(10,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3710  DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4110  DFLD  POS=(10,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4510  DFLD  POS=(10,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0311  DFLD  POS=(11,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2711  DFLD  POS=(11,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3211  DFLD  POS=(11,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3711  DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4111  DFLD  POS=(11,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4511  DFLD  POS=(11,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0312  DFLD  POS=(12,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2712  DFLD  POS=(12,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3212  DFLD  POS=(12,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3712  DFLD  POS=(12,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4112  DFLD  POS=(12,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4512  DFLD  POS=(12,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0313  DFLD  POS=(13,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2713  DFLD  POS=(13,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3213  DFLD  POS=(13,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3713  DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4113  DFLD  POS=(13,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4513  DFLD  POS=(13,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0314  DFLD  POS=(14,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2714  DFLD  POS=(14,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3214  DFLD  POS=(14,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3714  DFLD  POS=(14,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4114  DFLD  POS=(14,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4514  DFLD  POS=(14,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0315  DFLD  POS=(15,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2715  DFLD  POS=(15,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3215  DFLD  POS=(15,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3715  DFLD  POS=(15,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4115  DFLD  POS=(15,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4515  DFLD  POS=(15,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0316  DFLD  POS=(16,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2716  DFLD  POS=(16,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3216  DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3716  DFLD  POS=(16,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4116  DFLD  POS=(16,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4516  DFLD  POS=(16,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0317  DFLD  POS=(17,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2717  DFLD  POS=(17,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3217  DFLD  POS=(17,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3717  DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4117  DFLD  POS=(17,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4517  DFLD  POS=(17,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0318  DFLD  POS=(18,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2718  DFLD  POS=(18,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3218  DFLD  POS=(18,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3718  DFLD  POS=(18,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4118  DFLD  POS=(18,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4518  DFLD  POS=(18,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
COL0319  DFLD  POS=(19,3),LTH=23,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2719  DFLD  POS=(19,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3219  DFLD  POS=(19,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL3719  DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4119  DFLD  POS=(19,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4519  DFLD  POS=(19,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Restart list 14 Start inv.   15 Change flag  16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W0O603N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0N603,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I603N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  COL0306,                                                +        
               LTH=23                                                           
         MFLD  COL2706,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3206,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3706,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4106,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4506,                                                +        
               LTH=27                                                           
         MFLD  COL0307,                                                +        
               LTH=23                                                           
         MFLD  COL2707,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3707,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4107,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4507,                                                +        
               LTH=27                                                           
         MFLD  COL0308,                                                +        
               LTH=23                                                           
         MFLD  COL2708,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3708,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4108,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4508,                                                +        
               LTH=27                                                           
         MFLD  COL0309,                                                +        
               LTH=23                                                           
         MFLD  COL2709,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3709,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4109,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4509,                                                +        
               LTH=27                                                           
         MFLD  COL0310,                                                +        
               LTH=23                                                           
         MFLD  COL2710,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3710,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4110,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4510,                                                +        
               LTH=27                                                           
         MFLD  COL0311,                                                +        
               LTH=23                                                           
         MFLD  COL2711,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3711,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4511,                                                +        
               LTH=27                                                           
         MFLD  COL0312,                                                +        
               LTH=23                                                           
         MFLD  COL2712,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3712,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4512,                                                +        
               LTH=27                                                           
         MFLD  COL0313,                                                +        
               LTH=23                                                           
         MFLD  COL2713,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3713,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4113,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4513,                                                +        
               LTH=27                                                           
         MFLD  COL0314,                                                +        
               LTH=23                                                           
         MFLD  COL2714,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3714,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4114,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4514,                                                +        
               LTH=27                                                           
         MFLD  COL0315,                                                +        
               LTH=23                                                           
         MFLD  COL2715,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3715,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4115,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4515,                                                +        
               LTH=27                                                           
         MFLD  COL0316,                                                +        
               LTH=23                                                           
         MFLD  COL2716,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3716,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4516,                                                +        
               LTH=27                                                           
         MFLD  COL0317,                                                +        
               LTH=23                                                           
         MFLD  COL2717,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3717,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4117,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4517,                                                +        
               LTH=27                                                           
         MFLD  COL0318,                                                +        
               LTH=23                                                           
         MFLD  COL2718,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3718,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4118,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4518,                                                +        
               LTH=27                                                           
         MFLD  COL0319,                                                +        
               LTH=23                                                           
         MFLD  COL2719,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3219,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3719,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4119,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4519,                                                +        
               LTH=27                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I603N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0N603),                                           +        
               OPT=2,                                                  +        
               NXT=W0O603N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '06032',                                                +        
               LTH=5                                                            
         MFLD  COL0306,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3206,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4106,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0307,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3207,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4107,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0308,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3208,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4108,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0309,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3209,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4109,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0310,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3210,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4110,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0311,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3211,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4111,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0312,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3212,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4112,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0313,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3213,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4113,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0314,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3214,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4114,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0315,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3215,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4115,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0316,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3216,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4116,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0317,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3217,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4117,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0318,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3218,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4118,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL0319,                                                +        
               LTH=23,                                                 +        
               FILL=X'4E'                                                       
         MFLD  COL3219,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MFLD  COL4119,                                                +        
               LTH=1,                                                  +        
               FILL=X'4E'                                                       
         MSGEND                                                                 
         END                                                                    
