***********************************************************************         
* CREATED BY V036147   ON 06/01/31  AT 11:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W0N623   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T623U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T621  ',                                          +        
               14='W0T622  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order Entry Error',                                    +        
               POS=(1,11),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Date',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0207  DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Time',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0219  DFLD  POS=(2,19),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0307  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd Node',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Date   Time',                                          +        
               POS=(5,15),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'User',                                                 +        
               POS=(5,31),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Status Job',                                           +        
               POS=(5,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0606  DFLD  POS=(6,6),LTH=8,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0615  DFLD  POS=(6,15),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0622  DFLD  POS=(6,22),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0631  DFLD  POS=(6,31),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0640  DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0647  DFLD  POS=(6,47),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Message',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0938  DFLD  POS=(9,6),LTH=69,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Update Trans 14 Show Transqu 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W0O623N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0N623,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I623N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001,                                           +        
               NXT=W0I623N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0207,                                                +        
               LTH=2                                                            
         MFLD  FLD0307,                                                +        
               LTH=6                                                            
         MFLD  FLD0219,                                                +        
               LTH=2                                                            
         MFLD  FLD0319,                                                +        
               LTH=8                                                            
         MFLD  FLD0602,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0606,                                                +        
               LTH=8                                                            
         MFLD  FLD0615,                                                +        
               LTH=6                                                            
         MFLD  FLD0622,                                                +        
               LTH=8                                                            
         MFLD  FLD0631,                                                +        
               LTH=8                                                            
         MFLD  FLD0640,                                                +        
               LTH=1                                                            
         MFLD  FLD0647,                                                +        
               LTH=8                                                            
         MFLD  FLD0902,                                                +        
               LTH=3                                                            
         MFLD  FLD0938,                                                +        
               LTH=69                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I623N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0N623),                                           +        
               OPT=2,                                                  +        
               NXT=W0O623N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '06232',                                                +        
               LTH=5                                                            
         MFLD  (FLD0207,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0307,                                                +        
               LTH=6                                                            
         MFLD  (FLD0219,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=8                                                            
         MFLD  (FLD0602,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0606,                                                +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0615,                                                +        
               LTH=6,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0622,                                                +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0631,                                                +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0640,                                                +        
               LTH=1,                                                  +        
               FILL=NULL                                                        
         MFLD  FLD0647,                                                +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MSGEND                                                                 
         END                                                                    
