*          DATA SET W0N705FII0 AT LEVEL 007 AS OF 89/06/14                      
*                                                                               
         PRINT NOGEN                                                            
W0N705   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','R05T01  ',*        
               'W0T501  ','W0T501  ','W0T705 7','W0T705 8','W0T501  ', *        
               'WHELP   ','W0T705U ','/RCL.   ','W0T701  ','W0T702  ', *        
               'W0T703  ','W0T704  ','W0T705  ','W0T706  ','W0T707  ', *        
               'W0T708  ','W0T709  ','WHELP   ','W0T705U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,10)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'UPDATE DATA',                                          *        
               POS=(01,12),LTH=0011,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'ROUTINE',                                              *        
               POS=(02,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0210  DFLD  POS=(02,10),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'JOB',                                                  *        
               POS=(02,20),LTH=0003,ATTR=(NUM,PROT)                             
FLD0225  DFLD  POS=(02,25),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'READY',                                                '        
               POS=(02,34),LTH=0005,ATTR=(NUM,PROT)                             
FLD0240  DFLD  POS=(02,40),LTH=0001,ATTR=(ALPHA)                                
FLD0310  DFLD  POS=(03,10),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0325  DFLD  POS=(03,25),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0502  DFLD  POS=(05,02),LTH=0005,ATTR=(NUM,MOD)                              
         DO    14,SUF=06                                                        
COL02    DFLD  POS=(06,02),LTH=0005,ATTR=(NUM,MOD)                              
COL08    DFLD  POS=(06,08),LTH=0071,ATTR=(ALPHA)                                
         ENDDO                                                                  
         DFLD  '13 SECURITY      14 RUTIN UPD.  15 SHOW RUTINES 16 JOBB*        
                UPDATE  17 CHANGE DATA',                               *        
               POS=(21,02),LTH=0078,ATTR=(NUM,PROT)                             
         DFLD  '18 DELETE DATA   19 JCL INPUT   20 STATUS JOBB  21 STAR*        
               T JOBB   10 WHELP',                                     *        
               POS=(22,02),LTH=0072,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O705N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0N705,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I705N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0008                                                 
         MFLD  FLD0225,LTH=0002                                                 
         MFLD  FLD0325,LTH=0008                                                 
         MFLD  FLD0240,LTH=0001                                                 
         MFLD  FLD0502,LTH=0007,ATTR=YES                                        
         DO    14,SUF=06                                                        
         MFLD  COL02,LTH=0007,ATTR=YES                                          
         MFLD  COL08,LTH=0073,ATTR=YES                                          
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0O705N2 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0N705,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I705N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0008                                                 
         MFLD  FLD0225,LTH=0002                                                 
         MFLD  FLD0325,LTH=0008                                                 
         MFLD  (FLD0240,' '),LTH=0001                                           
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W0I705N1 MSG   TYPE=INPUT,                                             *        
               SOR=W0N705,                                             *        
               OPT=2,                                                  *        
               NXT=W0O705N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'7'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'5'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '07052',LTH=0005                                                 
         MFLD  (FLD0210,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0310,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0225,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0325,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0240,'+'),LTH=0001,FILL=C' '                                 
         MFLD  FLD0502,LTH=0005,FILL=C'0',JUST=R                                
         DO    14,SUF=06                                                        
         MFLD  (COL02,'+++++'),LTH=0005,FILL=C'0',JUST=R                        
         MFLD  (COL08,'++++++++++++++++++++++++++++++++++++++++++++++++*        
               +++++++++++++++++++++++'),LTH=0071,FILL=C' '                     
         ENDDO                                                                  
         MSGEND                                                                 
         END                                                                    
