***********************************************************************         
* CREATED BY PC53390   ON 20/10/16  AT 10:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Steering table for B2C          '                               
W0N815   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T815 7',                                           +        
               8='W0T815 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T815U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Steering table for B2C',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partner:',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
SYSTIN   DFLD  POS=(2,11),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'District:',                                            +        
               POS=(2,23),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,33),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
SYSTUT   DFLD  POS=(3,11),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,33),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C  CC  Postal code from  Postal code to  Dist  Cust    +        
               Home DC',                                               +        
               POS=(5,2),LTH=75,                                       +        
               ATTR=(PROT)                                                      
         DO    12,SUF=12                                                        
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
CC       DFLD  POS=(6,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
POSTFOM  DFLD  POS=(6,9),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
POSTTOM  DFLD  POS=(6,27),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDIST   DFLD  POS=(6,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND   DFLD  POS=(6,49),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(6,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
               ENDDO                                                            
         DFLD  'New/Change',                                           +        
               POS=(18,2),LTH=10,                                      +        
               ATTR=(ALPHA,PROT)                                                
CMDE     DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
CCE      DFLD  POS=(19,5),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
POSTFOME DFLD  POS=(19,09),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
POSTTOME DFLD  POS=(19,27),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDDISTE  DFLD  POS=(19,43),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKUNDE  DFLD  POS=(19,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(21,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(22,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0O815N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0N815,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0I815N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  SYSTIN,                                                 +        
               LTH=10                                                           
         MFLD  SYSTUT,                                                 +        
               LTH=10                                                           
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         DO    12,SUF=12                                                        
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CC,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  POSTFOM,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  POSTTOM,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDIST,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUND,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         ENDDO                                                                  
         MFLD  CMDE,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CCE,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  POSTFOME,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  POSTTOME,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDISTE,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDE,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0I815N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0N815),                                           +        
               OPT=2,                                                  +        
               NXT=W0O815N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '08152',                                                +        
               LTH=5                                                            
         MFLD  (SYSTIN,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (SYSTUT,                                                +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DISTRUT,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         DO    12,SUF=12                                                        
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CC,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (POSTFOM,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  (POSTTOM,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         ENDDO                                                                  
         MFLD  (CMDE,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CCE,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (POSTFOME,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  (POSTTOME,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  (IDDISTE,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (IDKUNDE,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
