*          DATA SET W0N804FII0 AT LEVEL 001 AS OF 88/01/12                      
*                                                                               
         PRINT NOGEN                                                            
W0N804   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T801  ','W0T802  ','W0T803  ','W0T804  ',*        
               'W0T501  ','W0T501  ','W0T807  ','W0T808  ','W0T809  ', *        
               'WHELP   ','W0T804U ','/RCL.   ','W0T801  ','W0T802  ', *        
               'W0T803  ','W0T804  ','W0T501  ','W0T501  ','W0T807  ', *        
               'W0T808  ','W0T809  ','WHELP   ','W0T804U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,15)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'UPDATE FREIGHT TEXT',                                  *        
               POS=(01,10),LTH=0019,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'FREIGHT CODE',                                         *        
               POS=(02,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD0215  DFLD  POS=(02,15),LTH=0003,ATTR=NUM                                    
         DFLD  'UPDATE',                                               *        
               POS=(02,27),LTH=0006,ATTR=(NUM,PROT)                             
FLD0234  DFLD  POS=(02,34),LTH=0001,ATTR=(ALPHA,MOD)                            
         DFLD  '(C,N,D)',                                              *        
               POS=(02,36),LTH=0007,ATTR=(NUM,PROT)                             
FLD0315  DFLD  POS=(03,15),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0334  DFLD  POS=(03,34),LTH=0001,ATTR=(NUM,PROT,MOD)                         
         DFLD  'FREIGHTTEXT',                                          *        
               POS=(05,02),LTH=0011,ATTR=(NUM,PROT)                             
FLD0702  DFLD  POS=(07,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'SWE',                                                  *        
               POS=(07,27),LTH=0003,ATTR=(NUM,PROT)                             
FLD0902  DFLD  POS=(09,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'ENG',                                                  *        
               POS=(09,27),LTH=0003,ATTR=(NUM,PROT)                             
FLD1102  DFLD  POS=(11,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'FRE',                                                  *        
               POS=(11,27),LTH=0003,ATTR=(NUM,PROT)                             
FLD1302  DFLD  POS=(13,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'SPA',                                                  *        
               POS=(13,27),LTH=0003,ATTR=(NUM,PROT)                             
FLD1502  DFLD  POS=(15,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'GER',                                                  *        
               POS=(15,27),LTH=0003,ATTR=(NUM,PROT)                             
FLD1702  DFLD  POS=(17,02),LTH=0020,ATTR=ALPHA                                  
         DFLD  'ITA',                                                  *        
               POS=(17,27),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  '1 PERSONAL CODE 2 DISTR/PERSCOD 3 CONFIRM. TEXT 4 FREIG*        
               HT TEXT  5               6               7 PACK. MAT.   *        
                8 FR. CARRIER   9 TERMS OF DEL. 10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W0O804N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W0N804,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W0I804N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0215,LTH=0003                                                 
         MFLD  FLD0234,LTH=0001                                                 
         MFLD  FLD0315,LTH=0003                                                 
         MFLD  FLD0334,LTH=0001                                                 
         MFLD  FLD0702,LTH=0022,ATTR=YES                                        
         MFLD  FLD0902,LTH=0022,ATTR=YES                                        
         MFLD  FLD1102,LTH=0022,ATTR=YES                                        
         MFLD  FLD1302,LTH=0022,ATTR=YES                                        
         MFLD  FLD1502,LTH=0022,ATTR=YES                                        
         MFLD  FLD1702,LTH=0022,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W0I804N1 MSG   TYPE=INPUT,                                             *        
               SOR=W0N804,                                             *        
               OPT=2,                                                  *        
               NXT=W0O804N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'0'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'8'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'4'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '08042',LTH=5                                                    
         MFLD  (FLD0215,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0315,LTH=0003,FILL=C'0'                                       
         MFLD  (FLD0234,'+'),LTH=0001                                           
         MFLD  FLD0334,LTH=0001,FILL=C' '                                       
         MFLD  (FLD0702,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD0902,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1102,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1302,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1502,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MFLD  (FLD1702,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
