***********************************************************************         
* CREATED BY PC30186   ON 96/01/11  AT 08:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DATAREG ANSKAFFNING R22         '                               
W0NR22   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T832 7',                                           +        
               8='W0T832 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T832U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0NR22   DPAGE CURSOR=((7,27)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DATAREGISTRERING ANSKAFFNING',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'R22   UPPDATERA BESTÄLLNING - ANNULLATION',            +        
               POS=(5,10),LTH=41,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artikelnr',                                            +        
               POS=(7,10),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(7,27),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Beställnings-id',                                      +        
               POS=(9,10),LTH=15,                                      +        
               ATTR=(PROT)                                                      
INKÖPARN DFLD  POS=(9,27),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(9,31),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BESTÄLLA DFLD  POS=(9,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(9,40),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
GODSM    DFLD  POS=(9,42),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Levnr',                                                +        
               POS=(11,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(11,27),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Datum',                                                +        
               POS=(12,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TIBEST   DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Antal',                                                +        
               POS=(13,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVBES    DFLD  POS=(13,27),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kod',                                                  +        
               POS=(14,10),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDBEH    DFLD  POS=(14,27),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '1 = beställning  5 = annullation',                     +        
               POS=(14,42),LTH=32,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'För uppdatering  tryck pf 11',                         +        
               POS=(18,10),LTH=28,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Åter till registreringsmeny  tryck pf 7',              +        
               POS=(19,10),LTH=39,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '05',                                                   +        
               POS=(21,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0OR22N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0NR22,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0IR22N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0NR22                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNR,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INKÖPARN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESTÄLLA,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GODSM,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIBEST,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBES,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDBEH,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0IR22N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0NR22),                                           +        
               OPT=2,                                                  +        
               NXT=W0OR22N1                                                     
MID      LPAGE SOR=(W0NR22)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '083B2',                                                +        
               LTH=5                                                            
         MFLD  'R22',                                                  +        
               LTH=3                                                            
         MFLD  (IDARTNR,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INKÖPARN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BESTÄLLA,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GODSM,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIBEST,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBES,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBEH,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
