***********************************************************************         
* cREATED BY PC30186   ON 94/11/14  AT 15:48                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DATAREG ANSKAFFNING R17         '                               
W0NR17   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T832 7',                                           +        
               8='W0T832 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T832V ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W0NR17   DPAGE CURSOR=((7,24)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DATAREGISTRERING ANSKAFFNING',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'R17   ÄNDRA-TA BORT LEVERANTÖR',                       +        
               POS=(5,10),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bilden kan endast',                                    +        
               POS=(5,55),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'användas av system-',                                  +        
               POS=(6,55),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Levnr',                                                +        
               POS=(7,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,24),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'gruppen',                                              +        
               POS=(7,55),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Beh kod',                                              +        
               POS=(8,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDBEHX   DFLD  POS=(8,24),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ä = ändra  b = ta bort',                               +        
               POS=(8,30),LTH=22,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ledtid',                                               +        
               POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LT       DFLD  POS=(10,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'veckor',                                               +        
               POS=(10,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ansktid',                                              +        
               POS=(11,10),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AT       DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'veckor',                                               +        
               POS=(11,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tull CDC',                                             +        
               POS=(12,10),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TTC1     DFLD  POS=(12,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'dagar',                                                +        
               POS=(12,30),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tull ST',                                              +        
               POS=(13,10),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TTC2     DFLD  POS=(13,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'dagar',                                                +        
               POS=(13,30),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev typ',                                              +        
               POS=(14,10),LTH=7,                                      +        
               ATTR=(PROT)                                                      
LEVTYP   DFLD  POS=(14,25),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '0 = vanlig  3 = koncern',                              +        
               POS=(14,30),LTH=23,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Gk',                                                   +        
               POS=(15,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GK       DFLD  POS=(15,25),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '1 = CDC  2 = ST',                                      +        
               POS=(15,30),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Kontr levpl',                                          +        
               POS=(16,10),LTH=11,                                     +        
               ATTR=(PROT)                                                      
LPKOLL   DFLD  POS=(16,25),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '0 = ingen kontr  1 - 4 = kontr i resp vecka',          +        
               POS=(16,30),LTH=43,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Unik levadr',                                          +        
               POS=(17,10),LTH=11,                                     +        
               ATTR=(PROT)                                                      
RSADR    DFLD  POS=(17,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'j n',                                                  +        
               POS=(17,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Emp pool',                                             +        
               POS=(18,10),LTH=8,                                      +        
               ATTR=(PROT)                                                      
EMBPOL   DFLD  POS=(18,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'j n',                                                  +        
               POS=(18,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Språkkod',                                             +        
               POS=(19,10),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SPRAK    DFLD  POS=(19,25),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '0 = sv  1 = eng  2 = fr  3 = sp  4 = ty',              +        
               POS=(19,30),LTH=39,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '05',                                                   +        
               POS=(21,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W0OR17N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W0NR17,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W0IR17N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W0NR17                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDBEHX,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LT,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AT,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTC1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTC2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVTYP,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GK,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LPKOLL,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RSADR,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EMBPOL,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPRAK,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W0IR17N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W0NR17),                                           +        
               OPT=2,                                                  +        
               NXT=W0OR17N1                                                     
MID      LPAGE SOR=(W0NR17)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '083B2',                                                +        
               LTH=5                                                            
         MFLD  'R17',                                                  +        
               LTH=3                                                            
         MFLD  (IDLEVNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDBEHX,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LT,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AT,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TTC1,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TTC2,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVTYP,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GK,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LPKOLL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RSADR,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (EMBPOL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SPRAK,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
