***********************************************************************         
* CREATED BY V0C1505   ON 16/02/29  AT 10:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPDATERA PLANNER ID            '                               
W1F155   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T155 7',                                           +        
               8='W1T155 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T155U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((4,17)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPPDATERA PLANNER ID',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,32),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'MAIL',                                                 +        
               POS=(4,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0417  DFLD  POS=(4,17),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0422  DFLD  POS=(4,22),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PRODUKTSLAG',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0517  DFLD  POS=(5,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SORT',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0617  DFLD  POS=(6,17),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0620  DFLD  POS=(6,20),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0623  DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0626  DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0629  DFLD  POS=(6,29),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'VALFRITT(5ST)',                                        +        
               POS=(6,34),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'UNDANTAG(SORT)',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0717  DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0720  DFLD  POS=(7,20),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0723  DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0726  DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0729  DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'VALFRITT(5ST)',                                        +        
               POS=(7,34),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'UPPDATERA GCP',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0817  DFLD  POS=(8,17),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ÅTGÄRD J/N/E',                                         +        
               POS=(8,34),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FUNKTIONSGRUPP',                                       +        
               POS=(15,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FOM',                                                  +        
               POS=(15,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(15,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TOM',                                                  +        
               POS=(15,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PLANNER ID',                                           +        
               POS=(15,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1617  DFLD  POS=(16,17),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1623  DFLD  POS=(16,23),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1634  DFLD  POS=(16,34),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F10 WHELP',                                            +        
               POS=(21,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F11 UPDATE',                                           +        
               POS=(21,18),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F12 LOGOFF',                                           +        
               POS=(21,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O15501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F155,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I15501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FLD0417,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0422,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0517,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0617,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0620,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0623,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0626,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0629,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0717,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0720,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0723,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0726,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0729,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0817,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1617,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1623,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1634,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I15501 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F155),                                           +        
               OPT=2,                                                  +        
               NXT=W1O15501                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11551',                                                +        
               LTH=5                                                            
         MFLD  (FLD0417,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0422,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0517,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0617,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0620,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0623,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0626,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0629,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0717,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0720,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0723,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0726,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0729,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0817,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1617,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1623,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1634,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
