***********************************************************************         
* CREATED BY V028439   ON 05/10/04  AT 15:28                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÄMMANDE BETECKNINGAR 1        '                               
W1F107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSSINDEX PER FRÄMMANDE BET',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'LEVERANTÖR-NR',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0216  DFLD  POS=(2,16),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'BETECKNING',                                           +        
               POS=(2,22),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0233  DFLD  POS=(2,33),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ART-NR',                                               +        
               POS=(2,64),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0271  DFLD  POS=(2,71),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0316  DFLD  POS=(3,16),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0371  DFLD  POS=(3,71),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0433  DFLD  POS=(4,33),LTH=30,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'BETECKNING',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FÖRETAGSKOD TILLV BENR  VOLVONR  RESERVDEL',           +        
               POS=(5,33),LTH=42,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0638  DFLD  POS=(6,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0653  DFLD  POS=(6,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0655  DFLD  POS=(6,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0674  DFLD  POS=(6,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0738  DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0747  DFLD  POS=(7,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0753  DFLD  POS=(7,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0755  DFLD  POS=(7,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0774  DFLD  POS=(7,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0838  DFLD  POS=(8,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0853  DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0874  DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0938  DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0947  DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0953  DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0955  DFLD  POS=(9,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0974  DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1038  DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1053  DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1055  DFLD  POS=(10,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1074  DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1138  DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1153  DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1155  DFLD  POS=(11,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1174  DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1238  DFLD  POS=(12,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1253  DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1255  DFLD  POS=(12,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1274  DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1338  DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1353  DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1355  DFLD  POS=(13,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1374  DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1438  DFLD  POS=(14,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1447  DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1453  DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1455  DFLD  POS=(14,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1474  DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1538  DFLD  POS=(15,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1547  DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1553  DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1555  DFLD  POS=(15,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1574  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1638  DFLD  POS=(16,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1647  DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1653  DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1655  DFLD  POS=(16,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1674  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1738  DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1747  DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1753  DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1755  DFLD  POS=(17,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1774  DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1838  DFLD  POS=(18,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1847  DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1853  DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1855  DFLD  POS=(18,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1874  DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1938  DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1947  DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1953  DFLD  POS=(19,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1955  DFLD  POS=(19,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1974  DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 BEREDNING',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 ERSÄTTS AV    3 ERSÄTTER',                           +        
               POS=(21,18),LTH=26,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS MPNR',                                         +        
               POS=(21,66),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 FR-BET/VOL-NR 8 VOL-NR/FR-BET 9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSSINDEX PER FRÄMMANDE BET',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'LEVERANTÖR-NR',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0216  DFLD  POS=(2,16),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'BETECKNING',                                           +        
               POS=(2,22),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0233  DFLD  POS=(2,33),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ART-NR',                                               +        
               POS=(2,64),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0271  DFLD  POS=(2,71),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0316  DFLD  POS=(3,16),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0371  DFLD  POS=(3,71),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0433  DFLD  POS=(4,33),LTH=30,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'BETECKNING',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FÖRETAGSKOD TILLV BENR  VOLVONR  RESERVDEL',           +        
               POS=(5,33),LTH=42,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0638  DFLD  POS=(6,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0653  DFLD  POS=(6,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0655  DFLD  POS=(6,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0674  DFLD  POS=(6,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0738  DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0747  DFLD  POS=(7,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0753  DFLD  POS=(7,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0755  DFLD  POS=(7,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0774  DFLD  POS=(7,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0838  DFLD  POS=(8,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0853  DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0874  DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
FLD0938  DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0947  DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0953  DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0955  DFLD  POS=(9,55),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0974  DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1038  DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1053  DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1055  DFLD  POS=(10,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1074  DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1138  DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1153  DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1155  DFLD  POS=(11,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1174  DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1238  DFLD  POS=(12,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1253  DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1255  DFLD  POS=(12,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1274  DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1338  DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1353  DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1355  DFLD  POS=(13,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1374  DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1438  DFLD  POS=(14,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1447  DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1453  DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1455  DFLD  POS=(14,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1474  DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1538  DFLD  POS=(15,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1547  DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1553  DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1555  DFLD  POS=(15,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1574  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1638  DFLD  POS=(16,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1647  DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1653  DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1655  DFLD  POS=(16,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1674  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1738  DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1747  DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1753  DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1755  DFLD  POS=(17,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1774  DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1838  DFLD  POS=(18,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1847  DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1853  DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1855  DFLD  POS=(18,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1874  DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1938  DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1947  DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1953  DFLD  POS=(19,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1955  DFLD  POS=(19,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1974  DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 BEREDNING',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 ERSÄTTS AV    3 ERSÄTTER',                           +        
               POS=(21,18),LTH=26,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS REF MPNR',                                     +        
               POS=(21,67),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 FR-BET/VOL-NR 8 VOL-NR/FR-BET 9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O10701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I10701,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0216,                                                +        
               LTH=5                                                            
         MFLD  FLD0233,                                                +        
               LTH=30                                                           
         MFLD  FLD0271,                                                +        
               LTH=9                                                            
         MFLD  FLD0316,                                                +        
               LTH=5                                                            
         MFLD  FLD0333,                                                +        
               LTH=30                                                           
         MFLD  FLD0371,                                                +        
               LTH=9                                                            
         MFLD  FLD0433,                                                +        
               LTH=30                                                           
         MFLD  FLD0602,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0638,                                                +        
               LTH=1                                                            
         MFLD  FLD0647,                                                +        
               LTH=1                                                            
         MFLD  FLD0653,                                                +        
               LTH=1                                                            
         MFLD  FLD0655,                                                +        
               LTH=9                                                            
         MFLD  FLD0674,                                                +        
               LTH=1                                                            
         MFLD  FLD0702,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0738,                                                +        
               LTH=1                                                            
         MFLD  FLD0747,                                                +        
               LTH=1                                                            
         MFLD  FLD0753,                                                +        
               LTH=1                                                            
         MFLD  FLD0755,                                                +        
               LTH=9                                                            
         MFLD  FLD0774,                                                +        
               LTH=1                                                            
         MFLD  FLD0802,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0838,                                                +        
               LTH=1                                                            
         MFLD  FLD0847,                                                +        
               LTH=1                                                            
         MFLD  FLD0853,                                                +        
               LTH=1                                                            
         MFLD  FLD0855,                                                +        
               LTH=9                                                            
         MFLD  FLD0874,                                                +        
               LTH=1                                                            
         MFLD  FLD0902,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0938,                                                +        
               LTH=1                                                            
         MFLD  FLD0947,                                                +        
               LTH=1                                                            
         MFLD  FLD0953,                                                +        
               LTH=1                                                            
         MFLD  FLD0955,                                                +        
               LTH=9                                                            
         MFLD  FLD0974,                                                +        
               LTH=1                                                            
         MFLD  FLD1002,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1038,                                                +        
               LTH=1                                                            
         MFLD  FLD1047,                                                +        
               LTH=1                                                            
         MFLD  FLD1053,                                                +        
               LTH=1                                                            
         MFLD  FLD1055,                                                +        
               LTH=9                                                            
         MFLD  FLD1074,                                                +        
               LTH=1                                                            
         MFLD  FLD1102,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1138,                                                +        
               LTH=1                                                            
         MFLD  FLD1147,                                                +        
               LTH=1                                                            
         MFLD  FLD1153,                                                +        
               LTH=1                                                            
         MFLD  FLD1155,                                                +        
               LTH=9                                                            
         MFLD  FLD1174,                                                +        
               LTH=1                                                            
         MFLD  FLD1202,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1238,                                                +        
               LTH=1                                                            
         MFLD  FLD1247,                                                +        
               LTH=1                                                            
         MFLD  FLD1253,                                                +        
               LTH=1                                                            
         MFLD  FLD1255,                                                +        
               LTH=9                                                            
         MFLD  FLD1274,                                                +        
               LTH=1                                                            
         MFLD  FLD1302,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1338,                                                +        
               LTH=1                                                            
         MFLD  FLD1347,                                                +        
               LTH=1                                                            
         MFLD  FLD1353,                                                +        
               LTH=1                                                            
         MFLD  FLD1355,                                                +        
               LTH=9                                                            
         MFLD  FLD1374,                                                +        
               LTH=1                                                            
         MFLD  FLD1402,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1438,                                                +        
               LTH=1                                                            
         MFLD  FLD1447,                                                +        
               LTH=1                                                            
         MFLD  FLD1453,                                                +        
               LTH=1                                                            
         MFLD  FLD1455,                                                +        
               LTH=9                                                            
         MFLD  FLD1474,                                                +        
               LTH=1                                                            
         MFLD  FLD1502,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1538,                                                +        
               LTH=1                                                            
         MFLD  FLD1547,                                                +        
               LTH=1                                                            
         MFLD  FLD1553,                                                +        
               LTH=1                                                            
         MFLD  FLD1555,                                                +        
               LTH=9                                                            
         MFLD  FLD1574,                                                +        
               LTH=1                                                            
         MFLD  FLD1602,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1638,                                                +        
               LTH=1                                                            
         MFLD  FLD1647,                                                +        
               LTH=1                                                            
         MFLD  FLD1653,                                                +        
               LTH=1                                                            
         MFLD  FLD1655,                                                +        
               LTH=9                                                            
         MFLD  FLD1674,                                                +        
               LTH=1                                                            
         MFLD  FLD1702,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1738,                                                +        
               LTH=1                                                            
         MFLD  FLD1747,                                                +        
               LTH=1                                                            
         MFLD  FLD1753,                                                +        
               LTH=1                                                            
         MFLD  FLD1755,                                                +        
               LTH=9                                                            
         MFLD  FLD1774,                                                +        
               LTH=1                                                            
         MFLD  FLD1802,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1838,                                                +        
               LTH=1                                                            
         MFLD  FLD1847,                                                +        
               LTH=1                                                            
         MFLD  FLD1853,                                                +        
               LTH=1                                                            
         MFLD  FLD1855,                                                +        
               LTH=9                                                            
         MFLD  FLD1874,                                                +        
               LTH=1                                                            
         MFLD  FLD1902,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1938,                                                +        
               LTH=1                                                            
         MFLD  FLD1947,                                                +        
               LTH=1                                                            
         MFLD  FLD1953,                                                +        
               LTH=1                                                            
         MFLD  FLD1955,                                                +        
               LTH=9                                                            
         MFLD  FLD1974,                                                +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I10701 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F107),                                           +        
               OPT=2,                                                  +        
               NXT=W1O10701                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11071',                                                +        
               LTH=5                                                            
         MFLD  (FLD0271,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0371,                                                +        
               LTH=9                                                            
         MFLD  (FLD0216,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0316,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0233,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0333,                                                +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0433,                                                +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
