***********************************************************************         
* CREATED BY PC59625   ON 94/03/02  AT 09:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROPER SHIPPING NAME            '                               
W1F132   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T132 7',                                           +        
               8='W1T132 8',                                           +        
               9='W1T118  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T132U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROPER SHIPPING NAME',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PSN',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0026 DFLD  POS=(2,6),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'LANGUAGE',                                             +        
               POS=(2,14),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDSPRKI  DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0027 DFLD  POS=(3,6),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
IDSPRKU  DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DGR',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(5,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(6,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'IM',                                                   +        
               POS=(7,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(7,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DG',                                                   +        
               POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(8,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0024 DFLD  POS=(9,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'IM',                                                   +        
               POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(10,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'DG',                                                   +        
               POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(11,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'FIN',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(12,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ADR',                                                  +        
               POS=(13,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(13,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(14,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(15,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'MKR',                                                  +        
               POS=(16,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(16,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ADR',                                                  +        
               POS=(17,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(17,7),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(17,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PLA',                                                  +        
               POS=(17,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(17,32),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(17,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DGR',                                                  +        
               POS=(17,53),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(17,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FLAMPKT',                                              +        
               POS=(17,68),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVFLAMPU DFLD  POS=(17,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(18,7),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(18,17),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(18,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(18,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(18,57),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLNEG    DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KVFLAMPI DFLD  POS=(18,77),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'IMDG',                                                 +        
               POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(19,7),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(19,17),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'IMDG-FIN',                                             +        
               POS=(19,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(19,38),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(19,49),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 ARTINFO KEMI 10 WHELP',                              +        
               POS=(22,50),LTH=23,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W1I13201 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F132),                                           +        
               OPT=2,                                                  +        
               NXT=W1O13201                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11321',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0026,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSPRKI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0027,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSPRKU,                                                +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0009,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0023,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0020,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0021,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0005,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0015,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLNEG,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVFLAMPI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W1O13201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F132,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I13201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0026,                                               +        
               LTH=3                                                            
         MFLD  IDSPRKI,                                                +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=3                                                            
         MFLD  IDSPRKU,                                                +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLAMPU,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLNEG,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLAMPI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
