***********************************************************************         
* CREATED BY V028439   ON 05/10/18  AT 13:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'INFORMATION FOR PARTS PLANNING  '                               
W1F101   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T101U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T101U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS PLANNING INFORMATION',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'PROCURER NO',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0517  DFLD  POS=(5,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FUNC GROUP',                                           +        
               POS=(5,22),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0534  DFLD  POS=(5,34),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SWE DESCRIPT',                                         +        
               POS=(5,40),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0554  DFLD  POS=(5,54),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPLIER NO',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0615  DFLD  POS=(6,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SORT CODE',                                            +        
               POS=(6,22),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0636  DFLD  POS=(6,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ENG DESCRIPT',                                         +        
               POS=(6,40),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0654  DFLD  POS=(6,54),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRODUCT GROUP',                                        +        
               POS=(7,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'BPSR',                                                 +        
               POS=(7,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SU:',                                                  +        
               POS=(7,40),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0744  DFLD  POS=(7,44),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'LPC',                                                  +        
               POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FLD0819  DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PLANNER',                                              +        
               POS=(8,22),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0835  DFLD  POS=(8,35),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DATE OF REG',                                          +        
               POS=(8,40),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0860  DFLD  POS=(8,60),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EXCEPT PART',                                          +        
               POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0919  DFLD  POS=(9,19),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'COMMON CP/TP',                                         +        
               POS=(9,22),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SOP WEEK',                                             +        
               POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0961  DFLD  POS=(9,61),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'INKL IN KIT',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1017  DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SPARE PART',                                           +        
               POS=(10,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DATE OF SUPERS',                                       +        
               POS=(10,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD1061  DFLD  POS=(10,61),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1117  DFLD  POS=(11,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'COMMON FMC',                                           +        
               POS=(11,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLGEMFMC DFLD  POS=(11,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DCN NO',                                               +        
               POS=(11,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1158  DFLD  POS=(11,58),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1169  DFLD  POS=(11,69),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'STANDARD PRICE',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1258  DFLD  POS=(12,58),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'PROJECT',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1319  DFLD  POS=(13,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'REG. FOR VEHICLE:',                                    +        
               POS=(13,40),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1358  DFLD  POS=(13,64),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1369  DFLD  POS=(13,70),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SUB PROJECT',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1417  DFLD  POS=(14,19),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PART IN VEHICLE:',                                     +        
               POS=(14,40),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DRAWING NO',                                           +        
               POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DRAWING  DFLD  POS=(15,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1540  DFLD  POS=(15,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1546  DFLD  POS=(15,46),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1552  DFLD  POS=(15,52),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1558  DFLD  POS=(15,58),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1564  DFLD  POS=(15,64),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1570  DFLD  POS=(15,70),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1576  DFLD  POS=(15,76),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SUPERSESSION CODE',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1624  DFLD  POS=(16,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1640  DFLD  POS=(16,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(16,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1652  DFLD  POS=(16,52),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1658  DFLD  POS=(16,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1664  DFLD  POS=(16,64),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1670  DFLD  POS=(16,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1676  DFLD  POS=(16,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AVIL STOCK CDC',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(ALPHA,PROT)                                                
FLD1720  DFLD  POS=(17,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRODUCTION UNIT',                                      +        
               POS=(17,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLD1840  DFLD  POS=(18,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1849  DFLD  POS=(18,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1858  DFLD  POS=(18,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NOTES',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1911  DFLD  POS=(19,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
FLD2011  DFLD  POS=(20,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS MPNR',                                         +        
               POS=(21,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T101U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T101U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS PLANNING INFORMATION',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'PROCURER NO',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0517  DFLD  POS=(5,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FUNC GROUP',                                           +        
               POS=(5,22),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0534  DFLD  POS=(5,34),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SWE DESCRIPT',                                         +        
               POS=(5,40),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0554  DFLD  POS=(5,54),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPLIER NO',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0615  DFLD  POS=(6,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SORT CODE',                                            +        
               POS=(6,22),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0636  DFLD  POS=(6,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ENG DESCRIPT',                                         +        
               POS=(6,40),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0654  DFLD  POS=(6,54),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRODUCT GROUP',                                        +        
               POS=(7,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'BPSR',                                                 +        
               POS=(7,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SU',                                                   +        
               POS=(7,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0744  DFLD  POS=(7,43),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'LPC',                                                  +        
               POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FLD0819  DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PLANNER',                                              +        
               POS=(8,22),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0835  DFLD  POS=(8,35),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DATE OF REG',                                          +        
               POS=(8,40),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0860  DFLD  POS=(8,60),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EXCEPT PART',                                          +        
               POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0919  DFLD  POS=(9,19),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'COMMON CP/TP',                                         +        
               POS=(9,22),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SOP WEEK',                                             +        
               POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0961  DFLD  POS=(9,61),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'INKL IN KIT',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1017  DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SPARE PART',                                           +        
               POS=(10,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DATE OF SUPERS',                                       +        
               POS=(10,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD1061  DFLD  POS=(10,61),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1117  DFLD  POS=(11,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'COMMON FMC',                                           +        
               POS=(11,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLGEMFMC DFLD  POS=(11,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DCN NO',                                               +        
               POS=(11,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1158  DFLD  POS=(11,58),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1169  DFLD  POS=(11,69),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'STANDARD PRICE',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1258  DFLD  POS=(12,58),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'PROJECT',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1319  DFLD  POS=(13,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'REG. FOR VEHICLE:',                                    +        
               POS=(13,40),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1358  DFLD  POS=(13,64),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1369  DFLD  POS=(13,70),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SUB PROJECT',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1417  DFLD  POS=(14,19),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PART IN VEHICLE:',                                     +        
               POS=(14,40),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DRAWING NO',                                           +        
               POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DRAWING  DFLD  POS=(15,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1540  DFLD  POS=(15,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1546  DFLD  POS=(15,46),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1552  DFLD  POS=(15,52),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1558  DFLD  POS=(15,58),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1564  DFLD  POS=(15,64),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1570  DFLD  POS=(15,70),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1576  DFLD  POS=(15,76),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SUPERSESSION CODE',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1624  DFLD  POS=(16,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1640  DFLD  POS=(16,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(16,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1652  DFLD  POS=(16,52),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1658  DFLD  POS=(16,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1664  DFLD  POS=(16,64),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1670  DFLD  POS=(16,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1676  DFLD  POS=(16,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AVIL STOCK CDC',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1720  DFLD  POS=(17,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRODUCTION UNIT',                                      +        
               POS=(17,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLD1840  DFLD  POS=(18,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1849  DFLD  POS=(18,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1858  DFLD  POS=(18,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NOTES',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1911  DFLD  POS=(19,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
FLD2011  DFLD  POS=(20,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS REF MPNR',                                     +        
               POS=(21,67),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O10101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F101,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I10101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0402,                                                +        
               LTH=3                                                            
         MFLD  FLD0517,                                                +        
               LTH=3                                                            
         MFLD  FLD0615,                                                +        
               LTH=5                                                            
         MFLD  FLD0718,                                                +        
               LTH=2                                                            
         MFLD  FLD0919,                                                +        
               LTH=1                                                            
         MFLD  FLD0819,                                                +        
               LTH=2                                                            
         MFLD  FLD1017,                                                +        
               LTH=1                                                            
         MFLD  FLD1117,                                                +        
               LTH=3                                                            
         MFLD  FLGEMFMC,                                               +        
               LTH=1                                                            
         MFLD  FLD1223,                                                +        
               LTH=10                                                           
         MFLD  FLD1319,                                                +        
               LTH=4                                                            
         MFLD  FLD1417,                                                +        
               LTH=8                                                            
         MFLD  DRAWING,                                                +        
               LTH=10                                                           
         MFLD  FLD1624,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1720,                                                +        
               LTH=7                                                            
         MFLD  FLD0534,                                                +        
               LTH=4                                                            
         MFLD  FLD0636,                                                +        
               LTH=2                                                            
         MFLD  FLD0737,                                                +        
               LTH=1                                                            
         MFLD  FLD0835,                                                +        
               LTH=3                                                            
         MFLD  FLD0937,                                                +        
               LTH=1                                                            
         MFLD  FLD1037,                                                +        
               LTH=1                                                            
         MFLD  FLD0554,                                                +        
               LTH=25                                                           
         MFLD  FLD0654,                                                +        
               LTH=25                                                           
         MFLD  FLD0744,                                                +        
               LTH=35                                                           
         MFLD  FLD0860,                                                +        
               LTH=6                                                            
         MFLD  FLD0961,                                                +        
               LTH=5                                                            
         MFLD  FLD1061,                                                +        
               LTH=5                                                            
         MFLD  FLD1147,                                                +        
               LTH=10                                                           
         MFLD  FLD1158,                                                +        
               LTH=10                                                           
         MFLD  FLD1169,                                                +        
               LTH=10                                                           
         MFLD  FLD1247,                                                +        
               LTH=10                                                           
         MFLD  FLD1258,                                                +        
               LTH=10                                                           
         MFLD  FLD1347,                                                +        
               LTH=5                                                            
         MFLD  FLD1358,                                                +        
               LTH=5                                                            
         MFLD  FLD1369,                                                +        
               LTH=5                                                            
         MFLD  FLD1540,                                                +        
               LTH=5                                                            
         MFLD  FLD1546,                                                +        
               LTH=5                                                            
         MFLD  FLD1552,                                                +        
               LTH=5                                                            
         MFLD  FLD1558,                                                +        
               LTH=5                                                            
         MFLD  FLD1564,                                                +        
               LTH=5                                                            
         MFLD  FLD1570,                                                +        
               LTH=5                                                            
         MFLD  FLD1576,                                                +        
               LTH=5                                                            
         MFLD  FLD1640,                                                +        
               LTH=5                                                            
         MFLD  FLD1646,                                                +        
               LTH=5                                                            
         MFLD  FLD1652,                                                +        
               LTH=5                                                            
         MFLD  FLD1658,                                                +        
               LTH=5                                                            
         MFLD  FLD1664,                                                +        
               LTH=5                                                            
         MFLD  FLD1670,                                                +        
               LTH=5                                                            
         MFLD  FLD1676,                                                +        
               LTH=5                                                            
         MFLD  FLD1840,                                                +        
               LTH=8                                                            
         MFLD  FLD1849,                                                +        
               LTH=8                                                            
         MFLD  FLD1858,                                                +        
               LTH=8                                                            
         MFLD  FLD1911,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2011,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I10101 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F101),                                           +        
               OPT=2,                                                  +        
               NXT=W1O10101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11011',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1911,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD2011,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
