***********************************************************************         
* CREATED BY PC40073   ON 94/03/07  AT 10:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1F115   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W1T142  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T115U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W1T112  ',                                          +        
               15='W1T113  ',                                          +        
               16='W1T114  ',                                          +        
               17='W1T115  ',                                          +        
               18='W1T116  ',                                          +        
               19='W1T117  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T115U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKELINFORMATION NYPON',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ARTIKELNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'PROJ',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0509  DFLD  POS=(5,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'PROJ-K',                                               +        
               POS=(5,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0528  DFLD  POS=(5,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DELPROJ',                                              +        
               POS=(5,36),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0546  DFLD  POS=(5,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ÄO',                                                   +        
               POS=(5,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0566  DFLD  POS=(5,66),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RUTG',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0610  DFLD  POS=(6,10),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SBER',                                                 +        
               POS=(6,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0628  DFLD  POS=(6,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KONSTGRP',                                             +        
               POS=(6,36),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0649  DFLD  POS=(6,49),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ANT.ÅR1',                                              +        
               POS=(6,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0667  DFLD  POS=(6,67),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'BRIT',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0709  DFLD  POS=(7,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0714  DFLD  POS=(7,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FBER',                                                 +        
               POS=(7,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0728  DFLD  POS=(7,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LEVENH',                                               +        
               POS=(7,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(7,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ÅR2',                                                  +        
               POS=(7,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0767  DFLD  POS=(7,67),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CRIT',                                                 +        
               POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0809  DFLD  POS=(8,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0814  DFLD  POS=(8,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KÖPV',                                                 +        
               POS=(8,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0828  DFLD  POS=(8,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRIS',                                                 +        
               POS=(8,36),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0844  DFLD  POS=(8,44),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'ÅR3',                                                  +        
               POS=(8,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0867  DFLD  POS=(8,67),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRIT',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0909  DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0914  DFLD  POS=(9,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'A-REG',                                                +        
               POS=(9,20),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0928  DFLD  POS=(9,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RITNR',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1009  DFLD  POS=(10,9),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KÖPT',                                                 +        
               POS=(10,20),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1028  DFLD  POS=(10,28),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FKNGRP',                                               +        
               POS=(11,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1109  DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'INK',                                                  +        
               POS=(11,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1129  DFLD  POS=(11,28),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SORT',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1211  DFLD  POS=(12,11),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'LEVNR',                                                +        
               POS=(12,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1227  DFLD  POS=(12,27),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FÖRB',                                                 +        
               POS=(12,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1241  DFLD  POS=(12,41),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1253  DFLD  POS=(12,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1259  DFLD  POS=(12,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1265  DFLD  POS=(12,65),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1308  DFLD  POS=(13,8),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'UTF',                                                  +        
               POS=(13,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1328  DFLD  POS=(13,28),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1333  DFLD  POS=(13,33),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SLEV',                                                 +        
               POS=(13,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1342  DFLD  POS=(13,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1348  DFLD  POS=(13,48),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1354  DFLD  POS=(13,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1360  DFLD  POS=(13,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1366  DFLD  POS=(13,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1:A AVROP',                                            +        
               POS=(14,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1430  DFLD  POS=(14,30),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1435  DFLD  POS=(14,35),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'ÅRSPROGNOS',                                           +        
               POS=(14,44),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1455  DFLD  POS=(14,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BENÄMNING',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1512  DFLD  POS=(15,12),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'TEKN-NOT',                                             +        
               POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1612  DFLD  POS=(16,12),LTH=50,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'RS',                                                   +        
               POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1706  DFLD  POS=(17,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'UPPF',                                                 +        
               POS=(17,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1718  DFLD  POS=(17,18),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1806  DFLD  POS=(18,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD1818  DFLD  POS=(18,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSL-NOT',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1912  DFLD  POS=(19,12),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'SLÄCK',                                                +        
               POS=(19,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1964  DFLD  POS=(19,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 BYTE SV HOM 15 ERSÄTTNING  16 MARKN.REG   17 ARTIKEL+        
                INF',                                                  +        
               POS=(21,17),LTH=59,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 REG NYA ART 19 BEREDN DATA 20',                     +        
               POS=(22,2),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 ART PROJ/ÄO',                                        +        
               POS=(22,63),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1O11501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F115,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I11501,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0509,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0528,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0546,                                                +        
               LTH=8                                                            
         MFLD  FLD0566,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0610,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0628,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0649,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0667,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0709,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0714,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0728,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0746,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0767,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0809,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0814,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0828,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0844,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0855,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0867,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0909,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0914,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0928,                                                +        
               LTH=4                                                            
         MFLD  FLD1009,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1028,                                                +        
               LTH=4                                                            
         MFLD  FLD1109,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1129,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1227,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1241,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1247,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1253,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1259,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1265,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1308,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1328,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1333,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1342,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1348,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1354,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1360,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1366,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1430,                                                +        
               LTH=4                                                            
         MFLD  FLD1435,                                                +        
               LTH=7                                                            
         MFLD  FLD1455,                                                +        
               LTH=7                                                            
         MFLD  FLD1512,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1612,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1706,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1718,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1806,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1912,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1964,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I11501 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F115),                                           +        
               OPT=2,                                                  +        
               NXT=W1O11501                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11151',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1806,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1818,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1912,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1964,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
