***********************************************************************         
* CREATED BY R035976   ON 92/01/13  AT 10:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KÖBILD FÖRPACKNING              '                               
W1F231   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T231 7',                                           +        
               8='W1T231 8',                                           +        
               9='W1T231 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KÖBILD FÖRPACKNING',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Int/ext lev',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0053 DFLD  POS=(2,14),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Prodsl',                                               +        
               POS=(2,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(2,34),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0054 DFLD  POS=(3,14),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(3,34),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,25),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'S Satsnummer',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,25),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inlevv Ansk Levnr PS Funkgrp SS',                      +        
               POS=(5,50),LTH=31,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(6,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART1   DFLD  POS=(6,25),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TIFINLV1 DFLD  POS=(6,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSK1  DFLD  POS=(6,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR1 DFLD  POS=(6,62),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(6,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(6,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SATSSTA1 DFLD  POS=(6,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
SELECT2  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(7,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART2   DFLD  POS=(7,25),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TIFINLV2 DFLD  POS=(7,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSK2  DFLD  POS=(7,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR2 DFLD  POS=(7,62),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0045 DFLD  POS=(7,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(7,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SATSSTA2 DFLD  POS=(7,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
SELECT3  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0009 DFLD  POS=(8,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART3   DFLD  POS=(8,25),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TIFINLV3 DFLD  POS=(8,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSK3  DFLD  POS=(8,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR3 DFLD  POS=(8,62),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0046 DFLD  POS=(8,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(8,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SATSSTA3 DFLD  POS=(8,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
SELECT4  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0010 DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART4   DFLD  POS=(9,25),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TIFINLV4 DFLD  POS=(9,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSK4  DFLD  POS=(9,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR4 DFLD  POS=(9,62),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0047 DFLD  POS=(9,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(9,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SATSSTA4 DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
SELECT5  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0011 DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART5   DFLD  POS=(10,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TIFINLV5 DFLD  POS=(10,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK5  DFLD  POS=(10,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR5 DFLD  POS=(10,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0048 DFLD  POS=(10,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(10,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SATSSTA5 DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT6  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0012 DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART6   DFLD  POS=(11,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TIFINLV6 DFLD  POS=(11,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK6  DFLD  POS=(11,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR6 DFLD  POS=(11,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0049 DFLD  POS=(11,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0026 DFLD  POS=(11,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SATSSTA6 DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT7  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0013 DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART7   DFLD  POS=(12,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TIFINLV7 DFLD  POS=(12,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK7  DFLD  POS=(12,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR7 DFLD  POS=(12,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0050 DFLD  POS=(12,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0027 DFLD  POS=(12,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SATSSTA7 DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT8  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0014 DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART8   DFLD  POS=(13,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TIFINLV8 DFLD  POS=(13,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK8  DFLD  POS=(13,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR8 DFLD  POS=(13,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0051 DFLD  POS=(13,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0028 DFLD  POS=(13,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SATSSTA8 DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT9  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0015 DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART9   DFLD  POS=(14,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TIFINLV9 DFLD  POS=(14,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK9  DFLD  POS=(14,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR9 DFLD  POS=(14,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0052 DFLD  POS=(14,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0029 DFLD  POS=(14,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SATSSTA9 DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT10 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0003 DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART10  DFLD  POS=(15,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(15,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK10 DFLD  POS=(15,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(15,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(15,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(15,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT11 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART11  DFLD  POS=(16,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(16,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK11 DFLD  POS=(16,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(16,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(16,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(16,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT12 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(17,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART12  DFLD  POS=(17,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(17,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK12 DFLD  POS=(17,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(17,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0042 DFLD  POS=(17,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(17,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT13 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(18,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART13  DFLD  POS=(18,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(18,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK13 DFLD  POS=(18,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(18,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0043 DFLD  POS=(18,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(18,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SELECT14 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0007 DFLD  POS=(19,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART14  DFLD  POS=(19,25),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(19,51),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSK14 DFLD  POS=(19,58),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(19,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0044 DFLD  POS=(19,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(19,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I23101 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F231),                                           +        
               OPT=2,                                                  +        
               NXT=W1O23101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12311',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0053,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0037,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0054,                                               +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0038,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0036,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=9                                                            
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=9                                                            
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=9                                                            
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=9                                                            
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=9                                                            
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=9                                                            
         MFLD  (SELECT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=9                                                            
         MFLD  (SELECT14,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MSGEND                                                                 
W1O23101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F231,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I23101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0053,                                               +        
               LTH=2                                                            
         MFLD  DGIA0037,                                               +        
               LTH=2                                                            
         MFLD  DGIA0035,                                               +        
               LTH=2                                                            
         MFLD  DGIA0054,                                               +        
               LTH=1                                                            
         MFLD  DGIA0038,                                               +        
               LTH=2                                                            
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  BEART1,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV1,                                               +        
               LTH=5                                                            
         MFLD  IDANSK1,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR1,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=2                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA1,                                               +        
               LTH=1                                                            
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  BEART2,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV2,                                               +        
               LTH=5                                                            
         MFLD  IDANSK2,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR2,                                               +        
               LTH=5                                                            
         MFLD  DGIA0045,                                               +        
               LTH=2                                                            
         MFLD  DGIA0022,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA2,                                               +        
               LTH=1                                                            
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=9                                                            
         MFLD  BEART3,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV3,                                               +        
               LTH=5                                                            
         MFLD  IDANSK3,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR3,                                               +        
               LTH=5                                                            
         MFLD  DGIA0046,                                               +        
               LTH=2                                                            
         MFLD  DGIA0023,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA3,                                               +        
               LTH=1                                                            
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=9                                                            
         MFLD  BEART4,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV4,                                               +        
               LTH=5                                                            
         MFLD  IDANSK4,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR4,                                               +        
               LTH=5                                                            
         MFLD  DGIA0047,                                               +        
               LTH=2                                                            
         MFLD  DGIA0024,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA4,                                               +        
               LTH=1                                                            
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  BEART5,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV5,                                               +        
               LTH=5                                                            
         MFLD  IDANSK5,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR5,                                               +        
               LTH=5                                                            
         MFLD  DGIA0048,                                               +        
               LTH=2                                                            
         MFLD  DGIA0025,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA5,                                               +        
               LTH=1                                                            
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=9                                                            
         MFLD  BEART6,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV6,                                               +        
               LTH=5                                                            
         MFLD  IDANSK6,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR6,                                               +        
               LTH=5                                                            
         MFLD  DGIA0049,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA6,                                               +        
               LTH=1                                                            
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  BEART7,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV7,                                               +        
               LTH=5                                                            
         MFLD  IDANSK7,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR7,                                               +        
               LTH=5                                                            
         MFLD  DGIA0050,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA7,                                               +        
               LTH=1                                                            
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  BEART8,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV8,                                               +        
               LTH=5                                                            
         MFLD  IDANSK8,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR8,                                               +        
               LTH=5                                                            
         MFLD  DGIA0051,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA8,                                               +        
               LTH=1                                                            
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=9                                                            
         MFLD  BEART9,                                                 +        
               LTH=25                                                           
         MFLD  TIFINLV9,                                               +        
               LTH=5                                                            
         MFLD  IDANSK9,                                                +        
               LTH=3                                                            
         MFLD  IDLEVNR9,                                               +        
               LTH=5                                                            
         MFLD  DGIA0052,                                               +        
               LTH=2                                                            
         MFLD  DGIA0029,                                               +        
               LTH=4                                                            
         MFLD  SATSSTA9,                                               +        
               LTH=1                                                            
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  BEART10,                                                +        
               LTH=25                                                           
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  IDANSK10,                                               +        
               LTH=3                                                            
         MFLD  DGIA0030,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=2                                                            
         MFLD  DGIA0017,                                               +        
               LTH=4                                                            
         MFLD  DGIA0055,                                               +        
               LTH=1                                                            
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=9                                                            
         MFLD  BEART11,                                                +        
               LTH=25                                                           
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  IDANSK11,                                               +        
               LTH=3                                                            
         MFLD  DGIA0031,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=2                                                            
         MFLD  DGIA0018,                                               +        
               LTH=4                                                            
         MFLD  DGIA0056,                                               +        
               LTH=1                                                            
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=9                                                            
         MFLD  BEART12,                                                +        
               LTH=25                                                           
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  IDANSK12,                                               +        
               LTH=3                                                            
         MFLD  DGIA0032,                                               +        
               LTH=5                                                            
         MFLD  DGIA0042,                                               +        
               LTH=2                                                            
         MFLD  DGIA0019,                                               +        
               LTH=4                                                            
         MFLD  DGIA0057,                                               +        
               LTH=1                                                            
         MFLD  SELECT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=9                                                            
         MFLD  BEART13,                                                +        
               LTH=25                                                           
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  IDANSK13,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=5                                                            
         MFLD  DGIA0043,                                               +        
               LTH=2                                                            
         MFLD  DGIA0020,                                               +        
               LTH=4                                                            
         MFLD  DGIA0058,                                               +        
               LTH=1                                                            
         MFLD  SELECT14,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MFLD  BEART14,                                                +        
               LTH=25                                                           
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  IDANSK14,                                               +        
               LTH=3                                                            
         MFLD  DGIA0034,                                               +        
               LTH=5                                                            
         MFLD  DGIA0044,                                               +        
               LTH=2                                                            
         MFLD  DGIA0021,                                               +        
               LTH=4                                                            
         MFLD  DGIA0059,                                               +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
