***********************************************************************         
* CREATED BY R035976   ON 93/02/18  AT 13:40                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STRUKTURHISTORIK                '                               
W1F214   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T214 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T214 7',                                           +        
               8='W1T214 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T211  ',                                          +        
               14='W1T212  ',                                          +        
               15='W1T213  ',                                          +        
               16='W1T214  ',                                          +        
               17='W1T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'STRUKTURHISTORIK',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Strukturnummer',                                       +        
               POS=(2,2),LTH=14,                                       +        
               ATTR=(ALPHA,PROT)                                                
STRNR    DFLD  POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(2,37),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Vecka  fom',                                           +        
               POS=(2,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVF  DFLD  POS=(2,58),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'tom',                                                  +        
               POS=(2,64),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIAAVVT  DFLD  POS=(2,68),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(3,17),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,37),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(3,58),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(3,68),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0005 DFLD  POS=(4,8),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0008 DFLD  POS=(4,24),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'S  Antal Levnr Artnr/Levbet',                          +        
               POS=(5,2),LTH=27,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ÄO-tillk  Vecka ÄO-utgår  Vecka S',                    +        
               POS=(5,48),LTH=33,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ANTAL1   DFLD  POS=(6,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR1 DFLD  POS=(6,11),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV1   DFLD  POS=(6,17),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
IDAOT1   DFLD  POS=(6,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVA1 DFLD  POS=(6,59),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDAOU1   DFLD  POS=(6,64),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVB1 DFLD  POS=(6,75),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
STRTYP1  DFLD  POS=(6,80),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
SELECT2  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ANTAL2   DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR2 DFLD  POS=(7,11),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV2   DFLD  POS=(7,17),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
IDAOT2   DFLD  POS=(7,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVA2 DFLD  POS=(7,59),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDAOU2   DFLD  POS=(7,64),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVB2 DFLD  POS=(7,75),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
STRTYP2  DFLD  POS=(7,80),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
SELECT3  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ANTAL3   DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR3 DFLD  POS=(8,11),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV3   DFLD  POS=(8,17),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
IDAOT3   DFLD  POS=(8,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVA3 DFLD  POS=(8,59),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDAOU3   DFLD  POS=(8,64),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVB3 DFLD  POS=(8,75),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
STRTYP3  DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
SELECT4  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ANTAL4   DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR4 DFLD  POS=(9,11),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV4   DFLD  POS=(9,17),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
IDAOT4   DFLD  POS=(9,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVA4 DFLD  POS=(9,59),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDAOU4   DFLD  POS=(9,64),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAAVVB4 DFLD  POS=(9,75),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
STRTYP4  DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
SELECT5  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL5   DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR5 DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV5   DFLD  POS=(10,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT5   DFLD  POS=(10,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVA5 DFLD  POS=(10,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU5   DFLD  POS=(10,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVB5 DFLD  POS=(10,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP5  DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT6  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL6   DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR6 DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV6   DFLD  POS=(11,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT6   DFLD  POS=(11,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVA6 DFLD  POS=(11,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU6   DFLD  POS=(11,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVB6 DFLD  POS=(11,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP6  DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT7  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL7   DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR7 DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV7   DFLD  POS=(12,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT7   DFLD  POS=(12,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVA7 DFLD  POS=(12,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU7   DFLD  POS=(12,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVB7 DFLD  POS=(12,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP7  DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT8  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL8   DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR8 DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV8   DFLD  POS=(13,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT8   DFLD  POS=(13,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVA8 DFLD  POS=(13,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU8   DFLD  POS=(13,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVB8 DFLD  POS=(13,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP8  DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT9  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL9   DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR9 DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV9   DFLD  POS=(14,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT9   DFLD  POS=(14,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVA9 DFLD  POS=(14,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU9   DFLD  POS=(14,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIAAVVB9 DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP9  DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT10 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL10  DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV10  DFLD  POS=(15,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT10  DFLD  POS=(15,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(15,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU10  DFLD  POS=(15,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(15,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP10 DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT11 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL11  DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV11  DFLD  POS=(16,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT11  DFLD  POS=(16,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(16,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU11  DFLD  POS=(16,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(16,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP11 DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT12 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL12  DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV12  DFLD  POS=(17,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT12  DFLD  POS=(17,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(17,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU12  DFLD  POS=(17,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(17,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP12 DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT13 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANTAL13  DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(18,11),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BELEV13  DFLD  POS=(18,17),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
IDAOT13  DFLD  POS=(18,48),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(18,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDAOU13  DFLD  POS=(18,64),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(18,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
STRTYP13 DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Printer',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KDPRTVAL DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'A=RA    B=RB   C=SA2  D=CARPAC',                       +        
               POS=(19,13),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 UPPD STRNR  14 UPPD STRRAD   15 STRUKTUR    16 HISTO+        
               RIK',                                                   +        
               POS=(21,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 FÖRPACKNING',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I21401 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F214),                                           +        
               OPT=2,                                                  +        
               NXT=W1O21401                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12141',                                                +        
               LTH=5                                                            
         MFLD  (STRNR,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIAAVVF,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAAVVT,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR1,                                               +        
               LTH=5                                                            
         MFLD  BELEV1,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP1,                                                +        
               LTH=1                                                            
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=5                                                            
         MFLD  BELEV2,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP2,                                                +        
               LTH=1                                                            
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR3,                                               +        
               LTH=5                                                            
         MFLD  BELEV3,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP3,                                                +        
               LTH=1                                                            
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR4,                                               +        
               LTH=5                                                            
         MFLD  BELEV4,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP4,                                                +        
               LTH=1                                                            
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR5,                                               +        
               LTH=5                                                            
         MFLD  BELEV5,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP5,                                                +        
               LTH=1                                                            
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR6,                                               +        
               LTH=5                                                            
         MFLD  BELEV6,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP6,                                                +        
               LTH=1                                                            
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR7,                                               +        
               LTH=5                                                            
         MFLD  BELEV7,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP7,                                                +        
               LTH=1                                                            
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR8,                                               +        
               LTH=5                                                            
         MFLD  BELEV8,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP8,                                                +        
               LTH=1                                                            
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDLEVNR9,                                               +        
               LTH=5                                                            
         MFLD  BELEV9,                                                 +        
               LTH=30                                                           
         MFLD  STRTYP9,                                                +        
               LTH=1                                                            
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  BELEV10,                                                +        
               LTH=30                                                           
         MFLD  STRTYP10,                                               +        
               LTH=1                                                            
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  BELEV11,                                                +        
               LTH=30                                                           
         MFLD  STRTYP11,                                               +        
               LTH=1                                                            
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  BELEV12,                                                +        
               LTH=30                                                           
         MFLD  STRTYP12,                                               +        
               LTH=1                                                            
         MFLD  (SELECT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  BELEV13,                                                +        
               LTH=30                                                           
         MFLD  STRTYP13,                                               +        
               LTH=1                                                            
         MFLD  (KDPRTVAL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O21401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F214,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I21401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  STRNR,                                                  +        
               LTH=9                                                            
         MFLD  DGIA0009,                                               +        
               LTH=9                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  TIAAVVF,                                                +        
               LTH=4                                                            
         MFLD  DGIA0018,                                               +        
               LTH=4                                                            
         MFLD  TIAAVVT,                                                +        
               LTH=4                                                            
         MFLD  DGIA0019,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL1,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR1,                                               +        
               LTH=5                                                            
         MFLD  BELEV1,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT1,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA1,                                               +        
               LTH=4                                                            
         MFLD  IDAOU1,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB1,                                               +        
               LTH=4                                                            
         MFLD  STRTYP1,                                                +        
               LTH=1                                                            
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL2,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR2,                                               +        
               LTH=5                                                            
         MFLD  BELEV2,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT2,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA2,                                               +        
               LTH=4                                                            
         MFLD  IDAOU2,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB2,                                               +        
               LTH=4                                                            
         MFLD  STRTYP2,                                                +        
               LTH=1                                                            
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL3,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR3,                                               +        
               LTH=5                                                            
         MFLD  BELEV3,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT3,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA3,                                               +        
               LTH=4                                                            
         MFLD  IDAOU3,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB3,                                               +        
               LTH=4                                                            
         MFLD  STRTYP3,                                                +        
               LTH=1                                                            
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL4,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR4,                                               +        
               LTH=5                                                            
         MFLD  BELEV4,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT4,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA4,                                               +        
               LTH=4                                                            
         MFLD  IDAOU4,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB4,                                               +        
               LTH=4                                                            
         MFLD  STRTYP4,                                                +        
               LTH=1                                                            
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL5,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR5,                                               +        
               LTH=5                                                            
         MFLD  BELEV5,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT5,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA5,                                               +        
               LTH=4                                                            
         MFLD  IDAOU5,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB5,                                               +        
               LTH=4                                                            
         MFLD  STRTYP5,                                                +        
               LTH=1                                                            
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL6,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR6,                                               +        
               LTH=5                                                            
         MFLD  BELEV6,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT6,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA6,                                               +        
               LTH=4                                                            
         MFLD  IDAOU6,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB6,                                               +        
               LTH=4                                                            
         MFLD  STRTYP6,                                                +        
               LTH=1                                                            
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL7,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR7,                                               +        
               LTH=5                                                            
         MFLD  BELEV7,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT7,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA7,                                               +        
               LTH=4                                                            
         MFLD  IDAOU7,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB7,                                               +        
               LTH=4                                                            
         MFLD  STRTYP7,                                                +        
               LTH=1                                                            
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL8,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR8,                                               +        
               LTH=5                                                            
         MFLD  BELEV8,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT8,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA8,                                               +        
               LTH=4                                                            
         MFLD  IDAOU8,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB8,                                               +        
               LTH=4                                                            
         MFLD  STRTYP8,                                                +        
               LTH=1                                                            
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL9,                                                 +        
               LTH=6                                                            
         MFLD  IDLEVNR9,                                               +        
               LTH=5                                                            
         MFLD  BELEV9,                                                 +        
               LTH=30                                                           
         MFLD  IDAOT9,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVA9,                                               +        
               LTH=4                                                            
         MFLD  IDAOU9,                                                 +        
               LTH=10                                                           
         MFLD  TIAAVVB9,                                               +        
               LTH=4                                                            
         MFLD  STRTYP9,                                                +        
               LTH=1                                                            
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL10,                                                +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  BELEV10,                                                +        
               LTH=30                                                           
         MFLD  IDAOT10,                                                +        
               LTH=10                                                           
         MFLD  DGIA0010,                                               +        
               LTH=4                                                            
         MFLD  IDAOU10,                                                +        
               LTH=10                                                           
         MFLD  DGIA0014,                                               +        
               LTH=4                                                            
         MFLD  STRTYP10,                                               +        
               LTH=1                                                            
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL11,                                                +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  BELEV11,                                                +        
               LTH=30                                                           
         MFLD  IDAOT11,                                                +        
               LTH=10                                                           
         MFLD  DGIA0011,                                               +        
               LTH=4                                                            
         MFLD  IDAOU11,                                                +        
               LTH=10                                                           
         MFLD  DGIA0015,                                               +        
               LTH=4                                                            
         MFLD  STRTYP11,                                               +        
               LTH=1                                                            
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL12,                                                +        
               LTH=6                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  BELEV12,                                                +        
               LTH=30                                                           
         MFLD  IDAOT12,                                                +        
               LTH=10                                                           
         MFLD  DGIA0012,                                               +        
               LTH=4                                                            
         MFLD  IDAOU12,                                                +        
               LTH=10                                                           
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  STRTYP12,                                               +        
               LTH=1                                                            
         MFLD  SELECT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL13,                                                +        
               LTH=6                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  BELEV13,                                                +        
               LTH=30                                                           
         MFLD  IDAOT13,                                                +        
               LTH=10                                                           
         MFLD  DGIA0013,                                               +        
               LTH=4                                                            
         MFLD  IDAOU13,                                                +        
               LTH=10                                                           
         MFLD  DGIA0017,                                               +        
               LTH=4                                                            
         MFLD  STRTYP13,                                               +        
               LTH=1                                                            
         MFLD  KDPRTVAL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
