***********************************************************************         
* CREATED BY PC59625   ON 98/08/18  AT 14:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPDATERA STRUKTURNR            '                               
W1F211   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T211 7',                                           +        
               8='W1T211 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T211U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T211  ',                                          +        
               14='W1T212  ',                                          +        
               15='W1T213  ',                                          +        
               16='W1T214  ',                                          +        
               17='W1T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPPDATERA STRUKTURNUMMER',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Strukturnummer',                                       +        
               POS=(2,2),LTH=14,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,40),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,46),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(3,17),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,46),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Nytt strukturnummer',                                  +        
               POS=(5,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(5,22),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Benämning',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(6,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Homkod',                                               +        
               POS=(6,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(6,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regdatum',                                             +        
               POS=(6,52),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(6,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(7,12),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0011 DFLD  POS=(7,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prodsl',                                               +        
               POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(8,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Funkgrp',                                              +        
               POS=(8,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(8,29),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Strtyp',                                               +        
               POS=(8,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(8,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Borttag',                                              +        
               POS=(8,52),LTH=7,                                       +        
               ATTR=(PROT)                                                      
BORT     DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0013 DFLD  POS=(9,12),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0005 DFLD  POS=(9,29),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(9,46),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Levnr',                                                +        
               POS=(11,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(11,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ek',                                                   +        
               POS=(11,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Levbet',                                               +        
               POS=(12,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BELEVART DFLD  POS=(12,10),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'ÄO-nr',                                                +        
               POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDAO1    DFLD  POS=(14,10),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDAO2    DFLD  POS=(14,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDAO3    DFLD  POS=(14,32),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDAO4    DFLD  POS=(14,43),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDAO5    DFLD  POS=(14,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Bernot',                                               +        
               POS=(15,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEARTNOT DFLD  POS=(15,10),LTH=40,                                     +        
               ATTR=(PROT)                                                      
BERNOT7  DFLD  POS=(16,10),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Strnot',                                               +        
               POS=(17,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(17,10),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0016 DFLD  POS=(18,10),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 UPPD STRNR  14 UPPD STRRAD   15 STRUKTUR    16 HISTO+        
               RIK',                                                   +        
               POS=(21,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 FÖRPACKNING',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I21101 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F211),                                           +        
               OPT=2,                                                  +        
               NXT=W1O21101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '12111',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BORT,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0015,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (DGIA0016,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MSGEND                                                                 
W1O21101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F211,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I21101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=9                                                            
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  DGIA0003,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=25                                                           
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  BORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  BELEVART,                                               +        
               LTH=30                                                           
         MFLD  IDAO1,                                                  +        
               LTH=10                                                           
         MFLD  IDAO2,                                                  +        
               LTH=10                                                           
         MFLD  IDAO3,                                                  +        
               LTH=10                                                           
         MFLD  IDAO4,                                                  +        
               LTH=10                                                           
         MFLD  IDAO5,                                                  +        
               LTH=10                                                           
         MFLD  TEARTNOT,                                               +        
               LTH=40                                                           
         MFLD  BERNOT7,                                                +        
               LTH=40                                                           
         MFLD  DGIA0015,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
