***********************************************************************         
* CREATED BY PC59625   ON 96/08/23  AT 12:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LÅN, AVSNITT                    '                               
W1F552   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T552U ',                                           +        
               4='W1T552 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T552 7',                                           +        
               8='W1T552 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T552U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T552U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((6,21)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LÅN, AVSNITT',                                         +        
               POS=(1,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
PUBSPAR  DFLD  POS=(4,3),LTH=6,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FRÅN',                                                 +        
               POS=(5,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TILL',                                                 +        
               POS=(5,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KATALOG',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(6,21),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOG',                                              +        
               POS=(6,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(6,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(7,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(8,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLUMN (A-E)',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(9,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'KOLUMN (A-E)',                                         +        
               POS=(9,35),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FRÅN OCH MED RAD',                                     +        
               POS=(10,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(10,22),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RAD START',                                            +        
               POS=(10,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TILL OCH MED RAD',                                     +        
               POS=(11,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FRÅN OCH MED POS',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'TILL OCH MED POS',                                     +        
               POS=(13,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(13,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FRÅN',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PUBFF    DFLD  POS=(14,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FRÅN',                                             +        
               POS=(14,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTF    DFLD  POS=(14,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB TILL',                                             +        
               POS=(15,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTT    DFLD  POS=(15,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 AVSN, OMNUM  14 LÅN, KOL/RAD 15',                   +        
               POS=(21,1),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,1),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T552U ',                                           +        
               4='W1T552 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T552 7',                                           +        
               8='W1T552 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T552U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T552U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((6,21)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LÅN, AVSNITT',                                         +        
               POS=(1,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
PUBSPAR  DFLD  POS=(3,9),LTH=6,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FRÅN',                                                 +        
               POS=(5,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TILL',                                                 +        
               POS=(5,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KATALOG',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(6,21),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOG',                                              +        
               POS=(6,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(6,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(7,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(8,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLUMN (A-E)',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(9,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'KOLUMN (A-E)',                                         +        
               POS=(9,35),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FRÅN OCH MED RAD',                                     +        
               POS=(10,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(10,22),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RAD START',                                            +        
               POS=(10,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TILL OCH MED RAD',                                     +        
               POS=(11,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FRÅN OCH MED POS',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'TILL OCH MED POS',                                     +        
               POS=(13,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(13,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FRÅN',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PUBFF    DFLD  POS=(14,23),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FRÅN',                                             +        
               POS=(14,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTF    DFLD  POS=(14,48),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB TILL',                                             +        
               POS=(15,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTT    DFLD  POS=(15,48),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 AVSN, OMNUM  14 LÅN, KOL/RAD 15',                   +        
               POS=(21,1),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,1),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O55201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F552,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I55201,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0004,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBFF,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBTF,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBTT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4                                                            
         MFLD  PUBSPAR,                                                +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I55201 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F552),                                           +        
               OPT=2,                                                  +        
               NXT=W1O55201                                                     
DGI2     LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15521',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBFF,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBTF,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBTT,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PUBSPAR,                                                +        
               LTH=6,                                                  +        
               FILL=X'00'                                                       
         MSGEND                                                                 
         END                                                                    
