***********************************************************************         
* CREATED BY PC59625   ON 95/12/01  AT 10:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TILLÄGGSTEXT FRÅGA              '                               
W1F505   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T505  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T505 7',                                           +        
               8='W1T505 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T505  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T501  ',                                          +        
               14='W1T502  ',                                          +        
               15='W1T503  ',                                          +        
               16='W0T501  ',                                          +        
               17='W1T505  ',                                          +        
               18='W1T506  ',                                          +        
               19='W0T501  ',                                          +        
               20='W1T508  ',                                          +        
               21='W1T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T505  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TILLÄGGSTEXT, SÖKNING',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'SÖKORD',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=25,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SPRÅK',                                                +        
               POS=(2,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0241  DFLD  POS=(2,41),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'NUMMER',                                               +        
               POS=(2,45),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0252  DFLD  POS=(2,52),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0309  DFLD  POS=(3,9),LTH=25,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0341  DFLD  POS=(3,41),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0352  DFLD  POS=(3,52),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0415  DFLD  POS=(4,15),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'TILLÄGGSNR  TILLÄGGSTEXT',                             +        
               POS=(5,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SPRÅK',                                                +        
               POS=(5,41),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0606  DFLD  POS=(6,6),LTH=75,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0706  DFLD  POS=(7,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD0806  DFLD  POS=(8,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD0906  DFLD  POS=(9,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD1006  DFLD  POS=(10,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1106  DFLD  POS=(11,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1206  DFLD  POS=(12,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1306  DFLD  POS=(13,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1406  DFLD  POS=(14,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1506  DFLD  POS=(15,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1606  DFLD  POS=(16,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1706  DFLD  POS=(17,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1806  DFLD  POS=(18,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1906  DFLD  POS=(19,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 RUB SÖKORD   14 RUB SÖK GRP  15 RUB UPPDAT   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 TTEXT SÖKORD',                                      +        
               POS=(21,66),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 TTEXT UPPDAT 19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20FOTNOT SÖKORD 21FOTNOT UPPDAT 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T505  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T505 7',                                           +        
               8='W1T505 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T505  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T501  ',                                          +        
               14='W1T502  ',                                          +        
               15='W1T503  ',                                          +        
               16='W0T501  ',                                          +        
               17='W1T505  ',                                          +        
               18='W1T506  ',                                          +        
               19='W0T501  ',                                          +        
               20='W1T508  ',                                          +        
               21='W1T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T505  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TILLÄGGSTEXT, SÖKNING',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'SÖKORD',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0209  DFLD  POS=(2,9),LTH=25,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SPRÅK',                                                +        
               POS=(2,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0241  DFLD  POS=(2,41),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'NUMMER',                                               +        
               POS=(2,45),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0252  DFLD  POS=(2,52),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0309  DFLD  POS=(3,9),LTH=25,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0341  DFLD  POS=(3,41),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0352  DFLD  POS=(3,52),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0415  DFLD  POS=(4,15),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'TILLÄGGSNR  TILLÄGGSTEXT',                             +        
               POS=(5,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SPRÅK',                                                +        
               POS=(5,41),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0606  DFLD  POS=(6,6),LTH=75,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0706  DFLD  POS=(7,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD0806  DFLD  POS=(8,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD0906  DFLD  POS=(9,6),LTH=75,                                       +        
               ATTR=(PROT)                                                      
FLD1006  DFLD  POS=(10,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1106  DFLD  POS=(11,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1206  DFLD  POS=(12,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1306  DFLD  POS=(13,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1406  DFLD  POS=(14,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1506  DFLD  POS=(15,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1606  DFLD  POS=(16,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1706  DFLD  POS=(17,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1806  DFLD  POS=(18,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
FLD1906  DFLD  POS=(19,6),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 RUB SÖKORD   14 RUB SÖK GRP  15 RUB UPPDAT   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 TTEXT SÖKORD',                                      +        
               POS=(21,66),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 TTEXT UPPDAT 19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20FOTNOT SÖKORD 21FOTNOT UPPDAT 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O50501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F505,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I50501,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0309,                                                +        
               LTH=25                                                           
         MFLD  FLD0241,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0341,                                                +        
               LTH=3                                                            
         MFLD  FLD0252,                                                +        
               LTH=5                                                            
         MFLD  FLD0352,                                                +        
               LTH=5                                                            
         MFLD  FLD0415,                                                +        
               LTH=5                                                            
         MFLD  FLD0606,                                                +        
               LTH=75                                                           
         MFLD  FLD0706,                                                +        
               LTH=75                                                           
         MFLD  FLD0806,                                                +        
               LTH=75                                                           
         MFLD  FLD0906,                                                +        
               LTH=75                                                           
         MFLD  FLD1006,                                                +        
               LTH=75                                                           
         MFLD  FLD1106,                                                +        
               LTH=75                                                           
         MFLD  FLD1206,                                                +        
               LTH=75                                                           
         MFLD  FLD1306,                                                +        
               LTH=75                                                           
         MFLD  FLD1406,                                                +        
               LTH=75                                                           
         MFLD  FLD1506,                                                +        
               LTH=75                                                           
         MFLD  FLD1606,                                                +        
               LTH=75                                                           
         MFLD  FLD1706,                                                +        
               LTH=75                                                           
         MFLD  FLD1806,                                                +        
               LTH=75                                                           
         MFLD  FLD1906,                                                +        
               LTH=75                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I50501 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F505),                                           +        
               OPT=2,                                                  +        
               NXT=W1O50501                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15051',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0309,                                                +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0241,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0341,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0252,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0352,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0606,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
