***********************************************************************         
* CREATED BY PC28439   ON 98/07/01  AT 07:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LISTBESTÄLLNING, REDAKTÖR       '                               
W1F524   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T524U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T521  ',                                          +        
               14='W1T522  ',                                          +        
               15='W1T523  ',                                          +        
               16='W1T524  ',                                          +        
               17='W1T525  ',                                          +        
               18='W1T526  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((5,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LISTBESTÄLLNING, REDAKTÖR',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Starta jobb',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0514  DFLD  POS=(5,14),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Katalog',                                              +        
               POS=(5,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0532  DFLD  POS=(5,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Benämningsspråk 1',                                    +        
               POS=(5,50),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0568  DFLD  POS=(5,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(6,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0668  DFLD  POS=(6,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Fotnotsspråk 1',                                       +        
               POS=(7,53),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0768  DFLD  POS=(7,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(8,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0868  DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '3',                                                    +        
               POS=(9,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0968  DFLD  POS=(9,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '4',                                                    +        
               POS=(10,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1068  DFLD  POS=(10,68),LTH=3,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDPRTVAL DFLD  POS=(11,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Fr.o.m. ers datum',                                    +        
               POS=(12,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TIERSDAT DFLD  POS=(12,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '(ÅÅVV) för föregående Ä-tjänst.',                      +        
               POS=(12,25),LTH=31,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '1 = KATALOG-KONTROLL (På katalog under redigering. OMBR+        
               YTNINGS-KOLL)',                                         +        
               POS=(14,2),LTH=68,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 = SPRÅK-KONTROLL   (På aktuell/senaste utgåva.)',    +        
               POS=(16,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3 = ÄNDRINGSTJÄNST   (Visar ersättningar och ev. utg. b+        
               enämningar)',                                           +        
               POS=(18,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Asterisk i Benämningsspråk 2, ger listning av katalogen+        
               s fotnoter.',                                           +        
               POS=(19,6),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Övers.Bevakn  14 Lån Kat/Grp    15 Lista LEX   16 Li+        
               sta RED  17 Ombrytning',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Kat.ben.Övers.19',                                  +        
               POS=(22,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 Info',                                               +        
               POS=(22,53),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T524U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T521  ',                                          +        
               14='W1T522  ',                                          +        
               15='W1T523  ',                                          +        
               16='W1T524  ',                                          +        
               17='W1T525  ',                                          +        
               18='W1T526  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((5,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LISTBESTÄLLNING, REDAKTÖR',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Starta jobb',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0514  DFLD  POS=(5,14),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Katalog',                                              +        
               POS=(5,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0532  DFLD  POS=(5,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Benämningsspråk 1',                                    +        
               POS=(5,50),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0568  DFLD  POS=(5,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(6,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0668  DFLD  POS=(6,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Fotnotsspråk 1',                                       +        
               POS=(7,53),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0768  DFLD  POS=(7,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(8,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0868  DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '3',                                                    +        
               POS=(9,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0968  DFLD  POS=(9,68),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '4',                                                    +        
               POS=(10,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1068  DFLD  POS=(10,68),LTH=3,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDPRTVAL DFLD  POS=(11,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Fr.o.m. ers datum',                                    +        
               POS=(12,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TIERSDAT DFLD  POS=(12,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '(ÅÅVV) för föregående Ä-tjänst.',                      +        
               POS=(12,25),LTH=31,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '1 = KATALOG-KONTROLL (På katalog under redigering. OMBR+        
               YTNINGS-KOLL)',                                         +        
               POS=(14,2),LTH=68,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 = SPRÅK-KONTROLL   (På aktuell/senaste utgåva.)',    +        
               POS=(16,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3 = ÄNDRINGSTJÄNST   (Visar ersättningar och ev. utg. b+        
               enämningar)',                                           +        
               POS=(18,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Asterisk i Benämningsspråk 2, ger listning av katalogen+        
               s fotnoter.',                                           +        
               POS=(19,6),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Övers.Bevakn  14 Lån Kat/Grp    15 Lista LEX   16 Li+        
               sta RED  17 Ombrytning',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Kat.ben.Övers.19',                                  +        
               POS=(22,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 Info',                                               +        
               POS=(22,53),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O52401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F524,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I52401,                                           +        
               FILL=PT                                                          
DGIMOD24 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0514,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0532,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0568,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0668,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0768,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0868,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0968,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1068,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  (KDPRTVAL,                                              +        
               ' '),                                                   +        
               LTH=4                                                            
         MFLD  TIERSDAT,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I52401 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F524),                                           +        
               OPT=2,                                                  +        
               NXT=W1O52401                                                     
DGIMID24 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15241',                                                +        
               LTH=5                                                            
         MFLD  (FLD0514,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0532,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0568,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0668,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0768,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0868,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0968,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1068,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDPRTVAL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIERSDAT,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
