***********************************************************************         
* CREATED BY PC28439   ON 96/05/28  AT 08:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RADNOT & HÄNVISN                '                               
W1F513   FMT                                                                    
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T513U ',                                           +        
               4='W1T513 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T513 7',                                           +        
               8='W1T513 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T513U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T513U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1F513   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RADNOTERING & SIDHÄNVISNING',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalognr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
CATNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grupp',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CATGRPIN DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsnitt',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
CATAVSIN DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SPRAKIN  DFLD  POS=(2,50),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radnr',                                                +        
               POS=(2,55),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CATRADIN DFLD  POS=(2,61),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RadPUB',                                               +        
               POS=(2,68),LTH=6,                                       +        
               ATTR=(PROT)                                                      
RADPUBIN DFLD  POS=(2,75),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
CATNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
CATGRPUT DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSUT DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SPRAKUT  DFLD  POS=(3,50),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
CATRADUT DFLD  POS=(3,61),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RADPUBUT DFLD  POS=(3,75),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PUBMIN   DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
PUBMAX   DFLD  POS=(4,7),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Notering',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0511  DFLD  POS=(5,11),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sidhänvisning till',                                   +        
               POS=(7,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Referens från',                                        +        
               POS=(7,53),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Grupp  Avsn   Rad   PUB    B/A',                       +        
               POS=(8,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Grupp  Avsn    Rad  PUB   B/A',                        +        
               POS=(8,53),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Grupp  Avsn    Rad  PUB   B/A',                        +        
               POS=(8,88),LTH=29,                                      +        
               ATTR=(PROT)                                                      
SIDHGRP  DFLD  POS=(9,4),LTH=2,                                        +        
               ATTR=(PROT)                                                      
SIDHAVS  DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
SIDHRAD  DFLD  POS=(9,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SIDHPUBF DFLD  POS=(9,22),LTH=3,                                       +        
               ATTR=(PROT)                                                      
SIDHPUBT DFLD  POS=(9,26),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SIDHAEN  DFLD  POS=(9,30),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KATGRP01 DFLD  POS=(9,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KATAVS01 DFLD  POS=(9,60),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KATRAD01 DFLD  POS=(9,67),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CATPUB01 DFLD  POS=(9,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
HANREF01 DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KATGRP15 DFLD  POS=(9,90),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KATAVS15 DFLD  POS=(9,95),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KATRAD15 DFLD  POS=(9,102),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB15 DFLD  POS=(9,108),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF15 DFLD  POS=(9,114),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP02 DFLD  POS=(10,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS02 DFLD  POS=(10,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD02 DFLD  POS=(10,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB02 DFLD  POS=(10,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF02 DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP16 DFLD  POS=(10,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS16 DFLD  POS=(10,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD16 DFLD  POS=(10,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB16 DFLD  POS=(10,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF16 DFLD  POS=(10,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Eventuella referenser till detta avsnittshuvud',       +        
               POS=(11,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
KATGRP03 DFLD  POS=(11,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS03 DFLD  POS=(11,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD03 DFLD  POS=(11,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB03 DFLD  POS=(11,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF03 DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP17 DFLD  POS=(11,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS17 DFLD  POS=(11,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD17 DFLD  POS=(11,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB17 DFLD  POS=(11,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF17 DFLD  POS=(11,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '0       10 A    11 B    12 C    13 D    14 E',         +        
               POS=(12,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
KATGRP04 DFLD  POS=(12,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS04 DFLD  POS=(12,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD04 DFLD  POS=(12,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB04 DFLD  POS=(12,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF04 DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP18 DFLD  POS=(12,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS18 DFLD  POS=(12,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD18 DFLD  POS=(12,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB18 DFLD  POS=(12,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF18 DFLD  POS=(12,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'R       R PUB   R PUB   R PUB   R PUB   R PUB',        +        
               POS=(13,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
KATGRP05 DFLD  POS=(13,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS05 DFLD  POS=(13,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD05 DFLD  POS=(13,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB05 DFLD  POS=(13,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF05 DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP19 DFLD  POS=(13,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS19 DFLD  POS=(13,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD19 DFLD  POS=(13,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB19 DFLD  POS=(13,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF19 DFLD  POS=(13,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFAVSN  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REFKOLA1 DFLD  POS=(14,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA1 DFLD  POS=(14,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB1 DFLD  POS=(14,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB1 DFLD  POS=(14,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC1 DFLD  POS=(14,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC1 DFLD  POS=(14,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD1 DFLD  POS=(14,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD1 DFLD  POS=(14,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE1 DFLD  POS=(14,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE1 DFLD  POS=(14,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP06 DFLD  POS=(14,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS06 DFLD  POS=(14,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD06 DFLD  POS=(14,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB06 DFLD  POS=(14,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF06 DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP20 DFLD  POS=(14,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS20 DFLD  POS=(14,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD20 DFLD  POS=(14,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB20 DFLD  POS=(14,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF20 DFLD  POS=(14,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA2 DFLD  POS=(15,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA2 DFLD  POS=(15,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB2 DFLD  POS=(15,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB2 DFLD  POS=(15,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC2 DFLD  POS=(15,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC2 DFLD  POS=(15,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD2 DFLD  POS=(15,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD2 DFLD  POS=(15,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE2 DFLD  POS=(15,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE2 DFLD  POS=(15,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP07 DFLD  POS=(15,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS07 DFLD  POS=(15,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD07 DFLD  POS=(15,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB07 DFLD  POS=(15,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF07 DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP21 DFLD  POS=(15,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS21 DFLD  POS=(15,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD21 DFLD  POS=(15,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB21 DFLD  POS=(15,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF21 DFLD  POS=(15,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA3 DFLD  POS=(16,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA3 DFLD  POS=(16,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB3 DFLD  POS=(16,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB3 DFLD  POS=(16,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC3 DFLD  POS=(16,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC3 DFLD  POS=(16,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD3 DFLD  POS=(16,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD3 DFLD  POS=(16,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE3 DFLD  POS=(16,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE3 DFLD  POS=(16,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP08 DFLD  POS=(16,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS08 DFLD  POS=(16,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD08 DFLD  POS=(16,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB08 DFLD  POS=(16,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF08 DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP22 DFLD  POS=(16,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS22 DFLD  POS=(16,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD22 DFLD  POS=(16,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB22 DFLD  POS=(16,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF22 DFLD  POS=(16,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA4 DFLD  POS=(17,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA4 DFLD  POS=(17,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB4 DFLD  POS=(17,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB4 DFLD  POS=(17,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC4 DFLD  POS=(17,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC4 DFLD  POS=(17,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD4 DFLD  POS=(17,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD4 DFLD  POS=(17,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE4 DFLD  POS=(17,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE4 DFLD  POS=(17,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP09 DFLD  POS=(17,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS09 DFLD  POS=(17,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD09 DFLD  POS=(17,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB09 DFLD  POS=(17,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF09 DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP23 DFLD  POS=(17,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS23 DFLD  POS=(17,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD23 DFLD  POS=(17,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB23 DFLD  POS=(17,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF23 DFLD  POS=(17,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA5 DFLD  POS=(18,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA5 DFLD  POS=(18,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB5 DFLD  POS=(18,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB5 DFLD  POS=(18,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC5 DFLD  POS=(18,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC5 DFLD  POS=(18,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD5 DFLD  POS=(18,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD5 DFLD  POS=(18,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE5 DFLD  POS=(18,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE5 DFLD  POS=(18,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP10 DFLD  POS=(18,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS10 DFLD  POS=(18,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD10 DFLD  POS=(18,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB10 DFLD  POS=(18,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF10 DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP24 DFLD  POS=(18,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS24 DFLD  POS=(18,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD24 DFLD  POS=(18,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB24 DFLD  POS=(18,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF24 DFLD  POS=(18,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA6 DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA6 DFLD  POS=(19,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB6 DFLD  POS=(19,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB6 DFLD  POS=(19,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC6 DFLD  POS=(19,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC6 DFLD  POS=(19,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD6 DFLD  POS=(19,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD6 DFLD  POS=(19,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE6 DFLD  POS=(19,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE6 DFLD  POS=(19,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP11 DFLD  POS=(19,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS11 DFLD  POS=(19,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD11 DFLD  POS=(19,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB11 DFLD  POS=(19,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF11 DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP25 DFLD  POS=(19,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS25 DFLD  POS=(19,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD25 DFLD  POS=(19,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB25 DFLD  POS=(19,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF25 DFLD  POS=(19,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA7 DFLD  POS=(20,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA7 DFLD  POS=(20,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB7 DFLD  POS=(20,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB7 DFLD  POS=(20,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC7 DFLD  POS=(20,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC7 DFLD  POS=(20,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD7 DFLD  POS=(20,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD7 DFLD  POS=(20,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE7 DFLD  POS=(20,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE7 DFLD  POS=(20,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP12 DFLD  POS=(20,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS12 DFLD  POS=(20,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD12 DFLD  POS=(20,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB12 DFLD  POS=(20,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF12 DFLD  POS=(20,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP26 DFLD  POS=(20,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS26 DFLD  POS=(20,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD26 DFLD  POS=(20,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB26 DFLD  POS=(20,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF26 DFLD  POS=(20,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA8 DFLD  POS=(21,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA8 DFLD  POS=(21,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB8 DFLD  POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB8 DFLD  POS=(21,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC8 DFLD  POS=(21,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC8 DFLD  POS=(21,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD8 DFLD  POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD8 DFLD  POS=(21,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE8 DFLD  POS=(21,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE8 DFLD  POS=(21,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP13 DFLD  POS=(21,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS13 DFLD  POS=(21,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD13 DFLD  POS=(21,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB13 DFLD  POS=(21,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF13 DFLD  POS=(21,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP27 DFLD  POS=(21,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS27 DFLD  POS=(21,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD27 DFLD  POS=(21,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB27 DFLD  POS=(21,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF27 DFLD  POS=(21,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
REFKOLA9 DFLD  POS=(22,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLA9 DFLD  POS=(22,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLB9 DFLD  POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLB9 DFLD  POS=(22,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLC9 DFLD  POS=(22,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLC9 DFLD  POS=(22,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLD9 DFLD  POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLD9 DFLD  POS=(22,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REFKOLE9 DFLD  POS=(22,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PUBKOLE9 DFLD  POS=(22,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KATGRP14 DFLD  POS=(22,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS14 DFLD  POS=(22,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD14 DFLD  POS=(22,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CATPUB14 DFLD  POS=(22,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
HANREF14 DFLD  POS=(22,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KATGRP28 DFLD  POS=(22,90),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KATAVS28 DFLD  POS=(22,95),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KATRAD28 DFLD  POS=(22,102),LTH=4,                                     +        
               ATTR=(PROT)                                                      
CATPUB28 DFLD  POS=(22,108),LTH=3,                                     +        
               ATTR=(PROT)                                                      
HANREF28 DFLD  POS=(22,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 KATALOGAVS   14 KATALOGRAD    15 RADNOTERING    16 A+        
               VSNITT HUVUD',                                          +        
               POS=(24,2),LTH=67,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 VADIS Sökbegrepp',                                  +        
               POS=(24,74),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(25,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 Avsnittsorig. 20 Avsnittsrubr.  21 Avsnitt print',  +        
               POS=(25,18),LTH=51,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(25,74),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2602  DFLD  POS=(26,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(26,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2664  DFLD  POS=(26,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2673  DFLD  POS=(26,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(27,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O51301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F513,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I51301,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=W1F513                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  CATNRIN,                                                +        
               LTH=5                                                            
         MFLD  CATNRUT,                                                +        
               LTH=5                                                            
         MFLD  CATGRPIN,                                               +        
               LTH=2                                                            
         MFLD  CATGRPUT,                                               +        
               LTH=2                                                            
         MFLD  CATAVSIN,                                               +        
               LTH=4                                                            
         MFLD  CATAVSUT,                                               +        
               LTH=4                                                            
         MFLD  SPRAKIN,                                                +        
               LTH=3                                                            
         MFLD  SPRAKUT,                                                +        
               LTH=3                                                            
         MFLD  CATRADIN,                                               +        
               LTH=4                                                            
         MFLD  CATRADUT,                                               +        
               LTH=4                                                            
         MFLD  RADPUBIN,                                               +        
               LTH=3                                                            
         MFLD  RADPUBUT,                                               +        
               LTH=3                                                            
         MFLD  PUBMIN,                                                 +        
               LTH=3                                                            
         MFLD  PUBMAX,                                                 +        
               LTH=3                                                            
         MFLD  FLD0511,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SIDHGRP,                                                +        
               LTH=2                                                            
         MFLD  SIDHAVS,                                                +        
               LTH=4                                                            
         MFLD  SIDHRAD,                                                +        
               LTH=4                                                            
         MFLD  SIDHPUBF,                                               +        
               LTH=3                                                            
         MFLD  SIDHPUBT,                                               +        
               LTH=3                                                            
         MFLD  SIDHAEN,                                                +        
               LTH=1                                                            
         MFLD  KATGRP01,                                               +        
               LTH=2                                                            
         MFLD  KATAVS01,                                               +        
               LTH=4                                                            
         MFLD  KATRAD01,                                               +        
               LTH=4                                                            
         MFLD  CATPUB01,                                               +        
               LTH=3                                                            
         MFLD  HANREF01,                                               +        
               LTH=1                                                            
         MFLD  KATGRP02,                                               +        
               LTH=2                                                            
         MFLD  KATAVS02,                                               +        
               LTH=4                                                            
         MFLD  KATRAD02,                                               +        
               LTH=4                                                            
         MFLD  CATPUB02,                                               +        
               LTH=3                                                            
         MFLD  HANREF02,                                               +        
               LTH=1                                                            
         MFLD  KATGRP03,                                               +        
               LTH=2                                                            
         MFLD  KATAVS03,                                               +        
               LTH=4                                                            
         MFLD  KATRAD03,                                               +        
               LTH=4                                                            
         MFLD  CATPUB03,                                               +        
               LTH=3                                                            
         MFLD  HANREF03,                                               +        
               LTH=1                                                            
         MFLD  KATGRP04,                                               +        
               LTH=2                                                            
         MFLD  KATAVS04,                                               +        
               LTH=4                                                            
         MFLD  KATRAD04,                                               +        
               LTH=4                                                            
         MFLD  CATPUB04,                                               +        
               LTH=3                                                            
         MFLD  HANREF04,                                               +        
               LTH=1                                                            
         MFLD  KATGRP05,                                               +        
               LTH=2                                                            
         MFLD  KATAVS05,                                               +        
               LTH=4                                                            
         MFLD  KATRAD05,                                               +        
               LTH=4                                                            
         MFLD  CATPUB05,                                               +        
               LTH=3                                                            
         MFLD  HANREF05,                                               +        
               LTH=1                                                            
         MFLD  KATGRP06,                                               +        
               LTH=2                                                            
         MFLD  KATAVS06,                                               +        
               LTH=4                                                            
         MFLD  KATRAD06,                                               +        
               LTH=4                                                            
         MFLD  CATPUB06,                                               +        
               LTH=3                                                            
         MFLD  HANREF06,                                               +        
               LTH=1                                                            
         MFLD  KATGRP07,                                               +        
               LTH=2                                                            
         MFLD  KATAVS07,                                               +        
               LTH=4                                                            
         MFLD  KATRAD07,                                               +        
               LTH=4                                                            
         MFLD  CATPUB07,                                               +        
               LTH=3                                                            
         MFLD  HANREF07,                                               +        
               LTH=1                                                            
         MFLD  KATGRP08,                                               +        
               LTH=2                                                            
         MFLD  KATAVS08,                                               +        
               LTH=4                                                            
         MFLD  KATRAD08,                                               +        
               LTH=4                                                            
         MFLD  CATPUB08,                                               +        
               LTH=3                                                            
         MFLD  HANREF08,                                               +        
               LTH=1                                                            
         MFLD  KATGRP09,                                               +        
               LTH=2                                                            
         MFLD  KATAVS09,                                               +        
               LTH=4                                                            
         MFLD  KATRAD09,                                               +        
               LTH=4                                                            
         MFLD  CATPUB09,                                               +        
               LTH=3                                                            
         MFLD  HANREF09,                                               +        
               LTH=1                                                            
         MFLD  KATGRP10,                                               +        
               LTH=2                                                            
         MFLD  KATAVS10,                                               +        
               LTH=4                                                            
         MFLD  KATRAD10,                                               +        
               LTH=4                                                            
         MFLD  CATPUB10,                                               +        
               LTH=3                                                            
         MFLD  HANREF10,                                               +        
               LTH=1                                                            
         MFLD  KATGRP11,                                               +        
               LTH=2                                                            
         MFLD  KATAVS11,                                               +        
               LTH=4                                                            
         MFLD  KATRAD11,                                               +        
               LTH=4                                                            
         MFLD  CATPUB11,                                               +        
               LTH=3                                                            
         MFLD  HANREF11,                                               +        
               LTH=1                                                            
         MFLD  KATGRP12,                                               +        
               LTH=2                                                            
         MFLD  KATAVS12,                                               +        
               LTH=4                                                            
         MFLD  KATRAD12,                                               +        
               LTH=4                                                            
         MFLD  CATPUB12,                                               +        
               LTH=3                                                            
         MFLD  HANREF12,                                               +        
               LTH=1                                                            
         MFLD  KATGRP13,                                               +        
               LTH=2                                                            
         MFLD  KATAVS13,                                               +        
               LTH=4                                                            
         MFLD  KATRAD13,                                               +        
               LTH=4                                                            
         MFLD  CATPUB13,                                               +        
               LTH=3                                                            
         MFLD  HANREF13,                                               +        
               LTH=1                                                            
         MFLD  KATGRP14,                                               +        
               LTH=2                                                            
         MFLD  KATAVS14,                                               +        
               LTH=4                                                            
         MFLD  KATRAD14,                                               +        
               LTH=4                                                            
         MFLD  CATPUB14,                                               +        
               LTH=3                                                            
         MFLD  HANREF14,                                               +        
               LTH=1                                                            
         MFLD  KATGRP15,                                               +        
               LTH=2                                                            
         MFLD  KATAVS15,                                               +        
               LTH=4                                                            
         MFLD  KATRAD15,                                               +        
               LTH=4                                                            
         MFLD  CATPUB15,                                               +        
               LTH=3                                                            
         MFLD  HANREF15,                                               +        
               LTH=1                                                            
         MFLD  KATGRP16,                                               +        
               LTH=2                                                            
         MFLD  KATAVS16,                                               +        
               LTH=4                                                            
         MFLD  KATRAD16,                                               +        
               LTH=4                                                            
         MFLD  CATPUB16,                                               +        
               LTH=3                                                            
         MFLD  HANREF16,                                               +        
               LTH=1                                                            
         MFLD  KATGRP17,                                               +        
               LTH=2                                                            
         MFLD  KATAVS17,                                               +        
               LTH=4                                                            
         MFLD  KATRAD17,                                               +        
               LTH=4                                                            
         MFLD  CATPUB17,                                               +        
               LTH=3                                                            
         MFLD  HANREF17,                                               +        
               LTH=1                                                            
         MFLD  KATGRP18,                                               +        
               LTH=2                                                            
         MFLD  KATAVS18,                                               +        
               LTH=4                                                            
         MFLD  KATRAD18,                                               +        
               LTH=4                                                            
         MFLD  CATPUB18,                                               +        
               LTH=3                                                            
         MFLD  HANREF18,                                               +        
               LTH=1                                                            
         MFLD  KATGRP19,                                               +        
               LTH=2                                                            
         MFLD  KATAVS19,                                               +        
               LTH=4                                                            
         MFLD  KATRAD19,                                               +        
               LTH=4                                                            
         MFLD  CATPUB19,                                               +        
               LTH=3                                                            
         MFLD  HANREF19,                                               +        
               LTH=1                                                            
         MFLD  KATGRP20,                                               +        
               LTH=2                                                            
         MFLD  KATAVS20,                                               +        
               LTH=4                                                            
         MFLD  KATRAD20,                                               +        
               LTH=4                                                            
         MFLD  CATPUB20,                                               +        
               LTH=3                                                            
         MFLD  HANREF20,                                               +        
               LTH=1                                                            
         MFLD  KATGRP21,                                               +        
               LTH=2                                                            
         MFLD  KATAVS21,                                               +        
               LTH=4                                                            
         MFLD  KATRAD21,                                               +        
               LTH=4                                                            
         MFLD  CATPUB21,                                               +        
               LTH=3                                                            
         MFLD  HANREF21,                                               +        
               LTH=1                                                            
         MFLD  KATGRP22,                                               +        
               LTH=2                                                            
         MFLD  KATAVS22,                                               +        
               LTH=4                                                            
         MFLD  KATRAD22,                                               +        
               LTH=4                                                            
         MFLD  CATPUB22,                                               +        
               LTH=3                                                            
         MFLD  HANREF22,                                               +        
               LTH=1                                                            
         MFLD  KATGRP23,                                               +        
               LTH=2                                                            
         MFLD  KATAVS23,                                               +        
               LTH=4                                                            
         MFLD  KATRAD23,                                               +        
               LTH=4                                                            
         MFLD  CATPUB23,                                               +        
               LTH=3                                                            
         MFLD  HANREF23,                                               +        
               LTH=1                                                            
         MFLD  KATGRP24,                                               +        
               LTH=2                                                            
         MFLD  KATAVS24,                                               +        
               LTH=4                                                            
         MFLD  KATRAD24,                                               +        
               LTH=4                                                            
         MFLD  CATPUB24,                                               +        
               LTH=3                                                            
         MFLD  HANREF24,                                               +        
               LTH=1                                                            
         MFLD  KATGRP25,                                               +        
               LTH=2                                                            
         MFLD  KATAVS25,                                               +        
               LTH=4                                                            
         MFLD  KATRAD25,                                               +        
               LTH=4                                                            
         MFLD  CATPUB25,                                               +        
               LTH=3                                                            
         MFLD  HANREF25,                                               +        
               LTH=1                                                            
         MFLD  KATGRP26,                                               +        
               LTH=2                                                            
         MFLD  KATAVS26,                                               +        
               LTH=4                                                            
         MFLD  KATRAD26,                                               +        
               LTH=4                                                            
         MFLD  CATPUB26,                                               +        
               LTH=3                                                            
         MFLD  HANREF26,                                               +        
               LTH=1                                                            
         MFLD  KATGRP27,                                               +        
               LTH=2                                                            
         MFLD  KATAVS27,                                               +        
               LTH=4                                                            
         MFLD  KATRAD27,                                               +        
               LTH=4                                                            
         MFLD  CATPUB27,                                               +        
               LTH=3                                                            
         MFLD  HANREF27,                                               +        
               LTH=1                                                            
         MFLD  KATGRP28,                                               +        
               LTH=2                                                            
         MFLD  KATAVS28,                                               +        
               LTH=4                                                            
         MFLD  KATRAD28,                                               +        
               LTH=4                                                            
         MFLD  CATPUB28,                                               +        
               LTH=3                                                            
         MFLD  HANREF28,                                               +        
               LTH=1                                                            
         MFLD  REFAVSN,                                                +        
               LTH=1                                                            
         MFLD  REFKOLA1,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA1,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA2,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA2,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA3,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA3,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA4,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA4,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA5,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA5,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA6,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA6,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA7,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA7,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA8,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA8,                                               +        
               LTH=3                                                            
         MFLD  REFKOLA9,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLA9,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB1,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB1,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB2,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB2,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB3,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB3,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB4,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB4,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB5,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB5,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB6,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB6,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB7,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB7,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB8,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB8,                                               +        
               LTH=3                                                            
         MFLD  REFKOLB9,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLB9,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC1,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC1,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC2,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC2,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC3,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC3,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC4,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC4,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC5,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC5,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC6,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC6,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC7,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC7,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC8,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC8,                                               +        
               LTH=3                                                            
         MFLD  REFKOLC9,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLC9,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD1,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD1,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD2,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD2,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD3,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD3,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD4,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD4,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD5,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD5,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD6,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD6,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD7,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD7,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD8,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD8,                                               +        
               LTH=3                                                            
         MFLD  REFKOLD9,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLD9,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE1,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE1,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE2,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE2,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE3,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE3,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE4,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE4,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE5,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE5,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE6,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE6,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE7,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE7,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE8,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE8,                                               +        
               LTH=3                                                            
         MFLD  REFKOLE9,                                               +        
               LTH=1                                                            
         MFLD  PUBKOLE9,                                               +        
               LTH=3                                                            
         MFLD  FLD2602,                                                +        
               LTH=55                                                           
         MFLD  (FLD2664,                                               +        
               DATE4)                                                           
         MFLD  (FLD2673,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I51301 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F513),                                           +        
               OPT=2,                                                  +        
               NXT=W1O51301                                                     
DGIMID03 LPAGE SOR=(W1F513)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15131',                                                +        
               LTH=5                                                            
         MFLD  (CATNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATNRUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CATGRPIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATGRPUT,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CATAVSIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATAVSUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (SPRAKIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  SPRAKUT,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CATRADIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATRADUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADPUBIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  RADPUBUT,                                               +        
               LTH=3                                                            
         MFLD  PUBMIN,                                                 +        
               LTH=3                                                            
         MFLD  PUBMAX,                                                 +        
               LTH=3                                                            
         MFLD  (FLD0511,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
