***********************************************************************         
* CREATED BY V028439   ON 01/10/04  AT 13:34                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'OMNUMRERING KATALOGAVSNITT      '                               
W1F551   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T551U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T551  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOGAVSNITT, OMNUMRERING',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'KATALOGNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
CATNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CATGRPIN DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
CATAVSIN DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
CATNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
CATGRPUT DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSUT DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
NYRADNR  DFLD  POS=(4,1),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FL8RAD   DFLD  POS=(4,10),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
OMNUM8   DFLD  POS=(4,13),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IXHEL    DFLD  POS=(4,16),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Omnumrerar avsnitt med radintervall om +10',           +        
               POS=(8,2),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Startrad är 0020',                                     +        
               POS=(9,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '13 AVS.OMNUM.   14 LÅN, KOL/RAD 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T551U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T551  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOGAVSNITT, OMNUMRERING',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'KATALOGNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
CATNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRUPP',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CATGRPIN DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITT',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
CATAVSIN DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
CATNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
CATGRPUT DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSUT DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
NYRADNR  DFLD  POS=(4,1),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FL8RAD   DFLD  POS=(4,10),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
OMNUM8   DFLD  POS=(4,13),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IXHEL    DFLD  POS=(4,16),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Omnumrerar avsnitt med radintervall om +10',           +        
               POS=(9,2),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Startrad är 0020',                                     +        
               POS=(10,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 AVS.OMNUM.   14 LÅN, KOL/RAD 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O55101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F551,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I55101,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  CATNRIN,                                                +        
               LTH=5                                                            
         MFLD  CATNRUT,                                                +        
               LTH=5                                                            
         MFLD  CATGRPIN,                                               +        
               LTH=2                                                            
         MFLD  CATGRPUT,                                               +        
               LTH=2                                                            
         MFLD  CATAVSIN,                                               +        
               LTH=4                                                            
         MFLD  CATAVSUT,                                               +        
               LTH=4                                                            
         MFLD  NYRADNR,                                                +        
               LTH=4                                                            
         MFLD  FL8RAD,                                                 +        
               LTH=1                                                            
         MFLD  OMNUM8,                                                 +        
               LTH=1                                                            
         MFLD  IXHEL,                                                  +        
               LTH=9                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I55101 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F551),                                           +        
               OPT=2,                                                  +        
               NXT=W1O55101                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15511',                                                +        
               LTH=5                                                            
         MFLD  (CATNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATNRUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CATGRPIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATGRPUT,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CATAVSIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATAVSUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (NYRADNR,                                               +        
               '0000'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FL8RAD,                                                +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  (OMNUM8,                                                +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  (IXHEL,                                                 +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
