***********************************************************************         
* CREATED BY PCC5729   ON 96/05/13  AT 13:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'AVSNITTSRUBRIKER, UTSKRIFT      '                               
W1F518   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T518U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T518U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T518U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITTSRUBRIKER, UTSKRIFT',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKATIN  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grp-från',                                             +        
               POS=(2,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
GRPFRAIN DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsnitt',                                              +        
               POS=(2,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CATAVSIN DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,41),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
SPRAKIN  DFLD  POS=(2,47),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radnr',                                                +        
               POS=(2,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADIN  DFLD  POS=(2,57),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,62),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PUBIN    DFLD  POS=(2,66),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKATUT  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
GRPFRUT  DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSUT DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SPRAAKUT DFLD  POS=(3,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
RADUT    DFLD  POS=(3,57),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PUBUT    DFLD  POS=(3,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Grp-till',                                             +        
               POS=(5,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(5,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Val av listtyp',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
IDLISTA  DFLD  POS=(8,17),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '001 = På H-grupp alla avsnitt. / På U-grupp avsnitt 1.'+        
               ,POS=(8,23),LTH=54,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '002 = På U-grupp alla avsnitt.',                       +        
               POS=(9,23),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer adress',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(13,17),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,19),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLTERM  DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A = Katalogredaktion',                                 +        
               POS=(15,17),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 AVSN.HUVUD',                                        +        
               POS=(21,46),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 VADIS/AVS-KOL',                                     +        
               POS=(21,64),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVSN ORIGIN  20 -',                                 +        
               POS=(22,15),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21 LISTA AVSNITT  10/22 WHELP',                        +        
               POS=(22,46),LTH=29,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T518U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T518U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T518U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AVSNITTSRUBRIKER, UTSKRIFT',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKATIN  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grp-från',                                             +        
               POS=(2,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
GRPFRAIN DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsnitt',                                              +        
               POS=(2,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CATAVSIN DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,41),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
SPRAKIN  DFLD  POS=(2,47),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radnr',                                                +        
               POS=(2,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADIN  DFLD  POS=(2,57),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,62),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PUBIN    DFLD  POS=(2,66),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKATUT  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
GRPFRUT  DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSUT DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SPRAAKUT DFLD  POS=(3,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
RADUT    DFLD  POS=(3,57),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PUBUT    DFLD  POS=(3,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Grp-till',                                             +        
               POS=(5,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(5,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Val av listtyp',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
IDLISTA  DFLD  POS=(8,17),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '001 = På H-grupp alla avsnitt. / På U-grupp avsnitt 1.'+        
               ,POS=(8,23),LTH=54,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '002 = På U-grupp alla avsnitt.',                       +        
               POS=(9,23),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer adress',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(13,17),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,19),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLTERM  DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A = Katalogredaktion',                                 +        
               POS=(15,17),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 VISA AVSNITT',                                      +        
               POS=(21,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 UPPDAT RADER',                                      +        
               POS=(21,19),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '15 VISA RADNOT',                                       +        
               POS=(21,36),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16 AVSN.HUVUD',                                        +        
               POS=(21,53),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 VADIS/AVS-KOL',                                     +        
               POS=(21,70),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVSN ORIGIN',                                       +        
               POS=(22,19),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '20 -',                                                 +        
               POS=(22,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 LISTA AVSNITT',                                     +        
               POS=(22,53),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10/22 WHELP',                                          +        
               POS=(22,70),LTH=11,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O51802 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F518,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I51801,                                           +        
               FILL=PT                                                          
DGI3MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  LTH=2                                                            
         MFLD  LTH=8                                                            
         MFLD  LTH=2                                                            
         MFLD  LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I51801 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F518),                                           +        
               OPT=2,                                                  +        
               NXT=W1O51801                                                     
DGI2MID  LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15181',                                                +        
               LTH=5                                                            
         MFLD  (IDKATIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKATUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (GRPFRAIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  GRPFRUT,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CATAVSIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CATAVSUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (SPRAKIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  SPRAAKUT,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDRADIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADUT,                                                  +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PUBIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PUBUT,                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLISTA,                                               +        
               '002'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPRTVAL,                                              +        
               'A'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O51801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F518,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I51801,                                           +        
               FILL=PT                                                          
DGI1MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKATIN,                                                +        
               LTH=5                                                            
         MFLD  IDKATUT,                                                +        
               LTH=5                                                            
         MFLD  GRPFRAIN,                                               +        
               LTH=2                                                            
         MFLD  GRPFRUT,                                                +        
               LTH=2                                                            
         MFLD  CATAVSIN,                                               +        
               LTH=4                                                            
         MFLD  CATAVSUT,                                               +        
               LTH=4                                                            
         MFLD  SPRAKIN,                                                +        
               LTH=3                                                            
         MFLD  SPRAAKUT,                                               +        
               LTH=3                                                            
         MFLD  IDRADIN,                                                +        
               LTH=4                                                            
         MFLD  RADUT,                                                  +        
               LTH=4                                                            
         MFLD  PUBIN,                                                  +        
               LTH=3                                                            
         MFLD  PUBUT,                                                  +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLISTA,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPRTVAL,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLTERM,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
