***********************************************************************         
* CREATED BY V028439   ON 00/02/13  AT 09:48                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ARTIKELFRÅGA MASTER             '                               
W1F542   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T542 7',                                           +        
               8='W1T542 8',                                           +        
               9='W1T543 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T541  ',                                          +        
               14='W1T542  ',                                          +        
               15='W1T543  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKELFRÅGA MASTER',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
INIDART  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,22),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Fordon',                                               +        
               POS=(2,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
INKDFORD DFLD  POS=(2,32),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Katalog',                                              +        
               POS=(2,38),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INIDKATN DFLD  POS=(2,46),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,52),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
UTIDART  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
UTKDFORD DFLD  POS=(3,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTIDKATN DFLD  POS=(3,46),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
SEGMNYCK DFLD  POS=(4,2),LTH=10,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
UTBEART  DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(5,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDMASTAT DFLD  POS=(5,49),LTH=2,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  's  Katalogidentitet    s  Katalogidentitet   s  Katalog+        
               identitet',                                             +        
               POS=(6,2),LTH=64,                                       +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST11 DFLD  POS=(7,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT11  DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD12    DFLD  POS=(7,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST12 DFLD  POS=(7,27),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT12  DFLD  POS=(7,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD13    DFLD  POS=(7,47),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST13 DFLD  POS=(7,49),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT13  DFLD  POS=(7,62),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD21    DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST21 DFLD  POS=(8,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT21  DFLD  POS=(8,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD22    DFLD  POS=(8,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST22 DFLD  POS=(8,27),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT22  DFLD  POS=(8,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD23    DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST23 DFLD  POS=(8,49),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT23  DFLD  POS=(8,62),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD31    DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST31 DFLD  POS=(9,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT31  DFLD  POS=(9,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD32    DFLD  POS=(9,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST32 DFLD  POS=(9,27),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT32  DFLD  POS=(9,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD33    DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST33 DFLD  POS=(9,49),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT33  DFLD  POS=(9,62),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD41    DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST41 DFLD  POS=(10,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT41  DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD42    DFLD  POS=(10,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST42 DFLD  POS=(10,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT42  DFLD  POS=(10,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD43    DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST43 DFLD  POS=(10,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT43  DFLD  POS=(10,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD51    DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST51 DFLD  POS=(11,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT51  DFLD  POS=(11,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD52    DFLD  POS=(11,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST52 DFLD  POS=(11,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT52  DFLD  POS=(11,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD53    DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST53 DFLD  POS=(11,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT53  DFLD  POS=(11,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD61    DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST61 DFLD  POS=(12,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT61  DFLD  POS=(12,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD62    DFLD  POS=(12,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST62 DFLD  POS=(12,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT62  DFLD  POS=(12,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD63    DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST63 DFLD  POS=(12,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT63  DFLD  POS=(12,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD71    DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST71 DFLD  POS=(13,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT71  DFLD  POS=(13,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD72    DFLD  POS=(13,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST72 DFLD  POS=(13,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT72  DFLD  POS=(13,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD73    DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST73 DFLD  POS=(13,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT73  DFLD  POS=(13,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD81    DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST81 DFLD  POS=(14,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT81  DFLD  POS=(14,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD82    DFLD  POS=(14,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST82 DFLD  POS=(14,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT82  DFLD  POS=(14,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD83    DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST83 DFLD  POS=(14,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT83  DFLD  POS=(14,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD91    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST91 DFLD  POS=(15,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT91  DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD92    DFLD  POS=(15,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST92 DFLD  POS=(15,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT92  DFLD  POS=(15,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD93    DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST93 DFLD  POS=(15,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT93  DFLD  POS=(15,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD101   DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS101 DFLD  POS=(16,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT101 DFLD  POS=(16,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD102   DFLD  POS=(16,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS102 DFLD  POS=(16,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT102 DFLD  POS=(16,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD103   DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS103 DFLD  POS=(16,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT103 DFLD  POS=(16,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD111   DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS111 DFLD  POS=(17,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT111 DFLD  POS=(17,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD112   DFLD  POS=(17,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS112 DFLD  POS=(17,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT112 DFLD  POS=(17,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD113   DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS113 DFLD  POS=(17,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT113 DFLD  POS=(17,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD121   DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS121 DFLD  POS=(18,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT121 DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD122   DFLD  POS=(18,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS122 DFLD  POS=(18,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT122 DFLD  POS=(18,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD123   DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS123 DFLD  POS=(18,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT123 DFLD  POS=(18,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD131   DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS131 DFLD  POS=(19,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT131 DFLD  POS=(19,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD132   DFLD  POS=(19,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS132 DFLD  POS=(19,27),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT132 DFLD  POS=(19,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD133   DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS133 DFLD  POS=(19,49),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT133 DFLD  POS=(19,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13 ART FRÅGA KAT 14 FRÅGA MASTER   15 MODELLINFO  16', +        
               POS=(21,2),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SYSDATE  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SYSTIME  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T542 7',                                           +        
               8='W1T542 8',                                           +        
               9='W1T543 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T541  ',                                          +        
               14='W1T542  ',                                          +        
               15='W1T543  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKELFRÅGA MASTER',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
INIDART  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,22),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Fordon',                                               +        
               POS=(2,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
INKDFORD DFLD  POS=(2,32),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Katalog',                                              +        
               POS=(2,38),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INIDKATN DFLD  POS=(2,46),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,52),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
UTIDART  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
UTKDFORD DFLD  POS=(3,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTIDKATN DFLD  POS=(3,46),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
SEGMNYCK DFLD  POS=(4,2),LTH=10,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
UTBEART  DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(5,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDMASTAT DFLD  POS=(5,49),LTH=2,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  's  Katalogidentitet',                                  +        
               POS=(6,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
         DFLD  's  Katalogidentitet',                                  +        
               POS=(6,27),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  's  Katalogidentitet',                                  +        
               POS=(6,51),LTH=19,                                      +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST11 DFLD  POS=(7,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT11  DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD12    DFLD  POS=(7,27),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST12 DFLD  POS=(7,29),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT12  DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD13    DFLD  POS=(7,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST13 DFLD  POS=(7,53),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT13  DFLD  POS=(7,66),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD21    DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST21 DFLD  POS=(8,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT21  DFLD  POS=(8,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD22    DFLD  POS=(8,27),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST22 DFLD  POS=(8,29),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT22  DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD23    DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST23 DFLD  POS=(8,53),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT23  DFLD  POS=(8,66),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD31    DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
BEMAST31 DFLD  POS=(9,4),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKAT31  DFLD  POS=(9,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD32    DFLD  POS=(9,27),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST32 DFLD  POS=(9,29),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT32  DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD33    DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST33 DFLD  POS=(9,53),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT33  DFLD  POS=(9,66),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD41    DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST41 DFLD  POS=(10,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT41  DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD42    DFLD  POS=(10,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST42 DFLD  POS=(10,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT42  DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD43    DFLD  POS=(10,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST43 DFLD  POS=(10,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT43  DFLD  POS=(10,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD51    DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST51 DFLD  POS=(11,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT51  DFLD  POS=(11,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD52    DFLD  POS=(11,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST52 DFLD  POS=(11,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT52  DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD53    DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST53 DFLD  POS=(11,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT53  DFLD  POS=(11,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD61    DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST61 DFLD  POS=(12,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT61  DFLD  POS=(12,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD62    DFLD  POS=(12,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST62 DFLD  POS=(12,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT62  DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD63    DFLD  POS=(12,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST63 DFLD  POS=(12,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT63  DFLD  POS=(12,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD71    DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST71 DFLD  POS=(13,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT71  DFLD  POS=(13,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD72    DFLD  POS=(13,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST72 DFLD  POS=(13,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT72  DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD73    DFLD  POS=(13,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST73 DFLD  POS=(13,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT73  DFLD  POS=(13,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD81    DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST81 DFLD  POS=(14,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT81  DFLD  POS=(14,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD82    DFLD  POS=(14,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST82 DFLD  POS=(14,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT82  DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD83    DFLD  POS=(14,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST83 DFLD  POS=(14,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT83  DFLD  POS=(14,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD91    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAST91 DFLD  POS=(15,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT91  DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD92    DFLD  POS=(15,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST92 DFLD  POS=(15,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT92  DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD93    DFLD  POS=(15,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAST93 DFLD  POS=(15,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT93  DFLD  POS=(15,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD101   DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS101 DFLD  POS=(16,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT101 DFLD  POS=(16,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD102   DFLD  POS=(16,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS102 DFLD  POS=(16,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT102 DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD103   DFLD  POS=(16,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS103 DFLD  POS=(16,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT103 DFLD  POS=(16,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD111   DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS111 DFLD  POS=(17,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT111 DFLD  POS=(17,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD112   DFLD  POS=(17,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS112 DFLD  POS=(17,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT112 DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD113   DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS113 DFLD  POS=(17,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT113 DFLD  POS=(17,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD121   DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS121 DFLD  POS=(18,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT121 DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD122   DFLD  POS=(18,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS122 DFLD  POS=(18,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT122 DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD123   DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS123 DFLD  POS=(18,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT123 DFLD  POS=(18,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD131   DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
BEMAS131 DFLD  POS=(19,4),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKAT131 DFLD  POS=(19,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD132   DFLD  POS=(19,27),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS132 DFLD  POS=(19,29),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT132 DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD133   DFLD  POS=(19,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BEMAS133 DFLD  POS=(19,53),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKAT133 DFLD  POS=(19,66),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13 ART FRÅGA KAT 14 FRÅGA MASTER   15 MOELLINFO   16', +        
               POS=(21,2),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SYSDATE  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SYSTIME  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O54201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F542,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I54201,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INIDART,                                                +        
               LTH=9                                                            
         MFLD  UTIDART,                                                +        
               LTH=9                                                            
         MFLD  INKDFORD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTKDFORD,                                               +        
               LTH=2                                                            
         MFLD  INIDKATN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTIDKATN,                                               +        
               LTH=5                                                            
         MFLD  SEGMNYCK,                                               +        
               LTH=10                                                           
         MFLD  UTBEART,                                                +        
               LTH=25                                                           
         MFLD  KDMASTAT,                                               +        
               LTH=2                                                            
         MFLD  CMD11,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST11,                                               +        
               LTH=12                                                           
         MFLD  IDKAT11,                                                +        
               LTH=5                                                            
         MFLD  CMD12,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST12,                                               +        
               LTH=12                                                           
         MFLD  IDKAT12,                                                +        
               LTH=5                                                            
         MFLD  CMD13,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST13,                                               +        
               LTH=12                                                           
         MFLD  IDKAT13,                                                +        
               LTH=5                                                            
         MFLD  CMD21,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST21,                                               +        
               LTH=12                                                           
         MFLD  IDKAT21,                                                +        
               LTH=5                                                            
         MFLD  CMD22,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST22,                                               +        
               LTH=12                                                           
         MFLD  IDKAT22,                                                +        
               LTH=5                                                            
         MFLD  CMD23,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST23,                                               +        
               LTH=12                                                           
         MFLD  IDKAT23,                                                +        
               LTH=5                                                            
         MFLD  CMD31,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST31,                                               +        
               LTH=12                                                           
         MFLD  IDKAT31,                                                +        
               LTH=5                                                            
         MFLD  CMD32,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST32,                                               +        
               LTH=12                                                           
         MFLD  IDKAT32,                                                +        
               LTH=5                                                            
         MFLD  CMD33,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST33,                                               +        
               LTH=12                                                           
         MFLD  IDKAT33,                                                +        
               LTH=5                                                            
         MFLD  CMD41,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST41,                                               +        
               LTH=12                                                           
         MFLD  IDKAT41,                                                +        
               LTH=5                                                            
         MFLD  CMD42,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST42,                                               +        
               LTH=12                                                           
         MFLD  IDKAT42,                                                +        
               LTH=5                                                            
         MFLD  CMD43,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST43,                                               +        
               LTH=12                                                           
         MFLD  IDKAT43,                                                +        
               LTH=5                                                            
         MFLD  CMD51,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST51,                                               +        
               LTH=12                                                           
         MFLD  IDKAT51,                                                +        
               LTH=5                                                            
         MFLD  CMD52,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST52,                                               +        
               LTH=12                                                           
         MFLD  IDKAT52,                                                +        
               LTH=5                                                            
         MFLD  CMD53,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST53,                                               +        
               LTH=12                                                           
         MFLD  IDKAT53,                                                +        
               LTH=5                                                            
         MFLD  CMD61,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST61,                                               +        
               LTH=12                                                           
         MFLD  IDKAT61,                                                +        
               LTH=5                                                            
         MFLD  CMD62,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST62,                                               +        
               LTH=12                                                           
         MFLD  IDKAT62,                                                +        
               LTH=5                                                            
         MFLD  CMD63,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST63,                                               +        
               LTH=12                                                           
         MFLD  IDKAT63,                                                +        
               LTH=5                                                            
         MFLD  CMD71,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST71,                                               +        
               LTH=12                                                           
         MFLD  IDKAT71,                                                +        
               LTH=5                                                            
         MFLD  CMD72,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST72,                                               +        
               LTH=12                                                           
         MFLD  IDKAT72,                                                +        
               LTH=5                                                            
         MFLD  CMD73,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST73,                                               +        
               LTH=12                                                           
         MFLD  IDKAT73,                                                +        
               LTH=5                                                            
         MFLD  CMD81,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST81,                                               +        
               LTH=12                                                           
         MFLD  IDKAT81,                                                +        
               LTH=5                                                            
         MFLD  CMD82,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST82,                                               +        
               LTH=12                                                           
         MFLD  IDKAT82,                                                +        
               LTH=5                                                            
         MFLD  CMD83,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST83,                                               +        
               LTH=12                                                           
         MFLD  IDKAT83,                                                +        
               LTH=5                                                            
         MFLD  CMD91,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST91,                                               +        
               LTH=12                                                           
         MFLD  IDKAT91,                                                +        
               LTH=5                                                            
         MFLD  CMD92,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST92,                                               +        
               LTH=12                                                           
         MFLD  IDKAT92,                                                +        
               LTH=5                                                            
         MFLD  CMD93,                                                  +        
               LTH=1                                                            
         MFLD  BEMAST93,                                               +        
               LTH=12                                                           
         MFLD  IDKAT93,                                                +        
               LTH=5                                                            
         MFLD  CMD101,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS101,                                               +        
               LTH=12                                                           
         MFLD  IDKAT101,                                               +        
               LTH=5                                                            
         MFLD  CMD102,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS102,                                               +        
               LTH=12                                                           
         MFLD  IDKAT102,                                               +        
               LTH=5                                                            
         MFLD  CMD103,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS103,                                               +        
               LTH=12                                                           
         MFLD  IDKAT103,                                               +        
               LTH=5                                                            
         MFLD  CMD111,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS111,                                               +        
               LTH=12                                                           
         MFLD  IDKAT111,                                               +        
               LTH=5                                                            
         MFLD  CMD112,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS112,                                               +        
               LTH=12                                                           
         MFLD  IDKAT112,                                               +        
               LTH=5                                                            
         MFLD  CMD113,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS113,                                               +        
               LTH=12                                                           
         MFLD  IDKAT113,                                               +        
               LTH=5                                                            
         MFLD  CMD121,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS121,                                               +        
               LTH=12                                                           
         MFLD  IDKAT121,                                               +        
               LTH=5                                                            
         MFLD  CMD122,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS122,                                               +        
               LTH=12                                                           
         MFLD  IDKAT122,                                               +        
               LTH=5                                                            
         MFLD  CMD123,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS123,                                               +        
               LTH=12                                                           
         MFLD  IDKAT123,                                               +        
               LTH=5                                                            
         MFLD  CMD131,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS131,                                               +        
               LTH=12                                                           
         MFLD  IDKAT131,                                               +        
               LTH=5                                                            
         MFLD  CMD132,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS132,                                               +        
               LTH=12                                                           
         MFLD  IDKAT132,                                               +        
               LTH=5                                                            
         MFLD  CMD133,                                                 +        
               LTH=1                                                            
         MFLD  BEMAS133,                                               +        
               LTH=12                                                           
         MFLD  IDKAT133,                                               +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (SYSDATE,                                               +        
               DATE4)                                                           
         MFLD  (SYSTIME,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I54201 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F542),                                           +        
               OPT=2,                                                  +        
               NXT=W1O54201                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15421',                                                +        
               LTH=5                                                            
         MFLD  (INIDART,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTIDART,                                                +        
               LTH=9                                                            
         MFLD  (INKDFORD,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTKDFORD,                                               +        
               LTH=2                                                            
         MFLD  (INIDKATN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTIDKATN,                                               +        
               LTH=5                                                            
         MFLD  (SEGMNYCK,                                              +        
               '          '),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT11,                                                +        
               LTH=5                                                            
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT12,                                                +        
               LTH=5                                                            
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT13,                                                +        
               LTH=5                                                            
         MFLD  (CMD21,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT21,                                                +        
               LTH=5                                                            
         MFLD  (CMD22,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT22,                                                +        
               LTH=5                                                            
         MFLD  (CMD23,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT23,                                                +        
               LTH=5                                                            
         MFLD  (CMD31,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT31,                                                +        
               LTH=5                                                            
         MFLD  (CMD32,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT32,                                                +        
               LTH=5                                                            
         MFLD  (CMD33,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT33,                                                +        
               LTH=5                                                            
         MFLD  (CMD41,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT41,                                                +        
               LTH=5                                                            
         MFLD  (CMD42,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT42,                                                +        
               LTH=5                                                            
         MFLD  (CMD43,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT43,                                                +        
               LTH=5                                                            
         MFLD  (CMD51,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT51,                                                +        
               LTH=5                                                            
         MFLD  (CMD52,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT52,                                                +        
               LTH=5                                                            
         MFLD  (CMD53,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT53,                                                +        
               LTH=5                                                            
         MFLD  (CMD61,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT61,                                                +        
               LTH=5                                                            
         MFLD  (CMD62,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT62,                                                +        
               LTH=5                                                            
         MFLD  (CMD63,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT63,                                                +        
               LTH=5                                                            
         MFLD  (CMD71,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT71,                                                +        
               LTH=5                                                            
         MFLD  (CMD72,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT72,                                                +        
               LTH=5                                                            
         MFLD  (CMD73,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT73,                                                +        
               LTH=5                                                            
         MFLD  (CMD81,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT81,                                                +        
               LTH=5                                                            
         MFLD  (CMD82,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT82,                                                +        
               LTH=5                                                            
         MFLD  (CMD83,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT83,                                                +        
               LTH=5                                                            
         MFLD  (CMD91,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT91,                                                +        
               LTH=5                                                            
         MFLD  (CMD92,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT92,                                                +        
               LTH=5                                                            
         MFLD  (CMD93,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT93,                                                +        
               LTH=5                                                            
         MFLD  (CMD101,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT101,                                               +        
               LTH=5                                                            
         MFLD  (CMD102,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT102,                                               +        
               LTH=5                                                            
         MFLD  (CMD103,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT103,                                               +        
               LTH=5                                                            
         MFLD  (CMD111,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT111,                                               +        
               LTH=5                                                            
         MFLD  (CMD112,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT112,                                               +        
               LTH=5                                                            
         MFLD  (CMD113,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT113,                                               +        
               LTH=5                                                            
         MFLD  (CMD121,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT121,                                               +        
               LTH=5                                                            
         MFLD  (CMD122,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT122,                                               +        
               LTH=5                                                            
         MFLD  (CMD123,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT123,                                               +        
               LTH=5                                                            
         MFLD  (CMD131,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT131,                                               +        
               LTH=5                                                            
         MFLD  (CMD132,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT132,                                               +        
               LTH=5                                                            
         MFLD  (CMD133,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKAT133,                                               +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
