***********************************************************************         
* CREATED BY V028439   ON 00/09/14  AT 14:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VADIS VARIANTABELL PER KOLUMN   '                               
W1F515   FMT                                                                    
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T519 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T515 7',                                           +        
               8='W1T515 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T515U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T515U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1F515   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VADIS VARIANTABELL PER KOLUMN',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDKATIN  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grupp',                                                +        
               POS=(2,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KATGRPIN DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsnitt',                                              +        
               POS=(2,30),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KATAVSIN DFLD  POS=(2,38),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,46),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SPRAKIN  DFLD  POS=(2,52),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radnr',                                                +        
               POS=(2,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KATRADIN DFLD  POS=(2,65),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CATPUBIN DFLD  POS=(2,76),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
IDKATUT  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KATGRPUT DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KATAVSUT DFLD  POS=(3,38),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SPRAKUT  DFLD  POS=(3,52),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
KATRADUT DFLD  POS=(3,65),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CATPUBUT DFLD  POS=(3,76),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Skall avsnittet med i VADIS?',                         +        
               POS=(5,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
FLAVSTVA DFLD  POS=(5,31),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(J/N)',                                                +        
               POS=(5,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PUB tom.',                                             +        
               POS=(5,67),LTH=8,                                       +        
               ATTR=(PROT)                                                      
CATPUBTO DFLD  POS=(5,76),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '( Utskrift med PF4 )',                                 +        
               POS=(5,86),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kol Exc Mod Start  Slut  Variant 1',                   +        
               POS=(7,2),LTH=34,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Variant 2',                                            +        
               POS=(7,43),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cha Chassi  Chassi',                                   +        
               POS=(7,58),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(8,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(8,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Typ Fr.o.m. T.o.m.',                                   +        
               POS=(8,58),LTH=18,                                      +        
               ATTR=(PROT)                                                      
KOL1     DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EXCL1    DFLD  POS=(9,7),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
MODELL1  DFLD  POS=(9,10),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
AARSTA1  DFLD  POS=(9,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,19),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
AARSLU1  DFLD  POS=(9,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
VARIAN11 DFLD  POS=(9,27),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
VARIAN21 DFLD  POS=(9,43),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
CHATYP1  DFLD  POS=(9,59),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA1 DFLD  POS=(9,62),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU1 DFLD  POS=(9,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
RADNR1   DFLD  POS=(9,77),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL2     DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL2    DFLD  POS=(10,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL2  DFLD  POS=(10,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA2  DFLD  POS=(10,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU2  DFLD  POS=(10,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN12 DFLD  POS=(10,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN22 DFLD  POS=(10,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP2  DFLD  POS=(10,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA2 DFLD  POS=(10,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU2 DFLD  POS=(10,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR2   DFLD  POS=(10,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL3     DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL3    DFLD  POS=(11,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL3  DFLD  POS=(11,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA3  DFLD  POS=(11,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU3  DFLD  POS=(11,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN13 DFLD  POS=(11,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN23 DFLD  POS=(11,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP3  DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA3 DFLD  POS=(11,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU3 DFLD  POS=(11,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR3   DFLD  POS=(11,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL4     DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL4    DFLD  POS=(12,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL4  DFLD  POS=(12,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA4  DFLD  POS=(12,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU4  DFLD  POS=(12,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN14 DFLD  POS=(12,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN24 DFLD  POS=(12,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP4  DFLD  POS=(12,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA4 DFLD  POS=(12,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU4 DFLD  POS=(12,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR4   DFLD  POS=(12,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL5     DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL5    DFLD  POS=(13,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL5  DFLD  POS=(13,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA5  DFLD  POS=(13,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU5  DFLD  POS=(13,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN15 DFLD  POS=(13,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN25 DFLD  POS=(13,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP5  DFLD  POS=(13,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA5 DFLD  POS=(13,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU5 DFLD  POS=(13,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR5   DFLD  POS=(13,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL6     DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL6    DFLD  POS=(14,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL6  DFLD  POS=(14,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA6  DFLD  POS=(14,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU6  DFLD  POS=(14,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN16 DFLD  POS=(14,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN26 DFLD  POS=(14,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP6  DFLD  POS=(14,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA6 DFLD  POS=(14,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU6 DFLD  POS=(14,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR6   DFLD  POS=(14,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL7     DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL7    DFLD  POS=(15,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL7  DFLD  POS=(15,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA7  DFLD  POS=(15,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU7  DFLD  POS=(15,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN17 DFLD  POS=(15,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN27 DFLD  POS=(15,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP7  DFLD  POS=(15,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA7 DFLD  POS=(15,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU7 DFLD  POS=(15,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR7   DFLD  POS=(15,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL8     DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL8    DFLD  POS=(16,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL8  DFLD  POS=(16,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA8  DFLD  POS=(16,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU8  DFLD  POS=(16,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN18 DFLD  POS=(16,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN28 DFLD  POS=(16,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP8  DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA8 DFLD  POS=(16,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU8 DFLD  POS=(16,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR8   DFLD  POS=(16,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL9     DFLD  POS=(17,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL9    DFLD  POS=(17,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL9  DFLD  POS=(17,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA9  DFLD  POS=(17,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU9  DFLD  POS=(17,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN19 DFLD  POS=(17,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN29 DFLD  POS=(17,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP9  DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA9 DFLD  POS=(17,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU9 DFLD  POS=(17,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR9   DFLD  POS=(17,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL10    DFLD  POS=(18,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL10   DFLD  POS=(18,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL10 DFLD  POS=(18,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA10 DFLD  POS=(18,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU10 DFLD  POS=(18,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN1A DFLD  POS=(18,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN2A DFLD  POS=(18,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP10 DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTAA DFLD  POS=(18,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLUA DFLD  POS=(18,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR10  DFLD  POS=(18,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 KATALOGAVS.  14 KATALOGRAD    15 RADNOTERING    16 A+        
               VSNITTSHUVUD',                                          +        
               POS=(24,2),LTH=67,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 VADIS A/K SÖK',                                     +        
               POS=(24,75),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(25,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVS ORIGINAL  20 LISTA RUBRIK   21 LISTA AVSN',     +        
               POS=(25,18),LTH=48,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(25,75),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(26,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(26,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(26,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(26,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(27,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T519 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T515 7',                                           +        
               8='W1T515 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T515U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T515U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1F515   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VADIS VARIANTABELL PER KOLUMN',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
IDKATIN  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grupp',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KATGRPIN DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsnitt',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KATAVSIN DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SPRAKIN  DFLD  POS=(2,50),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radnr',                                                +        
               POS=(2,56),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KATRADIN DFLD  POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,69),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CATPUBIN DFLD  POS=(2,73),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
IDKATUT  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KATGRPUT DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KATAVSUT DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SPRAKUT  DFLD  POS=(3,50),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
KATRADUT DFLD  POS=(3,62),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CATPUBUT DFLD  POS=(3,73),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Skall avsnittet med i VADIS?',                         +        
               POS=(5,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
FLAVSTVA DFLD  POS=(5,31),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(J/N)',                                                +        
               POS=(5,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PUB tom.',                                             +        
               POS=(5,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
CATPUBTO DFLD  POS=(5,73),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kol Exc Mod Start  Slut  Variant 1',                   +        
               POS=(7,2),LTH=34,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Variant 2',                                            +        
               POS=(7,43),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cha Chassi  Chassi',                                   +        
               POS=(7,58),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(8,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(8,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Typ Fr.o.m. T.o.m.',                                   +        
               POS=(8,58),LTH=18,                                      +        
               ATTR=(PROT)                                                      
KOL1     DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EXCL1    DFLD  POS=(9,7),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
MODELL1  DFLD  POS=(9,10),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
AARSTA1  DFLD  POS=(9,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,19),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
AARSLU1  DFLD  POS=(9,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
VARIAN11 DFLD  POS=(9,27),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
VARIAN21 DFLD  POS=(9,43),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
CHATYP1  DFLD  POS=(9,59),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA1 DFLD  POS=(9,62),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU1 DFLD  POS=(9,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
RADNR1   DFLD  POS=(9,77),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL2     DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL2    DFLD  POS=(10,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL2  DFLD  POS=(10,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA2  DFLD  POS=(10,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU2  DFLD  POS=(10,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN12 DFLD  POS=(10,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN22 DFLD  POS=(10,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP2  DFLD  POS=(10,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA2 DFLD  POS=(10,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU2 DFLD  POS=(10,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR2   DFLD  POS=(10,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL3     DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL3    DFLD  POS=(11,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL3  DFLD  POS=(11,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA3  DFLD  POS=(11,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU3  DFLD  POS=(11,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN13 DFLD  POS=(11,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN23 DFLD  POS=(11,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP3  DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA3 DFLD  POS=(11,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU3 DFLD  POS=(11,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR3   DFLD  POS=(11,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL4     DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL4    DFLD  POS=(12,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL4  DFLD  POS=(12,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA4  DFLD  POS=(12,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU4  DFLD  POS=(12,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN14 DFLD  POS=(12,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN24 DFLD  POS=(12,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP4  DFLD  POS=(12,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA4 DFLD  POS=(12,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU4 DFLD  POS=(12,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR4   DFLD  POS=(12,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL5     DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL5    DFLD  POS=(13,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL5  DFLD  POS=(13,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA5  DFLD  POS=(13,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU5  DFLD  POS=(13,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN15 DFLD  POS=(13,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN25 DFLD  POS=(13,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP5  DFLD  POS=(13,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA5 DFLD  POS=(13,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU5 DFLD  POS=(13,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR5   DFLD  POS=(13,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL6     DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL6    DFLD  POS=(14,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL6  DFLD  POS=(14,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA6  DFLD  POS=(14,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU6  DFLD  POS=(14,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN16 DFLD  POS=(14,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN26 DFLD  POS=(14,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP6  DFLD  POS=(14,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA6 DFLD  POS=(14,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU6 DFLD  POS=(14,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR6   DFLD  POS=(14,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL7     DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL7    DFLD  POS=(15,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL7  DFLD  POS=(15,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA7  DFLD  POS=(15,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU7  DFLD  POS=(15,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN17 DFLD  POS=(15,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN27 DFLD  POS=(15,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP7  DFLD  POS=(15,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA7 DFLD  POS=(15,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU7 DFLD  POS=(15,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR7   DFLD  POS=(15,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL8     DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL8    DFLD  POS=(16,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL8  DFLD  POS=(16,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA8  DFLD  POS=(16,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU8  DFLD  POS=(16,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN18 DFLD  POS=(16,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN28 DFLD  POS=(16,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP8  DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA8 DFLD  POS=(16,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU8 DFLD  POS=(16,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR8   DFLD  POS=(16,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL9     DFLD  POS=(17,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL9    DFLD  POS=(17,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL9  DFLD  POS=(17,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA9  DFLD  POS=(17,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU9  DFLD  POS=(17,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN19 DFLD  POS=(17,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN29 DFLD  POS=(17,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP9  DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTA9 DFLD  POS=(17,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLU9 DFLD  POS=(17,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR9   DFLD  POS=(17,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOL10    DFLD  POS=(18,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EXCL10   DFLD  POS=(18,7),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MODELL10 DFLD  POS=(18,10),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
AARSTA10 DFLD  POS=(18,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,19),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
AARSLU10 DFLD  POS=(18,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
VARIAN1A DFLD  POS=(18,27),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
VARIAN2A DFLD  POS=(18,43),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
CHATYP10 DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSTAA DFLD  POS=(18,62),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CHASSLUA DFLD  POS=(18,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADNR10  DFLD  POS=(18,77),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 AVSNITTSHUVUD 17 VADIS A/K SÖK',                    +        
               POS=(21,48),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVS ORIGINAL 20 LISTA RUBRIK  21 LISTA AVSN    10 WH+        
               ELP',                                                   +        
               POS=(22,15),LTH=58,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1O51501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F515,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I51501,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=W1F515                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKATIN,                                                +        
               LTH=5                                                            
         MFLD  IDKATUT,                                                +        
               LTH=5                                                            
         MFLD  KATGRPIN,                                               +        
               LTH=2                                                            
         MFLD  KATGRPUT,                                               +        
               LTH=2                                                            
         MFLD  KATAVSIN,                                               +        
               LTH=4                                                            
         MFLD  KATAVSUT,                                               +        
               LTH=4                                                            
         MFLD  SPRAKIN,                                                +        
               LTH=3                                                            
         MFLD  SPRAKUT,                                                +        
               LTH=3                                                            
         MFLD  KATRADIN,                                               +        
               LTH=4                                                            
         MFLD  KATRADUT,                                               +        
               LTH=4                                                            
         MFLD  CATPUBIN,                                               +        
               LTH=3                                                            
         MFLD  CATPUBUT,                                               +        
               LTH=3                                                            
         MFLD  FLAVSTVA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CATPUBTO,                                               +        
               LTH=3                                                            
         MFLD  KOL1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL1,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN11,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN21,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR1,                                                 +        
               LTH=4                                                            
         MFLD  KOL2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL2,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN12,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN22,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA2,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU2,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR2,                                                 +        
               LTH=4                                                            
         MFLD  KOL3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL3,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN13,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN23,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA3,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU3,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR3,                                                 +        
               LTH=4                                                            
         MFLD  KOL4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL4,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN14,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN24,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA4,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU4,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR4,                                                 +        
               LTH=4                                                            
         MFLD  KOL5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL5,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA5,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU5,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN15,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN25,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA5,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU5,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR5,                                                 +        
               LTH=4                                                            
         MFLD  KOL6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL6,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL6,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA6,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU6,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN16,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN26,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA6,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU6,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR6,                                                 +        
               LTH=4                                                            
         MFLD  KOL7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL7,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL7,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA7,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU7,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN17,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN27,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA7,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU7,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR7,                                                 +        
               LTH=4                                                            
         MFLD  KOL8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL8,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL8,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA8,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU8,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN18,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN28,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA8,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU8,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR8,                                                 +        
               LTH=4                                                            
         MFLD  KOL9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL9,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL9,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA9,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU9,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN19,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN29,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTA9,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLU9,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR9,                                                 +        
               LTH=4                                                            
         MFLD  KOL10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EXCL10,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODELL10,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSTA10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARSLU10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VARIAN1A,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARIAN2A,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CHATYP10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSTAA,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CHASSLUA,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADNR10,                                                +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I51501 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F515),                                           +        
               OPT=2,                                                  +        
               NXT=W1O51501                                                     
DGIMID03 LPAGE SOR=(W1F515)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15151',                                                +        
               LTH=5                                                            
         MFLD  (IDKATIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKATUT,                                                +        
               LTH=5                                                            
         MFLD  (KATGRPIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KATGRPUT,                                               +        
               LTH=2                                                            
         MFLD  (KATAVSIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KATAVSUT,                                               +        
               LTH=4                                                            
         MFLD  (SPRAKIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  SPRAKUT,                                                +        
               LTH=3                                                            
         MFLD  (KATRADIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KATRADUT,                                               +        
               LTH=4                                                            
         MFLD  (CATPUBIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  CATPUBUT,                                               +        
               LTH=3                                                            
         MFLD  (FLAVSTVA,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  CATPUBTO,                                               +        
               LTH=3                                                            
         MFLD  (KOL1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL1,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN11,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN21,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA1,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU1,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR1,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL2,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN12,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN22,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA2,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU2,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR2,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL3,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN13,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN23,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA3,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU3,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR3,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL4,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA4,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU4,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN14,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN24,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA4,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU4,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR4,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL5,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA5,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU5,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN15,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN25,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA5,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU5,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR5,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL6,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL6,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA6,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU6,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN16,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN26,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA6,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU6,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR6,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL7,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL7,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA7,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU7,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN17,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN27,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA7,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU7,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR7,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL8,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL8,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA8,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU8,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN18,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN28,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA8,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU8,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR8,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL9,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL9,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA9,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU9,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN19,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN29,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTA9,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLU9,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR9,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOL10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXCL10,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MODELL10,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AARSTA10,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AARSLU10,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VARIAN1A,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARIAN2A,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CHATYP10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSTAA,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CHASSLUA,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADNR10,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
