***********************************************************************         
* CREATED BY V028439   ON 01/04/11  AT 07:47                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KATALOGAVSNITT, UTSKRIFT        '                               
W1F519   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T519 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T519 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T519 4',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOGAVSNITT, UTSKRIFT',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
INCATNR  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grp',                                                  +        
               POS=(2,16),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INGRP    DFLD  POS=(2,20),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avs',                                                  +        
               POS=(2,23),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INAVS    DFLD  POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
INSPR    DFLD  POS=(2,38),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Rad',                                                  +        
               POS=(2,42),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INRAD    DFLD  POS=(2,46),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB from',                                             +        
               POS=(2,51),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
INPUBFOM DFLD  POS=(2,60),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB tom',                                              +        
               POS=(2,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
INPUBTOM DFLD  POS=(2,72),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
UTCATNR  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
UTGRP    DFLD  POS=(3,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTAVS    DFLD  POS=(3,27),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTSPR    DFLD  POS=(3,38),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTRAD    DFLD  POS=(3,46),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTPUBFOM DFLD  POS=(3,60),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTPUBTOM DFLD  POS=(3,72),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Omfattning på lista',                                  +        
               POS=(5,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
KDSVAR   DFLD  POS=(5,23),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '(normalt fås 2)',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1 = Endast VADIS-BEGREPP och Avsnitts-huvud.',         +        
               POS=(6,23),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 = Ovanstående plus alla rader.',                     +        
               POS=(7,23),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Utskrift destination',                                 +        
               POS=(9,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,25),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  '( Node',                                               +        
               POS=(9,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLTERM  DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ')',                                                    +        
               POS=(9,43),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'A = Katalogredaktion',                                 +        
               POS=(11,23),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'B = Beredningen',                                      +        
               POS=(12,23),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'C = Systemavdelningen',                                +        
               POS=(13,23),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Om avsnittet är märkt N för generering till VADIS, fås +        
               ej VADIS-BEGREPP',                                      +        
               POS=(17,2),LTH=71,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,30),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 AVSN. HUVUD   17 VADIS/AVS-KOL',                    +        
               POS=(21,47),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVS.ORIGIN. 20 LISTA RUBRIK  21 -',                 +        
               POS=(22,15),LTH=36,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T519 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T519 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T519 4',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KATALOGAVSNITT, UTSKRIFT',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Katalog',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
INCATNR  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Grp',                                                  +        
               POS=(2,16),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INGRP    DFLD  POS=(2,20),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avs',                                                  +        
               POS=(2,23),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INAVS    DFLD  POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Språk',                                                +        
               POS=(2,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
INSPR    DFLD  POS=(2,38),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Rad',                                                  +        
               POS=(2,42),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INRAD    DFLD  POS=(2,46),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB from',                                             +        
               POS=(2,51),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
INPUBFOM DFLD  POS=(2,60),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB tom',                                              +        
               POS=(2,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
INPUBTOM DFLD  POS=(2,72),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
UTCATNR  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
UTGRP    DFLD  POS=(3,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTAVS    DFLD  POS=(3,27),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTSPR    DFLD  POS=(3,38),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTRAD    DFLD  POS=(3,46),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTPUBFOM DFLD  POS=(3,60),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTPUBTOM DFLD  POS=(3,72),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Omfattning på lista',                                  +        
               POS=(5,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
KDSVAR   DFLD  POS=(5,23),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '(normalt fås 2)',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1 = Endast VADIS-BEGREPP och Avsnitts-huvud.',         +        
               POS=(6,23),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '2 = Ovanstående plus alla rader.',                     +        
               POS=(7,23),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Utskrift destination',                                 +        
               POS=(9,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,25),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  '( Node',                                               +        
               POS=(9,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLTERM  DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ')',                                                    +        
               POS=(9,43),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'A = Katalogredaktion',                                 +        
               POS=(11,23),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'B = Beredningen',                                      +        
               POS=(12,23),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'C = Systemavdelningen',                                +        
               POS=(13,23),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Om avsnittet är märkt N för generering till VADIS, fås +        
               ej VADIS-BEGREPP',                                      +        
               POS=(17,2),LTH=71,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 VISA AVSNITT 14 UPPDAT RADER  15 VISA RADNOT   16 AV+        
               SN. HUVUD  17 VADIS/AVS-KOL',                           +        
               POS=(21,2),LTH=82,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 AVS.ORIGIN.   20 LISTA RUBRIK  21 -',               +        
               POS=(22,18),LTH=38,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O51901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1F519,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I51901,                                           +        
               FILL=PT                                                          
DGI1MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INCATNR,                                                +        
               LTH=5                                                            
         MFLD  UTCATNR,                                                +        
               LTH=5                                                            
         MFLD  INGRP,                                                  +        
               LTH=2                                                            
         MFLD  UTGRP,                                                  +        
               LTH=2                                                            
         MFLD  INAVS,                                                  +        
               LTH=4                                                            
         MFLD  UTAVS,                                                  +        
               LTH=4                                                            
         MFLD  INSPR,                                                  +        
               LTH=3                                                            
         MFLD  UTSPR,                                                  +        
               LTH=3                                                            
         MFLD  INRAD,                                                  +        
               LTH=4                                                            
         MFLD  UTRAD,                                                  +        
               LTH=4                                                            
         MFLD  INPUBFOM,                                               +        
               LTH=3                                                            
         MFLD  UTPUBFOM,                                               +        
               LTH=3                                                            
         MFLD  INPUBTOM,                                               +        
               LTH=3                                                            
         MFLD  UTPUBTOM,                                               +        
               LTH=3                                                            
         MFLD  KDSVAR,                                                 +        
               LTH=2                                                            
         MFLD  KDPRTVAL,                                               +        
               LTH=2                                                            
         MFLD  IDLTERM,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
W1I51901 MSG   TYPE=INPUT,                                             +        
               SOR=(W1F519),                                           +        
               OPT=2,                                                  +        
               NXT=W1O51901                                                     
DGI2MID  LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15191',                                                +        
               LTH=5                                                            
         MFLD  (INCATNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTCATNR,                                                +        
               LTH=5                                                            
         MFLD  (INGRP,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTGRP,                                                  +        
               LTH=2                                                            
         MFLD  (INAVS,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTAVS,                                                  +        
               LTH=4                                                            
         MFLD  (INSPR,                                                 +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  UTSPR,                                                  +        
               LTH=3                                                            
         MFLD  (INRAD,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTRAD,                                                  +        
               LTH=4                                                            
         MFLD  (INPUBFOM,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  UTPUBFOM,                                               +        
               LTH=3                                                            
         MFLD  (INPUBTOM,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  UTPUBTOM,                                               +        
               LTH=3                                                            
         MFLD  (KDSVAR,                                                +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDPRTVAL,                                              +        
               'A'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLTERM,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
