***********************************************************************         
* CREATED BY V077376   ON 06/04/12  AT 13:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TRANSLATION DESCRIPTION         '                               
W1N122   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='        ',                                           +        
               2='        ',                                           +        
               3='        ',                                           +        
               4='        ',                                           +        
               5='        ',                                           +        
               6='        ',                                           +        
               7='        ',                                           +        
               8='        ',                                           +        
               9='        ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T122U ',                                          +        
               12='/RCL.   ',                                          +        
               13='        ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='        ',                                          +        
               21='        ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T122U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1N12201 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TRANSLATION DESCRIPTION',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Description',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
BEARTIN  DFLD  POS=(2,14),LTH=25,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Hom.Code',                                             +        
               POS=(2,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDHOMIN  DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
BEARTUT  DFLD  POS=(3,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
KDHOMUT  DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr.No.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDBENNR  DFLD  POS=(5,14),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(5,33),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GB',                                                   +        
               POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Create des.',                                          +        
               POS=(5,41),LTH=11,                                      +        
               ATTR=(PROT)                                                      
SKAPBEN  DFLD  POS=(5,53),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
GB       DFLD  POS=(6,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(6,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'USA',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
USA      DFLD  POS=(7,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0023 DFLD  POS=(7,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'D',                                                    +        
               POS=(8,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
D        DFLD  POS=(8,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(8,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Unicode lang',                                         +        
               POS=(8,37),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DK',                                                   +        
               POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DK       DFLD  POS=(9,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(9,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '® = exist.',                                           +        
               POS=(9,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(9,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(9,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F',                                                    +        
               POS=(10,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
F        DFLD  POS=(10,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(10,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Japanese    J',                                        +        
               POS=(10,37),LTH=13,                                     +        
               ATTR=(PROT)                                                      
J        DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Greek',                                                +        
               POS=(10,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'GR',                                                   +        
               POS=(10,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GR       DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'E',                                                    +        
               POS=(11,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
E        DFLD  POS=(11,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0003 DFLD  POS=(11,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Korean',                                               +        
               POS=(11,37),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KOR',                                                  +        
               POS=(11,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOR      DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Hungarian   H',                                        +        
               POS=(11,60),LTH=13,                                     +        
               ATTR=(PROT)                                                      
H        DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'P',                                                    +        
               POS=(12,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
P        DFLD  POS=(12,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0014 DFLD  POS=(12,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T.Chinese   RC',                                       +        
               POS=(12,37),LTH=14,                                     +        
               ATTR=(PROT)                                                      
RC       DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Farsi(Iran) IR',                                       +        
               POS=(12,60),LTH=14,                                     +        
               ATTR=(PROT)                                                      
IR       DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'MAL',                                                  +        
               POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
MAL      DFLD  POS=(13,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0012 DFLD  POS=(13,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Russian',                                              +        
               POS=(13,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RUS',                                                  +        
               POS=(13,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RUS      DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Polish',                                               +        
               POS=(13,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PL',                                                   +        
               POS=(13,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PL       DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'NL',                                                   +        
               POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NL       DFLD  POS=(14,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0013 DFLD  POS=(14,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Thai',                                                 +        
               POS=(14,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(14,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
T        DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'S.Chinese   RCN',                                      +        
               POS=(14,60),LTH=15,                                     +        
               ATTR=(PROT)                                                      
RCN      DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'I',                                                    +        
               POS=(15,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
I        DFLD  POS=(15,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(15,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Turkish',                                              +        
               POS=(15,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TR',                                                   +        
               POS=(15,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TR       DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Romanian    RO',                                       +        
               POS=(15,60),LTH=14,                                     +        
               ATTR=(PROT)                                                      
RO       DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SF',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
SF       DFLD  POS=(16,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0020 DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Czech',                                                +        
               POS=(16,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CZ',                                                   +        
               POS=(16,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CZ       DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Serbian',                                              +        
               POS=(16,60),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'YU',                                                   +        
               POS=(16,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
YU       DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Homonymous',                                           +        
               POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEHOM1   DFLD  POS=(18,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'code Notes',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEHOM2   DFLD  POS=(19,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='        ',                                           +        
               2='        ',                                           +        
               3='        ',                                           +        
               4='        ',                                           +        
               5='        ',                                           +        
               6='        ',                                           +        
               7='        ',                                           +        
               8='        ',                                           +        
               9='        ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T122U ',                                          +        
               12='/RCL.   ',                                          +        
               13='        ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='        ',                                          +        
               21='        ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T122U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1N12201 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TRANSLATION DESCRIPTION',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Description',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
BEARTIN  DFLD  POS=(2,14),LTH=25,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Hom.Code',                                             +        
               POS=(2,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDHOMIN  DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
BEARTUT  DFLD  POS=(3,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
KDHOMUT  DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr.No.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDBENNR  DFLD  POS=(5,14),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(5,33),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GB',                                                   +        
               POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Create des.',                                          +        
               POS=(5,41),LTH=11,                                      +        
               ATTR=(PROT)                                                      
SKAPBEN  DFLD  POS=(5,53),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
GB       DFLD  POS=(6,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(6,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'USA',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
USA      DFLD  POS=(7,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0023 DFLD  POS=(7,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'D',                                                    +        
               POS=(8,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
D        DFLD  POS=(8,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(8,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Unicode lang',                                         +        
               POS=(8,37),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DK',                                                   +        
               POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DK       DFLD  POS=(9,6),LTH=25,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(9,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '® = exist.',                                           +        
               POS=(9,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(9,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tr.',                                                  +        
               POS=(9,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F',                                                    +        
               POS=(10,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
F        DFLD  POS=(10,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(10,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Japanese    J',                                        +        
               POS=(10,37),LTH=13,                                     +        
               ATTR=(PROT)                                                      
J        DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Greek',                                                +        
               POS=(10,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'GR',                                                   +        
               POS=(10,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GR       DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'E',                                                    +        
               POS=(11,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
E        DFLD  POS=(11,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0003 DFLD  POS=(11,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Korean',                                               +        
               POS=(11,37),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KOR',                                                  +        
               POS=(11,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOR      DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Hungarian   H',                                        +        
               POS=(11,60),LTH=13,                                     +        
               ATTR=(PROT)                                                      
H        DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'P',                                                    +        
               POS=(12,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
P        DFLD  POS=(12,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0014 DFLD  POS=(12,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T.Chinese   RC',                                       +        
               POS=(12,37),LTH=14,                                     +        
               ATTR=(PROT)                                                      
RC       DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Farsi(Iran) IR',                                       +        
               POS=(12,60),LTH=14,                                     +        
               ATTR=(PROT)                                                      
IR       DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'MAL',                                                  +        
               POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
MAL      DFLD  POS=(13,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0012 DFLD  POS=(13,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Russian',                                              +        
               POS=(13,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RUS',                                                  +        
               POS=(13,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RUS      DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Polish',                                               +        
               POS=(13,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PL',                                                   +        
               POS=(13,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PL       DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'NL',                                                   +        
               POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NL       DFLD  POS=(14,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0013 DFLD  POS=(14,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Thai',                                                 +        
               POS=(14,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(14,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
T        DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'S.Chinese   RCN',                                      +        
               POS=(14,60),LTH=15,                                     +        
               ATTR=(PROT)                                                      
RCN      DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'I',                                                    +        
               POS=(15,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
I        DFLD  POS=(15,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(15,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Turkish',                                              +        
               POS=(15,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TR',                                                   +        
               POS=(15,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TR       DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Romanian    RO',                                       +        
               POS=(15,60),LTH=14,                                     +        
               ATTR=(PROT)                                                      
RO       DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SF',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
SF       DFLD  POS=(16,6),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0020 DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Czech',                                                +        
               POS=(16,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CZ',                                                   +        
               POS=(16,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CZ       DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Serbian',                                              +        
               POS=(16,60),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'YU',                                                   +        
               POS=(16,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
YU       DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Homonymous',                                           +        
               POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEHOM1   DFLD  POS=(18,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'code Notes',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEHOM2   DFLD  POS=(19,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O122N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N122,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I122N1,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=W1N12201                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  BEARTIN,                                                +        
               LTH=25                                                           
         MFLD  BEARTUT,                                                +        
               LTH=25                                                           
         MFLD  KDHOMIN,                                                +        
               LTH=1                                                            
         MFLD  KDHOMUT,                                                +        
               LTH=1                                                            
         MFLD  IDBENNR,                                                +        
               LTH=7                                                            
         MFLD  GB,                                                     +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  USA,                                                    +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=1                                                            
         MFLD  D,                                                      +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DK,                                                     +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  F,                                                      +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  E,                                                      +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  P,                                                      +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=1                                                            
         MFLD  MAL,                                                    +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  NL,                                                     +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  I,                                                      +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  SF,                                                     +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=1                                                            
         MFLD  CZ,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  GR,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  H,                                                      +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  IR,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=1                                                            
         MFLD  J,                                                      +        
               LTH=1                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  KOR,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=1                                                            
         MFLD  PL,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  RC,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  RCN,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  RO,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  RUS,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  T,                                                      +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  TR,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  YU,                                                     +        
               LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=1                                                            
         MFLD  TEHOM1,                                                 +        
               LTH=60                                                           
         MFLD  TEHOM2,                                                 +        
               LTH=60                                                           
         MFLD  SKAPBEN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I122N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N122),                                           +        
               OPT=2,                                                  +        
               NXT=W1O122N1                                                     
DGIMID03 LPAGE SOR=(W1N12201)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11222',                                                +        
               LTH=5                                                            
         MFLD  (BEARTIN,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  BEARTUT,                                                +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDHOMIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KDHOMUT,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (GB,                                                    +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (USA,                                                   +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (D,                                                     +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DK,                                                    +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (F,                                                     +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (E,                                                     +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (P,                                                     +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (MAL,                                                   +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NL,                                                    +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (I,                                                     +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SF,                                                    +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SKAPBEN,                                               +        
               '+')                                                    +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TEHOM1,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEHOM2,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
