*                                                                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
W1N154   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W1T154 7','W1T154 8','W0T501  ', *        
               'WHELP   ','W1T154U ','/RCL.   ','W1T151  ','W1T152  ', *        
               'W1T153  ','W1T154  ','W1T155  ','W1T156  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,15)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'CROSSREF. PLANNER/FUNC.GROUP',                         *        
               POS=(01,10),LTH=0028,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Prod.group ',                                          *        
               POS=(02,02),LTH=0011,ATTR=(NUM,PROT)                             
FLD0215  DFLD  POS=(02,15),LTH=0002,ATTR=(NUM)                                  
FLD0315  DFLD  POS=(03,15),LTH=0002,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0408  DFLD  POS=(04,08),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Func.gr.   Planner     Func.gr.   Planner      Func.gr.*        
                   Planner              From  To               From  To*        
                               From  To                      ',        *        
               POS=(05,03),LTH=0158,ATTR=(NUM,PROT)                             
         DO    11,SUF=07                                                        
COL02    DFLD  POS=(07,02),LTH=0019,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DO    11,SUF=07                                                        
COL25    DFLD  POS=(07,25),LTH=0019,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DO    11,SUF=07                                                        
COL49    DFLD  POS=(07,49),LTH=0019,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
FLD1902  DFLD  POS=(19,02),LTH=0004,ATTR=(NUM)                                  
FLD1908  DFLD  POS=(19,08),LTH=0004,ATTR=(NUM)                                  
FLD1920  DFLD  POS=(19,20),LTH=0002,ATTR=(NUM)                                  
         DFLD  'Change  N/Ä/B',                                        *        
               POS=(19,25),LTH=0013,ATTR=(NUM,PROT)                             
FLD1940  DFLD  POS=(19,40),LTH=0001,ATTR=(ALPHA)                                
         DFLD  '13 MARK.STR.    14 PROJ.STR.    15 PROJ. MENU   16 PLAN*        
               ./FCN.GR.17 DEALER KIT   18 B.ST.ORDER   19             *        
                20              21              22 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W1O154N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W1N154,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W1I154N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0215,LTH=0002                                                 
         MFLD  FLD0315,LTH=0002                                                 
         MFLD  FLD0402,LTH=0004                                                 
         MFLD  FLD0408,LTH=0004                                                 
         DO    11,SUF=07                                                        
         MFLD  COL02,LTH=0021,ATTR=YES                                          
         ENDDO                                                                  
         DO    11,SUF=07                                                        
         MFLD  COL25,LTH=0021,ATTR=YES                                          
         ENDDO                                                                  
         DO    11,SUF=07                                                        
         MFLD  COL49,LTH=0021,ATTR=YES                                          
         ENDDO                                                                  
         MFLD  FLD1902,LTH=0004,ATTR=YES                                        
         MFLD  FLD1908,LTH=0004,ATTR=YES                                        
         MFLD  FLD1920,LTH=0004,ATTR=YES                                        
         MFLD  FLD1940,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W1I154N1 MSG   TYPE=INPUT,                                             *        
               SOR=W1N154,                                             *        
               OPT=2,                                                  *        
               NXT=W1O154N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'W',LTH=001                                                      
         MFLD  FLD0102,LTH=0001,FILL=C'1'                                       
         MFLD  'T',LTH=001                                                      
         MFLD  FLD0104,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'4'                                       
         MFLD  '  ',LTH=002                                                     
         MFLD  '11542',LTH=0005                                                 
         MFLD  (FLD0215,'++'),LTH=0002,FILL=C' ',JUST=R                         
         MFLD  FLD0315,LTH=0002,FILL=C'0',JUST=R                                
         MFLD  FLD0402,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  FLD0408,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  (FLD1902,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1908,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1920,'++'),LTH=0002,FILL=C'0',JUST=R                         
         MFLD  (FLD1940,'+'),LTH=0001,FILL=C' ',JUST=R                          
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
