***********************************************************************         
* CREATED BY V028439   ON 05/10/04  AT 15:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SUPPLIERS DESICNATION, PART NO  '                               
W1N108   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSSINDEX BY VOLVO-PARTNO',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0302  DFLD  POS=(3,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SUP-NO PLANT-CODE  MANUF.  SEQ.NO',                    +        
               POS=(5,2),LTH=33,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPLIERS PART NO',                                    +        
               POS=(5,40),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'UPDATE',                                               +        
               POS=(5,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0603  DFLD  POS=(6,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0614  DFLD  POS=(6,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0623  DFLD  POS=(6,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0631  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0637  DFLD  POS=(6,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0671  DFLD  POS=(6,71),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0703  DFLD  POS=(7,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0723  DFLD  POS=(7,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0731  DFLD  POS=(7,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0803  DFLD  POS=(8,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0831  DFLD  POS=(8,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0837  DFLD  POS=(8,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0903  DFLD  POS=(9,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0923  DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1003  DFLD  POS=(10,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1023  DFLD  POS=(10,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1031  DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1103  DFLD  POS=(11,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1123  DFLD  POS=(11,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1131  DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1137  DFLD  POS=(11,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1203  DFLD  POS=(12,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1231  DFLD  POS=(12,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1237  DFLD  POS=(12,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1303  DFLD  POS=(13,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1323  DFLD  POS=(13,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1331  DFLD  POS=(13,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1337  DFLD  POS=(13,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1403  DFLD  POS=(14,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1423  DFLD  POS=(14,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1431  DFLD  POS=(14,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1437  DFLD  POS=(14,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1503  DFLD  POS=(15,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1523  DFLD  POS=(15,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1531  DFLD  POS=(15,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1603  DFLD  POS=(16,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1623  DFLD  POS=(16,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1631  DFLD  POS=(16,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1637  DFLD  POS=(16,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1703  DFLD  POS=(17,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1723  DFLD  POS=(17,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1731  DFLD  POS=(17,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1737  DFLD  POS=(17,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1803  DFLD  POS=(18,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1823  DFLD  POS=(18,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1831  DFLD  POS=(18,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1837  DFLD  POS=(18,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1903  DFLD  POS=(19,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1923  DFLD  POS=(19,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1931  DFLD  POS=(19,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(19,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS MPNR',                                         +        
               POS=(21,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSSINDEX BY VOLVO-PARTNO',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0302  DFLD  POS=(3,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SUP-NO PLANT-CODE  MANUF.  SEQ.NO',                    +        
               POS=(5,2),LTH=33,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPLIERS PART NO',                                    +        
               POS=(5,40),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'UPDATE',                                               +        
               POS=(5,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0603  DFLD  POS=(6,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0614  DFLD  POS=(6,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0623  DFLD  POS=(6,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0631  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0637  DFLD  POS=(6,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0671  DFLD  POS=(6,71),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0703  DFLD  POS=(7,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0723  DFLD  POS=(7,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0731  DFLD  POS=(7,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0803  DFLD  POS=(8,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0831  DFLD  POS=(8,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0837  DFLD  POS=(8,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0903  DFLD  POS=(9,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0923  DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD1003  DFLD  POS=(10,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1023  DFLD  POS=(10,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1031  DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1103  DFLD  POS=(11,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1123  DFLD  POS=(11,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1131  DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1137  DFLD  POS=(11,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1203  DFLD  POS=(12,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1231  DFLD  POS=(12,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1237  DFLD  POS=(12,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1303  DFLD  POS=(13,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1323  DFLD  POS=(13,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1331  DFLD  POS=(13,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1337  DFLD  POS=(13,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1403  DFLD  POS=(14,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1423  DFLD  POS=(14,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1431  DFLD  POS=(14,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1437  DFLD  POS=(14,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1503  DFLD  POS=(15,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1523  DFLD  POS=(15,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1531  DFLD  POS=(15,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1603  DFLD  POS=(16,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1623  DFLD  POS=(16,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1631  DFLD  POS=(16,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1637  DFLD  POS=(16,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1703  DFLD  POS=(17,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1723  DFLD  POS=(17,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1731  DFLD  POS=(17,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1737  DFLD  POS=(17,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1803  DFLD  POS=(18,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1823  DFLD  POS=(18,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1831  DFLD  POS=(18,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1837  DFLD  POS=(18,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
FLD1903  DFLD  POS=(19,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1923  DFLD  POS=(19,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1931  DFLD  POS=(19,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(19,37),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS MPNR',                                         +        
               POS=(21,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O108N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N108,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I108N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0302,                                                +        
               LTH=3                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0603,                                                +        
               LTH=5                                                            
         MFLD  FLD0703,                                                +        
               LTH=5                                                            
         MFLD  FLD0803,                                                +        
               LTH=5                                                            
         MFLD  FLD0903,                                                +        
               LTH=5                                                            
         MFLD  FLD1003,                                                +        
               LTH=5                                                            
         MFLD  FLD1103,                                                +        
               LTH=5                                                            
         MFLD  FLD1203,                                                +        
               LTH=5                                                            
         MFLD  FLD1303,                                                +        
               LTH=5                                                            
         MFLD  FLD1403,                                                +        
               LTH=5                                                            
         MFLD  FLD1503,                                                +        
               LTH=5                                                            
         MFLD  FLD1603,                                                +        
               LTH=5                                                            
         MFLD  FLD1703,                                                +        
               LTH=5                                                            
         MFLD  FLD1803,                                                +        
               LTH=5                                                            
         MFLD  FLD1903,                                                +        
               LTH=5                                                            
         MFLD  FLD0614,                                                +        
               LTH=1                                                            
         MFLD  FLD0623,                                                +        
               LTH=1                                                            
         MFLD  FLD0723,                                                +        
               LTH=1                                                            
         MFLD  FLD0823,                                                +        
               LTH=1                                                            
         MFLD  FLD0923,                                                +        
               LTH=1                                                            
         MFLD  FLD1023,                                                +        
               LTH=1                                                            
         MFLD  FLD1123,                                                +        
               LTH=1                                                            
         MFLD  FLD1223,                                                +        
               LTH=1                                                            
         MFLD  FLD1323,                                                +        
               LTH=1                                                            
         MFLD  FLD1423,                                                +        
               LTH=1                                                            
         MFLD  FLD1523,                                                +        
               LTH=1                                                            
         MFLD  FLD1623,                                                +        
               LTH=1                                                            
         MFLD  FLD1723,                                                +        
               LTH=1                                                            
         MFLD  FLD1823,                                                +        
               LTH=1                                                            
         MFLD  FLD1923,                                                +        
               LTH=1                                                            
         MFLD  FLD0631,                                                +        
               LTH=1                                                            
         MFLD  FLD0731,                                                +        
               LTH=1                                                            
         MFLD  FLD0831,                                                +        
               LTH=1                                                            
         MFLD  FLD0931,                                                +        
               LTH=1                                                            
         MFLD  FLD1031,                                                +        
               LTH=1                                                            
         MFLD  FLD1131,                                                +        
               LTH=1                                                            
         MFLD  FLD1231,                                                +        
               LTH=1                                                            
         MFLD  FLD1331,                                                +        
               LTH=1                                                            
         MFLD  FLD1431,                                                +        
               LTH=1                                                            
         MFLD  FLD1531,                                                +        
               LTH=1                                                            
         MFLD  FLD1631,                                                +        
               LTH=1                                                            
         MFLD  FLD1731,                                                +        
               LTH=1                                                            
         MFLD  FLD1831,                                                +        
               LTH=1                                                            
         MFLD  FLD1931,                                                +        
               LTH=1                                                            
         MFLD  FLD0637,                                                +        
               LTH=30                                                           
         MFLD  FLD0737,                                                +        
               LTH=30                                                           
         MFLD  FLD0837,                                                +        
               LTH=30                                                           
         MFLD  FLD0937,                                                +        
               LTH=30                                                           
         MFLD  FLD1037,                                                +        
               LTH=30                                                           
         MFLD  FLD1137,                                                +        
               LTH=30                                                           
         MFLD  FLD1237,                                                +        
               LTH=30                                                           
         MFLD  FLD1337,                                                +        
               LTH=30                                                           
         MFLD  FLD1437,                                                +        
               LTH=30                                                           
         MFLD  FLD1537,                                                +        
               LTH=30                                                           
         MFLD  FLD1637,                                                +        
               LTH=30                                                           
         MFLD  FLD1737,                                                +        
               LTH=30                                                           
         MFLD  FLD1837,                                                +        
               LTH=30                                                           
         MFLD  FLD1937,                                                +        
               LTH=30                                                           
         MFLD  FLD0671,                                                +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I108N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N108),                                           +        
               OPT=2,                                                  +        
               NXT=W1O108N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11082',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0302,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
