***********************************************************************         
* CREATED BY PC22543   ON 97/01/21  AT 12:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROPER SHIPPING NAME            '                               
W1N132   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T132 7',                                           +        
               8='W1T132 8',                                           +        
               9='W1T118  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T132U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROPER SHIPPING NAME',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PSN',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
PSNIN    DFLD  POS=(2,6),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'LANGUAGE',                                             +        
               POS=(2,14),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDSPRKI  DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
PSNUT    DFLD  POS=(3,6),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
IDSPRKU  DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DGR',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
TYP1RAD1 DFLD  POS=(5,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
TYP1RAD2 DFLD  POS=(6,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
TYP1RAD3 DFLD  POS=(7,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'IM',                                                   +        
               POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
TYP2RAD1 DFLD  POS=(8,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DG',                                                   +        
               POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
TYP2RAD2 DFLD  POS=(9,6),LTH=75,                                       +        
               ATTR=(NOPROT)                                                    
TYP2RAD3 DFLD  POS=(10,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ADR',                                                  +        
               POS=(11,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TYP3RAD1 DFLD  POS=(11,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'OST',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TYP3RAD2 DFLD  POS=(12,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
TYP3RAD3 DFLD  POS=(13,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ADR',                                                  +        
               POS=(14,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TYP4RAD1 DFLD  POS=(14,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
TYP4RAD2 DFLD  POS=(15,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
TYP4RAD3 DFLD  POS=(16,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'NOT',                                                  +        
               POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
NOTES1   DFLD  POS=(18,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
NOTES2   DFLD  POS=(19,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
NOTES3   DFLD  POS=(20,6),LTH=75,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 PARTINFO CHEM 10 WHELP',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W1I132N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N132),                                           +        
               OPT=2,                                                  +        
               NXT=W1O132N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS4,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11322',                                                +        
               LTH=5                                                            
         MFLD  (PSNIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSPRKI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PSNUT,                                                 +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSPRKU,                                                +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP1RAD1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP1RAD2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP1RAD3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP2RAD1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP2RAD2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP2RAD3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP3RAD1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP3RAD2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP3RAD3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP4RAD1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP4RAD2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TYP4RAD3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOTES1,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOTES2,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOTES3,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++'),                                 +        
               LTH=75,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O132N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N132,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I132N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  PSNIN,                                                  +        
               LTH=3                                                            
         MFLD  IDSPRKI,                                                +        
               LTH=2                                                            
         MFLD  PSNUT,                                                  +        
               LTH=3                                                            
         MFLD  IDSPRKU,                                                +        
               LTH=2                                                            
         MFLD  TYP1RAD1,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP1RAD2,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP1RAD3,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP2RAD1,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP2RAD2,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP2RAD3,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP3RAD1,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP3RAD2,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP3RAD3,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP4RAD1,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP4RAD2,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TYP4RAD3,                                               +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOTES1,                                                 +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOTES2,                                                 +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOTES3,                                                 +        
               LTH=77,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
