***********************************************************************         
* CREATED BY V028439   ON 05/10/14  AT 09:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CROSS REFERENCE MPNR FORD       '                               
W1N105   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W1T105  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1N105   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSS REFERENCE MPNR',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCC Partnumber',                                       +        
               POS=(2,2),LTH=14,                                       +        
               ATTR=(ALPHA,PROT)                                                
INARTNR  DFLD  POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Srch Ford.No.',                                        +        
               POS=(2,32),LTH=13,                                      +        
               ATTR=(PROT)                                                      
INARTPFX DFLD  POS=(2,46),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(2,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
INARTBAS DFLD  POS=(2,55),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(2,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
INARTSFX DFLD  POS=(2,66),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
UTARTNR  DFLD  POS=(3,17),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KDARTUTF DFLD  POS=(3,27),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ford Engineering number',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
IDARTFMC DFLD  POS=(5,26),LTH=24,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Updated:',                                             +        
               POS=(5,56),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAREGFMC DFLD  POS=(5,65),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Partname FMC ....',                                    +        
               POS=(6,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
BEARTFMC DFLD  POS=(6,20),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Time:',                                                +        
               POS=(6,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIREGFMC DFLD  POS=(6,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Partname KDP ....',                                    +        
               POS=(7,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
BEARTKDP DFLD  POS=(7,20),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'By:',                                                  +        
               POS=(7,61),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDCDS    DFLD  POS=(7,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.Nypon .......',                                    +        
               POS=(8,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLAGGAD2 DFLD  POS=(8,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Active:',                                              +        
               POS=(8,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLGEMFMC DFLD  POS=(8,65),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.Puls ........',                                    +        
               POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLAGGAK6 DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS MPNR',                                         +        
               POS=(21,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W1T101  ',                                           +        
               2='W1T102  ',                                           +        
               3='W1T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W1T105  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T107  ',                                           +        
               8='W1T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T101  ',                                          +        
               14='W1T102  ',                                          +        
               15='W1T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W1T105  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T107  ',                                          +        
               20='W1T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1N105   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSS REFERENCE MPNR',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCC Partnumber',                                       +        
               POS=(2,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
INARTNR  DFLD  POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Srch Ford.No.',                                        +        
               POS=(2,32),LTH=13,                                      +        
               ATTR=(PROT)                                                      
INARTPFX DFLD  POS=(2,46),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(2,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
INARTBAS DFLD  POS=(2,55),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(2,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
INARTSFX DFLD  POS=(2,66),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
UTARTNR  DFLD  POS=(3,17),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KDARTUTF DFLD  POS=(3,27),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ford Engineering number',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
IDARTFMC DFLD  POS=(5,26),LTH=24,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Updated:',                                             +        
               POS=(5,56),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAREGFMC DFLD  POS=(5,65),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Partname FMC ....',                                    +        
               POS=(6,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
BEARTFMC DFLD  POS=(6,20),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Time:',                                                +        
               POS=(6,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIREGFMC DFLD  POS=(6,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Partname KDP ....',                                    +        
               POS=(7,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
BEARTKDP DFLD  POS=(7,20),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'By:',                                                  +        
               POS=(7,61),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDCDS    DFLD  POS=(7,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.Nypon .......',                                    +        
               POS=(8,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLAGGAD2 DFLD  POS=(8,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Active:',                                              +        
               POS=(8,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLGEMFMC DFLD  POS=(8,65),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.Puls ........',                                    +        
               POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLAGGAK6 DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1 PARTS INFO    2 SUPERSEDED BY 3 SUPERSEDES    4',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5 CROSS REF MPNR',                                     +        
               POS=(21,67),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7 CROSS/VOLVO   8 VOLVO/CROSS   9',                    +        
               POS=(22,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O105N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N105,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I105N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=W1N105                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INARTNR,                                                +        
               LTH=9                                                            
         MFLD  UTARTNR,                                                +        
               LTH=9                                                            
         MFLD  KDARTUTF,                                               +        
               LTH=3                                                            
         MFLD  INARTPFX,                                               +        
               LTH=6                                                            
         MFLD  INARTBAS,                                               +        
               LTH=8                                                            
         MFLD  INARTSFX,                                               +        
               LTH=8                                                            
         MFLD  IDARTFMC,                                               +        
               LTH=24                                                           
         MFLD  BEARTFMC,                                               +        
               LTH=34                                                           
         MFLD  BEARTKDP,                                               +        
               LTH=34                                                           
         MFLD  DAREGFMC,                                               +        
               LTH=10                                                           
         MFLD  TIREGFMC,                                               +        
               LTH=8                                                            
         MFLD  IDCDS,                                                  +        
               LTH=8                                                            
         MFLD  FLGEMFMC,                                               +        
               LTH=1                                                            
         MFLD  FLAGGAD2,                                               +        
               LTH=1                                                            
         MFLD  FLAGGAK6,                                               +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I105N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N105),                                           +        
               OPT=2,                                                  +        
               NXT=W1O105N1                                                     
DGI00003 LPAGE SOR=(W1N105)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11052',                                                +        
               LTH=5                                                            
         MFLD  (INARTNR,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTARTNR,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (INARTPFX,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (INARTBAS,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (INARTSFX,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
