***********************************************************************         
* CREATED BY V077376   ON 06/04/12  AT 13:12                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1N121   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='        ',                                           +        
               2='        ',                                           +        
               3='        ',                                           +        
               4='        ',                                           +        
               5='        ',                                           +        
               6='        ',                                           +        
               7='        ',                                           +        
               8='        ',                                           +        
               9='        ',                                           +        
               10='WHELP   ',                                          +        
               11='        ',                                          +        
               12='/RCL.   ',                                          +        
               13='        ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='        ',                                          +        
               21='        ',                                          +        
               22='WHELP   ',                                          +        
               23='        ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DESCRIPT.REG. SEARCH DESCRIPT',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DESCRIPTION',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0214  DFLD  POS=(2,14),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'SEARCH LANG.',                                         +        
               POS=(2,40),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0253  DFLD  POS=(2,53),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'REPLY LANG.',                                          +        
               POS=(2,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0270  DFLD  POS=(2,70),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CODE',                                                 +        
               POS=(2,74),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0279  DFLD  POS=(2,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0314  DFLD  POS=(3,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0353  DFLD  POS=(3,53),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0370  DFLD  POS=(3,70),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0379  DFLD  POS=(3,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0413  DFLD  POS=(4,13),LTH=25,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0440  DFLD  POS=(4,40),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'LANG.-1',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'HOM.CODE  TECHLA  LANG.-2',                            +        
               POS=(5,28),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NO.',                                                  +        
               POS=(5,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0632  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0641  DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR6  DFLD  POS=(6,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0732  DFLD  POS=(7,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0741  DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0747  DFLD  POS=(7,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR7  DFLD  POS=(7,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0832  DFLD  POS=(8,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0841  DFLD  POS=(8,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR8  DFLD  POS=(8,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0932  DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0941  DFLD  POS=(9,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0947  DFLD  POS=(9,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR9  DFLD  POS=(9,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1032  DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1041  DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR10 DFLD  POS=(10,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1132  DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1141  DFLD  POS=(11,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR11 DFLD  POS=(11,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1232  DFLD  POS=(12,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1241  DFLD  POS=(12,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR12 DFLD  POS=(12,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(13,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1341  DFLD  POS=(13,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR13 DFLD  POS=(13,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1432  DFLD  POS=(14,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1441  DFLD  POS=(14,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1447  DFLD  POS=(14,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR14 DFLD  POS=(14,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1532  DFLD  POS=(15,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1541  DFLD  POS=(15,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1547  DFLD  POS=(15,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR15 DFLD  POS=(15,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1632  DFLD  POS=(16,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1641  DFLD  POS=(16,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1647  DFLD  POS=(16,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR16 DFLD  POS=(16,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1732  DFLD  POS=(17,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1741  DFLD  POS=(17,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1747  DFLD  POS=(17,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR17 DFLD  POS=(17,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1832  DFLD  POS=(18,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1841  DFLD  POS=(18,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1847  DFLD  POS=(18,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR18 DFLD  POS=(18,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1932  DFLD  POS=(19,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1941  DFLD  POS=(19,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1947  DFLD  POS=(19,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR19 DFLD  POS=(19,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='        ',                                           +        
               2='        ',                                           +        
               3='        ',                                           +        
               4='        ',                                           +        
               5='        ',                                           +        
               6='        ',                                           +        
               7='        ',                                           +        
               8='        ',                                           +        
               9='        ',                                           +        
               10='WHELP   ',                                          +        
               11='        ',                                          +        
               12='/RCL.   ',                                          +        
               13='        ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='        ',                                          +        
               21='        ',                                          +        
               22='WHELP   ',                                          +        
               23='        ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DESCRIPT.REG. SEARCH DESCRIPT',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DESCRIPTION',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0214  DFLD  POS=(2,14),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'SEARCH LANG.',                                         +        
               POS=(2,40),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0253  DFLD  POS=(2,53),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'REPLY LANG.',                                          +        
               POS=(2,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0270  DFLD  POS=(2,70),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CODE',                                                 +        
               POS=(2,74),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0279  DFLD  POS=(2,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0314  DFLD  POS=(3,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0353  DFLD  POS=(3,53),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0370  DFLD  POS=(3,70),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0379  DFLD  POS=(3,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0413  DFLD  POS=(4,13),LTH=25,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0440  DFLD  POS=(4,40),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'LANG.-1',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'HOM.CODE  TECHLA  LANG.-2',                            +        
               POS=(5,28),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NO.',                                                  +        
               POS=(5,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0632  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0641  DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR6  DFLD  POS=(6,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0732  DFLD  POS=(7,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0741  DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0747  DFLD  POS=(7,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR7  DFLD  POS=(7,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0832  DFLD  POS=(8,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0841  DFLD  POS=(8,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR8  DFLD  POS=(8,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
FLD0932  DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0941  DFLD  POS=(9,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0947  DFLD  POS=(9,46),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDBENR9  DFLD  POS=(9,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1032  DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1041  DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR10 DFLD  POS=(10,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1132  DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1141  DFLD  POS=(11,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1147  DFLD  POS=(11,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR11 DFLD  POS=(11,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1232  DFLD  POS=(12,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1241  DFLD  POS=(12,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1247  DFLD  POS=(12,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR12 DFLD  POS=(12,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(13,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1341  DFLD  POS=(13,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1347  DFLD  POS=(13,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR13 DFLD  POS=(13,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1432  DFLD  POS=(14,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1441  DFLD  POS=(14,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1447  DFLD  POS=(14,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR14 DFLD  POS=(14,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1532  DFLD  POS=(15,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1541  DFLD  POS=(15,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1547  DFLD  POS=(15,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR15 DFLD  POS=(15,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1632  DFLD  POS=(16,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1641  DFLD  POS=(16,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1647  DFLD  POS=(16,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR16 DFLD  POS=(16,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1732  DFLD  POS=(17,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1741  DFLD  POS=(17,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1747  DFLD  POS=(17,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR17 DFLD  POS=(17,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1832  DFLD  POS=(18,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1841  DFLD  POS=(18,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1847  DFLD  POS=(18,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR18 DFLD  POS=(18,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD1932  DFLD  POS=(19,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1941  DFLD  POS=(19,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1947  DFLD  POS=(19,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDBENR19 DFLD  POS=(19,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1O121N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N121,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I121N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0214,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0314,                                                +        
               LTH=25                                                           
         MFLD  FLD0253,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0353,                                                +        
               LTH=3                                                            
         MFLD  FLD0270,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0370,                                                +        
               LTH=3                                                            
         MFLD  FLD0279,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0379,                                                +        
               LTH=1                                                            
         MFLD  FLD0413,                                                +        
               LTH=25                                                           
         MFLD  FLD0440,                                                +        
               LTH=7                                                            
         MFLD  FLD0602,                                                +        
               LTH=25                                                           
         MFLD  FLD0632,                                                +        
               LTH=1                                                            
         MFLD  FLD0641,                                                +        
               LTH=1                                                            
         MFLD  FLD0647,                                                +        
               LTH=25                                                           
         MFLD  IDBENR6,                                                +        
               LTH=7                                                            
         MFLD  FLD0702,                                                +        
               LTH=25                                                           
         MFLD  FLD0732,                                                +        
               LTH=1                                                            
         MFLD  FLD0741,                                                +        
               LTH=1                                                            
         MFLD  FLD0747,                                                +        
               LTH=25                                                           
         MFLD  IDBENR7,                                                +        
               LTH=7                                                            
         MFLD  FLD0802,                                                +        
               LTH=25                                                           
         MFLD  FLD0832,                                                +        
               LTH=1                                                            
         MFLD  FLD0841,                                                +        
               LTH=1                                                            
         MFLD  FLD0847,                                                +        
               LTH=25                                                           
         MFLD  IDBENR8,                                                +        
               LTH=7                                                            
         MFLD  FLD0902,                                                +        
               LTH=25                                                           
         MFLD  FLD0932,                                                +        
               LTH=1                                                            
         MFLD  FLD0941,                                                +        
               LTH=1                                                            
         MFLD  FLD0947,                                                +        
               LTH=25                                                           
         MFLD  IDBENR9,                                                +        
               LTH=7                                                            
         MFLD  FLD1002,                                                +        
               LTH=25                                                           
         MFLD  FLD1032,                                                +        
               LTH=1                                                            
         MFLD  FLD1041,                                                +        
               LTH=1                                                            
         MFLD  FLD1047,                                                +        
               LTH=25                                                           
         MFLD  IDBENR10,                                               +        
               LTH=7                                                            
         MFLD  FLD1102,                                                +        
               LTH=25                                                           
         MFLD  FLD1132,                                                +        
               LTH=1                                                            
         MFLD  FLD1141,                                                +        
               LTH=1                                                            
         MFLD  FLD1147,                                                +        
               LTH=25                                                           
         MFLD  IDBENR11,                                               +        
               LTH=7                                                            
         MFLD  FLD1202,                                                +        
               LTH=25                                                           
         MFLD  FLD1232,                                                +        
               LTH=1                                                            
         MFLD  FLD1241,                                                +        
               LTH=1                                                            
         MFLD  FLD1247,                                                +        
               LTH=25                                                           
         MFLD  IDBENR12,                                               +        
               LTH=7                                                            
         MFLD  FLD1302,                                                +        
               LTH=25                                                           
         MFLD  FLD1332,                                                +        
               LTH=1                                                            
         MFLD  FLD1341,                                                +        
               LTH=1                                                            
         MFLD  FLD1347,                                                +        
               LTH=25                                                           
         MFLD  IDBENR13,                                               +        
               LTH=7                                                            
         MFLD  FLD1402,                                                +        
               LTH=25                                                           
         MFLD  FLD1432,                                                +        
               LTH=1                                                            
         MFLD  FLD1441,                                                +        
               LTH=1                                                            
         MFLD  FLD1447,                                                +        
               LTH=25                                                           
         MFLD  IDBENR14,                                               +        
               LTH=7                                                            
         MFLD  FLD1502,                                                +        
               LTH=25                                                           
         MFLD  FLD1532,                                                +        
               LTH=1                                                            
         MFLD  FLD1541,                                                +        
               LTH=1                                                            
         MFLD  FLD1547,                                                +        
               LTH=25                                                           
         MFLD  IDBENR15,                                               +        
               LTH=7                                                            
         MFLD  FLD1602,                                                +        
               LTH=25                                                           
         MFLD  FLD1632,                                                +        
               LTH=1                                                            
         MFLD  FLD1641,                                                +        
               LTH=1                                                            
         MFLD  FLD1647,                                                +        
               LTH=25                                                           
         MFLD  IDBENR16,                                               +        
               LTH=7                                                            
         MFLD  FLD1702,                                                +        
               LTH=25                                                           
         MFLD  FLD1732,                                                +        
               LTH=1                                                            
         MFLD  FLD1741,                                                +        
               LTH=1                                                            
         MFLD  FLD1747,                                                +        
               LTH=25                                                           
         MFLD  IDBENR17,                                               +        
               LTH=7                                                            
         MFLD  FLD1802,                                                +        
               LTH=25                                                           
         MFLD  FLD1832,                                                +        
               LTH=1                                                            
         MFLD  FLD1841,                                                +        
               LTH=1                                                            
         MFLD  FLD1847,                                                +        
               LTH=25                                                           
         MFLD  IDBENR18,                                               +        
               LTH=7                                                            
         MFLD  FLD1902,                                                +        
               LTH=25                                                           
         MFLD  FLD1932,                                                +        
               LTH=1                                                            
         MFLD  FLD1941,                                                +        
               LTH=1                                                            
         MFLD  FLD1947,                                                +        
               LTH=25                                                           
         MFLD  IDBENR19,                                               +        
               LTH=7                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I121N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N121),                                           +        
               OPT=2,                                                  +        
               NXT=W1O121N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11212',                                                +        
               LTH=5                                                            
         MFLD  (FLD0214,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0314,                                                +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0253,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0353,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0270,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0370,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0279,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0379,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0413,                                                +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0440,                                                +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
