***********************************************************************         
* CREATED BY V028439   ON 02/01/28  AT 15:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTS REGISTRY                  '                               
W1N116   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T116U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W1T112  ',                                          +        
               15='W1T113  ',                                          +        
               16='W1T114  ',                                          +        
               17='W1T115  ',                                          +        
               18='W1T116  ',                                          +        
               19='W1T117  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T116U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS REGISTRY',                                       +        
               POS=(1,11),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART-NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0408  DFLD  POS=(4,8),LTH=10,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0419  DFLD  POS=(4,19),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0430  DFLD  POS=(4,30),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'NEW PART-NO',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0518  DFLD  POS=(5,18),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PLANNER',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0611  DFLD  POS=(6,11),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRODGR',                                               +        
               POS=(6,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0624  DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SORT',                                                 +        
               POS=(6,27),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0637  DFLD  POS=(6,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'P.UNIT',                                               +        
               POS=(6,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0653  DFLD  POS=(6,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0662  DFLD  POS=(6,62),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0671  DFLD  POS=(6,71),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0711  DFLD  POS=(7,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0724  DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0737  DFLD  POS=(7,37),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0753  DFLD  POS=(7,53),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0762  DFLD  POS=(7,62),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0771  DFLD  POS=(7,71),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SURFACE',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0811  DFLD  POS=(8,11),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PROJ',                                                 +        
               POS=(8,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0822  DFLD  POS=(8,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DANG.GOODS',                                           +        
               POS=(8,27),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0838  DFLD  POS=(8,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'BPSR',                                                 +        
               POS=(8,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0853  DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'VEH.',                                                 +        
               POS=(8,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0862  DFLD  POS=(8,62),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0868  DFLD  POS=(8,68),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0874  DFLD  POS=(8,74),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0911  DFLD  POS=(9,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0922  DFLD  POS=(9,22),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0938  DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0953  DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0962  DFLD  POS=(9,62),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0968  DFLD  POS=(9,68),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0974  DFLD  POS=(9,74),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'EXC.PART',                                             +        
               POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1012  DFLD  POS=(10,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PROJ-E',                                               +        
               POS=(10,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1022  DFLD  POS=(10,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PISK',                                                 +        
               POS=(10,27),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1038  DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DCN-NO',                                               +        
               POS=(10,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DELIV.W',                                              +        
               POS=(10,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1066  DFLD  POS=(10,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SOP',   ,                                              +        
               POS=(10,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TISOPU   DFLD  POS=(10,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1112  DFLD  POS=(11,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1127  DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1138  DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1147  DFLD  POS=(11,47),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
TISOPI   DFLD  POS=(11,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SP.PART',                                              +        
               POS=(12,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1212  DFLD  POS=(12,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SUBPROJ',                                              +        
               POS=(12,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1222  DFLD  POS=(12,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DES',                                                  +        
               POS=(12,34),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1238  DFLD  POS=(12,38),LTH=25,                                     +        
               ATTR=(PROT)                                                      
FLD1312  DFLD  POS=(13,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1322  DFLD  POS=(13,22),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1338  DFLD  POS=(13,38),LTH=25,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ENG',                                                  +        
               POS=(13,64),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1368  DFLD  POS=(13,68),LTH=3,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RS-UNIQ',                                              +        
               POS=(13,72),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1380  DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'FCNGRP',                                               +        
               POS=(14,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1409  DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPL',                                                +        
               POS=(14,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1420  DFLD  POS=(14,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PARTNO',                                               +        
               POS=(14,26),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1433  DFLD  POS=(14,33),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'YEAR PROG',                                            +        
               POS=(14,64),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1478  DFLD  POS=(14,74),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1509  DFLD  POS=(15,9),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1520  DFLD  POS=(15,20),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLD1533  DFLD  POS=(15,33),LTH=30,                                     +        
               ATTR=(NOPROT,MOD)                                                
FLD1578  DFLD  POS=(15,74),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'REASON',                                               +        
               POS=(16,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1611  DFLD  POS=(16,11),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DRAW-NO',                                              +        
               POS=(16,52),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1660  DFLD  POS=(16,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'NO/V',                                                 +        
               POS=(16,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1678  DFLD  POS=(16,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PLAN-NOT',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1711  DFLD  POS=(17,11),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
FLD1760  DFLD  POS=(17,60),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
FLD1778  DFLD  POS=(17,78),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1811  DFLD  POS=(18,11),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'COMPNO',                                               +        
               POS=(18,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1859  DFLD  POS=(18,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EXC',                                                  +        
               POS=(18,69),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1873  DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRO-NOT',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1911  DFLD  POS=(19,11),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
FLD1959  DFLD  POS=(19,59),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1973  DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RREG',                                                 +        
               POS=(19,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1980  DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 CHG DESC/HOM 15 REG. SUPERS. 16 MARKET REG.  17 PART+        
                INFO.',                                                +        
               POS=(21,18),LTH=61,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 PART REG.    19 CHG PART INF 20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O116N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N116,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I116N1,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0402,                                                +        
               LTH=2                                                            
         MFLD  FLD0408,                                                +        
               LTH=10                                                           
         MFLD  FLD0419,                                                +        
               LTH=10                                                           
         MFLD  FLD0430,                                                +        
               LTH=4                                                            
         MFLD  FLD0518,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0611,                                                +        
               LTH=2                                                            
         MFLD  FLD0624,                                                +        
               LTH=2                                                            
         MFLD  FLD0637,                                                +        
               LTH=2                                                            
         MFLD  FLD0653,                                                +        
               LTH=8                                                            
         MFLD  FLD0662,                                                +        
               LTH=8                                                            
         MFLD  FLD0671,                                                +        
               LTH=8                                                            
         MFLD  FLD0711,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0724,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0737,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0753,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0762,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0771,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0811,                                                +        
               LTH=2                                                            
         MFLD  FLD0822,                                                +        
               LTH=4                                                            
         MFLD  FLD0838,                                                +        
               LTH=1                                                            
         MFLD  FLD0853,                                                +        
               LTH=1                                                            
         MFLD  FLD0862,                                                +        
               LTH=5                                                            
         MFLD  FLD0868,                                                +        
               LTH=5                                                            
         MFLD  FLD0874,                                                +        
               LTH=5                                                            
         MFLD  FLD0911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0922,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0938,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0953,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0962,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0968,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0974,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1012,                                                +        
               LTH=1                                                            
         MFLD  FLD1022,                                                +        
               LTH=4                                                            
         MFLD  FLD1038,                                                +        
               LTH=1                                                            
         MFLD  FLD1047,                                                +        
               LTH=10                                                           
         MFLD  FLD1066,                                                +        
               LTH=5                                                            
         MFLD  TISOPU,                                                 +        
               LTH=5                                                            
         MFLD  FLD1112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1127,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1138,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1147,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISOPI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1212,                                                +        
               LTH=1                                                            
         MFLD  FLD1222,                                                +        
               LTH=8                                                            
         MFLD  FLD1238,                                                +        
               LTH=25                                                           
         MFLD  FLD1368,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1322,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1338,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1380,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1409,                                                +        
               LTH=4                                                            
         MFLD  FLD1420,                                                +        
               LTH=5                                                            
         MFLD  FLD1433,                                                +        
               LTH=30                                                           
         MFLD  FLD1478,                                                +        
               LTH=7                                                            
         MFLD  FLD1509,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1520,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1533,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1578,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1611,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1660,                                                +        
               LTH=10                                                           
         MFLD  FLD1678,                                                +        
               LTH=3                                                            
         MFLD  FLD1711,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1760,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1778,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1811,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1859,                                                +        
               LTH=9                                                            
         MFLD  FLD1873,                                                +        
               LTH=1                                                            
         MFLD  FLD1911,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1959,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1973,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1980,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I116N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N116),                                           +        
               OPT=2,                                                  +        
               NXT=W1O116N1                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11162',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0408,                                                +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0419,                                                +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0430,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0518,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0711,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0724,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0737,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0753,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0762,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0771,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0911,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0922,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0938,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0953,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0962,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0968,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0974,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1112,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1127,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1138,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1147,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TISOPI,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1368,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1312,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1322,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1338,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1380,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1509,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1520,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1533,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1578,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1611,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++'),  +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1711,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1760,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1778,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1811,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1911,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1959,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1973,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1980,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
