***********************************************************************         
* CREATED BY V063557   ON 06/03/21  AT 10:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PART INFORMATION CHEMISTRY      '                               
W1N118   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T118 7',                                           +        
               8='W1T118 8',                                           +        
               9='W1T132  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T118U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART INFO. CHEMISTRY',                                 +        
               POS=(1,18),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PSNDOLT  DFLD  POS=(4,13),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Swe. description',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
BEARTS   DFLD  POS=(5,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Handl.code',                                           +        
               POS=(5,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ARTHNT   DFLD  POS=(5,60),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dang.goods',                                           +        
               POS=(5,65),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Eng. description',                                     +        
               POS=(6,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
BEARTE   DFLD  POS=(6,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Incl. in kit',                                         +        
               POS=(6,48),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLIART   DFLD  POS=(6,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sup.code',                                             +        
               POS=(6,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(6,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Label',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDRITN   DFLD  POS=(7,11),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qual.hist',                                            +        
               POS=(7,48),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KHIST    DFLD  POS=(7,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'IR',                                                   +        
               POS=(7,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KRAPP    DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Colour.code',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KDFARGUT DFLD  POS=(8,14),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type of paint',                                        +        
               POS=(8,19),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KDLACKUT DFLD  POS=(8,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Rec.',                                                 +        
               POS=(8,42),LTH=4,                                       +        
               ATTR=(PROT)                                                      
RECUT    DFLD  POS=(8,49),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(8,60),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VKFORSUT DFLD  POS=(8,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDFARGIN DFLD  POS=(9,14),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDLACKIN DFLD  POS=(9,34),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
RECIN    DFLD  POS=(9,49),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
VKFORSIN DFLD  POS=(9,71),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Info.',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLINFUT  DFLD  POS=(10,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDINFUT  DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net cont.',                                            +        
               POS=(10,19),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVNTOUT  DFLD  POS=(10,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SRTNTOUT DFLD  POS=(10,37),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'VOC-kg',                                               +        
               POS=(10,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVVOCUT  DFLD  POS=(10,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EQ value',                                             +        
               POS=(10,60),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUEQUT   DFLD  POS=(10,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLINFIN  DFLD  POS=(11,11),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
IDINFIN  DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
KVNTOIN  DFLD  POS=(11,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
SRTNTOIN DFLD  POS=(11,37),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVVOCIN  DFLD  POS=(11,52),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
SUEQIN   DFLD  POS=(11,71),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SDS',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLSDSUT  DFLD  POS=(12,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDSDSUT  DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(12,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VLFGUT   DFLD  POS=(12,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SORTVLUT DFLD  POS=(12,37),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Flash point',                                          +        
               POS=(12,42),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
KVFLMUT  DFLD  POS=(12,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sens. for frost',                                      +        
               POS=(12,60),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FROSTUT  DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSDSIN  DFLD  POS=(13,11),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
IDSDSIN  DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
VLFGIN   DFLD  POS=(13,28),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
SORTVLIN DFLD  POS=(13,37),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLNEGIN  DFLD  POS=(13,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KVFLAMIN DFLD  POS=(13,55),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FROSTIN  DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PSN',                                                  +        
               POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPSNUT  DFLD  POS=(14,14),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EX No.',                                               +        
               POS=(14,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDAOUT   DFLD  POS=(14,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'FIFO',                                                 +        
               POS=(14,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FGPRIOUT DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tactil',                                               +        
               POS=(14,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TACTILUT DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDPSNIN  DFLD  POS=(15,14),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDAOIN   DFLD  POS=(15,26),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FGPRIOIN DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
TACTILIN DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Packing material',                                     +        
               POS=(16,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
EMBMATUT DFLD  POS=(16,21),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'A-number',                                             +        
               POS=(16,39),LTH=8,                                      +        
               ATTR=(PROT)                                                      
IDANMUT  DFLD  POS=(16,49),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(16,56),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
REKSIFUT DFLD  POS=(16,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Weight exp.',                                          +        
               POS=(16,60),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
VUT      DFLD  POS=(16,72),LTH=7,                                      +        
               ATTR=(PROT)                                                      
EMBMATIN DFLD  POS=(17,21),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
IDANMIN  DFLD  POS=(17,49),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(17,56),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
REKSIFIN DFLD  POS=(17,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VIN      DFLD  POS=(17,72),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Notes',                                                +        
               POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TENOTEN1 DFLD  POS=(18,21),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
TENOTEN2 DFLD  POS=(19,21),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Delete',                                               +        
               POS=(19,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
BORTTAG  DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O118N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N118,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I118N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  PSNDOLT,                                                +        
               LTH=3                                                            
         MFLD  BEARTS,                                                 +        
               LTH=25                                                           
         MFLD  ARTHNT,                                                 +        
               LTH=3                                                            
         MFLD  KDFARLIG,                                               +        
               LTH=1                                                            
         MFLD  BEARTE,                                                 +        
               LTH=25                                                           
         MFLD  FLIART,                                                 +        
               LTH=1                                                            
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  IDRITN,                                                 +        
               LTH=10                                                           
         MFLD  KHIST,                                                  +        
               LTH=1                                                            
         MFLD  KRAPP,                                                  +        
               LTH=1                                                            
         MFLD  KDFARGUT,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDLACKUT,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RECUT,                                                  +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VKFORSUT,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARGIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDLACKIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RECIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKFORSIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINFUT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDINFUT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVNTOUT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SRTNTOUT,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVVOCUT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUEQUT,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLINFIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDINFIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVNTOIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SRTNTOIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVVOCIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUEQIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSDSUT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSDSUT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VLFGUT,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SORTVLUT,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLMUT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FROSTUT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSDSIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSDSIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VLFGIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SORTVLIN,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLNEGIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLAMIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FROSTIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPSNUT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDAOUT,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FGPRIOUT,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TACTILUT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPSNIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDAOIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FGPRIOIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TACTILIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EMBMATUT,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANMUT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REKSIFUT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VUT,                                                    +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EMBMATIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANMIN,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REKSIFIN,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIN,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TENOTEN1,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTEN2,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BORTTAG,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I118N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N118),                                           +        
               OPT=2,                                                  +        
               NXT=W1O118N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11182',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PSNDOLT,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFARGIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDLACKIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RECIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VKFORSIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINFIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDINFIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVNTOIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SRTNTOIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVVOCIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUEQIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSDSIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDSDSIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (VLFGIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SORTVLIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLNEGIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVFLAMIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FROSTIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDPSNIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAOIN,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FGPRIOIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TACTILIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EMBMATIN,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDANMIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REKSIFIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VIN,                                                   +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TENOTEN1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TENOTEN2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORTTAG,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
