***********************************************************************         
* CREATED BY PC59625   ON 94/11/15  AT 12:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1N113   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='        ',                                           +        
               2='        ',                                           +        
               3='        ',                                           +        
               4='        ',                                           +        
               5='        ',                                           +        
               6='        ',                                           +        
               7='        ',                                           +        
               8='        ',                                           +        
               9='        ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T113U ',                                          +        
               12='/RCL.   ',                                          +        
               13='        ',                                          +        
               14='        ',                                          +        
               15='        ',                                          +        
               16='        ',                                          +        
               17='        ',                                          +        
               18='        ',                                          +        
               19='        ',                                          +        
               20='        ',                                          +        
               21='        ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T113U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REGISTRATION OF SUPERSESSIONS',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0412  DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0416  DFLD  POS=(4,16),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0420  DFLD  POS=(4,20),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'QUANT',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0508  DFLD  POS=(5,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SUP.CODE',                                             +        
               POS=(5,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0525  DFLD  POS=(5,26),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DCN-NO',                                               +        
               POS=(5,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0535  DFLD  POS=(5,37),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DATE OF SUP.',                                         +        
               POS=(5,49),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0555  DFLD  POS=(5,62),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LINE  ADDED PART    QUANT   DESCRIPTION',              +        
               POS=(7,2),LTH=39,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TEXT',                                                 +        
               POS=(7,58),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0608  DFLD  POS=(8,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0808  DFLD  POS=(8,8),LTH=9,                                        +        
               ATTR=(NOPROT)                                                    
COL2008  DFLD  POS=(8,20),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
COL3008  DFLD  POS=(8,30),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL5808  DFLD  POS=(8,58),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
COL0209  DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0609  DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0809  DFLD  POS=(9,8),LTH=9,                                        +        
               ATTR=(NOPROT)                                                    
COL2009  DFLD  POS=(9,20),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
COL3009  DFLD  POS=(9,30),LTH=25,                                      +        
               ATTR=(PROT)                                                      
COL5809  DFLD  POS=(9,58),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
COL0210  DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0610  DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0810  DFLD  POS=(10,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2010  DFLD  POS=(10,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3010  DFLD  POS=(10,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5810  DFLD  POS=(10,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0211  DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0611  DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0811  DFLD  POS=(11,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2011  DFLD  POS=(11,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3011  DFLD  POS=(11,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5811  DFLD  POS=(11,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0212  DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0612  DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0812  DFLD  POS=(12,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2012  DFLD  POS=(12,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3012  DFLD  POS=(12,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5812  DFLD  POS=(12,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0213  DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0613  DFLD  POS=(13,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0813  DFLD  POS=(13,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2013  DFLD  POS=(13,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3013  DFLD  POS=(13,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5813  DFLD  POS=(13,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0214  DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0614  DFLD  POS=(14,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0814  DFLD  POS=(14,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2014  DFLD  POS=(14,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3014  DFLD  POS=(14,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5814  DFLD  POS=(14,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0215  DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0615  DFLD  POS=(15,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0815  DFLD  POS=(15,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2015  DFLD  POS=(15,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3015  DFLD  POS=(15,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5815  DFLD  POS=(15,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
COL0216  DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0616  DFLD  POS=(16,6),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
COL0816  DFLD  POS=(16,8),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
COL2016  DFLD  POS=(16,20),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
COL3016  DFLD  POS=(16,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
COL5816  DFLD  POS=(16,58),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'SUP.NOTE',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1711  DFLD  POS=(17,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'RESPONSIBLE',                                          +        
               POS=(17,54),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1765  DFLD  POS=(17,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CUR.SUP.CODE  DATE OF REG.    PREL.DATE',              +        
               POS=(18,2),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DEF.DATE   READY',                                     +        
               POS=(18,49),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FLD1867  DFLD  POS=(18,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '  ',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1905  DFLD  POS=(19,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1912  DFLD  POS=(19,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1917  DFLD  POS=(19,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '  ',                                                   +        
               POS=(19,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1927  DFLD  POS=(19,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1944  DFLD  POS=(19,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O113N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N113,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I113N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=3                                                            
         MFLD  FLD0416,                                                +        
               LTH=3                                                            
         MFLD  FLD0420,                                                +        
               LTH=3                                                            
         MFLD  FLD0508,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0525,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0535,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0555,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0608,                                                +        
               LTH=1                                                            
         MFLD  COL0808,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2008,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3008,                                                +        
               LTH=25                                                           
         MFLD  COL5808,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0609,                                                +        
               LTH=1                                                            
         MFLD  COL0809,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2009,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3009,                                                +        
               LTH=25                                                           
         MFLD  COL5809,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0610,                                                +        
               LTH=1                                                            
         MFLD  COL0810,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2010,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3010,                                                +        
               LTH=25                                                           
         MFLD  COL5810,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0611,                                                +        
               LTH=1                                                            
         MFLD  COL0811,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2011,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3011,                                                +        
               LTH=25                                                           
         MFLD  COL5811,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0612,                                                +        
               LTH=1                                                            
         MFLD  COL0812,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2012,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3012,                                                +        
               LTH=25                                                           
         MFLD  COL5812,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0613,                                                +        
               LTH=1                                                            
         MFLD  COL0813,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2013,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3013,                                                +        
               LTH=25                                                           
         MFLD  COL5813,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0614,                                                +        
               LTH=1                                                            
         MFLD  COL0814,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2014,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3014,                                                +        
               LTH=25                                                           
         MFLD  COL5814,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0615,                                                +        
               LTH=1                                                            
         MFLD  COL0815,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2015,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3015,                                                +        
               LTH=25                                                           
         MFLD  COL5815,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0616,                                                +        
               LTH=1                                                            
         MFLD  COL0816,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2016,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3016,                                                +        
               LTH=25                                                           
         MFLD  COL5816,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1711,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1765,                                                +        
               LTH=8                                                            
         MFLD  FLD1867,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1905,                                                +        
               LTH=2                                                            
         MFLD  FLD1912,                                                +        
               LTH=2                                                            
         MFLD  FLD1917,                                                +        
               LTH=5                                                            
         MFLD  FLD1927,                                                +        
               LTH=5                                                            
         MFLD  FLD1937,                                                +        
               LTH=5                                                            
         MFLD  FLD1944,                                                +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I113N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N113),                                           +        
               OPT=2,                                                  +        
               NXT=W1O113N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11132',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0412,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0416,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0420,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0508,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0525,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0535,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0555,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL0208,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0608,                                                +        
               LTH=1                                                            
         MFLD  (COL0808,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2008,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5808,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0209,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0609,                                                +        
               LTH=1                                                            
         MFLD  (COL0809,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2009,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5809,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0210,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0610,                                                +        
               LTH=1                                                            
         MFLD  (COL0810,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2010,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5810,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0211,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0611,                                                +        
               LTH=1                                                            
         MFLD  (COL0811,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2011,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5811,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0212,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0612,                                                +        
               LTH=1                                                            
         MFLD  (COL0812,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2012,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5812,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0213,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0613,                                                +        
               LTH=1                                                            
         MFLD  (COL0813,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2013,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5813,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0214,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0614,                                                +        
               LTH=1                                                            
         MFLD  (COL0814,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2014,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5814,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0215,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0615,                                                +        
               LTH=1                                                            
         MFLD  (COL0815,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2015,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5815,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0216,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0616,                                                +        
               LTH=1                                                            
         MFLD  (COL0816,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL2016,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL5816,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1711,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1867,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
