***********************************************************************         
* CREATED BY PC59625   ON 95/04/03  AT 12:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1N117   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T117 7',                                           +        
               8='W1T117 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T117U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W1T112  ',                                          +        
               15='W1T113  ',                                          +        
               16='W1T114  ',                                          +        
               17='W1T115  ',                                          +        
               18='W1T116  ',                                          +        
               19='W1T117  ',                                          +        
               20='        ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T117U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CHANGE PART INFORMATION',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART-NO',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DESCRIPTION',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0517  DFLD  POS=(5,17),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PLANNER',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0611  DFLD  POS=(6,11),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRODGR',                                               +        
               POS=(6,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0625  DFLD  POS=(6,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SORT',                                                 +        
               POS=(6,36),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0642  DFLD  POS=(6,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'P.UNIT',                                               +        
               POS=(6,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0655  DFLD  POS=(6,55),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0664  DFLD  POS=(6,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0673  DFLD  POS=(6,73),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0711  DFLD  POS=(7,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0725  DFLD  POS=(7,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0742  DFLD  POS=(7,42),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0755  DFLD  POS=(7,55),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0764  DFLD  POS=(7,64),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0773  DFLD  POS=(7,73),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXC-PART',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0811  DFLD  POS=(8,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PROJ',                                                 +        
               POS=(8,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0825  DFLD  POS=(8,25),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PISK',                                                 +        
               POS=(8,36),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0842  DFLD  POS=(8,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'VEH.',                                                 +        
               POS=(8,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0864  DFLD  POS=(8,64),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0873  DFLD  POS=(8,73),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0911  DFLD  POS=(9,11),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0925  DFLD  POS=(9,25),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0942  DFLD  POS=(9,42),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0955  DFLD  POS=(9,55),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
FLD0964  DFLD  POS=(9,64),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
FLD0973  DFLD  POS=(9,73),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'SP.PART',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1011  DFLD  POS=(10,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PROJ-E',                                               +        
               POS=(10,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1025  DFLD  POS=(10,25),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BPSR',                                                 +        
               POS=(10,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1042  DFLD  POS=(10,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DELIV.W',                                              +        
               POS=(10,47),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1055  DFLD  POS=(10,55),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SOP',                                                  +        
               POS=(10,68),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TISOPU   DFLD  POS=(10,73),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1111  DFLD  POS=(11,11),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1125  DFLD  POS=(11,25),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1142  DFLD  POS=(11,42),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TISOPI   DFLD  POS=(11,73),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FCNGRP',                                               +        
               POS=(12,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1211  DFLD  POS=(12,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SUBPROJ',                                              +        
               POS=(12,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1225  DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'COMPNO',                                               +        
               POS=(12,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1255  DFLD  POS=(12,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1311  DFLD  POS=(13,11),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1325  DFLD  POS=(13,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FLD1355  DFLD  POS=(13,55),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXC',                                                  +        
               POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD1411  DFLD  POS=(14,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DRAW-NO',                                              +        
               POS=(14,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1425  DFLD  POS=(14,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'NO/V',                                                 +        
               POS=(14,36),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1442  DFLD  POS=(14,42),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'YEAR PROG',                                            +        
               POS=(14,47),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVPROGU  DFLD  POS=(14,57),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AGE CODE',                                             +        
               POS=(14,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KDAGEU   DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1511  DFLD  POS=(15,11),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1525  DFLD  POS=(15,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FLD1542  DFLD  POS=(15,42),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVPROGI  DFLD  POS=(15,57),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDAGEI   DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'DCN-NO',                                               +        
               POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1611  DFLD  POS=(16,11),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1622  DFLD  POS=(16,22),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1633  DFLD  POS=(16,33),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1644  DFLD  POS=(16,44),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1655  DFLD  POS=(16,55),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1711  DFLD  POS=(17,11),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FLD1722  DFLD  POS=(17,22),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FLD1733  DFLD  POS=(17,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FLD1744  DFLD  POS=(17,44),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
FLD1755  DFLD  POS=(17,55),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'REASON',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1811  DFLD  POS=(18,11),LTH=50,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'VAR-NOT',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VARNOT   DFLD  POS=(19,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 CHG DESC/HOM 15 REG. SUPERS. 16 MARKET REG.  17 PART+        
                INFO.',                                                +        
               POS=(21,18),LTH=61,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 PART REG.    19 CHG PART INF 20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1O117N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N117,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I117N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0517,                                                +        
               LTH=25                                                           
         MFLD  FLD0611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0625,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0642,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0655,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0664,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0673,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0711,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0725,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0742,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0755,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0764,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0773,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0811,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0825,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0842,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0855,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0864,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0873,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0925,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0942,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0955,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0964,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0973,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1011,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1025,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1042,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1055,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISOPU,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1125,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1142,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISOPI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1211,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1225,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1255,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1325,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1355,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1411,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1425,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1442,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPROGU,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDAGEU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1511,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1525,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1542,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPROGI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDAGEI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1611,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1622,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1633,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1644,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1655,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1711,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1722,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1733,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1744,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1755,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1811,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VARNOT,                                                 +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I117N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N117),                                           +        
               OPT=2,                                                  +        
               NXT=W1O117N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11172',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0711,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0725,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0742,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0755,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0764,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0773,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0911,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0925,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0942,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0955,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0964,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0973,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1111,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1125,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1142,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1311,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1325,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1355,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1511,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1525,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1542,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPROGI,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDAGEI,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1711,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1722,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1733,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1744,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1755,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1811,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++'),  +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VARNOT,                                                +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TISOPI,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
