***********************************************************************         
* CREATED BY PC59625   ON 94/03/30  AT 10:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STATISTICAL NUMBER              '                               
W1N111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T111 7',                                           +        
               8='W1T111 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T111U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPDATE STATISTICAL NO.',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No. ',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0001 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0002 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descript.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod.gr.',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
PRODSL   DFLD  POS=(6,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Comp.no.',                                             +        
               POS=(6,30),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(6,42),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Func.gr.',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FUNKGRP  DFLD  POS=(7,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Statistical number',                                   +        
               POS=(10,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dubai',                                                +        
               POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'England    Belgium    Peru',                           +        
               POS=(12,13),LTH=26,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Sweden ',                                              +        
               POS=(12,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
STATUT1  DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
STATUT2  DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATUT3  DFLD  POS=(13,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATUT4  DFLD  POS=(13,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATUT5  DFLD  POS=(13,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATIN1  DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
STATIN2  DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATIN3  DFLD  POS=(14,24),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATIN4  DFLD  POS=(14,35),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATIN5  DFLD  POS=(14,46),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14              15       ',                            +        
               POS=(21,18),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16              17            ',                       +        
               POS=(21,50),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18              19              20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O111N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N111,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I111N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  PRODSL,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  FUNKGRP,                                                +        
               LTH=4                                                            
         MFLD  STATUT1,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STATUT2,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STATUT3,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STATUT4,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STATUT5,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STATIN1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATIN2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATIN3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATIN4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATIN5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I111N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N111),                                           +        
               OPT=2,                                                  +        
               NXT=W1O111N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '11112',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0001,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '000000000'),                                           +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (STATIN1,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATIN2,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATIN3,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATIN4,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATIN5,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
