***********************************************************************         
* CREATED BY PC59625   ON 93/04/06  AT 11:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LISTBESTÄLLNING STRUKTURNUMMER  '                               
W1N202   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W1T202  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T202  ',                                           +        
               8='W1T202  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T202U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T201  ',                                          +        
               14='W1T202  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T202U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LISTBESTÄLLNING STRUKTUR-NR',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Språk',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDSKYLT  DFLD  POS=(5,8),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Lista 1',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Strukturnr',                                           +        
               POS=(11,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
STRNRA1  DFLD  POS=(11,15),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STRNRA2  DFLD  POS=(11,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STRNRA3  DFLD  POS=(11,35),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STRNRA4  DFLD  POS=(12,15),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STRNRA5  DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STRNRA6  DFLD  POS=(12,35),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Skrivare',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PRINTER  DFLD  POS=(17,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'RA=R36929   RB=R44059   SA2=RSE77433',                 +        
               POS=(17,22),LTH=36,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'CARPAC=R3110031',                                      +        
               POS=(18,22),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F1=Help     F10=WHELP    F11=Update   F12=Logoff',     +        
               POS=(22,2),LTH=48,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I202N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N202),                                           +        
               OPT=2,                                                  +        
               NXT=W1O202N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12022',                                                +        
               LTH=5                                                            
         MFLD  (IDSKYLT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STRNRA1,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRNRA2,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRNRA3,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRNRA4,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRNRA5,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRNRA6,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRINTER,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O202N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N202,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I202N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDSKYLT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STRNRA1,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STRNRA2,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STRNRA3,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STRNRA4,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STRNRA5,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STRNRA6,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRINTER,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
