***********************************************************************         
* CREATED BY V028439   ON 02/01/15  AT 15:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CHANGE IN STRUCTURE             '                               
W1N222   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T222 7',                                           +        
               8='W1T222 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T222U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T221  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((6,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CHANGE IN STRUCTURE',                                  +        
               POS=(1,10),LTH=19,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Suppl.',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNR  DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Part no./Ref',                                         +        
               POS=(2,15),LTH=12,                                      +        
               ATTR=(ALPHA,PROT)                                                
BELEVART DFLD  POS=(2,29),LTH=30,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,60),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(2,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(2,66),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
IDART    DFLD  POS=(3,14),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0002 DFLD  POS=(3,28),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,60),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0010 DFLD  POS=(3,64),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(3,66),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0000 DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,6),LTH=3,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Description old part no.',                             +        
               POS=(5,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,27),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cancel',                                               +        
               POS=(5,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
AANGRA   DFLD  POS=(5,64),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DCN',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
IDAO     DFLD  POS=(6,8),LTH=10,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Delete part number',                                   +        
               POS=(6,25),LTH=18,                                      +        
               ATTR=(PROT)                                                      
BORT     DFLD  POS=(6,44),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Week',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TIAAVV   DFLD  POS=(7,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'New part no.  1',                                      +        
               POS=(9,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl.',                                               +        
               POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR1 DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part no./Ref.',                                        +        
               POS=(10,15),LTH=13,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(10,29),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'QTY',                                                  +        
               POS=(10,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTAL1   DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sort',                                                 +        
               POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDSORT1  DFLD  POS=(11,11),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Description',                                          +        
               POS=(11,15),LTH=11,                                     +        
               ATTR=(PROT)                                                      
BEART1   DFLD  POS=(11,27),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Hom.C',                                                +        
               POS=(11,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TS',                                                   +        
               POS=(11,62),LTH=2,                                      +        
               ATTR=(PROT)                                                      
STRTYP1  DFLD  POS=(11,71),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note   1',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(12,12),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note   2',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(13,12),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'New part no   2',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR2 DFLD  POS=(16,9),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part no /Ref',                                         +        
               POS=(16,15),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(16,29),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'QTY',                                                  +        
               POS=(16,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTAL2   DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sort',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDSORT2  DFLD  POS=(17,11),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Description',                                          +        
               POS=(17,15),LTH=11,                                     +        
               ATTR=(PROT)                                                      
BEART2   DFLD  POS=(17,27),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Hom.C',                                                +        
               POS=(17,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TS',                                                   +        
               POS=(17,62),LTH=2,                                      +        
               ATTR=(PROT)                                                      
STRTYP2  DFLD  POS=(17,71),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note   1',                                             +        
               POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(18,12),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note   2',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(19,12),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'READY',                                                +        
               POS=(19,73),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLAR     DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 PART INCL.IN STR.14',                               +        
               POS=(21,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I222N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N222),                                           +        
               OPT=2,                                                  +        
               NXT=W1O222N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12222',                                                +        
               LTH=5                                                            
         MFLD  (BELEVART,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART,                                                 +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BELEVART,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '                         +++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0015,                                              +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0008,                                              +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0009,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0010,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0005,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEART,                                                 +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (AANGRA,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDAO,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORT,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIAAVV,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR1,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDSORT1,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEART1,                                                +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0016,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRTYP1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNR2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDSORT2,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEART2,                                                +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0017,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRTYP2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0014,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KLAR,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O222N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N222,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I222N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  BELEVART,                                               +        
               LTH=30                                                           
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  DGIA0009,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0015,                                               +        
               LTH=5                                                            
         MFLD  IDART,                                                  +        
               LTH=9                                                            
         MFLD  DGIA0002,                                               +        
               LTH=30                                                           
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3                                                            
         MFLD  DGIA0001,                                               +        
               LTH=3                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  AANGRA,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDAO,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAAVV,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTAL1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSORT1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART1,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STRTYP1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTAL2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSORT2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART2,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STRTYP2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KLAR,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
