***********************************************************************         
* CREATED BY PC59625   ON 93/10/27  AT 09:16                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRATION OF PACKAGING       '                               
W1N215   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T215 7',                                           +        
               8='W1T215 8',                                           +        
               9='W1T215 9',                                           +        
               10='WHELP   ',                                          +        
               11='W1T215U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T211  ',                                          +        
               14='W1T212  ',                                          +        
               15='W1T213  ',                                          +        
               16='W1T214  ',                                          +        
               17='W1T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T215U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REGISTRATION OF PACKAGING',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'No.',                                                  +        
               POS=(2,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0013 DFLD  POS=(4,4),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0016 DFLD  POS=(4,25),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0014 DFLD  POS=(4,27),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Descript.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl.',                                               +        
               POS=(5,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(5,46),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'External packing',                                     +        
               POS=(6,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(6,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(7,21),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line  Part',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'no.',                                                  +        
               POS=(8,13),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(8,29),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'QTY    Sweek  Eweek  Dlet',                            +        
               POS=(8,55),LTH=25,                                      +        
               ATTR=(PROT)                                                      
IDRADNR1 DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(9,8),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(9,29),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(9,55),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(9,62),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(9,69),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
BORT1    DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(10,8),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(10,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0023 DFLD  POS=(10,62),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(10,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Note',                                                 +        
               POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FRITEXT1 DFLD  POS=(11,8),LTH=70,                                      +        
               ATTR=(NOPROT)                                                    
IDRADNR2 DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(12,8),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(12,29),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(12,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(12,62),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(12,69),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
BORT2    DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(13,8),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0018 DFLD  POS=(13,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0024 DFLD  POS=(13,62),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0030 DFLD  POS=(13,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Note',                                                 +        
               POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FRITEXT2 DFLD  POS=(14,8),LTH=70,                                      +        
               ATTR=(NOPROT)                                                    
IDRADNR3 DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(15,8),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(15,29),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(15,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(15,62),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(15,69),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
BORT3    DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0007 DFLD  POS=(16,8),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(16,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0025 DFLD  POS=(16,62),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0031 DFLD  POS=(16,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Note',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FRITEXT3 DFLD  POS=(17,8),LTH=70,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ready',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KLAR     DFLD  POS=(19,8),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'REG.STRUCT.',                                          +        
               POS=(21,5),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'REG.STR.LINES',                                        +        
               POS=(21,20),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'STR.LINES',                                            +        
               POS=(21,37),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 OLD',                                               +        
               POS=(21,49),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'STR.LINES',                                            +        
               POS=(21,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 PACKAGING',                                         +        
               POS=(21,66),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I215N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N215),                                           +        
               OPT=2,                                                  +        
               NXT=W1O215N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12152',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0008,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0013,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDRADNR1,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0020,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORT1,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0005,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRITEXT1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDRADNR2,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0021,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORT2,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRITEXT2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDRADNR3,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORT3,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRITEXT3,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KLAR,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O215N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N215,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I215N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=9                                                            
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR1,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=9                                                            
         MFLD  DGIA0000,                                               +        
               LTH=25                                                           
         MFLD  DGIA0020,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=4                                                            
         MFLD  DGIA0032,                                               +        
               LTH=4                                                            
         MFLD  BORT1,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRITEXT1,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR2,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=25                                                           
         MFLD  DGIA0021,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=4                                                            
         MFLD  DGIA0033,                                               +        
               LTH=4                                                            
         MFLD  BORT2,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRITEXT2,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR3,                                               +        
               LTH=5                                                            
         MFLD  DGIA0012,                                               +        
               LTH=9                                                            
         MFLD  DGIA0002,                                               +        
               LTH=25                                                           
         MFLD  DGIA0022,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=4                                                            
         MFLD  DGIA0034,                                               +        
               LTH=4                                                            
         MFLD  BORT3,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRITEXT3,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KLAR,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
