***********************************************************************         
* CREATED BY V028439   ON 02/01/15  AT 14:47                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRATION OF STRUCTURE LINES '                               
W1N212   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T212 7',                                           +        
               8='W1T212 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T212U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T211  ',                                          +        
               14='W1T212  ',                                          +        
               15='W1T213  ',                                          +        
               16='W1T214  ',                                          +        
               17='W1T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REGISTRATION STRUCTURE LINES',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Structure no.',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(ALPHA,PROT)                                                
STRNR    DFLD  POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang.',                                                +        
               POS=(2,41),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDSKYLT  DFLD  POS=(2,47),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDRAD    DFLD  POS=(2,59),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
STRNRA   DFLD  POS=(3,17),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDSKYLTA DFLD  POS=(3,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADA   DFLD  POS=(3,59),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADNRB DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Copy to line',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
IDRADNRK DFLD  POS=(5,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Move to line',                                         +        
               POS=(5,28),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDRADNRF DFLD  POS=(5,41),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Part no.',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(6,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl.',                                               +        
               POS=(6,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(6,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ref.',                                                 +        
               POS=(6,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BELEV    DFLD  POS=(6,48),LTH=30,                                      +        
               ATTR=(PROT)                                                      
IDARTNRA DFLD  POS=(7,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNRA DFLD  POS=(7,35),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
BELEVA   DFLD  POS=(7,48),LTH=30,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Description',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEARTX   DFLD  POS=(8,16),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Hom.code',                                             +        
               POS=(8,43),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,52),LTH=1,                                       +        
               ATTR=(PROT)                                                      
BEARTZ   DFLD  POS=(9,16),LTH=25,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0001 DFLD  POS=(9,52),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Suppl.',                                               +        
               POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRX DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ref.',                                                 +        
               POS=(10,16),LTH=4,                                      +        
               ATTR=(PROT)                                                      
BELEVX   DFLD  POS=(10,23),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Date of reg.',                                         +        
               POS=(10,56),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TIAAVVDD DFLD  POS=(10,69),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'QTY',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
ANTAL    DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type of Str',                                          +        
               POS=(12,16),LTH=11,                                     +        
               ATTR=(PROT)                                                      
STRTYP   DFLD  POS=(12,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sort',                                                 +        
               POS=(12,31),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(12,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ANTALA   DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
STRTYPB  DFLD  POS=(13,28),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDSORTA  DFLD  POS=(13,36),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DCN',                                                  +        
               POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDAO     DFLD  POS=(16,6),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Week',                                                 +        
               POS=(16,18),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TIAAVV   DFLD  POS=(16,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Note',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FRITEXT  DFLD  POS=(17,10),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
FRITEXTA DFLD  POS=(18,10),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Structure ready',                                      +        
               POS=(19,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KLAR     DFLD  POS=(19,18),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Delete line',                                          +        
               POS=(19,21),LTH=11,                                     +        
               ATTR=(PROT)                                                      
BORT     DFLD  POS=(19,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 REG.STRUCT. 14 REG.STR.LINES 15 STR. LINES  16 OLD S+        
               TR.LINES 17 PACKAGING',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I212N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N212),                                           +        
               OPT=2,                                                  +        
               NXT=W1O212N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '12122',                                                +        
               LTH=5                                                            
         MFLD  (STRNR,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STRNRA,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDSKYLT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDSKYLTA,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDRAD,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRADA,                                                 +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDRADNRB,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDRADNRK,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRADNRF,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRA,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNRA,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BELEVA,                                                +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEARTZ,                                                +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTALA,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STRTYPB,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSORTA,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDAO,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIAAVV,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRITEXT,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FRITEXTA,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KLAR,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BORT,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O212N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N212,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I212N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  STRNR,                                                  +        
               LTH=9                                                            
         MFLD  STRNRA,                                                 +        
               LTH=9                                                            
         MFLD  IDSKYLT,                                                +        
               LTH=3                                                            
         MFLD  IDSKYLTA,                                               +        
               LTH=3                                                            
         MFLD  IDRAD,                                                  +        
               LTH=4                                                            
         MFLD  IDRADA,                                                 +        
               LTH=4                                                            
         MFLD  IDRADNRB,                                               +        
               LTH=4                                                            
         MFLD  IDRADNRK,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNRF,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR,                                                +        
               LTH=9                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  BELEV,                                                  +        
               LTH=30                                                           
         MFLD  IDARTNRA,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNRA,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BELEVA,                                                 +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEARTX,                                                 +        
               LTH=25                                                           
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  BEARTZ,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNRX,                                               +        
               LTH=5                                                            
         MFLD  BELEVX,                                                 +        
               LTH=30                                                           
         MFLD  TIAAVVDD,                                               +        
               LTH=6                                                            
         MFLD  ANTAL,                                                  +        
               LTH=6                                                            
         MFLD  STRTYP,                                                 +        
               LTH=1                                                            
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  ANTALA,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STRTYPB,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSORTA,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDAO,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TIAAVV,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRITEXT,                                                +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FRITEXTA,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KLAR,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
