***********************************************************************         
* CREATED BY V048987   ON 97/02/12  AT 07:55                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STRUCTURE LINES                 '                               
W1N213   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W1T213 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T213 7',                                           +        
               8='W1T213 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1t211  ',                                          +        
               14='W1t212  ',                                          +        
               15='W1T213  ',                                          +        
               16='W1t214  ',                                          +        
               17='W1t215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'STRUCTURE LINES',                                      +        
               POS=(1,12),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0010 DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Language',                                             +        
               POS=(2,33),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(2,42),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,55),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(3,42),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,55),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,5),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,13),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0007 DFLD  POS=(4,20),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Desc.',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prodgrp',                                              +        
               POS=(5,34),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KDPRODSL DFLD  POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Funcgrp',                                              +        
               POS=(5,46),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDFKNGRP DFLD  POS=(5,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Struct.type',                                          +        
               POS=(5,60),LTH=11,                                      +        
               ATTR=(PROT)                                                      
STRTYP   DFLD  POS=(5,72),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LPC',                                                  +        
               POS=(5,75),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDPSLLOC DFLD  POS=(5,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Line Quant. Part no Proc  Std.price',                +        
               POS=(6,2),LTH=37,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Lt Work.bal',                                          +        
               POS=(6,41),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(6,53),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ts Status DG',                                         +        
               POS=(6,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDRADNR1 DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD1   DFLD  POS=(7,9),LTH=72,                                       +        
               ATTR=(PROT)                                                      
SELECT2  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDRADNR2 DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD2   DFLD  POS=(8,9),LTH=72,                                       +        
               ATTR=(PROT)                                                      
SELECT3  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDRADNR3 DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD3   DFLD  POS=(9,9),LTH=72,                                       +        
               ATTR=(PROT)                                                      
SELECT4  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR4 DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD4   DFLD  POS=(10,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT5  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR5 DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD5   DFLD  POS=(11,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT6  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR6 DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD6   DFLD  POS=(12,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT7  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR7 DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD7   DFLD  POS=(13,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT8  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR8 DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD8   DFLD  POS=(14,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT9  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDRADNR9 DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD9   DFLD  POS=(15,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT10 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD10  DFLD  POS=(16,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT11 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD11  DFLD  POS=(17,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
SELECT12 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
UTRAD12  DFLD  POS=(18,9),LTH=72,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KDPRTVAL DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'A=RA    B=RB   C=SA2  D=CARPAC',                       +        
               POS=(19,13),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 REG.STRUCT. 14 REG.STR.LINES 15 STR.LINES   16 OLD S+        
               TR.LINES 17 PACKAGING',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W1I213N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N213),                                           +        
               OPT=2,                                                  +        
               NXT=W1O213N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '12132',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0010,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR1,                                               +        
               LTH=4                                                            
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR2,                                               +        
               LTH=4                                                            
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR3,                                               +        
               LTH=4                                                            
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR4,                                               +        
               LTH=4                                                            
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR5,                                               +        
               LTH=4                                                            
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR6,                                               +        
               LTH=4                                                            
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR7,                                               +        
               LTH=4                                                            
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR8,                                               +        
               LTH=4                                                            
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDRADNR9,                                               +        
               LTH=4                                                            
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  (KDPRTVAL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1O213N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N213,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I213N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0010,                                               +        
               LTH=9                                                            
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  DGIA0009,                                               +        
               LTH=3                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  IDFKNGRP,                                               +        
               LTH=4                                                            
         MFLD  STRTYP,                                                 +        
               LTH=1                                                            
         MFLD  KDPSLLOC,                                               +        
               LTH=2                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR1,                                               +        
               LTH=4                                                            
         MFLD  UTRAD1,                                                 +        
               LTH=72                                                           
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR2,                                               +        
               LTH=4                                                            
         MFLD  UTRAD2,                                                 +        
               LTH=72                                                           
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR3,                                               +        
               LTH=4                                                            
         MFLD  UTRAD3,                                                 +        
               LTH=72                                                           
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR4,                                               +        
               LTH=4                                                            
         MFLD  UTRAD4,                                                 +        
               LTH=72                                                           
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR5,                                               +        
               LTH=4                                                            
         MFLD  UTRAD5,                                                 +        
               LTH=72                                                           
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR6,                                               +        
               LTH=4                                                            
         MFLD  UTRAD6,                                                 +        
               LTH=72                                                           
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR7,                                               +        
               LTH=4                                                            
         MFLD  UTRAD7,                                                 +        
               LTH=72                                                           
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR8,                                               +        
               LTH=4                                                            
         MFLD  UTRAD8,                                                 +        
               LTH=72                                                           
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRADNR9,                                               +        
               LTH=4                                                            
         MFLD  UTRAD9,                                                 +        
               LTH=72                                                           
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  UTRAD10,                                                +        
               LTH=72                                                           
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  UTRAD11,                                                +        
               LTH=72                                                           
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  UTRAD12,                                                +        
               LTH=72                                                           
         MFLD  KDPRTVAL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
