***********************************************************************         
* CREATED BY V028439   ON 05/04/05  AT 09:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CATALOGUE IDENTITY              '                               
W1N531   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T531U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T531 7',                                           +        
               8='W1T531 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T531U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T531  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T531U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE IDENTITY',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Catalogno',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDKATIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKATUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Catal.name ROW 1 .',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
BEKAT1   DFLD  POS=(5,21),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Catal.name ROW 2 .',                                   +        
               POS=(6,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
BEKAT2   DFLD  POS=(6,21),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Emblem . . . . . .',                                   +        
               POS=(7,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
BEEMBL   DFLD  POS=(7,21),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Catalogue Mastercat. Name',                            +        
               POS=(7,32),LTH=25,                                      +        
               ATTR=(PROT)                                                      
BEMAST   DFLD  POS=(7,59),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Belongs to . . . .',                                   +        
               POS=(8,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
KDFORD   DFLD  POS=(8,21),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Allowed to copy from . . .',                           +        
               POS=(8,32),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLKOPIE  DFLD  POS=(8,59),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'First Cat.make up',                                    +        
               POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
TIOMBETT DFLD  POS=(9,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Registration date  . . . .',                           +        
               POS=(9,32),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(9,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Illustration no. .',                                   +        
               POS=(10,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
IDILLU   DFLD  POS=(10,21),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Historic reg. date . . . .',                           +        
               POS=(10,32),LTH=26,                                     +        
               ATTR=(PROT)                                                      
TIHIST   DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Catalogue for VADIS  . . .',                           +        
               POS=(11,32),LTH=26,                                     +        
               ATTR=(PROT)                                                      
FLKATVAD DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks  . . . . .',                                   +        
               POS=(12,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TENOTE   DFLD  POS=(12,21),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Editions  0',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
UTG0     DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '5',                                                    +        
               POS=(14,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG5     DFLD  POS=(14,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '10',                                                   +        
               POS=(14,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG10    DFLD  POS=(14,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '15',                                                   +        
               POS=(14,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG15    DFLD  POS=(14,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '1',                                                    +        
               POS=(15,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG1     DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '6',                                                    +        
               POS=(15,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG6     DFLD  POS=(15,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '11',                                                   +        
               POS=(15,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG11    DFLD  POS=(15,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '16',                                                   +        
               POS=(15,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG16    DFLD  POS=(15,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '2',                                                    +        
               POS=(16,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG2     DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '7',                                                    +        
               POS=(16,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG7     DFLD  POS=(16,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '12',                                                   +        
               POS=(16,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG12    DFLD  POS=(16,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '3',                                                    +        
               POS=(17,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG3     DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '8',                                                    +        
               POS=(17,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG8     DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(17,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG13    DFLD  POS=(17,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Latest Cat.Make Up Values',                            +        
               POS=(17,46),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(18,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG4     DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '9',                                                    +        
               POS=(18,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG9     DFLD  POS=(18,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '14',                                                   +        
               POS=(18,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG14    DFLD  POS=(18,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Date',                                                 +        
               POS=(18,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
OMBRSEN  DFLD  POS=(18,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Publ.W',                                               +        
               POS=(18,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
OMBRPUBL DFLD  POS=(18,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Code',                                                 +        
               POS=(18,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCATPUB DFLD  POS=(18,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 CATALOGUE ID 14  GEN. CODES  15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T531  ',                                           +        
               8='W1T531  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T531U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T531  ',                                          +        
               14='W1T532  ',                                          +        
               15='W1T533  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T531  ',                                          +        
               20='W1T531  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T531  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE IDENTITY',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Catalogno',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDKATIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKATUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Catal.name ROW 1 .',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
BEKAT1   DFLD  POS=(5,22),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Catal.name ROW 2 .',                                   +        
               POS=(6,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
BEKAT2   DFLD  POS=(6,22),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Emblem  . . . . . .',                                  +        
               POS=(7,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
BEEMBL   DFLD  POS=(7,22),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Catalogue Mastercat. Name',                            +        
               POS=(7,34),LTH=25,                                      +        
               ATTR=(PROT)                                                      
BEMAST   DFLD  POS=(7,61),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Belongs to . . . .',                                   +        
               POS=(8,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
KDFORD   DFLD  POS=(8,22),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Allowed to copy from . . .',                           +        
               POS=(8,34),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLKOPIE  DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'First Cat.make up',                                    +        
               POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
TIOMBETT DFLD  POS=(9,22),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Registration date  . . . .',                           +        
               POS=(9,34),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Illustration no. .',                                   +        
               POS=(10,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
IDILLU   DFLD  POS=(10,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Historic reg. date . . . .',                           +        
               POS=(10,34),LTH=26,                                     +        
               ATTR=(PROT)                                                      
TIHIST   DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Catalogue for VADIS  . . .',                           +        
               POS=(11,34),LTH=26,                                     +        
               ATTR=(PROT)                                                      
FLKATVAD DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks  . . . . .',                                   +        
               POS=(12,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TENOTE   DFLD  POS=(12,22),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Editions  0',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
UTG0     DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '5',                                                    +        
               POS=(14,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG5     DFLD  POS=(14,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '10',                                                   +        
               POS=(14,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG10    DFLD  POS=(14,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '15',                                                   +        
               POS=(14,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG15    DFLD  POS=(14,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '1',                                                    +        
               POS=(15,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG1     DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '6',                                                    +        
               POS=(15,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG6     DFLD  POS=(15,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '11',                                                   +        
               POS=(15,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG11    DFLD  POS=(15,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '16',                                                   +        
               POS=(15,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG16    DFLD  POS=(15,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '2',                                                    +        
               POS=(16,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG2     DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '7',                                                    +        
               POS=(16,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG7     DFLD  POS=(16,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '12',                                                   +        
               POS=(16,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG12    DFLD  POS=(16,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '3',                                                    +        
               POS=(17,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG3     DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '8',                                                    +        
               POS=(17,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG8     DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(17,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG13    DFLD  POS=(17,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Latest Catalogue Make Up Values',                      +        
               POS=(17,46),LTH=31,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(18,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG4     DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '9',                                                    +        
               POS=(18,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
UTG9     DFLD  POS=(18,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '14',                                                   +        
               POS=(18,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
UTG14    DFLD  POS=(18,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Day',                                                  +        
               POS=(18,46),LTH=3,                                      +        
               ATTR=(PROT)                                                      
OMBRSEN  DFLD  POS=(18,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Publ.Week',                                            +        
               POS=(18,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
OMBRPUBL DFLD  POS=(18,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'P.Code',                                               +        
               POS=(18,76),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KDCATPUB DFLD  POS=(18,83),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 CATALOG ID   14 VADIS/CATALOG 15 GEN.TABLES 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O531N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N531,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I531N1,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDKATIN,                                                +        
               LTH=5                                                            
         MFLD  IDKATUT,                                                +        
               LTH=5                                                            
         MFLD  BEKAT1,                                                 +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEKAT2,                                                 +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEEMBL,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEMAST,                                                 +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFORD,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKOPIE,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIOMBETT,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMBRPUBL,                                               +        
               LTH=4                                                            
         MFLD  KDCATPUB,                                               +        
               LTH=3                                                            
         MFLD  FLKATVAD,                                               +        
               LTH=1                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  IDILLU,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIHIST,                                                 +        
               LTH=6                                                            
         MFLD  TENOTE,                                                 +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  UTG0,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG1,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG2,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG3,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG4,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG5,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG6,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG7,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG8,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG9,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG13,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG14,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG15,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTG16,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMBRSEN,                                                +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W1I531N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N531),                                           +        
               OPT=2,                                                  +        
               NXT=W1O531N1                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15312',                                                +        
               LTH=5                                                            
         MFLD  (IDKATIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKATUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (BEKAT1,                                                +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'FF'                                                       
         MFLD  (BEKAT2,                                                +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'FF'                                                       
         MFLD  (BEEMBL,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEMAST,                                                +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDFORD,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLKOPIE,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIOMBETT,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDILLU,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG0,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG1,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG2,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG3,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG4,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG5,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG6,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG7,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG8,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG9,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG10,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG11,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG12,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG13,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG14,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG15,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (UTG16,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TENOTE,                                                +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
