***********************************************************************         
* CREATED BY V028439   ON 00/02/16  AT 15:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PART INFORMATION IN CATALOGUE   '                               
W1N541   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T541 7',                                           +        
               8='W1T541 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T541  ',                                          +        
               14='W1T542  ',                                          +        
               15='W1T543  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,13))                                                  
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART INFORMATION, CATLOGUE',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
INIDART  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Catalog.no.(From)',                                    +        
               POS=(2,24),LTH=17,                                      +        
               ATTR=(PROT)                                                      
INIDKAT  DFLD  POS=(2,42),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
UTIDART  DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
UTIDKAT  DFLD  POS=(3,42),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KATGRPLO DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KATAVSLO DFLD  POS=(4,6),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KATRADLO DFLD  POS=(4,12),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATGRPHI DFLD  POS=(4,20),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATAVSHI DFLD  POS=(4,24),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATRADHI DFLD  POS=(4,30),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
NEXTKAT  DFLD  POS=(4,39),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
SIDRAEK  DFLD  POS=(4,47),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIDSP    DFLD  POS=(4,50),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIDN     DFLD  POS=(4,55),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Descr.',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,10),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cat/master',                                           +        
               POS=(5,37),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDKATNR  DFLD  POS=(5,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '/',                                                    +        
               POS=(5,54),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
BEMASTER DFLD  POS=(5,56),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr.Bl.  Line Pub. Fig.Qty Gr.Bl.  Line Pub. Fig.Qty Gr.+        
               Bl.  Line Pub. Fig.Qty',                                +        
               POS=(6,2),LTH=77,                                       +        
               ATTR=(PROT)                                                      
UTRAD1   DFLD  POS=(7,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD2   DFLD  POS=(7,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD3   DFLD  POS=(7,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD4   DFLD  POS=(8,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD5   DFLD  POS=(8,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD6   DFLD  POS=(8,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD7   DFLD  POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD8   DFLD  POS=(9,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD9   DFLD  POS=(9,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD10  DFLD  POS=(10,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD11  DFLD  POS=(10,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD12  DFLD  POS=(10,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD13  DFLD  POS=(11,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD14  DFLD  POS=(11,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD15  DFLD  POS=(11,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD16  DFLD  POS=(12,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD17  DFLD  POS=(12,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD18  DFLD  POS=(12,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD19  DFLD  POS=(13,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD20  DFLD  POS=(13,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD21  DFLD  POS=(13,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD22  DFLD  POS=(14,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD23  DFLD  POS=(14,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD24  DFLD  POS=(14,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD25  DFLD  POS=(15,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD26  DFLD  POS=(15,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD27  DFLD  POS=(15,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD28  DFLD  POS=(16,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD29  DFLD  POS=(16,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD30  DFLD  POS=(16,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD31  DFLD  POS=(17,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD32  DFLD  POS=(17,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD33  DFLD  POS=(17,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD34  DFLD  POS=(18,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD35  DFLD  POS=(18,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD36  DFLD  POS=(18,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD37  DFLD  POS=(19,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD38  DFLD  POS=(19,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD39  DFLD  POS=(19,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 PART INF.CAT 14 PART INF.MAST. 15 MODEL INFO  16',  +        
               POS=(21,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SYSDATE  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SYSTIME  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T541 7',                                           +        
               8='W1T541 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T541  ',                                          +        
               14='W1T542  ',                                          +        
               15='W1T543  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART INFORMATION, CATALOGUE',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
INIDART  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Catalog.no.(From)',                                    +        
               POS=(2,23),LTH=17,                                      +        
               ATTR=(PROT)                                                      
INIDKAT  DFLD  POS=(2,41),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
UTIDART  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
UTIDKAT  DFLD  POS=(3,41),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KATGRPLO DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KATAVSLO DFLD  POS=(4,6),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KATRADLO DFLD  POS=(4,12),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATGRPHI DFLD  POS=(4,23),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATAVSHI DFLD  POS=(4,27),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KATRADHI DFLD  POS=(4,33),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
NEXTKAT  DFLD  POS=(4,43),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
SIDRAEK  DFLD  POS=(4,52),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIDSP    DFLD  POS=(4,55),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIDN     DFLD  POS=(4,61),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cat/Master',                                           +        
               POS=(5,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDKATNR  DFLD  POS=(5,59),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '/',                                                    +        
               POS=(5,65),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
BEMASTER DFLD  POS=(5,67),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr.Bl.  Line Pub. Fig.Qty Gr.Bl.  Line Pub. Fig.Qty Gr.+        
               Bl.  Line Pub. Fig.Qty',                                +        
               POS=(6,2),LTH=77,                                       +        
               ATTR=(PROT)                                                      
UTRAD1   DFLD  POS=(7,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD2   DFLD  POS=(7,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD3   DFLD  POS=(7,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD4   DFLD  POS=(8,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD5   DFLD  POS=(8,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD6   DFLD  POS=(8,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD7   DFLD  POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
UTRAD8   DFLD  POS=(9,28),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD9   DFLD  POS=(9,54),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
UTRAD10  DFLD  POS=(10,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD11  DFLD  POS=(10,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD12  DFLD  POS=(10,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD13  DFLD  POS=(11,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD14  DFLD  POS=(11,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD15  DFLD  POS=(11,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD16  DFLD  POS=(12,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD17  DFLD  POS=(12,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD18  DFLD  POS=(12,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD19  DFLD  POS=(13,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD20  DFLD  POS=(13,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD21  DFLD  POS=(13,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD22  DFLD  POS=(14,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD23  DFLD  POS=(14,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD24  DFLD  POS=(14,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD25  DFLD  POS=(15,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD26  DFLD  POS=(15,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD27  DFLD  POS=(15,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD28  DFLD  POS=(16,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD29  DFLD  POS=(16,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD30  DFLD  POS=(16,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD31  DFLD  POS=(17,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD32  DFLD  POS=(17,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD33  DFLD  POS=(17,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD34  DFLD  POS=(18,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD35  DFLD  POS=(18,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD36  DFLD  POS=(18,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD37  DFLD  POS=(19,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
UTRAD38  DFLD  POS=(19,28),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
UTRAD39  DFLD  POS=(19,54),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 PART INF.CATALOG  14 PART INF.MASTER   15 MODEL INFO+        
               ',                                                      +        
               POS=(24,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(24,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(24,93),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(25,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(25,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(25,44),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(25,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(25,93),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(26,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(26,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SYSDATE  DFLD  POS=(26,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SYSTIME  DFLD  POS=(26,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(27,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O541N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N541,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I541N1,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INIDART,                                                +        
               LTH=9                                                            
         MFLD  UTIDART,                                                +        
               LTH=9                                                            
         MFLD  INIDKAT,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTIDKAT,                                                +        
               LTH=5                                                            
         MFLD  KATGRPLO,                                               +        
               LTH=2                                                            
         MFLD  KATAVSLO,                                               +        
               LTH=4                                                            
         MFLD  KATRADLO,                                               +        
               LTH=4                                                            
         MFLD  KATGRPHI,                                               +        
               LTH=2                                                            
         MFLD  KATAVSHI,                                               +        
               LTH=4                                                            
         MFLD  KATRADHI,                                               +        
               LTH=4                                                            
         MFLD  NEXTKAT,                                                +        
               LTH=5                                                            
         MFLD  SIDRAEK,                                                +        
               LTH=1                                                            
         MFLD  TIDSP,                                                  +        
               LTH=3                                                            
         MFLD  TIDN,                                                   +        
               LTH=3                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  IDKATNR,                                                +        
               LTH=5                                                            
         MFLD  BEMASTER,                                               +        
               LTH=12                                                           
         MFLD  UTRAD1,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD2,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD3,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD4,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD5,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD6,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD7,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD8,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD9,                                                 +        
               LTH=25                                                           
         MFLD  UTRAD10,                                                +        
               LTH=25                                                           
         MFLD  UTRAD11,                                                +        
               LTH=25                                                           
         MFLD  UTRAD12,                                                +        
               LTH=25                                                           
         MFLD  UTRAD13,                                                +        
               LTH=25                                                           
         MFLD  UTRAD14,                                                +        
               LTH=25                                                           
         MFLD  UTRAD15,                                                +        
               LTH=25                                                           
         MFLD  UTRAD16,                                                +        
               LTH=25                                                           
         MFLD  UTRAD17,                                                +        
               LTH=25                                                           
         MFLD  UTRAD18,                                                +        
               LTH=25                                                           
         MFLD  UTRAD19,                                                +        
               LTH=25                                                           
         MFLD  UTRAD20,                                                +        
               LTH=25                                                           
         MFLD  UTRAD21,                                                +        
               LTH=25                                                           
         MFLD  UTRAD22,                                                +        
               LTH=25                                                           
         MFLD  UTRAD23,                                                +        
               LTH=25                                                           
         MFLD  UTRAD24,                                                +        
               LTH=25                                                           
         MFLD  UTRAD25,                                                +        
               LTH=25                                                           
         MFLD  UTRAD26,                                                +        
               LTH=25                                                           
         MFLD  UTRAD27,                                                +        
               LTH=25                                                           
         MFLD  UTRAD28,                                                +        
               LTH=25                                                           
         MFLD  UTRAD29,                                                +        
               LTH=25                                                           
         MFLD  UTRAD30,                                                +        
               LTH=25                                                           
         MFLD  UTRAD31,                                                +        
               LTH=25                                                           
         MFLD  UTRAD32,                                                +        
               LTH=25                                                           
         MFLD  UTRAD33,                                                +        
               LTH=25                                                           
         MFLD  UTRAD34,                                                +        
               LTH=25                                                           
         MFLD  UTRAD35,                                                +        
               LTH=25                                                           
         MFLD  UTRAD36,                                                +        
               LTH=25                                                           
         MFLD  UTRAD37,                                                +        
               LTH=25                                                           
         MFLD  UTRAD38,                                                +        
               LTH=25                                                           
         MFLD  UTRAD39,                                                +        
               LTH=25                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (SYSDATE,                                               +        
               DATE4)                                                           
         MFLD  (SYSTIME,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W1I541N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N541),                                           +        
               OPT=2,                                                  +        
               NXT=W1O541N1                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15412',                                                +        
               LTH=5                                                            
         MFLD  (INIDART,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTIDART,                                                +        
               LTH=9                                                            
         MFLD  (INIDKAT,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTIDKAT,                                                +        
               LTH=5                                                            
         MFLD  KATGRPLO,                                               +        
               LTH=2                                                            
         MFLD  KATAVSLO,                                               +        
               LTH=4                                                            
         MFLD  KATRADLO,                                               +        
               LTH=4                                                            
         MFLD  KATGRPHI,                                               +        
               LTH=2                                                            
         MFLD  KATAVSHI,                                               +        
               LTH=4                                                            
         MFLD  KATRADHI,                                               +        
               LTH=4                                                            
         MFLD  (NEXTKAT,                                               +        
               '00000'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  SIDRAEK,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  TIDSP,                                                  +        
               LTH=3                                                            
         MFLD  TIDN,                                                   +        
               LTH=3                                                            
         MFLD  (IDKATNR,                                               +        
               '00000'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
