***********************************************************************         
* CREATED BY V028439   ON 01/10/04  AT 13:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1N551   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T105  ',                                           +        
               2='W0T105  ',                                           +        
               3='W1T551U ',                                           +        
               4='W0T105  ',                                           +        
               5='W0T105  ',                                           +        
               6='W0T105  ',                                           +        
               7='W0T105  ',                                           +        
               8='W0T105  ',                                           +        
               9='W0T105  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T551U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T105  ',                                          +        
               16='W0T105  ',                                          +        
               17='W0T105  ',                                          +        
               18='W0T105  ',                                          +        
               19='W0T105  ',                                          +        
               20='W0T105  ',                                          +        
               21='W0T105  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T551U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE TEXT-BLOCK RENUM.',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CATALOGUE NO',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0215  DFLD  POS=(2,15),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(2,22),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0228  DFLD  POS=(2,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T-BLOCK',                                              +        
               POS=(2,32),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0240  DFLD  POS=(2,40),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0315  DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(3,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0340  DFLD  POS=(3,40),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0411  DFLD  POS=(4,11),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0414  DFLD  POS=(4,14),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Renumbers a textblock in line increments of +10',      +        
               POS=(8,2),LTH=47,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'First line is always 0020',                            +        
               POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '13 T-BLOCK RENUM 14 LOAN COL/LINE 15',                 +        
               POS=(21,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T105  ',                                           +        
               2='W0T105  ',                                           +        
               3='W1T551U ',                                           +        
               4='W0T105  ',                                           +        
               5='W0T105  ',                                           +        
               6='W0T105  ',                                           +        
               7='W0T105  ',                                           +        
               8='W0T105  ',                                           +        
               9='W0T105  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T551U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T105  ',                                          +        
               16='W0T105  ',                                          +        
               17='W0T105  ',                                          +        
               18='W0T105  ',                                          +        
               19='W0T105  ',                                          +        
               20='W0T105  ',                                          +        
               21='W0T105  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T551U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE TEXT-BLOCK RENUM.',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CATALOGUE NO',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0215  DFLD  POS=(2,15),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(2,22),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0228  DFLD  POS=(2,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T-BLOCK',                                              +        
               POS=(2,32),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0240  DFLD  POS=(2,40),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0315  DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(3,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0340  DFLD  POS=(3,40),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0411  DFLD  POS=(4,11),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0414  DFLD  POS=(4,14),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Renumbers a textblock in line increments of +10',      +        
               POS=(8,2),LTH=47,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'First line is always 0020',                            +        
               POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '13 T-BLOCK RENUM 14 LOAN COL/LINE 15',                 +        
               POS=(21,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O551N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N551,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I551N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0215,                                                +        
               LTH=5                                                            
         MFLD  FLD0315,                                                +        
               LTH=5                                                            
         MFLD  FLD0228,                                                +        
               LTH=3                                                            
         MFLD  FLD0328,                                                +        
               LTH=3                                                            
         MFLD  FLD0240,                                                +        
               LTH=5                                                            
         MFLD  FLD0340,                                                +        
               LTH=5                                                            
         MFLD  FLD0402,                                                +        
               LTH=6                                                            
         MFLD  FLD0411,                                                +        
               LTH=1                                                            
         MFLD  FLD0414,                                                +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I551N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N551),                                           +        
               OPT=2,                                                  +        
               NXT=W1O551N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15512',                                                +        
               LTH=5                                                            
         MFLD  (FLD0215,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0315,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0228,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0328,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0240,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0340,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0402,                                               +        
               '      '),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0411,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD0414,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
