***********************************************************************         
* CREATED BY PC59625   ON 96/08/23  AT 12:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W1N552   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T552U ',                                           +        
               4='W1T552 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T552 7',                                           +        
               8='W1T552 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T552U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T552U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((6,23)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'COPY, TEXT-BLOCK (LOAN)',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
PUBSPAR  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FROM',                                                 +        
               POS=(5,23),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TO',                                                   +        
               POS=(5,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CATALOGUE',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0623  DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE',                                            +        
               POS=(6,35),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0725  DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(7,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0749  DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,24),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK',                                           +        
               POS=(8,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'COLUMN (A-E)',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0927  DFLD  POS=(9,27),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'COLUMN (A-E)',                                         +        
               POS=(9,35),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0951  DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FROM THIS LINE',                                       +        
               POS=(10,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1023  DFLD  POS=(10,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'START LINE',                                           +        
               POS=(10,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TO THIS LINE (INCL)',                                  +        
               POS=(11,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1123  DFLD  POS=(11,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1147  DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FROM THIS FIG.',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1225  DFLD  POS=(12,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'TO THIS FIG. (INCL)',                                  +        
               POS=(13,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1325  DFLD  POS=(13,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FROM',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PUBFF    DFLD  POS=(14,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FROM',                                             +        
               POS=(14,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTF    DFLD  POS=(14,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB TO',                                               +        
               POS=(15,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PUBTT    DFLD  POS=(15,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 COPY, COL/LINE 15',                                 +        
               POS=(21,18),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T552U ',                                           +        
               4='W1T552 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T552 7',                                           +        
               8='W1T552 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T552U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T551  ',                                          +        
               14='W1T552  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T552U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((6,23)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'COPY, TEXT-BLOCK (LOAN)',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
PUBSPAR  DFLD  POS=(3,8),LTH=6,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FROM',                                                 +        
               POS=(5,23),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TO',                                                   +        
               POS=(5,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CATALOGUE',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0623  DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE',                                            +        
               POS=(6,35),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0725  DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GROUP',                                                +        
               POS=(7,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0749  DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,24),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK',                                           +        
               POS=(8,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0847  DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'COLUMN (A-E)',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0927  DFLD  POS=(9,27),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'COLUMN (A-E)',                                         +        
               POS=(9,35),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0951  DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FROM THIS LINE',                                       +        
               POS=(10,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1023  DFLD  POS=(10,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'START LINE',                                           +        
               POS=(10,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1047  DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TO THIS LINE (INCL)',                                  +        
               POS=(11,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1123  DFLD  POS=(11,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1147  DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'FROM THIS FIG.',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1225  DFLD  POS=(12,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'TO THIS FIG. (INCL)',                                  +        
               POS=(13,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1325  DFLD  POS=(13,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FROM',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PUBFF    DFLD  POS=(14,25),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB FROM',                                             +        
               POS=(14,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PUBTF    DFLD  POS=(14,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB TO',                                               +        
               POS=(15,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PUBTT    DFLD  POS=(15,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 COPY, COL/LINE 15',                                 +        
               POS=(21,18),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O552N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N552,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I552N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0623,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0647,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0725,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0749,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0823,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0847,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0927,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0951,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1023,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1047,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1123,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1225,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1325,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBFF,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBTF,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBTT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1147,                                                +        
               LTH=4                                                            
         MFLD  PUBSPAR,                                                +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I552N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N552),                                           +        
               OPT=2,                                                  +        
               NXT=W1O552N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15522',                                                +        
               LTH=5                                                            
         MFLD  (FLD0623,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0647,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0725,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0749,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0823,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0847,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0927,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0951,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1023,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1047,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1123,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1225,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1325,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBFF,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBTF,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUBTT,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1147,                                                +        
               LTH=4                                                            
         MFLD  PUBSPAR,                                                +        
               LTH=6                                                            
         MSGEND                                                                 
         END                                                                    
