***********************************************************************         
* CREATED BY V028439   ON 03/09/04  AT 12:38                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TEXT-BLOCK HEADING AREA         '                               
W1N514   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T514U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T514 7',                                           +        
               8='W1T514 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T514U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T514U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK HEADING-AREA',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CatalogNo',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
KATNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Group',                                                +        
               POS=(2,18),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CATGRPI  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T-block',                                              +        
               POS=(2,27),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CATAVSI  DFLD  POS=(2,35),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang',                                                 +        
               POS=(2,40),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SKYLTI   DFLD  POS=(2,45),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CATRI    DFLD  POS=(2,55),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,60),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KATTI    DFLD  POS=(2,64),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB-to',                                               +        
               POS=(2,69),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KATNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
CATGRPU  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSU  DFLD  POS=(3,35),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SKYLTU   DFLD  POS=(3,45),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
CATRU    DFLD  POS=(3,55),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KATTU    DFLD  POS=(3,64),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TOM      DFLD  POS=(3,76),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Copy to new PUB',                                      +        
               POS=(5,6),LTH=15,                                       +        
               ATTR=(PROT)                                                      
PUBKOPY  DFLD  POS=(5,22),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Delete',                                               +        
               POS=(5,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BORT     DFLD  POS=(5,40),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'New PUB',                                              +        
               POS=(5,52),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FOM      DFLD  POS=(5,60),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'New PUB-to',                                           +        
               POS=(5,65),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TOMI     DFLD  POS=(5,76),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 1 headings',                                      +        
               POS=(7,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
RUBNR1   DFLD  POS=(7,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
RUBNR2   DFLD  POS=(7,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
RUBNR3   DFLD  POS=(7,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Text Col A',                                           +        
               POS=(7,44),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KOLA     DFLD  POS=(7,55),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 2 heading',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
RUBNR4   DFLD  POS=(8,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col B',                                                +        
               POS=(8,49),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLB     DFLD  POS=(8,55),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 3 heading',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
RUBNR5   DFLD  POS=(9,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col C',                                                +        
               POS=(9,49),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLC     DFLD  POS=(9,55),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col D',                                                +        
               POS=(10,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLD     DFLD  POS=(10,55),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 4 Text',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RUB1     DFLD  POS=(11,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col E',                                                +        
               POS=(11,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLE     DFLD  POS=(11,55),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
RUB2     DFLD  POS=(12,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 4 footnote',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FOTRAD41 DFLD  POS=(13,18),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTRAD42 DFLD  POS=(13,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTRAD43 DFLD  POS=(13,32),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Footnote in column',                                   +        
               POS=(13,55),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'N.B. Col + Line4 + Footnotes = MAX 180 char.  Col A',  +        
               POS=(14,3),LTH=51,                                      +        
               ATTR=(PROT)                                                      
FOTCOA1  DFLD  POS=(14,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOA2  DFLD  POS=(14,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOA3  DFLD  POS=(14,69),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line 4 (VADIS)',                                       +        
               POS=(15,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
RUBTEXT3 DFLD  POS=(15,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col B',                                                +        
               POS=(15,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOB1  DFLD  POS=(15,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOB2  DFLD  POS=(15,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOB3  DFLD  POS=(15,69),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RUBTEXT4 DFLD  POS=(16,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col C',                                                +        
               POS=(16,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOC1  DFLD  POS=(16,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOC2  DFLD  POS=(16,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOC3  DFLD  POS=(16,69),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col D',                                                +        
               POS=(17,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOD1  DFLD  POS=(17,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOD2  DFLD  POS=(17,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOD3  DFLD  POS=(17,69),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Illustration',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
ILLU     DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col E',                                                +        
               POS=(18,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOE1  DFLD  POS=(18,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOE2  DFLD  POS=(18,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOE3  DFLD  POS=(18,69),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 T-block head 17 T-BL VADIS',                        +        
               POS=(21,50),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 T-block orig 20 Headers pr.  21 T-block pr.  10 WHEL+        
               P',                                                     +        
               POS=(22,18),LTH=56,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T514U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T514 7',                                           +        
               8='W1T514 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T514U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W1T517  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T514U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-BLOCK HEADING-AREA',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CatalogNo',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KATNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Group',                                                +        
               POS=(2,18),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CATGRPI  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Block',                                                +        
               POS=(2,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CATAVSI  DFLD  POS=(2,34),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang.',                                                +        
               POS=(2,40),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SKYLTI   DFLD  POS=(2,46),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,51),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CATRI    DFLD  POS=(2,56),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB',                                                  +        
               POS=(2,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KATTI    DFLD  POS=(2,66),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB-to',                                               +        
               POS=(2,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KATNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
CATGRPU  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CATAVSU  DFLD  POS=(3,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SKYLTU   DFLD  POS=(3,46),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
CATRU    DFLD  POS=(3,56),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KATTU    DFLD  POS=(3,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TOM      DFLD  POS=(3,78),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Copy to new PUB',                                      +        
               POS=(5,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
PUBKOPY  DFLD  POS=(5,18),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Delete',                                               +        
               POS=(5,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BORT     DFLD  POS=(5,33),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'New PUB',                                              +        
               POS=(5,55),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FOM      DFLD  POS=(5,63),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'New PUB-to',                                           +        
               POS=(5,67),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
TOMI     DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 1 headings',                                      +        
               POS=(7,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
RUBNR1   DFLD  POS=(7,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(7,24),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
RUBNR2   DFLD  POS=(7,26),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(7,32),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
RUBNR3   DFLD  POS=(7,34),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Text Col A',                                           +        
               POS=(7,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KOLA     DFLD  POS=(7,56),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 2 heading',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
RUBNR4   DFLD  POS=(8,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col B',                                                +        
               POS=(8,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLB     DFLD  POS=(8,56),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line 3 heading',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
RUBNR5   DFLD  POS=(9,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col C',                                                +        
               POS=(9,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLC     DFLD  POS=(9,56),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'SUBTITLE-problems in VADIS',                           +        
               POS=(9,84),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Col D',                                                +        
               POS=(10,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLD     DFLD  POS=(10,56),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'OBSERVE that the concatenated text of',                +        
               POS=(10,84),LTH=37,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Line 4 Text.',                                         +        
               POS=(11,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
RUB1     DFLD  POS=(11,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col E',                                                +        
               POS=(11,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLE     DFLD  POS=(11,56),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Col.txt) + (Line-4-txt) + (All 3 footnotes)',         +        
               POS=(11,84),LTH=44,                                     +        
               ATTR=(PROT)                                                      
RUB2     DFLD  POS=(12,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'are not allowed to exeed 180 char in SWEDISH.',        +        
               POS=(12,84),LTH=45,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Line 4 footnotes',                                     +        
               POS=(13,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FOTRAD41 DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,25),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
FOTRAD42 DFLD  POS=(13,27),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,33),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
FOTRAD43 DFLD  POS=(13,35),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Footnote NO',                                          +        
               POS=(13,55),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'N.B. Col + Line4 + Footnotes = MAX 180 char.   Col A', +        
               POS=(14,3),LTH=52,                                      +        
               ATTR=(PROT)                                                      
FOTCOA1  DFLD  POS=(14,56),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOA2  DFLD  POS=(14,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOA3  DFLD  POS=(14,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'IE''s will be created as DRAFT if any lang. has',      +        
               POS=(14,84),LTH=46,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Line 4 VADIS',                                         +        
               POS=(15,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
RUBTEXT3 DFLD  POS=(15,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col B',                                                +        
               POS=(15,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOB1  DFLD  POS=(15,56),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOB2  DFLD  POS=(15,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOB3  DFLD  POS=(15,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'longer SUBTITLES than 255 characters.',                +        
               POS=(15,84),LTH=37,                                     +        
               ATTR=(PROT)                                                      
RUBTEXT4 DFLD  POS=(16,17),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Col C',                                                +        
               POS=(16,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOC1  DFLD  POS=(16,56),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOC2  DFLD  POS=(16,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOC3  DFLD  POS=(16,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col D',                                                +        
               POS=(17,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOD1  DFLD  POS=(17,56),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOD2  DFLD  POS=(17,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOD3  DFLD  POS=(17,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Illustration',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
ILLU     DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Col E',                                                +        
               POS=(18,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FOTCOE1  DFLD  POS=(18,56),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOE2  DFLD  POS=(18,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTCOE3  DFLD  POS=(18,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Catalog Txt-block 14 Catalog Line Upd.  15 Line Note+        
               s, Ref. 16 T-block Header   17 T-block VADIS',          +        
               POS=(21,2),LTH=99,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 T-block Orig. Pr.  20 Headers Print    21 T-block Pr+        
               int    10 WHELP',                                       +        
               POS=(22,23),LTH=70,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O514N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N514,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I514N1,                                           +        
               FILL=PT                                                          
DGI1MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KATNRIN,                                                +        
               LTH=5                                                            
         MFLD  KATNRUT,                                                +        
               LTH=5                                                            
         MFLD  CATGRPI,                                                +        
               LTH=2                                                            
         MFLD  CATGRPU,                                                +        
               LTH=2                                                            
         MFLD  CATAVSI,                                                +        
               LTH=4                                                            
         MFLD  CATAVSU,                                                +        
               LTH=4                                                            
         MFLD  SKYLTI,                                                 +        
               LTH=3                                                            
         MFLD  SKYLTU,                                                 +        
               LTH=3                                                            
         MFLD  CATRI,                                                  +        
               LTH=4                                                            
         MFLD  CATRU,                                                  +        
               LTH=4                                                            
         MFLD  KATTI,                                                  +        
               LTH=3                                                            
         MFLD  KATTU,                                                  +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3                                                            
         MFLD  PUBKOPY,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOM,                                                    +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOM,                                                    +        
               LTH=3                                                            
         MFLD  TOMI,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR4,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR5,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUB1,                                                   +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RUB2,                                                   +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RUBTEXT3,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RUBTEXT4,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLA,                                                   +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLB,                                                   +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLC,                                                   +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLD,                                                   +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLE,                                                   +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FOTRAD41,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTRAD42,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTRAD43,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOA1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOA2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOA3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOB1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOB2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOB3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOC1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOC2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOC3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOD1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOD2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOD3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOE1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOE2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTCOE3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ILLU,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I514N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N514),                                           +        
               OPT=2,                                                  +        
               NXT=W1O514N1                                                     
DGI2MID  LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15142',                                                +        
               LTH=5                                                            
         MFLD  (KATNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KATNRUT,                                               +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (CATGRPI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CATGRPU,                                               +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (CATAVSI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CATAVSU,                                               +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (SKYLTI,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKYLTU,                                                +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (CATRI,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CATRU,                                                 +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (KATTI,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KATTU,                                                 +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0000,                                              +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (PUBKOPY,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BORT,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FOM,                                                   +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TOMI,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RUBNR1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR4,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR5,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUB1,                                                  +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RUB2,                                                  +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RUBTEXT3,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RUBTEXT4,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLA,                                                  +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLB,                                                  +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLC,                                                  +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLD,                                                  +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLE,                                                  +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FOTRAD41,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTRAD42,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTRAD43,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOA1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOA2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOA3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOB1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOB2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOB3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOC1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOC2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOC3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOD1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOD2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOD3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOE1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOE2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTCOE3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ILLU,                                                  +        
               '+++++'),                                               +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
