***********************************************************************         
* CREATED BY PC28439   ON 96/09/26  AT 10:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CATALOGUE LINES UPDATE NEW VER. '                               
W1N512   FMT                                                                    
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T512U ',                                           +        
               4='W1T519 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W1T512 7',                                           +        
               8='W1T512 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T512U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W1T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T512U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W1N512   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CATALOGUE LINES UPDATE',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Catalogno',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
INCATNR  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Group',                                                +        
               POS=(2,20),LTH=5,                                       +        
               ATTR=(PROT)                                                      
INCATGRP DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T-block',                                              +        
               POS=(2,31),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INCATAVS DFLD  POS=(2,39),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang',                                                 +        
               POS=(2,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
INSKYLT  DFLD  POS=(2,52),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line no.',                                             +        
               POS=(2,57),LTH=8,                                       +        
               ATTR=(PROT)                                                      
INCATRAD DFLD  POS=(2,66),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line PUB R/N',                                         +        
               POS=(2,72),LTH=12,                                      +        
               ATTR=(PROT)                                                      
INCATPUB DFLD  POS=(2,85),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PUB min.valid',                                        +        
               POS=(2,91),LTH=13,                                      +        
               ATTR=(PROT)                                                      
INTIDFRA DFLD  POS=(2,105),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PUB max.valid',                                        +        
               POS=(2,110),LTH=13,                                     +        
               ATTR=(PROT)                                                      
INTIDTIL DFLD  POS=(2,124),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
UTCATNR  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
UTCATGRP DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTCATAVS DFLD  POS=(3,39),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTSKYLT  DFLD  POS=(3,52),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTCATRAD DFLD  POS=(3,66),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
UTCATPUB DFLD  POS=(3,85),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTTIDFRA DFLD  POS=(3,105),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
UTTIDTIL DFLD  POS=(3,124),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
RADPREV  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
RADFROM  DFLD  POS=(4,9),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
RADMITT  DFLD  POS=(4,16),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
RADTILL  DFLD  POS=(4,23),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
RADFIRST DFLD  POS=(4,30),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
RADSISTA DFLD  POS=(4,37),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Line Pfr Ptom F Fig Partno.    A   B   C   D   E  PS . +        
               Description',                                           +        
               POS=(5,2),LTH=66,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Note',                                                 +        
               POS=(5,85),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'A Not Sup  R  H',                                      +        
               POS=(5,111),LTH=15,                                     +        
               ATTR=(PROT)                                                      
RAD06    DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
PU06F    DFLD  POS=(6,7),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
PU06T    DFLD  POS=(6,11),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FBX06    DFLD  POS=(6,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
POS06    DFLD  POS=(6,18),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ART06    DFLD  POS=(6,22),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
A06      DFLD  POS=(6,32),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
B06      DFLD  POS=(6,36),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
C06      DFLD  POS=(6,40),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
D06      DFLD  POS=(6,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
E06      DFLD  POS=(6,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PS06     DFLD  POS=(6,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKT06    DFLD  POS=(6,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART06  DFLD  POS=(6,57),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
ANM06    DFLD  POS=(6,85),LTH=23,                                      +        
               ATTR=(PROT)                                                      
AENDR06  DFLD  POS=(6,111),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NOT06    DFLD  POS=(6,114),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ERS06    DFLD  POS=(6,117),LTH=2,                                      +        
               ATTR=(PROT)                                                      
HREF06   DFLD  POS=(6,122),LTH=1,                                      +        
               ATTR=(PROT)                                                      
HAEN06   DFLD  POS=(6,125),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RAD07    DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
PU07F    DFLD  POS=(7,7),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
PU07T    DFLD  POS=(7,11),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FBX07    DFLD  POS=(7,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
POS07    DFLD  POS=(7,18),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ART07    DFLD  POS=(7,22),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
A07      DFLD  POS=(7,32),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
B07      DFLD  POS=(7,36),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
C07      DFLD  POS=(7,40),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
D07      DFLD  POS=(7,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
E07      DFLD  POS=(7,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PS07     DFLD  POS=(7,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKT07    DFLD  POS=(7,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART07  DFLD  POS=(7,57),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
ANM07    DFLD  POS=(7,85),LTH=23,                                      +        
               ATTR=(PROT)                                                      
AENDR07  DFLD  POS=(7,111),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NOT07    DFLD  POS=(7,114),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ERS07    DFLD  POS=(7,117),LTH=2,                                      +        
               ATTR=(PROT)                                                      
HREF07   DFLD  POS=(7,122),LTH=1,                                      +        
               ATTR=(PROT)                                                      
HAEN07   DFLD  POS=(7,125),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RAD08    DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
PU08F    DFLD  POS=(8,7),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
PU08T    DFLD  POS=(8,11),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FBX08    DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
POS08    DFLD  POS=(8,18),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ART08    DFLD  POS=(8,22),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
A08      DFLD  POS=(8,32),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
B08      DFLD  POS=(8,36),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
C08      DFLD  POS=(8,40),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
D08      DFLD  POS=(8,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
E08      DFLD  POS=(8,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PS08     DFLD  POS=(8,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKT08    DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART08  DFLD  POS=(8,57),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
ANM08    DFLD  POS=(8,85),LTH=23,                                      +        
               ATTR=(PROT)                                                      
AENDR08  DFLD  POS=(8,111),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NOT08    DFLD  POS=(8,114),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ERS08    DFLD  POS=(8,117),LTH=2,                                      +        
               ATTR=(PROT)                                                      
HREF3    DFLD  POS=(8,122),LTH=1,                                      +        
               ATTR=(PROT)                                                      
HAEN08   DFLD  POS=(8,125),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RAD09    DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
PU09F    DFLD  POS=(9,7),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
PU09T    DFLD  POS=(9,11),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FBX09    DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
POS09    DFLD  POS=(9,18),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ART09    DFLD  POS=(9,22),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
A09      DFLD  POS=(9,32),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
B09      DFLD  POS=(9,36),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
C09      DFLD  POS=(9,40),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
D09      DFLD  POS=(9,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
E09      DFLD  POS=(9,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PS09     DFLD  POS=(9,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKT09    DFLD  POS=(9,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART09  DFLD  POS=(9,57),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
ANM09    DFLD  POS=(9,85),LTH=23,                                      +        
               ATTR=(PROT)                                                      
AENDR09  DFLD  POS=(9,111),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NOT09    DFLD  POS=(9,114),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ERS09    DFLD  POS=(9,117),LTH=2,                                      +        
               ATTR=(PROT)                                                      
HREF09   DFLD  POS=(9,122),LTH=1,                                      +        
               ATTR=(PROT)                                                      
HAEN09   DFLD  POS=(9,125),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RAD10    DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU10F    DFLD  POS=(10,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU10T    DFLD  POS=(10,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX10    DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS10    DFLD  POS=(10,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART10    DFLD  POS=(10,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A10      DFLD  POS=(10,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B10      DFLD  POS=(10,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C10      DFLD  POS=(10,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D10      DFLD  POS=(10,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E10      DFLD  POS=(10,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS10     DFLD  POS=(10,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT10    DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART10  DFLD  POS=(10,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM10    DFLD  POS=(10,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR10  DFLD  POS=(10,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT10    DFLD  POS=(10,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS10    DFLD  POS=(10,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF10   DFLD  POS=(10,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN10   DFLD  POS=(10,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD11    DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU11F    DFLD  POS=(11,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU11T    DFLD  POS=(11,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX11    DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS11    DFLD  POS=(11,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART11    DFLD  POS=(11,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A11      DFLD  POS=(11,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B11      DFLD  POS=(11,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C11      DFLD  POS=(11,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D11      DFLD  POS=(11,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E11      DFLD  POS=(11,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS11     DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT11    DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART11  DFLD  POS=(11,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM11    DFLD  POS=(11,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR11  DFLD  POS=(11,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT11    DFLD  POS=(11,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS11    DFLD  POS=(11,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF11   DFLD  POS=(11,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN11   DFLD  POS=(11,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD12    DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU12F    DFLD  POS=(12,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU12T    DFLD  POS=(12,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX12    DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS12    DFLD  POS=(12,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART12    DFLD  POS=(12,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A12      DFLD  POS=(12,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B12      DFLD  POS=(12,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C12      DFLD  POS=(12,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D12      DFLD  POS=(12,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E12      DFLD  POS=(12,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS12     DFLD  POS=(12,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT12    DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART12  DFLD  POS=(12,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM12    DFLD  POS=(12,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR12  DFLD  POS=(12,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT12    DFLD  POS=(12,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS12    DFLD  POS=(12,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF12   DFLD  POS=(12,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN12   DFLD  POS=(12,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD13    DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU13F    DFLD  POS=(13,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU13T    DFLD  POS=(13,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX13    DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS13    DFLD  POS=(13,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART13    DFLD  POS=(13,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A13      DFLD  POS=(13,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B13      DFLD  POS=(13,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C13      DFLD  POS=(13,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D13      DFLD  POS=(13,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E13      DFLD  POS=(13,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS13     DFLD  POS=(13,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT13    DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART13  DFLD  POS=(13,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM13    DFLD  POS=(13,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR13  DFLD  POS=(13,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT13    DFLD  POS=(13,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS13    DFLD  POS=(13,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF13   DFLD  POS=(13,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN13   DFLD  POS=(13,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD14    DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU14F    DFLD  POS=(14,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU14T    DFLD  POS=(14,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX14    DFLD  POS=(14,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS14    DFLD  POS=(14,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART14    DFLD  POS=(14,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A14      DFLD  POS=(14,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B14      DFLD  POS=(14,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C14      DFLD  POS=(14,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D14      DFLD  POS=(14,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E14      DFLD  POS=(14,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS14     DFLD  POS=(14,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT14    DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART14  DFLD  POS=(14,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM14    DFLD  POS=(14,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR14  DFLD  POS=(14,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT14    DFLD  POS=(14,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS14    DFLD  POS=(14,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF14   DFLD  POS=(14,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN14   DFLD  POS=(14,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD15    DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU15F    DFLD  POS=(15,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU15T    DFLD  POS=(15,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX15    DFLD  POS=(15,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS15    DFLD  POS=(15,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART15    DFLD  POS=(15,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A15      DFLD  POS=(15,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B15      DFLD  POS=(15,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C15      DFLD  POS=(15,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D15      DFLD  POS=(15,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E15      DFLD  POS=(15,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS15     DFLD  POS=(15,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT15    DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART15  DFLD  POS=(15,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM15    DFLD  POS=(15,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR15  DFLD  POS=(15,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT15    DFLD  POS=(15,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS15    DFLD  POS=(15,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF15   DFLD  POS=(15,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN15   DFLD  POS=(15,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD16    DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU16F    DFLD  POS=(16,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU16T    DFLD  POS=(16,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX16    DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS16    DFLD  POS=(16,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART16    DFLD  POS=(16,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A16      DFLD  POS=(16,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B16      DFLD  POS=(16,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C16      DFLD  POS=(16,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D16      DFLD  POS=(16,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E16      DFLD  POS=(16,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS16     DFLD  POS=(16,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT16    DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART16  DFLD  POS=(16,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM16    DFLD  POS=(16,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR16  DFLD  POS=(16,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT16    DFLD  POS=(16,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS16    DFLD  POS=(16,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF16   DFLD  POS=(16,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN16   DFLD  POS=(16,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
RAD17    DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PU17F    DFLD  POS=(17,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
PU17T    DFLD  POS=(17,11),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FBX17    DFLD  POS=(17,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
POS17    DFLD  POS=(17,18),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ART17    DFLD  POS=(17,22),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
A17      DFLD  POS=(17,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
B17      DFLD  POS=(17,36),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
C17      DFLD  POS=(17,40),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
D17      DFLD  POS=(17,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
E17      DFLD  POS=(17,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
PS17     DFLD  POS=(17,52),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKT17    DFLD  POS=(17,55),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEART17  DFLD  POS=(17,57),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
ANM17    DFLD  POS=(17,85),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AENDR17  DFLD  POS=(17,111),LTH=1,                                     +        
               ATTR=(PROT)                                                      
NOT17    DFLD  POS=(17,114),LTH=1,                                     +        
               ATTR=(PROT)                                                      
ERS17    DFLD  POS=(17,117),LTH=2,                                     +        
               ATTR=(PROT)                                                      
HREF17   DFLD  POS=(17,122),LTH=1,                                     +        
               ATTR=(PROT)                                                      
HAEN17   DFLD  POS=(17,125),LTH=1,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Reference ......to',                                   +        
               POS=(18,111),LTH=18,                                    +        
               ATTR=(PROT)                                                      
         DFLD  'Line Pfr Ptom F Fig Partno',                           +        
               POS=(19,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A   B   C   D   E  PS . Description',                  +        
               POS=(19,33),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'H Note',                                               +        
               POS=(19,83),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr Tblk Line Pfr B/A',                                 +        
               POS=(19,111),LTH=20,                                    +        
               ATTR=(PROT)                                                      
IDCATRAD DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
CATPUBF  DFLD  POS=(20,7),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
CATPUBT  DFLD  POS=(20,11),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KDFBX    DFLD  POS=(20,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
IDCATPOS DFLD  POS=(20,18),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
IDARTNR  DFLD  POS=(20,22),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKOL1   DFLD  POS=(20,32),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KVKOL2   DFLD  POS=(20,36),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KVKOL3   DFLD  POS=(20,40),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KVKOL4   DFLD  POS=(20,44),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KVKOL5   DFLD  POS=(20,48),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KDPS     DFLD  POS=(20,52),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVPUNKT  DFLD  POS=(20,55),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEARTIN  DFLD  POS=(20,57),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
KDHOM    DFLD  POS=(20,83),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANMARTXT DFLD  POS=(20,85),LTH=23,                                     +        
               ATTR=(NOPROT)                                                    
GRPHAEN  DFLD  POS=(20,111),LTH=2,                                     +        
               ATTR=(NUM,NOPROT)                                                
AVSHAEN  DFLD  POS=(20,114),LTH=4,                                     +        
               ATTR=(NUM,NOPROT)                                                
RADHAEN  DFLD  POS=(20,119),LTH=4,                                     +        
               ATTR=(NUM,NOPROT)                                                
PUBHAEN  DFLD  POS=(20,124),LTH=3,                                     +        
               ATTR=(NOPROT)                                                    
KDHAEN   DFLD  POS=(20,128),LTH=1,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Del.up to',                                            +        
               POS=(21,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Search fig',                                           +        
               POS=(21,18),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Heading no',                                           +        
               POS=(21,53),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Addtext    Footnote no',                               +        
               POS=(21,74),LTH=22,                                     +        
               ATTR=(PROT)                                                      
RADBORT  DFLD  POS=(22,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
PUBBORT  DFLD  POS=(22,7),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SOEKPOS  DFLD  POS=(22,18),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
RUBNR1   DFLD  POS=(22,53),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RUBNR2   DFLD  POS=(22,59),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RUBNR3   DFLD  POS=(22,65),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TILTXTNR DFLD  POS=(22,74),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(22,80),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
FOTNR1   DFLD  POS=(22,85),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTNR2   DFLD  POS=(22,91),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FOTNR3   DFLD  POS=(22,97),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 CATAL. T-BLOCK 14 CATAL. UPD',                      +        
               POS=(24,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 LINE NOTES',                                        +        
               POS=(24,41),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16 TBLK HEAD',                                         +        
               POS=(24,64),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 VADIS SEARCH ARG.',                                 +        
               POS=(24,86),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(25,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 TBLK ORIG. PRINT  20 LIST TBLK.HEADERS   21 LIST TBL+        
               K',                                                     +        
               POS=(25,20),LTH=56,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10/22 WHELP',                                          +        
               POS=(25,86),LTH=11,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(26,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(26,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(26,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(26,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(27,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O512N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N512,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I512N1,                                           +        
               FILL=PT                                                          
DGI1MOD  LPAGE SOR=W1N512                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  INCATNR,                                                +        
               LTH=5                                                            
         MFLD  UTCATNR,                                                +        
               LTH=5                                                            
         MFLD  INCATGRP,                                               +        
               LTH=2                                                            
         MFLD  UTCATGRP,                                               +        
               LTH=2                                                            
         MFLD  INCATAVS,                                               +        
               LTH=4                                                            
         MFLD  UTCATAVS,                                               +        
               LTH=4                                                            
         MFLD  INSKYLT,                                                +        
               LTH=3                                                            
         MFLD  UTSKYLT,                                                +        
               LTH=3                                                            
         MFLD  INCATRAD,                                               +        
               LTH=4                                                            
         MFLD  UTCATRAD,                                               +        
               LTH=4                                                            
         MFLD  INCATPUB,                                               +        
               LTH=3                                                            
         MFLD  UTCATPUB,                                               +        
               LTH=3                                                            
         MFLD  INTIDFRA,                                               +        
               LTH=3                                                            
         MFLD  UTTIDFRA,                                               +        
               LTH=3                                                            
         MFLD  INTIDTIL,                                               +        
               LTH=3                                                            
         MFLD  UTTIDTIL,                                               +        
               LTH=3                                                            
         MFLD  RADPREV,                                                +        
               LTH=4                                                            
         MFLD  RADFROM,                                                +        
               LTH=4                                                            
         MFLD  RADMITT,                                                +        
               LTH=4                                                            
         MFLD  RADTILL,                                                +        
               LTH=4                                                            
         MFLD  RADFIRST,                                               +        
               LTH=4                                                            
         MFLD  RADSISTA,                                               +        
               LTH=4                                                            
         MFLD  RAD06,                                                  +        
               LTH=4                                                            
         MFLD  PU06F,                                                  +        
               LTH=3                                                            
         MFLD  PU06T,                                                  +        
               LTH=3                                                            
         MFLD  FBX06,                                                  +        
               LTH=1                                                            
         MFLD  POS06,                                                  +        
               LTH=3                                                            
         MFLD  ART06,                                                  +        
               LTH=9                                                            
         MFLD  A06,                                                    +        
               LTH=3                                                            
         MFLD  B06,                                                    +        
               LTH=3                                                            
         MFLD  C06,                                                    +        
               LTH=3                                                            
         MFLD  D06,                                                    +        
               LTH=3                                                            
         MFLD  E06,                                                    +        
               LTH=3                                                            
         MFLD  PS06,                                                   +        
               LTH=2                                                            
         MFLD  PKT06,                                                  +        
               LTH=1                                                            
         MFLD  BEART06,                                                +        
               LTH=25                                                           
         MFLD  ANM06,                                                  +        
               LTH=23                                                           
         MFLD  AENDR06,                                                +        
               LTH=1                                                            
         MFLD  NOT06,                                                  +        
               LTH=1                                                            
         MFLD  ERS06,                                                  +        
               LTH=2                                                            
         MFLD  HREF06,                                                 +        
               LTH=1                                                            
         MFLD  HAEN06,                                                 +        
               LTH=1                                                            
         MFLD  RAD07,                                                  +        
               LTH=4                                                            
         MFLD  PU07F,                                                  +        
               LTH=3                                                            
         MFLD  PU07T,                                                  +        
               LTH=3                                                            
         MFLD  FBX07,                                                  +        
               LTH=1                                                            
         MFLD  POS07,                                                  +        
               LTH=3                                                            
         MFLD  ART07,                                                  +        
               LTH=9                                                            
         MFLD  A07,                                                    +        
               LTH=3                                                            
         MFLD  B07,                                                    +        
               LTH=3                                                            
         MFLD  C07,                                                    +        
               LTH=3                                                            
         MFLD  D07,                                                    +        
               LTH=3                                                            
         MFLD  E07,                                                    +        
               LTH=3                                                            
         MFLD  PS07,                                                   +        
               LTH=2                                                            
         MFLD  PKT07,                                                  +        
               LTH=1                                                            
         MFLD  BEART07,                                                +        
               LTH=25                                                           
         MFLD  ANM07,                                                  +        
               LTH=23                                                           
         MFLD  AENDR07,                                                +        
               LTH=1                                                            
         MFLD  NOT07,                                                  +        
               LTH=1                                                            
         MFLD  ERS07,                                                  +        
               LTH=2                                                            
         MFLD  HREF07,                                                 +        
               LTH=1                                                            
         MFLD  HAEN07,                                                 +        
               LTH=1                                                            
         MFLD  RAD08,                                                  +        
               LTH=4                                                            
         MFLD  PU08F,                                                  +        
               LTH=3                                                            
         MFLD  PU08T,                                                  +        
               LTH=3                                                            
         MFLD  FBX08,                                                  +        
               LTH=1                                                            
         MFLD  POS08,                                                  +        
               LTH=3                                                            
         MFLD  ART08,                                                  +        
               LTH=9                                                            
         MFLD  A08,                                                    +        
               LTH=3                                                            
         MFLD  B08,                                                    +        
               LTH=3                                                            
         MFLD  C08,                                                    +        
               LTH=3                                                            
         MFLD  D08,                                                    +        
               LTH=3                                                            
         MFLD  E08,                                                    +        
               LTH=3                                                            
         MFLD  PS08,                                                   +        
               LTH=2                                                            
         MFLD  PKT08,                                                  +        
               LTH=1                                                            
         MFLD  BEART08,                                                +        
               LTH=25                                                           
         MFLD  ANM08,                                                  +        
               LTH=23                                                           
         MFLD  AENDR08,                                                +        
               LTH=1                                                            
         MFLD  NOT08,                                                  +        
               LTH=1                                                            
         MFLD  ERS08,                                                  +        
               LTH=2                                                            
         MFLD  HREF3,                                                  +        
               LTH=1                                                            
         MFLD  HAEN08,                                                 +        
               LTH=1                                                            
         MFLD  RAD09,                                                  +        
               LTH=4                                                            
         MFLD  PU09F,                                                  +        
               LTH=3                                                            
         MFLD  PU09T,                                                  +        
               LTH=3                                                            
         MFLD  FBX09,                                                  +        
               LTH=1                                                            
         MFLD  POS09,                                                  +        
               LTH=3                                                            
         MFLD  ART09,                                                  +        
               LTH=9                                                            
         MFLD  A09,                                                    +        
               LTH=3                                                            
         MFLD  B09,                                                    +        
               LTH=3                                                            
         MFLD  C09,                                                    +        
               LTH=3                                                            
         MFLD  D09,                                                    +        
               LTH=3                                                            
         MFLD  E09,                                                    +        
               LTH=3                                                            
         MFLD  PS09,                                                   +        
               LTH=2                                                            
         MFLD  PKT09,                                                  +        
               LTH=1                                                            
         MFLD  BEART09,                                                +        
               LTH=25                                                           
         MFLD  ANM09,                                                  +        
               LTH=23                                                           
         MFLD  AENDR09,                                                +        
               LTH=1                                                            
         MFLD  NOT09,                                                  +        
               LTH=1                                                            
         MFLD  ERS09,                                                  +        
               LTH=2                                                            
         MFLD  HREF09,                                                 +        
               LTH=1                                                            
         MFLD  HAEN09,                                                 +        
               LTH=1                                                            
         MFLD  RAD10,                                                  +        
               LTH=4                                                            
         MFLD  PU10F,                                                  +        
               LTH=3                                                            
         MFLD  PU10T,                                                  +        
               LTH=3                                                            
         MFLD  FBX10,                                                  +        
               LTH=1                                                            
         MFLD  POS10,                                                  +        
               LTH=3                                                            
         MFLD  ART10,                                                  +        
               LTH=9                                                            
         MFLD  A10,                                                    +        
               LTH=3                                                            
         MFLD  B10,                                                    +        
               LTH=3                                                            
         MFLD  C10,                                                    +        
               LTH=3                                                            
         MFLD  D10,                                                    +        
               LTH=3                                                            
         MFLD  E10,                                                    +        
               LTH=3                                                            
         MFLD  PS10,                                                   +        
               LTH=2                                                            
         MFLD  PKT10,                                                  +        
               LTH=1                                                            
         MFLD  BEART10,                                                +        
               LTH=25                                                           
         MFLD  ANM10,                                                  +        
               LTH=23                                                           
         MFLD  AENDR10,                                                +        
               LTH=1                                                            
         MFLD  NOT10,                                                  +        
               LTH=1                                                            
         MFLD  ERS10,                                                  +        
               LTH=2                                                            
         MFLD  HREF10,                                                 +        
               LTH=1                                                            
         MFLD  HAEN10,                                                 +        
               LTH=1                                                            
         MFLD  RAD11,                                                  +        
               LTH=4                                                            
         MFLD  PU11F,                                                  +        
               LTH=3                                                            
         MFLD  PU11T,                                                  +        
               LTH=3                                                            
         MFLD  FBX11,                                                  +        
               LTH=1                                                            
         MFLD  POS11,                                                  +        
               LTH=3                                                            
         MFLD  ART11,                                                  +        
               LTH=9                                                            
         MFLD  A11,                                                    +        
               LTH=3                                                            
         MFLD  B11,                                                    +        
               LTH=3                                                            
         MFLD  C11,                                                    +        
               LTH=3                                                            
         MFLD  D11,                                                    +        
               LTH=3                                                            
         MFLD  E11,                                                    +        
               LTH=3                                                            
         MFLD  PS11,                                                   +        
               LTH=2                                                            
         MFLD  PKT11,                                                  +        
               LTH=1                                                            
         MFLD  BEART11,                                                +        
               LTH=25                                                           
         MFLD  ANM11,                                                  +        
               LTH=23                                                           
         MFLD  AENDR11,                                                +        
               LTH=1                                                            
         MFLD  NOT11,                                                  +        
               LTH=1                                                            
         MFLD  ERS11,                                                  +        
               LTH=2                                                            
         MFLD  HREF11,                                                 +        
               LTH=1                                                            
         MFLD  HAEN11,                                                 +        
               LTH=1                                                            
         MFLD  RAD12,                                                  +        
               LTH=4                                                            
         MFLD  PU12F,                                                  +        
               LTH=3                                                            
         MFLD  PU12T,                                                  +        
               LTH=3                                                            
         MFLD  FBX12,                                                  +        
               LTH=1                                                            
         MFLD  POS12,                                                  +        
               LTH=3                                                            
         MFLD  ART12,                                                  +        
               LTH=9                                                            
         MFLD  A12,                                                    +        
               LTH=3                                                            
         MFLD  B12,                                                    +        
               LTH=3                                                            
         MFLD  C12,                                                    +        
               LTH=3                                                            
         MFLD  D12,                                                    +        
               LTH=3                                                            
         MFLD  E12,                                                    +        
               LTH=3                                                            
         MFLD  PS12,                                                   +        
               LTH=2                                                            
         MFLD  PKT12,                                                  +        
               LTH=1                                                            
         MFLD  BEART12,                                                +        
               LTH=25                                                           
         MFLD  ANM12,                                                  +        
               LTH=23                                                           
         MFLD  AENDR12,                                                +        
               LTH=1                                                            
         MFLD  NOT12,                                                  +        
               LTH=1                                                            
         MFLD  ERS12,                                                  +        
               LTH=2                                                            
         MFLD  HREF12,                                                 +        
               LTH=1                                                            
         MFLD  HAEN12,                                                 +        
               LTH=1                                                            
         MFLD  RAD13,                                                  +        
               LTH=4                                                            
         MFLD  PU13F,                                                  +        
               LTH=3                                                            
         MFLD  PU13T,                                                  +        
               LTH=3                                                            
         MFLD  FBX13,                                                  +        
               LTH=1                                                            
         MFLD  POS13,                                                  +        
               LTH=3                                                            
         MFLD  ART13,                                                  +        
               LTH=9                                                            
         MFLD  A13,                                                    +        
               LTH=3                                                            
         MFLD  B13,                                                    +        
               LTH=3                                                            
         MFLD  C13,                                                    +        
               LTH=3                                                            
         MFLD  D13,                                                    +        
               LTH=3                                                            
         MFLD  E13,                                                    +        
               LTH=3                                                            
         MFLD  PS13,                                                   +        
               LTH=2                                                            
         MFLD  PKT13,                                                  +        
               LTH=1                                                            
         MFLD  BEART13,                                                +        
               LTH=25                                                           
         MFLD  ANM13,                                                  +        
               LTH=23                                                           
         MFLD  AENDR13,                                                +        
               LTH=1                                                            
         MFLD  NOT13,                                                  +        
               LTH=1                                                            
         MFLD  ERS13,                                                  +        
               LTH=2                                                            
         MFLD  HREF13,                                                 +        
               LTH=1                                                            
         MFLD  HAEN13,                                                 +        
               LTH=1                                                            
         MFLD  RAD14,                                                  +        
               LTH=4                                                            
         MFLD  PU14F,                                                  +        
               LTH=3                                                            
         MFLD  PU14T,                                                  +        
               LTH=3                                                            
         MFLD  FBX14,                                                  +        
               LTH=1                                                            
         MFLD  POS14,                                                  +        
               LTH=3                                                            
         MFLD  ART14,                                                  +        
               LTH=9                                                            
         MFLD  A14,                                                    +        
               LTH=3                                                            
         MFLD  B14,                                                    +        
               LTH=3                                                            
         MFLD  C14,                                                    +        
               LTH=3                                                            
         MFLD  D14,                                                    +        
               LTH=3                                                            
         MFLD  E14,                                                    +        
               LTH=3                                                            
         MFLD  PS14,                                                   +        
               LTH=2                                                            
         MFLD  PKT14,                                                  +        
               LTH=1                                                            
         MFLD  BEART14,                                                +        
               LTH=25                                                           
         MFLD  ANM14,                                                  +        
               LTH=23                                                           
         MFLD  AENDR14,                                                +        
               LTH=1                                                            
         MFLD  NOT14,                                                  +        
               LTH=1                                                            
         MFLD  ERS14,                                                  +        
               LTH=2                                                            
         MFLD  HREF14,                                                 +        
               LTH=1                                                            
         MFLD  HAEN14,                                                 +        
               LTH=1                                                            
         MFLD  RAD15,                                                  +        
               LTH=4                                                            
         MFLD  PU15F,                                                  +        
               LTH=3                                                            
         MFLD  PU15T,                                                  +        
               LTH=3                                                            
         MFLD  FBX15,                                                  +        
               LTH=1                                                            
         MFLD  POS15,                                                  +        
               LTH=3                                                            
         MFLD  ART15,                                                  +        
               LTH=9                                                            
         MFLD  A15,                                                    +        
               LTH=3                                                            
         MFLD  B15,                                                    +        
               LTH=3                                                            
         MFLD  C15,                                                    +        
               LTH=3                                                            
         MFLD  D15,                                                    +        
               LTH=3                                                            
         MFLD  E15,                                                    +        
               LTH=3                                                            
         MFLD  PS15,                                                   +        
               LTH=2                                                            
         MFLD  PKT15,                                                  +        
               LTH=1                                                            
         MFLD  BEART15,                                                +        
               LTH=25                                                           
         MFLD  ANM15,                                                  +        
               LTH=23                                                           
         MFLD  AENDR15,                                                +        
               LTH=1                                                            
         MFLD  NOT15,                                                  +        
               LTH=1                                                            
         MFLD  ERS15,                                                  +        
               LTH=2                                                            
         MFLD  HREF15,                                                 +        
               LTH=1                                                            
         MFLD  HAEN15,                                                 +        
               LTH=1                                                            
         MFLD  RAD16,                                                  +        
               LTH=4                                                            
         MFLD  PU16F,                                                  +        
               LTH=3                                                            
         MFLD  PU16T,                                                  +        
               LTH=3                                                            
         MFLD  FBX16,                                                  +        
               LTH=1                                                            
         MFLD  POS16,                                                  +        
               LTH=3                                                            
         MFLD  ART16,                                                  +        
               LTH=9                                                            
         MFLD  A16,                                                    +        
               LTH=3                                                            
         MFLD  B16,                                                    +        
               LTH=3                                                            
         MFLD  C16,                                                    +        
               LTH=3                                                            
         MFLD  D16,                                                    +        
               LTH=3                                                            
         MFLD  E16,                                                    +        
               LTH=3                                                            
         MFLD  PS16,                                                   +        
               LTH=2                                                            
         MFLD  PKT16,                                                  +        
               LTH=1                                                            
         MFLD  BEART16,                                                +        
               LTH=25                                                           
         MFLD  ANM16,                                                  +        
               LTH=23                                                           
         MFLD  AENDR16,                                                +        
               LTH=1                                                            
         MFLD  NOT16,                                                  +        
               LTH=1                                                            
         MFLD  ERS16,                                                  +        
               LTH=2                                                            
         MFLD  HREF16,                                                 +        
               LTH=1                                                            
         MFLD  HAEN16,                                                 +        
               LTH=1                                                            
         MFLD  RAD17,                                                  +        
               LTH=4                                                            
         MFLD  PU17F,                                                  +        
               LTH=3                                                            
         MFLD  PU17T,                                                  +        
               LTH=3                                                            
         MFLD  FBX17,                                                  +        
               LTH=1                                                            
         MFLD  POS17,                                                  +        
               LTH=3                                                            
         MFLD  ART17,                                                  +        
               LTH=9                                                            
         MFLD  A17,                                                    +        
               LTH=3                                                            
         MFLD  B17,                                                    +        
               LTH=3                                                            
         MFLD  C17,                                                    +        
               LTH=3                                                            
         MFLD  D17,                                                    +        
               LTH=3                                                            
         MFLD  E17,                                                    +        
               LTH=3                                                            
         MFLD  PS17,                                                   +        
               LTH=2                                                            
         MFLD  PKT17,                                                  +        
               LTH=1                                                            
         MFLD  BEART17,                                                +        
               LTH=25                                                           
         MFLD  ANM17,                                                  +        
               LTH=23                                                           
         MFLD  AENDR17,                                                +        
               LTH=1                                                            
         MFLD  NOT17,                                                  +        
               LTH=1                                                            
         MFLD  ERS17,                                                  +        
               LTH=2                                                            
         MFLD  HREF17,                                                 +        
               LTH=1                                                            
         MFLD  HAEN17,                                                 +        
               LTH=1                                                            
         MFLD  IDCATRAD,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CATPUBF,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CATPUBT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFBX,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDCATPOS,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVKOL1,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOL2,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOL3,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOL4,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOL5,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPS,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPUNKT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEARTIN,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDHOM,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMARTXT,                                               +        
               LTH=25,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GRPHAEN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVSHAEN,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADHAEN,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBHAEN,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDHAEN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADBORT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBBORT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SOEKPOS,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUBNR3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILTXTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTNR1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTNR2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FOTNR3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I512N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N512),                                           +        
               OPT=2,                                                  +        
               NXT=W1O512N1                                                     
DGI2MID  LPAGE SOR=(W1N512)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15121',                                                +        
               LTH=5                                                            
         MFLD  (INCATNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTCATNR,                                                +        
               LTH=5                                                            
         MFLD  (INCATGRP,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTCATGRP,                                               +        
               LTH=2                                                            
         MFLD  (INCATAVS,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTCATAVS,                                               +        
               LTH=4                                                            
         MFLD  (INSKYLT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTSKYLT,                                                +        
               LTH=3                                                            
         MFLD  (INCATRAD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTCATRAD,                                               +        
               LTH=4                                                            
         MFLD  (INCATPUB,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTCATPUB,                                               +        
               LTH=3                                                            
         MFLD  (INTIDFRA,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTTIDFRA,                                               +        
               LTH=3                                                            
         MFLD  (INTIDTIL,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTTIDTIL,                                               +        
               LTH=3                                                            
         MFLD  (RADPREV,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADFROM,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADMITT,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADTILL,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADFIRST,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADSISTA,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDCATRAD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CATPUBF,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  CATPUBT,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDFBX,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDCATPOS,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKOL1,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVKOL2,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVKOL3,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVKOL4,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVKOL5,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDPS,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVPUNKT,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (BEARTIN,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDHOM,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANMARTXT,                                              +        
               '+++++++++++++++++++++++'),                             +        
               LTH=23,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GRPHAEN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVSHAEN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADHAEN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBHAEN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDHAEN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADBORT,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBBORT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SOEKPOS,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RUBNR1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUBNR3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TILTXTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTNR1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTNR2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FOTNR3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
