***********************************************************************         
* CREATED BY PC28439   ON 94/05/20  AT 11:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TEXT BLOCK HEADINGS, PRINT      '                               
W1N518   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T518U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T518U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W1T514  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T518U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT BLOCK HEADINGS, PRINT',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Catalogue',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0005 DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRP-From',                                             +        
               POS=(2,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Text-BLK',                                             +        
               POS=(2,32),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,41),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang.',                                                +        
               POS=(2,48),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(2,54),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,64),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,41),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,54),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,64),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'GRP-To',                                               +        
               POS=(5,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(5,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Job selection',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
IDLISTA  DFLD  POS=(8,17),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '001 = On Main-GRP,All Txt-Blks./ On Sub-Group,TXT-BLK 1+        
               .',                                                     +        
               POS=(8,23),LTH=56,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '002 = On Sub-GRP,All Txt-Blks.',                       +        
               POS=(9,23),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer Address',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(13,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(13,21),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLTERM  DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A = GOT/VCC   Editorial office',                       +        
               POS=(15,19),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 TEXT-BLOCK UPD. 17',                                +        
               POS=(21,49),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 HEADINGS PRINT 21 T-BLOCK PRINT   10/22 WHELP',     +        
               POS=(22,31),LTH=48,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         DEV   TYPE=3270-A7,                                           +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W1T518U ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W1T518U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W1T511  ',                                          +        
               14='W1T512  ',                                          +        
               15='W1T513  ',                                          +        
               16='W1T514  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W1T518  ',                                          +        
               21='W1T519  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T518U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT BLOCK HEADINGS, PRINT',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Catalogue',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GRP-From',                                             +        
               POS=(2,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TEXT-Block',                                           +        
               POS=(2,32),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,43),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Language',                                             +        
               POS=(2,50),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(2,59),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Line',                                                 +        
               POS=(2,64),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,69),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,43),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,69),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'GRP-To',                                               +        
               POS=(5,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(5,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Job Selection',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
IDLISTA  DFLD  POS=(8,18),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '001 = On Main-Group,All Text-Blocks. / On Sub-Group,Tes+        
               t-Block 1.',                                            +        
               POS=(8,24),LTH=65,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '002 = On Sub-Group, All Text-Blocks.',                 +        
               POS=(9,24),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer Address',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KDPRTVAL DFLD  POS=(13,20),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(13,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLTERM  DFLD  POS=(13,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A = GOT/VCC  Editorial office',                        +        
               POS=(15,20),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 CATALOG TXT-BLOCK  14 CATALOG LINES,UPD  15 LINE NOT+        
               ES',                                                    +        
               POS=(21,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 TEXT-BLOCK UPD.   17',                              +        
               POS=(21,67),LTH=23,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 HEADINGS PRINT    21 TEXT-BLOCK PRINT  10/22 WHELP',+        
               POS=(22,46),LTH=53,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W1O518N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N518,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I518N1,                                           +        
               FILL=PT                                                          
DGI3MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  LTH=2                                                            
         MFLD  LTH=8                                                            
         MFLD  LTH=2                                                            
         MFLD  LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W1I518N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W1N518),                                           +        
               OPT=2,                                                  +        
               NXT=W1O518N1                                                     
DGI2MID  LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '15182',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0005,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLISTA,                                               +        
               '002'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPRTVAL,                                              +        
               'A'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W1O518N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W1N518,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W1I518N1,                                           +        
               FILL=PT                                                          
DGI1MOD  LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3                                                            
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=3                                                            
         MFLD  DGIA0010,                                               +        
               LTH=3                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLISTA,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPRTVAL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLTERM,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
