***********************************************************************         
* CREATED BY V086977   oN 02/06/25  AT 15:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPDATERING LEVERANTÖRSDATA     '                               
W2F115   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T111  ',                                           +        
               2='W2T112  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T115 7',                                           +        
               8='W2T115 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T115U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T111  ',                                          +        
               14='W2T112  ',                                          +        
               15='W2T103  ',                                          +        
               16='W2T114  ',                                          +        
               17='W2T115  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T115V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPPDATERING LEVERANTÖRSDATA',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Leverantörnr',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0035 DFLD  POS=(2,15),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0036 DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0026 DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Namn:',                                                +        
               POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(4,8),LTH=60,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Motsv Levnr :',                                        +        
               POS=(5,59),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(5,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adr:',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(6,10),LTH=35,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Telefon:',                                             +        
               POS=(6,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adr2:',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(7,10),LTH=42,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0016 DFLD  POS=(7,59),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Padr:',                                                +        
               POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(8,10),LTH=46,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Telefax:',                                             +        
               POS=(8,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Land:',                                                +        
               POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(9,10),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Landkod:',                                             +        
               POS=(9,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
LEVFAX   DFLD  POS=(9,59),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Att.Nr:',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BELEVAT1 DFLD  POS=(11,5),LTH=35,                                      +        
               ATTR=(PROT)                                                      
MAIL1    DFLD  POS=(12,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ledtid  :',                                            +        
               POS=(12,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(12,70),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ny:',                                                  +        
               POS=(12,74),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(12,79),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEVTLF1  DFLD  POS=(13,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TENOTE1  DFLD  POS=(13,23),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ansk tid:',                                            +        
               POS=(13,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(13,70),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ny:',                                                  +        
               POS=(13,74),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(13,79),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0028 DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BELEVAT2 DFLD  POS=(14,5),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev. typ:',                                            +        
               POS=(14,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(14,71),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ny:',                                                  +        
               POS=(14,74),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
MAIL2    DFLD  POS=(15,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Unik Adr:',                                            +        
               POS=(15,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(15,71),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ny:',                                                  +        
               POS=(15,74),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
LEVTLF2  DFLD  POS=(16,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TENOTE2  DFLD  POS=(16,23),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Att.Nr:',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ATTUPD   DFLD  POS=(17,10),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Namn:',                                                +        
               POS=(17,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BELEVUP  DFLD  POS=(17,19),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Borttag:',                                             +        
               POS=(17,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DELETE   DFLD  POS=(17,68),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kopia:',                                               +        
               POS=(17,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COPY     DFLD  POS=(17,77),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Mail:',                                                +        
               POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
MAILUP   DFLD  POS=(18,8),LTH=50,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Telefon:',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PHONEUP  DFLD  POS=(19,11),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Notering:',                                            +        
               POS=(19,32),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
TENOTEUP DFLD  POS=(19,42),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'PF1 ALLM-LEVINF PF2 PRIS-INFO LEV PF15 LEVPLAN',       +        
               POS=(21,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I11501 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F115),                                           +        
               OPT=2,                                                  +        
               NXT=W2O11501                                                     
DGI2     LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21151',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0035,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0036,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0024,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0014,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0010,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++'),          +        
               LTH=42,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0009,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++'),      +        
               LTH=46,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0016,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVFAX,                                                +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0044,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0046,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0048,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0050,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ATTUPD,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BELEVUP,                                               +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (MAILUP,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++'),  +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PHONEUP,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TENOTEUP,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DELETE,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COPY,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W2O11501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F115,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I11501,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0035,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  DGIA0014,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=44,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=48,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEVFAX,                                                 +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=2                                                            
         MFLD  DGIA0044,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=2                                                            
         MFLD  DGIA0046,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=1                                                            
         MFLD  DGIA0048,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=1                                                            
         MFLD  DGIA0050,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=2                                                            
         MFLD  BELEVAT1,                                               +        
               LTH=35                                                           
         MFLD  MAIL1,                                                  +        
               LTH=50                                                           
         MFLD  LEVTLF1,                                                +        
               LTH=20                                                           
         MFLD  TENOTE1,                                                +        
               LTH=35                                                           
         MFLD  DGIA0028,                                               +        
               LTH=2                                                            
         MFLD  BELEVAT2,                                               +        
               LTH=35                                                           
         MFLD  MAIL2,                                                  +        
               LTH=50                                                           
         MFLD  LEVTLF2,                                                +        
               LTH=20                                                           
         MFLD  TENOTE2,                                                +        
               LTH=35                                                           
         MFLD  ATTUPD,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BELEVUP,                                                +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  MAILUP,                                                 +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PHONEUP,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTEUP,                                               +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DELETE,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COPY,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
