***********************************************************************         
* CREATED BY PC40073   ON 95/01/10  AT 08:47                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RESTORDER/TPO                   '                               
W2F125   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T121  ',                                           +        
               2='W2T122  ',                                           +        
               3='W2T123  ',                                           +        
               4='W2T124  ',                                           +        
               5='W2T125  ',                                           +        
               6='W2T126  ',                                           +        
               7='W2T125 7',                                           +        
               8='W2T125 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T125U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T121  ',                                          +        
               14='W2T122  ',                                          +        
               15='W2T123  ',                                          +        
               16='W2T124  ',                                          +        
               17='W2T125  ',                                          +        
               18='W2T126  ',                                          +        
               19='W2T127  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T125  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RESTORDER/TPO',                                        +        
               POS=(1,11),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,36),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikel',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ARTNRIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,20),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ansk',                                                 +        
               POS=(2,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ANSKIN   DFLD  POS=(2,37),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Orsak',                                                +        
               POS=(2,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDROOIN  DFLD  POS=(2,48),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TPO',                                                  +        
               POS=(2,51),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TPOFIN   DFLD  POS=(2,55),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(2,57),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TPOTIN   DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status',                                               +        
               POS=(2,62),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STARAIN  DFLD  POS=(2,69),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '(1-3)',                                                +        
               POS=(2,71),LTH=5,                                       +        
               ATTR=(ALPHA,PROT)                                                
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,26),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ANSKUT   DFLD  POS=(3,37),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
KDROOUT  DFLD  POS=(3,49),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
TPOFUT   DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '-',                                                    +        
               POS=(3,57),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
TPOTUT   DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
STARAUT  DFLD  POS=(3,69),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNRS   DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
RADPRIS  DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
RODATS   DFLD  POS=(4,16),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DISTRS   DFLD  POS=(4,23),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KUNDS    DFLD  POS=(4,28),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KUNDRFS  DFLD  POS=(4,36),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRS   DFLD  POS=(4,47),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ANSKS    DFLD  POS=(4,51),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDROOS   DFLD  POS=(4,55),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KVRADS   DFLD  POS=(4,61),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
REGTIDS  DFLD  POS=(4,68),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'K Artikelnr Dist Kundnr   Order Tt   Antal RO-dat RESda+        
               t K   O Ans  Tdat Pri',                                 +        
               POS=(5,2),LTH=76,                                       +        
               ATTR=(PROT)                                                      
KVARTO   DFLD  POS=(6,37),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TITPOO   DFLD  POS=(6,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DO    13,SUF=07                                                        
VALKOD   DFLD  POS=(7,02),LTH=1,ATTR=(NOPROT)                                   
IDARTNR  DFLD  POS=(7,04),LTH=9,ATTR=(NUM,PROT,MOD)                             
IDDISTR  DFLD  POS=(7,14),LTH=4,ATTR=(NUM,PROT,MOD)                             
IDKUNDNR DFLD  POS=(7,19),LTH=6,ATTR=(NUM,PROT,MOD)                             
IDORDNR  DFLD  POS=(7,26),LTH=7,ATTR=(NUM,PROT,MOD)                             
KDTPOTYP DFLD  POS=(7,35),LTH=1,ATTR=(PROT,MOD)                                 
KVART    DFLD  POS=(7,37),LTH=7,ATTR=(NUM,PROT,MOD)                             
TIRODAT  DFLD  POS=(7,45),LTH=6,ATTR=(NUM,PROT,MOD)                             
TIRES    DFLD  POS=(7,52),LTH=6,ATTR=(NUM,PROT,MOD)                             
KDORDKL  DFLD  POS=(7,59),LTH=1,ATTR=(NUM,PROT,MOD)                             
KDROO    DFLD  POS=(7,63),LTH=1,ATTR=(NUM,PROT,MOD)                             
IDANSK   DFLD  POS=(7,65),LTH=3,ATTR=(NUM,PROT,MOD)                             
TITPO    DFLD  POS=(7,69),LTH=5,ATTR=(NUM,PROT,MOD)                             
KDRAPRIO DFLD  POS=(7,75),LTH=3,ATTR=(NUM,PROT,MOD)                             
IDLOPNR  DFLD  POS=(7,79),LTH=2,ATTR=(NUM,PROT,NODISP,MOD)                      
         ENDDO                                                                  
ARTNRE   DFLD  POS=(20,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RAPRIOE  DFLD  POS=(20,12),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
RODATE   DFLD  POS=(20,16),LTH=6,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DISTRE   DFLD  POS=(20,23),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KUNDE    DFLD  POS=(20,28),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KUNDRFE  DFLD  POS=(20,36),LTH=10,                                     +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRE   DFLD  POS=(20,47),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDANSKE  DFLD  POS=(20,51),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KDROOE   DFLD  POS=(20,55),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
REGTIDE  DFLD  POS=(20,57),LTH=6,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Beställning  14 Graf ordning 15 Prognos inf  16 U-le+        
               v intyg 17 RO/TPO',                                     +        
               POS=(21,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Obekr TPO:er 19 Obekr offert 20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
MFSINFO  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O12501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F125,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I12501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  ANSKIN,                                                 +        
               LTH=3                                                            
         MFLD  ANSKUT,                                                 +        
               LTH=3                                                            
         MFLD  KDROOIN,                                                +        
               LTH=1                                                            
         MFLD  KDROOUT,                                                +        
               LTH=1                                                            
         MFLD  TPOFIN,                                                 +        
               LTH=1                                                            
         MFLD  TPOFUT,                                                 +        
               LTH=1                                                            
         MFLD  TPOTIN,                                                 +        
               LTH=1                                                            
         MFLD  TPOTUT,                                                 +        
               LTH=1                                                            
         MFLD  STARAIN,                                                +        
               LTH=1                                                            
         MFLD  STARAUT,                                                +        
               LTH=1                                                            
         MFLD  ARTNRS,                                                 +        
               LTH=9                                                            
         MFLD  RADPRIS,                                                +        
               LTH=3                                                            
         MFLD  RODATS,                                                 +        
               LTH=6                                                            
         MFLD  REGTIDS,                                                +        
               LTH=6                                                            
         MFLD  DISTRS,                                                 +        
               LTH=4                                                            
         MFLD  KUNDS,                                                  +        
               LTH=7                                                            
         MFLD  KUNDRFS,                                                +        
               LTH=10                                                           
         MFLD  LOPNRS,                                                 +        
               LTH=3                                                            
         MFLD  ANSKS,                                                  +        
               LTH=3                                                            
         MFLD  KDROOS,                                                 +        
               LTH=1                                                            
         MFLD  KVRADS,                                                 +        
               LTH=6                                                            
         MFLD  KVARTO,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TITPOO,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         DO    13,SUF=07                                                        
         MFLD  VALKOD,LTH=3,ATTR=(YES)                                          
         MFLD  IDARTNR,LTH=9                                                    
         MFLD  IDDISTR,LTH=4                                                    
         MFLD  IDKUNDNR,LTH=6                                                   
         MFLD  IDORDNR,LTH=7                                                    
         MFLD  KDTPOTYP,LTH=1                                                   
         MFLD  KVART,LTH=7                                                      
         MFLD  TIRODAT,LTH=6                                                    
         MFLD  TIRES,LTH=6                                                      
         MFLD  KDORDKL,LTH=1                                                    
         MFLD  KDROO,LTH=1                                                      
         MFLD  IDANSK,LTH=3                                                     
         MFLD  TITPO,LTH=5                                                      
         MFLD  KDRAPRIO,LTH=3                                                   
         MFLD  IDLOPNR,LTH=2                                                    
         ENDDO                                                                  
         MFLD  ARTNRE,                                                 +        
               LTH=9                                                            
         MFLD  RAPRIOE,                                                +        
               LTH=3                                                            
         MFLD  RODATE,                                                 +        
               LTH=6                                                            
         MFLD  REGTIDE,                                                +        
               LTH=6                                                            
         MFLD  DISTRE,                                                 +        
               LTH=4                                                            
         MFLD  KUNDE,                                                  +        
               LTH=7                                                            
         MFLD  KUNDRFE,                                                +        
               LTH=10                                                           
         MFLD  LOPNRE,                                                 +        
               LTH=3                                                            
         MFLD  IDANSKE,                                                +        
               LTH=3                                                            
         MFLD  KDROOE,                                                 +        
               LTH=1                                                            
         MFLD  MFSINFO,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I12501 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F125),                                           +        
               OPT=2,                                                  +        
               NXT=W2O12501                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21251',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANSKIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ANSKUT,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDROOIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDROOUT,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TPOFIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TPOFUT,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TPOTIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TPOTUT,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (STARAIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STARAUT,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNRS,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  RADPRIS,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  RODATS,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  REGTIDS,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRS,                                                 +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDS,                                                  +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDRFS,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRS,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ANSKS,                                                  +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KDROOS,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KVRADS,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KVARTO,                                                +        
               '0000000'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TITPOO,                                                +        
               '0000'),                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         DO    13,SUF=07                                                        
         MFLD  VALKOD,LTH=1,FILL=X'40'                                          
         MFLD  IDARTNR,LTH=9,FILL=X'F0'                                         
         MFLD  IDDISTR,LTH=4,FILL=X'F0'                                         
         MFLD  IDKUNDNR,LTH=6,FILL=X'F0'                                        
         MFLD  IDORDNR,LTH=7,FILL=X'F0'                                         
         MFLD  KDTPOTYP,LTH=1,FILL=X'F0'                                        
         MFLD  KVART,LTH=7,FILL=X'F0'                                           
         MFLD  TIRODAT,LTH=6,FILL=X'F0'                                         
         MFLD  TIRES,LTH=6,FILL=X'F0'                                           
         MFLD  KDORDKL,LTH=1,FILL=X'F0'                                         
         MFLD  KDROO,LTH=1,FILL=X'F0'                                           
         MFLD  IDANSK,LTH=3,FILL=X'F0'                                          
         MFLD  TITPO,LTH=5,FILL=X'F0'                                           
         MFLD  KDRAPRIO,LTH=3,FILL=X'F0'                                        
         MFLD  IDLOPNR,LTH=2,FILL=X'F0'                                         
         ENDDO                                                                  
         MFLD  ARTNRE,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  RAPRIOE,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  RODATE,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  REGTIDE,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRE,                                                 +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDE,                                                  +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDRFE,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRE,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDANSKE,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KDROOE,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
