***********************************************************************         
* CREATED BY V040073   ON 04/06/18  AT 12:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2F143   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W2T132  ',                                           +        
               3='W2T133  ',                                           +        
               4='W2T134  ',                                           +        
               5='W2T135  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T143  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T131  ',                                          +        
               14='W2T132  ',                                          +        
               15='W2T133  ',                                          +        
               16='W2T134  ',                                          +        
               17='W2T135  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T143  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2F143   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Parametrar till säkerhetslager',                       +        
               POS=(1,11),LTH=30,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,42),LTH=39,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q-opt',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
QOPT     DFLD  POS=(5,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prod.slag',                                            +        
               POS=(5,40),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PRODSL   DFLD  POS=(5,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Säk.lager',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KVSL     DFLD  POS=(6,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prisklass',                                            +        
               POS=(6,40),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PRKL     DFLD  POS=(6,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Säk.lager-opt',                                        +        
               POS=(7,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
KVSLOPT  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Frekv.klass',                                          +        
               POS=(7,40),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FRKL     DFLD  POS=(7,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Serv.grad mål',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
RETARGET DFLD  POS=(8,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Levnr',                                                +        
               POS=(8,40),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEVNR    DFLD  POS=(8,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Säk.lager just',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
RESLJUST DFLD  POS=(9,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Förp.typ',                                             +        
               POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(9,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Min säk.lag',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVVMIN   DFLD  POS=(10,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lag.omr',                                              +        
               POS=(10,40),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(10,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Max säk.lag',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVVMAX   DFLD  POS=(11,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order särkost',                                        +        
               POS=(11,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
PRORDSK  DFLD  POS=(11,57),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ledtids var.-lev',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
LVARLEV  DFLD  POS=(12,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Orders.kost-Lev',                                      +        
               POS=(12,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(12,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ledtids var.-man',                                     +        
               POS=(13,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
LVARART  DFLD  POS=(13,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Orders.kost-Ft',                                       +        
               POS=(13,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(13,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q-kvant         ',                                     +        
               POS=(14,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KVQ      DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Orders.kost-Omr',                                      +        
               POS=(14,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Enh.last        ',                                     +        
               POS=(15,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KVULOAD  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Volym.kost-Omr',                                       +        
               POS=(15,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(15,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MHQ             ',                                     +        
               POS=(16,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KVPALL   DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Överlag.kost %',                                       +        
               POS=(16,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
REOLAGK  DFLD  POS=(16,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MAD-tot         ',                                     +        
               POS=(17,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
MADTOT   DFLD  POS=(17,20),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lag.kost M3',                                          +        
               POS=(17,40),LTH=11,                                     +        
               ATTR=(PROT)                                                      
PRLAGK   DFLD  POS=(17,57),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PB-plan         ',                                     +        
               POS=(18,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
PBPLAN   DFLD  POS=(18,20),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lag.kost %',                                           +        
               POS=(18,40),LTH=10,                                     +        
               ATTR=(PROT)                                                      
RELAGR   DFLD  POS=(18,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O14301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F143,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I4301,                                            +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2F143,                                             +        
               NXT=W2I14301                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  QOPT,                                                   +        
               LTH=7                                                            
         MFLD  PRODSL,                                                 +        
               LTH=2                                                            
         MFLD  KVSL,                                                   +        
               LTH=7                                                            
         MFLD  PRKL,                                                   +        
               LTH=1                                                            
         MFLD  KVSLOPT,                                                +        
               LTH=7                                                            
         MFLD  FRKL,                                                   +        
               LTH=1                                                            
         MFLD  RETARGET,                                               +        
               LTH=4                                                            
         MFLD  LEVNR,                                                  +        
               LTH=5                                                            
         MFLD  RESLJUST,                                               +        
               LTH=4                                                            
         MFLD  BEFT,                                                   +        
               LTH=3                                                            
         MFLD  KVVMIN,                                                 +        
               LTH=4                                                            
         MFLD  ADLAGOMR,                                               +        
               LTH=3                                                            
         MFLD  KVVMAX,                                                 +        
               LTH=4                                                            
         MFLD  PRORDSK,                                                +        
               LTH=8                                                            
         MFLD  LVARLEV,                                                +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  LVARART,                                                +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  REOLAGK,                                                +        
               LTH=2                                                            
         MFLD  PRLAGK,                                                 +        
               LTH=8                                                            
         MFLD  RELAGR,                                                 +        
               LTH=2                                                            
         MFLD  KVQ,                                                    +        
               LTH=7                                                            
         MFLD  KVULOAD,                                                +        
               LTH=7                                                            
         MFLD  KVPALL,                                                 +        
               LTH=7                                                            
         MFLD  MADTOT,                                                 +        
               LTH=8                                                            
         MFLD  PBPLAN,                                                 +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I14301 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F143),                                           +        
               OPT=2,                                                  +        
               NXT=W2O14301                                                     
MID      LPAGE SOR=(W2F143)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21431',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
