***********************************************************************         
* CREATED BY V040073   ON 00/02/08  AT 12:48                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2F123   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W2T122  ',                                           +        
               3='W2T123  ',                                           +        
               4='W2T124  ',                                           +        
               5='W2T125  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T123U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T121  ',                                          +        
               14='W2T122  ',                                          +        
               15='W2T123  ',                                          +        
               16='W2T124  ',                                          +        
               17='W2T125  ',                                          +        
               18='W2T126  ',                                          +        
               19='W2T127  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T123V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2F123   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PROGNOSER OCH PROGNOSFAKTORER',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(6,25),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(6,65),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pb-sep',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(7,19),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(7,30),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mad-sep',                                              +        
               POS=(7,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(7,59),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(7,70),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pb-sep-veckoslut',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(8,19),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(8,30),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mad-tot',                                              +        
               POS=(8,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
MADTOT   DFLD  POS=(8,60),LTH=8,                                       +        
               ATTR=(PROT)                                                      
MADTOTIN DFLD  POS=(8,69),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Datum-man-just',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(9,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Utjämnat fel',                                         +        
               POS=(9,43),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(9,59),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(9,70),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PB-sats',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,19),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(10,30),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Trend(period)',                                        +        
               POS=(10,43),LTH=13,                                     +        
               ATTR=(PROT)                                                      
TRENDUT  DFLD  POS=(10,59),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TECKIN   DFLD  POS=(10,69),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRENDIN  DFLD  POS=(10,71),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Maskinell progn',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(11,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Trend ant.veckor',                                     +        
               POS=(11,43),LTH=16,                                     +        
               ATTR=(PROT)                                                      
TRENDVUT DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRENDVIN DFLD  POS=(11,69),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Datum-trend-just',                                     +        
               POS=(12,43),LTH=16,                                     +        
               ATTR=(PROT)                                                      
TRENDDAT DFLD  POS=(12,62),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Urspårn i följd',                                      +        
               POS=(13,43),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(13,65),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(13,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man Pb-sep hist',                                      +        
               POS=(12,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KVPBHIST DFLD  POS=(12,19),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stora prog fel',                                       +        
               POS=(14,43),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(14,65),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(14,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pbjust-1 CDC prog',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ÅÅVV',                                                 +        
               POS=(16,31),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(16,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pbjust-2 CDC prog',                                    +        
               POS=(16,42),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(16,60),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ÅÅVV',                                                 +        
               POS=(16,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(16,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pbjust-1 CDC uppd',                                    +        
               POS=(17,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(17,21),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0020 DFLD  POS=(17,36),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Pbjust-2 CDC uppd',                                    +        
               POS=(17,42),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(17,61),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0028 DFLD  POS=(17,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0021 DFLD  POS=(18,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(18,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(18,60),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(19,21),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(19,36),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(19,61),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(19,76),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Beställning  14 Graf ordning 15 Prognos inf  16 U-le+        
               v intyg  17 RO/TPO',                                    +        
               POS=(21,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Obekr TPO:er 19 Obekr offert 20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O12301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F123,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I12301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2F123                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=11                                                           
         MFLD  DGIA0002,                                               +        
               LTH=25                                                           
         MFLD  DGIA0015,                                               +        
               LTH=9                                                            
         MFLD  DGIA0016,                                               +        
               LTH=9                                                            
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  DGIA0012,                                               +        
               LTH=9                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  MADTOT,                                                 +        
               LTH=8                                                            
         MFLD  MADTOTIN,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=9                                                            
         MFLD  DGIA0038,                                               +        
               LTH=9                                                            
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0034,                                               +        
               LTH=3                                                            
         MFLD  KVPBHIST,                                               +        
               LTH=9                                                            
         MFLD  DGIA0017,                                               +        
               LTH=9                                                            
         MFLD  DGIA0019,                                               +        
               LTH=4                                                            
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=9                                                            
         MFLD  DGIA0023,                                               +        
               LTH=4                                                            
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=9                                                            
         MFLD  DGIA0027,                                               +        
               LTH=4                                                            
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=9                                                            
         MFLD  DGIA0031,                                               +        
               LTH=4                                                            
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRENDUT,                                                +        
               LTH=9                                                            
         MFLD  TECKIN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRENDIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRENDVUT,                                               +        
               LTH=2                                                            
         MFLD  TRENDVIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRENDDAT,                                               +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I12301 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F123),                                           +        
               OPT=2,                                                  +        
               NXT=W2O12301                                                     
MID      LPAGE SOR=(W2F123)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21231',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MADTOTIN,                                              +        
               '+++++++++'),                                           +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TECKIN,                                                +        
               '?'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRENDIN,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TRENDVIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
