***********************************************************************         
* CREATED BY PC40073   ON 99/02/19  AT 13:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2F104   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T101  ',                                           +        
               2='W2T102  ',                                           +        
               3='W2T103  ',                                           +        
               4='W2T104  ',                                           +        
               5='W2T105  ',                                           +        
               6='W2T106  ',                                           +        
               7='W2T107  ',                                           +        
               8='W2T108  ',                                           +        
               9='W2T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T104U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'O R D E R I N G Å N G',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Per      CDC  DC-vk    Div   Sats',                    +        
               POS=(5,2),LTH=33,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,38),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0322  DFLD  POS=(5,50),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0602  DFLD  POS=(6,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0607  DFLD  POS=(6,07),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0608  DFLD  POS=(6,09),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0615  DFLD  POS=(6,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0629  DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0622  DFLD  POS=(6,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0707  DFLD  POS=(7,07),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0708  DFLD  POS=(7,09),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0715  DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0729  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0722  DFLD  POS=(7,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(7,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0547  DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(7,51),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0555  DFLD  POS=(7,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RULL-12',                                              +        
               POS=(7,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(7,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0571  DFLD  POS=(7,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0807  DFLD  POS=(8,07),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0808  DFLD  POS=(8,09),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0815  DFLD  POS=(8,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0829  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0822  DFLD  POS=(8,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(8,38),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0642  DFLD  POS=(8,42),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0650  DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0658  DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0666  DFLD  POS=(8,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(09,02),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD0907  DFLD  POS=(09,07),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD0908  DFLD  POS=(09,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0915  DFLD  POS=(09,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0929  DFLD  POS=(09,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0922  DFLD  POS=(09,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DCvk',                                                 +        
               POS=(9,37),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0742  DFLD  POS=(9,42),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0750  DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0758  DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0766  DFLD  POS=(9,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1007  DFLD  POS=(10,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1008  DFLD  POS=(10,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1015  DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1029  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1022  DFLD  POS=(10,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sats',                                                 +        
               POS=(10,37),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0842  DFLD  POS=(10,42),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0850  DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0858  DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0866  DFLD  POS=(10,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1107  DFLD  POS=(11,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1108  DFLD  POS=(11,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1115  DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1129  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1122  DFLD  POS=(11,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Div',                                                  +        
               POS=(11,38),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0942  DFLD  POS=(11,42),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0950  DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0958  DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD0966  DFLD  POS=(11,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1207  DFLD  POS=(12,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1208  DFLD  POS=(12,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1215  DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1229  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1222  DFLD  POS=(12,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1307  DFLD  POS=(13,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1308  DFLD  POS=(13,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1315  DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1329  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1322  DFLD  POS=(13,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Snitt 12p Snitt 6p  Gäll PB  Nytt PB',                 +        
               POS=(13,42),LTH=36,                                     +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1407  DFLD  POS=(14,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1408  DFLD  POS=(14,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1415  DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1429  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1422  DFLD  POS=(14,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(14,38),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1344  DFLD  POS=(14,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1353  DFLD  POS=(14,53),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1361  DFLD  POS=(14,61),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1370  DFLD  POS=(14,70),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1502  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1507  DFLD  POS=(15,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1508  DFLD  POS=(15,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1515  DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1529  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1522  DFLD  POS=(15,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(15,39),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1444  DFLD  POS=(15,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1453  DFLD  POS=(15,53),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1461  DFLD  POS=(15,61),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1470  DFLD  POS=(15,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1607  DFLD  POS=(16,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1608  DFLD  POS=(16,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1615  DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1629  DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1622  DFLD  POS=(16,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1707  DFLD  POS=(17,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1708  DFLD  POS=(17,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1715  DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1729  DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1722  DFLD  POS=(17,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'OPB',                                                  +        
               POS=(17,38),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1742  DFLD  POS=(17,42),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Planerat PB',                                          +        
               POS=(17,49),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1661  DFLD  POS=(17,61),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MPB',                                                  +        
               POS=(17,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1676  DFLD  POS=(17,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,02),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0674  DFLD  POS=(18,09),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0774  DFLD  POS=(18,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0974  DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0874  DFLD  POS=(18,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ny',                                                   +        
               POS=(18,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1842  DFLD  POS=(18,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PB Plan Tom',                                          +        
               POS=(18,49),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1763  DFLD  POS=(18,63),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ny',                                                   +        
               POS=(18,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1775  DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1865  DFLD  POS=(19,65),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PB',                                                   +        
               POS=(20,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2007  DFLD  POS=(20,07),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2016  DFLD  POS=(20,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2028  DFLD  POS=(20,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PB låsning tom',                                       +        
               POS=(20,46),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD2063  DFLD  POS=(20,63),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Trend',                                                +        
               POS=(20,72),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ny',                                                   +        
               POS=(21,58),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2163  DFLD  POS=(21,63),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
FLD2172  DFLD  POS=(21,71),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O10401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F104,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I10401,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD1370,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1470,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1676,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1775,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0322,                                                +        
               LTH=25                                                           
         MFLD  FLD1802,                                                +        
               LTH=6                                                            
         MFLD  FLD0602,                                                +        
               LTH=4                                                            
         MFLD  FLD0702,                                                +        
               LTH=4                                                            
         MFLD  FLD0802,                                                +        
               LTH=4                                                            
         MFLD  FLD0902,                                                +        
               LTH=4                                                            
         MFLD  FLD1002,                                                +        
               LTH=4                                                            
         MFLD  FLD1102,                                                +        
               LTH=4                                                            
         MFLD  FLD1202,                                                +        
               LTH=4                                                            
         MFLD  FLD1302,                                                +        
               LTH=4                                                            
         MFLD  FLD1402,                                                +        
               LTH=4                                                            
         MFLD  FLD1502,                                                +        
               LTH=4                                                            
         MFLD  FLD1602,                                                +        
               LTH=4                                                            
         MFLD  FLD1702,                                                +        
               LTH=4                                                            
         MFLD  FLD0607,                                                +        
               LTH=1                                                            
         MFLD  FLD0707,                                                +        
               LTH=1                                                            
         MFLD  FLD0807,                                                +        
               LTH=1                                                            
         MFLD  FLD0907,                                                +        
               LTH=1                                                            
         MFLD  FLD1007,                                                +        
               LTH=1                                                            
         MFLD  FLD1107,                                                +        
               LTH=1                                                            
         MFLD  FLD1207,                                                +        
               LTH=1                                                            
         MFLD  FLD1307,                                                +        
               LTH=1                                                            
         MFLD  FLD1407,                                                +        
               LTH=1                                                            
         MFLD  FLD1507,                                                +        
               LTH=1                                                            
         MFLD  FLD1607,                                                +        
               LTH=1                                                            
         MFLD  FLD1707,                                                +        
               LTH=1                                                            
         MFLD  FLD0608,                                                +        
               LTH=6                                                            
         MFLD  FLD0708,                                                +        
               LTH=6                                                            
         MFLD  FLD0808,                                                +        
               LTH=6                                                            
         MFLD  FLD0908,                                                +        
               LTH=6                                                            
         MFLD  FLD1008,                                                +        
               LTH=6                                                            
         MFLD  FLD1108,                                                +        
               LTH=6                                                            
         MFLD  FLD1208,                                                +        
               LTH=6                                                            
         MFLD  FLD1308,                                                +        
               LTH=6                                                            
         MFLD  FLD1408,                                                +        
               LTH=6                                                            
         MFLD  FLD1508,                                                +        
               LTH=6                                                            
         MFLD  FLD1608,                                                +        
               LTH=6                                                            
         MFLD  FLD1708,                                                +        
               LTH=6                                                            
         MFLD  FLD0615,                                                +        
               LTH=6                                                            
         MFLD  FLD0715,                                                +        
               LTH=6                                                            
         MFLD  FLD0815,                                                +        
               LTH=6                                                            
         MFLD  FLD0915,                                                +        
               LTH=6                                                            
         MFLD  FLD1015,                                                +        
               LTH=6                                                            
         MFLD  FLD1115,                                                +        
               LTH=6                                                            
         MFLD  FLD1215,                                                +        
               LTH=6                                                            
         MFLD  FLD1315,                                                +        
               LTH=6                                                            
         MFLD  FLD1415,                                                +        
               LTH=6                                                            
         MFLD  FLD1515,                                                +        
               LTH=6                                                            
         MFLD  FLD1615,                                                +        
               LTH=6                                                            
         MFLD  FLD1715,                                                +        
               LTH=6                                                            
         MFLD  FLD0622,                                                +        
               LTH=6                                                            
         MFLD  FLD0722,                                                +        
               LTH=6                                                            
         MFLD  FLD0822,                                                +        
               LTH=6                                                            
         MFLD  FLD0922,                                                +        
               LTH=6                                                            
         MFLD  FLD1022,                                                +        
               LTH=6                                                            
         MFLD  FLD1122,                                                +        
               LTH=6                                                            
         MFLD  FLD1222,                                                +        
               LTH=6                                                            
         MFLD  FLD1322,                                                +        
               LTH=6                                                            
         MFLD  FLD1422,                                                +        
               LTH=6                                                            
         MFLD  FLD1522,                                                +        
               LTH=6                                                            
         MFLD  FLD1622,                                                +        
               LTH=6                                                            
         MFLD  FLD1722,                                                +        
               LTH=6                                                            
         MFLD  FLD0629,                                                +        
               LTH=6                                                            
         MFLD  FLD0729,                                                +        
               LTH=6                                                            
         MFLD  FLD0829,                                                +        
               LTH=6                                                            
         MFLD  FLD0929,                                                +        
               LTH=6                                                            
         MFLD  FLD1029,                                                +        
               LTH=6                                                            
         MFLD  FLD1129,                                                +        
               LTH=6                                                            
         MFLD  FLD1229,                                                +        
               LTH=6                                                            
         MFLD  FLD1329,                                                +        
               LTH=6                                                            
         MFLD  FLD1429,                                                +        
               LTH=6                                                            
         MFLD  FLD1529,                                                +        
               LTH=6                                                            
         MFLD  FLD1629,                                                +        
               LTH=6                                                            
         MFLD  FLD1729,                                                +        
               LTH=6                                                            
         MFLD  FLD0674,                                                +        
               LTH=6                                                            
         MFLD  FLD0774,                                                +        
               LTH=6                                                            
         MFLD  FLD0874,                                                +        
               LTH=6                                                            
         MFLD  FLD0974,                                                +        
               LTH=6                                                            
         MFLD  FLD0658,                                                +        
               LTH=7                                                            
         MFLD  FLD0758,                                                +        
               LTH=7                                                            
         MFLD  FLD0858,                                                +        
               LTH=7                                                            
         MFLD  FLD0958,                                                +        
               LTH=7                                                            
         MFLD  FLD0547,                                                +        
               LTH=2                                                            
         MFLD  FLD0642,                                                +        
               LTH=7                                                            
         MFLD  FLD0742,                                                +        
               LTH=7                                                            
         MFLD  FLD0842,                                                +        
               LTH=7                                                            
         MFLD  FLD0942,                                                +        
               LTH=7                                                            
         MFLD  FLD0555,                                                +        
               LTH=2                                                            
         MFLD  FLD0650,                                                +        
               LTH=7                                                            
         MFLD  FLD0750,                                                +        
               LTH=7                                                            
         MFLD  FLD0850,                                                +        
               LTH=7                                                            
         MFLD  FLD0950,                                                +        
               LTH=7                                                            
         MFLD  FLD0571,                                                +        
               LTH=2                                                            
         MFLD  FLD0666,                                                +        
               LTH=7                                                            
         MFLD  FLD0766,                                                +        
               LTH=7                                                            
         MFLD  FLD0866,                                                +        
               LTH=7                                                            
         MFLD  FLD0966,                                                +        
               LTH=7                                                            
         MFLD  FLD1344,                                                +        
               LTH=7                                                            
         MFLD  FLD1444,                                                +        
               LTH=7                                                            
         MFLD  FLD1353,                                                +        
               LTH=7                                                            
         MFLD  FLD1453,                                                +        
               LTH=7                                                            
         MFLD  FLD1361,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1461,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1742,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1842,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1661,                                                +        
               LTH=8                                                            
         MFLD  FLD1763,                                                +        
               LTH=6                                                            
         MFLD  FLD1865,                                                +        
               LTH=4                                                            
         MFLD  FLD2007,                                                +        
               LTH=8                                                            
         MFLD  FLD2016,                                                +        
               LTH=8                                                            
         MFLD  FLD2028,                                                +        
               LTH=8                                                            
         MFLD  FLD2063,                                                +        
               LTH=6                                                            
         MFLD  FLD2163,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2172,                                                +        
               LTH=9                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I10401 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F104),                                           +        
               OPT=2,                                                  +        
               NXT=W2O10401                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21041',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1370,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1470,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1775,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1842,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2163,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
