***********************************************************************         
* CREATED BY V040073   ON 01/06/08  AT 13:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LARM EMIL                       '                               
W2F172   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551u ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W2T172 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T172 7',                                           +        
               8='W2T172 8',                                           +        
               9='W2T172 9',                                           +        
               10='WHELP   ',                                          +        
               11='W2T172U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T171  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W2T172 4',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T172u ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2F172   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DELIVERY DEVIATION',                                   +        
               POS=(1,13),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'P.planner',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
ANSKNRI  DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Supplier',                                             +        
               POS=(2,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
LEVNI    DFLD  POS=(2,26),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Errorcode',                                            +        
               POS=(2,33),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ORSKI    DFLD  POS=(2,43),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partnumber',                                           +        
               POS=(2,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ARTIN    DFLD  POS=(2,59),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'OHF',                                                  +        
               POS=(2,69),LTH=3,                                       +        
               ATTR=(PROT)                                                      
OTFREKI  DFLD  POS=(2,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANSKNRO  DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNO    DFLD  POS=(3,26),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ORSKO    DFLD  POS=(3,43),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTUT    DFLD  POS=(3,59),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
OTFREKO  DFLD  POS=(3,73),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'P.adv/',                                               +        
               POS=(4,67),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S-D N  Part No. Supp. Deviation',                      +        
               POS=(5,2),LTH=31,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'OHF',                                                  +        
               POS=(5,48),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Alarmd Plan.d   G.rec  Plan Q',                        +        
               POS=(5,52),LTH=29,                                      +        
               ATTR=(PROT)                                                      
SB01     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
NY01     DFLD  POS=(6,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ARTNR01  DFLD  POS=(6,8),LTH=9,                                        +        
               ATTR=(PROT)                                                      
LEVNR01  DFLD  POS=(6,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ORS01    DFLD  POS=(6,24),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK01 DFLD  POS=(6,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LDAT01   DFLD  POS=(6,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PDAT01   DFLD  POS=(6,59),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVIS01   DFLD  POS=(6,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PLAN01   DFLD  POS=(6,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
SB02     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
NY02     DFLD  POS=(7,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ARTNR02  DFLD  POS=(7,8),LTH=9,                                        +        
               ATTR=(PROT)                                                      
LEVNR02  DFLD  POS=(7,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ORS02    DFLD  POS=(7,24),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK02 DFLD  POS=(7,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LDAT02   DFLD  POS=(7,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PDAT02   DFLD  POS=(7,59),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVIS02   DFLD  POS=(7,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PLAN02   DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
SB03     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
NY03     DFLD  POS=(8,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ARTNR03  DFLD  POS=(8,8),LTH=9,                                        +        
               ATTR=(PROT)                                                      
LEVNR03  DFLD  POS=(8,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ORS03    DFLD  POS=(8,24),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK03 DFLD  POS=(8,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LDAT03   DFLD  POS=(8,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PDAT03   DFLD  POS=(8,59),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVIS03   DFLD  POS=(8,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PLAN03   DFLD  POS=(8,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
SB04     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
NY04     DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ARTNR04  DFLD  POS=(9,8),LTH=9,                                        +        
               ATTR=(PROT)                                                      
LEVNR04  DFLD  POS=(9,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ORS04    DFLD  POS=(9,24),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK04 DFLD  POS=(9,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LDAT04   DFLD  POS=(9,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PDAT04   DFLD  POS=(9,59),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVIS04   DFLD  POS=(9,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PLAN04   DFLD  POS=(9,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
SB05     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY05     DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR05  DFLD  POS=(10,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR05  DFLD  POS=(10,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS05    DFLD  POS=(10,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK05 DFLD  POS=(10,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT05   DFLD  POS=(10,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT05   DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS05   DFLD  POS=(10,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN05   DFLD  POS=(10,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB06     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY06     DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR06  DFLD  POS=(11,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR06  DFLD  POS=(11,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS06    DFLD  POS=(11,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK06 DFLD  POS=(11,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT06   DFLD  POS=(11,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT06   DFLD  POS=(11,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS06   DFLD  POS=(11,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN06   DFLD  POS=(11,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB07     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY07     DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR07  DFLD  POS=(12,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR07  DFLD  POS=(12,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS07    DFLD  POS=(12,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK07 DFLD  POS=(12,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT07   DFLD  POS=(12,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT07   DFLD  POS=(12,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS07   DFLD  POS=(12,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN07   DFLD  POS=(12,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB08     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY08     DFLD  POS=(13,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR08  DFLD  POS=(13,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR08  DFLD  POS=(13,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS08    DFLD  POS=(13,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK08 DFLD  POS=(13,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT08   DFLD  POS=(13,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT08   DFLD  POS=(13,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS08   DFLD  POS=(13,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN08   DFLD  POS=(13,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB09     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY09     DFLD  POS=(14,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR09  DFLD  POS=(14,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR09  DFLD  POS=(14,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS09    DFLD  POS=(14,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK09 DFLD  POS=(14,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT09   DFLD  POS=(14,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT09   DFLD  POS=(14,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS09   DFLD  POS=(14,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN09   DFLD  POS=(14,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB10     DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY10     DFLD  POS=(15,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR10  DFLD  POS=(15,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR10  DFLD  POS=(15,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS10    DFLD  POS=(15,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK10 DFLD  POS=(15,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT10   DFLD  POS=(15,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT10   DFLD  POS=(15,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS10   DFLD  POS=(15,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN10   DFLD  POS=(15,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB11     DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY11     DFLD  POS=(16,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR11  DFLD  POS=(16,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR11  DFLD  POS=(16,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS11    DFLD  POS=(16,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK11 DFLD  POS=(16,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT11   DFLD  POS=(16,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT11   DFLD  POS=(16,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS11   DFLD  POS=(16,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN11   DFLD  POS=(16,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB12     DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY12     DFLD  POS=(17,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR12  DFLD  POS=(17,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR12  DFLD  POS=(17,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS12    DFLD  POS=(17,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK12 DFLD  POS=(17,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT12   DFLD  POS=(17,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT12   DFLD  POS=(17,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS12   DFLD  POS=(17,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN12   DFLD  POS=(17,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB13     DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY13     DFLD  POS=(18,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR13  DFLD  POS=(18,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR13  DFLD  POS=(18,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS13    DFLD  POS=(18,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK13 DFLD  POS=(18,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT13   DFLD  POS=(18,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT13   DFLD  POS=(18,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS13   DFLD  POS=(18,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN13   DFLD  POS=(18,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB14     DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY14     DFLD  POS=(19,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR14  DFLD  POS=(19,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR14  DFLD  POS=(19,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS14    DFLD  POS=(19,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK14 DFLD  POS=(19,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT14   DFLD  POS=(19,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT14   DFLD  POS=(19,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS14   DFLD  POS=(19,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN14   DFLD  POS=(19,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
SB15     DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
NY15     DFLD  POS=(20,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR15  DFLD  POS=(20,8),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNR15  DFLD  POS=(20,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORS15    DFLD  POS=(20,24),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK15 DFLD  POS=(20,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LDAT15   DFLD  POS=(20,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PDAT15   DFLD  POS=(20,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVIS15   DFLD  POS=(20,66),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PLAN15   DFLD  POS=(20,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Alarm',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIMME    DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O17201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F172,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I17201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2F172                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ANSKNRI,                                                +        
               LTH=3                                                            
         MFLD  ANSKNRO,                                                +        
               LTH=3                                                            
         MFLD  LEVNI,                                                  +        
               LTH=5                                                            
         MFLD  LEVNO,                                                  +        
               LTH=5                                                            
         MFLD  ORSKI,                                                  +        
               LTH=3                                                            
         MFLD  ORSKO,                                                  +        
               LTH=3                                                            
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  OTFREKI,                                                +        
               LTH=1                                                            
         MFLD  OTFREKO,                                                +        
               LTH=1                                                            
         MFLD  SB01,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY01,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR01,                                                +        
               LTH=9                                                            
         MFLD  LEVNR01,                                                +        
               LTH=5                                                            
         MFLD  ORS01,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK01,                                               +        
               LTH=1                                                            
         MFLD  LDAT01,                                                 +        
               LTH=6                                                            
         MFLD  PDAT01,                                                 +        
               LTH=6                                                            
         MFLD  AVIS01,                                                 +        
               LTH=7                                                            
         MFLD  PLAN01,                                                 +        
               LTH=7                                                            
         MFLD  SB02,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY02,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR02,                                                +        
               LTH=9                                                            
         MFLD  LEVNR02,                                                +        
               LTH=5                                                            
         MFLD  ORS02,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK02,                                               +        
               LTH=1                                                            
         MFLD  LDAT02,                                                 +        
               LTH=6                                                            
         MFLD  PDAT02,                                                 +        
               LTH=6                                                            
         MFLD  AVIS02,                                                 +        
               LTH=7                                                            
         MFLD  PLAN02,                                                 +        
               LTH=7                                                            
         MFLD  SB03,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY03,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR03,                                                +        
               LTH=9                                                            
         MFLD  LEVNR03,                                                +        
               LTH=5                                                            
         MFLD  ORS03,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK03,                                               +        
               LTH=1                                                            
         MFLD  LDAT03,                                                 +        
               LTH=6                                                            
         MFLD  PDAT03,                                                 +        
               LTH=6                                                            
         MFLD  AVIS03,                                                 +        
               LTH=7                                                            
         MFLD  PLAN03,                                                 +        
               LTH=7                                                            
         MFLD  SB04,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY04,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR04,                                                +        
               LTH=9                                                            
         MFLD  LEVNR04,                                                +        
               LTH=5                                                            
         MFLD  ORS04,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK04,                                               +        
               LTH=1                                                            
         MFLD  LDAT04,                                                 +        
               LTH=6                                                            
         MFLD  PDAT04,                                                 +        
               LTH=6                                                            
         MFLD  AVIS04,                                                 +        
               LTH=7                                                            
         MFLD  PLAN04,                                                 +        
               LTH=7                                                            
         MFLD  SB05,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY05,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR05,                                                +        
               LTH=9                                                            
         MFLD  LEVNR05,                                                +        
               LTH=5                                                            
         MFLD  ORS05,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK05,                                               +        
               LTH=1                                                            
         MFLD  LDAT05,                                                 +        
               LTH=6                                                            
         MFLD  PDAT05,                                                 +        
               LTH=6                                                            
         MFLD  AVIS05,                                                 +        
               LTH=7                                                            
         MFLD  PLAN05,                                                 +        
               LTH=7                                                            
         MFLD  SB06,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY06,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR06,                                                +        
               LTH=9                                                            
         MFLD  LEVNR06,                                                +        
               LTH=5                                                            
         MFLD  ORS06,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK06,                                               +        
               LTH=1                                                            
         MFLD  LDAT06,                                                 +        
               LTH=6                                                            
         MFLD  PDAT06,                                                 +        
               LTH=6                                                            
         MFLD  AVIS06,                                                 +        
               LTH=7                                                            
         MFLD  PLAN06,                                                 +        
               LTH=7                                                            
         MFLD  SB07,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY07,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR07,                                                +        
               LTH=9                                                            
         MFLD  LEVNR07,                                                +        
               LTH=5                                                            
         MFLD  ORS07,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK07,                                               +        
               LTH=1                                                            
         MFLD  LDAT07,                                                 +        
               LTH=6                                                            
         MFLD  PDAT07,                                                 +        
               LTH=6                                                            
         MFLD  AVIS07,                                                 +        
               LTH=7                                                            
         MFLD  PLAN07,                                                 +        
               LTH=7                                                            
         MFLD  SB08,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY08,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR08,                                                +        
               LTH=9                                                            
         MFLD  LEVNR08,                                                +        
               LTH=5                                                            
         MFLD  ORS08,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK08,                                               +        
               LTH=1                                                            
         MFLD  LDAT08,                                                 +        
               LTH=6                                                            
         MFLD  PDAT08,                                                 +        
               LTH=6                                                            
         MFLD  AVIS08,                                                 +        
               LTH=7                                                            
         MFLD  PLAN08,                                                 +        
               LTH=7                                                            
         MFLD  SB09,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY09,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR09,                                                +        
               LTH=9                                                            
         MFLD  LEVNR09,                                                +        
               LTH=5                                                            
         MFLD  ORS09,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK09,                                               +        
               LTH=1                                                            
         MFLD  LDAT09,                                                 +        
               LTH=6                                                            
         MFLD  PDAT09,                                                 +        
               LTH=6                                                            
         MFLD  AVIS09,                                                 +        
               LTH=7                                                            
         MFLD  PLAN09,                                                 +        
               LTH=7                                                            
         MFLD  SB10,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY10,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  LEVNR10,                                                +        
               LTH=5                                                            
         MFLD  ORS10,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK10,                                               +        
               LTH=1                                                            
         MFLD  LDAT10,                                                 +        
               LTH=6                                                            
         MFLD  PDAT10,                                                 +        
               LTH=6                                                            
         MFLD  AVIS10,                                                 +        
               LTH=7                                                            
         MFLD  PLAN10,                                                 +        
               LTH=7                                                            
         MFLD  SB11,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY11,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  LEVNR11,                                                +        
               LTH=5                                                            
         MFLD  ORS11,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK11,                                               +        
               LTH=1                                                            
         MFLD  LDAT11,                                                 +        
               LTH=6                                                            
         MFLD  PDAT11,                                                 +        
               LTH=6                                                            
         MFLD  AVIS11,                                                 +        
               LTH=7                                                            
         MFLD  PLAN11,                                                 +        
               LTH=7                                                            
         MFLD  SB12,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY12,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  LEVNR12,                                                +        
               LTH=5                                                            
         MFLD  ORS12,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK12,                                               +        
               LTH=1                                                            
         MFLD  LDAT12,                                                 +        
               LTH=6                                                            
         MFLD  PDAT12,                                                 +        
               LTH=6                                                            
         MFLD  AVIS12,                                                 +        
               LTH=7                                                            
         MFLD  PLAN12,                                                 +        
               LTH=7                                                            
         MFLD  SB13,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY13,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  LEVNR13,                                                +        
               LTH=5                                                            
         MFLD  ORS13,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK13,                                               +        
               LTH=1                                                            
         MFLD  LDAT13,                                                 +        
               LTH=6                                                            
         MFLD  PDAT13,                                                 +        
               LTH=6                                                            
         MFLD  AVIS13,                                                 +        
               LTH=7                                                            
         MFLD  PLAN13,                                                 +        
               LTH=7                                                            
         MFLD  SB14,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY14,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  LEVNR14,                                                +        
               LTH=5                                                            
         MFLD  ORS14,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK14,                                               +        
               LTH=1                                                            
         MFLD  LDAT14,                                                 +        
               LTH=6                                                            
         MFLD  PDAT14,                                                 +        
               LTH=6                                                            
         MFLD  AVIS14,                                                 +        
               LTH=7                                                            
         MFLD  PLAN14,                                                 +        
               LTH=7                                                            
         MFLD  SB15,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NY15,                                                   +        
               LTH=1                                                            
         MFLD  ARTNR15,                                                +        
               LTH=9                                                            
         MFLD  LEVNR15,                                                +        
               LTH=5                                                            
         MFLD  ORS15,                                                  +        
               LTH=25                                                           
         MFLD  OTFREK15,                                               +        
               LTH=1                                                            
         MFLD  LDAT15,                                                 +        
               LTH=6                                                            
         MFLD  PDAT15,                                                 +        
               LTH=6                                                            
         MFLD  AVIS15,                                                 +        
               LTH=7                                                            
         MFLD  PLAN15,                                                 +        
               LTH=7                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIMME,                                                 +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I17201 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F172),                                           +        
               OPT=2,                                                  +        
               NXT=W2O17201                                                     
MID      LPAGE SOR=(W2F172)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21721',                                                +        
               LTH=5                                                            
         MFLD  (ANSKNRI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANSKNRO,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNI,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNO,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ORSKI,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORSKO,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTUT,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OTFREKI,                                               +        
               '+++++'),                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OTFREKO,                                               +        
               '+++++'),                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB01,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB02,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB03,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB04,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB05,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB06,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB07,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB08,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB09,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB10,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB11,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB12,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB13,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB14,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SB15,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
