***********************************************************************         
* CREATED BY V040073   ON 100128                                                
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Parametrar för automatskrot av 01-märkta artiklar'              
W2F148   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T148 7',                                           +        
               8='W2T148 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T148U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2F148   DPAGE CURSOR=((19,9)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Styr aut.skrot 01-märkta art.',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Cmd  Produkt Ant period OI -behov',                    +        
               POS=(3,02),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ant period OI -värde Ant period OI -historik',         +        
               POS=(3,36),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '     slag    Ers / Tillk artikel',                     +        
               POS=(4,02),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ers artikel          Ers artikel  ',                   +        
               POS=(4,36),LTH=40,                                      +        
               ATTR=(PROT)                                                      
CMD01    DFLD  POS=(06,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS01  DFLD  POS=(06,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS01  DFLD  POS=(06,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK01  DFLD  POS=(06,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS01  DFLD  POS=(06,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS01  DFLD  POS=(06,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD02    DFLD  POS=(07,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS02  DFLD  POS=(07,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS02  DFLD  POS=(07,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK02  DFLD  POS=(07,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS02  DFLD  POS=(07,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS02  DFLD  POS=(07,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD03    DFLD  POS=(08,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS03  DFLD  POS=(08,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS03  DFLD  POS=(08,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK03  DFLD  POS=(08,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS03  DFLD  POS=(08,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS03  DFLD  POS=(08,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD04    DFLD  POS=(09,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS04  DFLD  POS=(09,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS04  DFLD  POS=(09,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK04  DFLD  POS=(09,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS04  DFLD  POS=(09,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS04  DFLD  POS=(09,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD05    DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS05  DFLD  POS=(10,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS05  DFLD  POS=(10,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK05  DFLD  POS=(10,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS05  DFLD  POS=(10,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS05  DFLD  POS=(10,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD06    DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS06  DFLD  POS=(11,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS06  DFLD  POS=(11,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK06  DFLD  POS=(11,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS06  DFLD  POS=(11,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS06  DFLD  POS=(11,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD07    DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS07  DFLD  POS=(12,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS07  DFLD  POS=(12,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK07  DFLD  POS=(12,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS07  DFLD  POS=(12,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS07  DFLD  POS=(12,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD08    DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS08  DFLD  POS=(13,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS08  DFLD  POS=(13,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK08  DFLD  POS=(13,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS08  DFLD  POS=(13,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS08  DFLD  POS=(13,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD09    DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS09  DFLD  POS=(14,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS09  DFLD  POS=(14,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK09  DFLD  POS=(14,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS09  DFLD  POS=(14,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS09  DFLD  POS=(14,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRODS10  DFLD  POS=(15,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEERS10  DFLD  POS=(15,16),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
BTILK10  DFLD  POS=(15,21),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
VAERS10  DFLD  POS=(15,37),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
HIERS10  DFLD  POS=(15,57),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Uppdatering ',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PRODSU   DFLD  POS=(19,9),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
BEERSU   DFLD  POS=(19,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
BTILKU   DFLD  POS=(19,21),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
VAERSU   DFLD  POS=(19,37),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
HIERSU   DFLD  POS=(19,57),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'F1 Hjälpsida  F7 Första sida  F8 Nästa sida',          +        
               POS=(21,4),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10 WHELP  F11 Uppdat ',                               +        
               POS=(21,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W2I14801 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F148),                                           +        
               OPT=2,                                                  +        
               NXT=W2O14801                                                     
MID      LPAGE SOR=(W2F148)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21481',                                                +        
               LTH=5                                                            
         MFLD  (CMD01,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS01,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD02,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS02,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD03,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS03,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD04,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS04,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD05,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS05,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD06,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS06,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD07,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS07,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD08,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS08,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD09,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS09,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODS10,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSU,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEERSU,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BTILKU,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VAERSU,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HIERSU,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W2O14801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F148,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I14801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2F148                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  CMD01,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS01,                                                +        
               LTH=2                                                            
         MFLD  BEERS01,                                                +        
               LTH=2                                                            
         MFLD  BTILK01,                                                +        
               LTH=2                                                            
         MFLD  VAERS01,                                                +        
               LTH=2                                                            
         MFLD  HIERS01,                                                +        
               LTH=2                                                            
         MFLD  CMD02,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS02,                                                +        
               LTH=2                                                            
         MFLD  BEERS02,                                                +        
               LTH=2                                                            
         MFLD  BTILK02,                                                +        
               LTH=2                                                            
         MFLD  VAERS02,                                                +        
               LTH=2                                                            
         MFLD  HIERS02,                                                +        
               LTH=2                                                            
         MFLD  CMD03,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS03,                                                +        
               LTH=2                                                            
         MFLD  BEERS03,                                                +        
               LTH=2                                                            
         MFLD  BTILK03,                                                +        
               LTH=2                                                            
         MFLD  VAERS03,                                                +        
               LTH=2                                                            
         MFLD  HIERS03,                                                +        
               LTH=2                                                            
         MFLD  CMD04,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS04,                                                +        
               LTH=2                                                            
         MFLD  BEERS04,                                                +        
               LTH=2                                                            
         MFLD  BTILK04,                                                +        
               LTH=2                                                            
         MFLD  VAERS04,                                                +        
               LTH=2                                                            
         MFLD  HIERS04,                                                +        
               LTH=2                                                            
         MFLD  CMD05,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS05,                                                +        
               LTH=2                                                            
         MFLD  BEERS05,                                                +        
               LTH=2                                                            
         MFLD  BTILK05,                                                +        
               LTH=2                                                            
         MFLD  VAERS05,                                                +        
               LTH=2                                                            
         MFLD  HIERS05,                                                +        
               LTH=2                                                            
         MFLD  CMD06,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS06,                                                +        
               LTH=2                                                            
         MFLD  BEERS06,                                                +        
               LTH=2                                                            
         MFLD  BTILK06,                                                +        
               LTH=2                                                            
         MFLD  VAERS06,                                                +        
               LTH=2                                                            
         MFLD  HIERS06,                                                +        
               LTH=2                                                            
         MFLD  CMD07,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS07,                                                +        
               LTH=2                                                            
         MFLD  BEERS07,                                                +        
               LTH=2                                                            
         MFLD  BTILK07,                                                +        
               LTH=2                                                            
         MFLD  VAERS07,                                                +        
               LTH=2                                                            
         MFLD  HIERS07,                                                +        
               LTH=2                                                            
         MFLD  CMD08,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS08,                                                +        
               LTH=2                                                            
         MFLD  BEERS08,                                                +        
               LTH=2                                                            
         MFLD  BTILK08,                                                +        
               LTH=2                                                            
         MFLD  VAERS08,                                                +        
               LTH=2                                                            
         MFLD  HIERS08,                                                +        
               LTH=2                                                            
         MFLD  CMD09,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS09,                                                +        
               LTH=2                                                            
         MFLD  BEERS09,                                                +        
               LTH=2                                                            
         MFLD  BTILK09,                                                +        
               LTH=2                                                            
         MFLD  VAERS09,                                                +        
               LTH=2                                                            
         MFLD  HIERS09,                                                +        
               LTH=2                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODS10,                                                +        
               LTH=2                                                            
         MFLD  BEERS10,                                                +        
               LTH=2                                                            
         MFLD  BTILK10,                                                +        
               LTH=2                                                            
         MFLD  VAERS10,                                                +        
               LTH=2                                                            
         MFLD  HIERS10,                                                +        
               LTH=2                                                            
         MFLD  PRODSU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEERSU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BTILKU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAERSU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HIERSU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
