***********************************************************************         
* CREATED BY R0C3633   ON 91/05/30  AT 12:46                                    
***********************************************************************         
         TITLE 'SATSER I ORDERKÖ                '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W2F301   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T301 7',                                           +        
               8='W2T301 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T301  ',                                          +        
               14='W2T302  ',                                          +        
               15='W2T303  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SATSER I ORDERKÖ',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'F AG',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDANSKFI DFLD  POS=(2,7),LTH=3,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T AG',                                                 +        
               POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSKTI DFLD  POS=(2,16),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Bb',                                                   +        
               POS=(2,20),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLBYGGBI DFLD  POS=(2,23),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Artnr',                                                +        
               POS=(2,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,31),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Order',                                               +        
               POS=(2,41),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNSI DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ing artnr',                                            +        
               POS=(2,54),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
IIDARTNI DFLD  POS=(2,64),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Komb',                                                 +        
               POS=(2,74),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDSATKMI DFLD  POS=(2,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSKFU DFLD  POS=(3,7),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
IDANSKTU DFLD  POS=(3,16),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLBYGGBU DFLD  POS=(3,23),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,31),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,41),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDORDNSU DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IIDARTNU DFLD  POS=(3,64),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KDSATKMU DFLD  POS=(3,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDANSKE  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDANSKN  DFLD  POS=(4,6),LTH=3,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRE DFLD  POS=(4,10),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRN DFLD  POS=(4,20),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDNSE DFLD  POS=(4,30),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDNSN DFLD  POS=(4,36),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TIREGDAE DFLD  POS=(4,42),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TIREGDAN DFLD  POS=(4,49),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLBYGGBE DFLD  POS=(4,56),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLBYGGBN DFLD  POS=(4,58),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'S   Ag   Artikelnr  Order  Regdat    Bpdat    Antal Byg+        
               gbara  CL   PRC Bb/U',                                  +        
               POS=(5,3),LTH=75,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0028 DFLD  POS=(6,6),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0042 DFLD  POS=(6,10),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0056 DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0140 DFLD  POS=(6,30),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0126 DFLD  POS=(6,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0098 DFLD  POS=(6,47),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0112 DFLD  POS=(6,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0084 DFLD  POS=(6,66),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0070 DFLD  POS=(6,69),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(6,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0029 DFLD  POS=(7,6),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0043 DFLD  POS=(7,10),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0057 DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0141 DFLD  POS=(7,30),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0127 DFLD  POS=(7,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0099 DFLD  POS=(7,47),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0113 DFLD  POS=(7,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0085 DFLD  POS=(7,66),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0071 DFLD  POS=(7,69),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0030 DFLD  POS=(8,6),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0044 DFLD  POS=(8,10),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0058 DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0142 DFLD  POS=(8,30),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0128 DFLD  POS=(8,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0100 DFLD  POS=(8,47),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0114 DFLD  POS=(8,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0086 DFLD  POS=(8,66),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0072 DFLD  POS=(8,69),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0031 DFLD  POS=(9,6),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0045 DFLD  POS=(9,10),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0059 DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0143 DFLD  POS=(9,30),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0129 DFLD  POS=(9,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0101 DFLD  POS=(9,47),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0115 DFLD  POS=(9,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0087 DFLD  POS=(9,66),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0073 DFLD  POS=(9,69),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0032 DFLD  POS=(10,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0046 DFLD  POS=(10,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0060 DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0144 DFLD  POS=(10,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0130 DFLD  POS=(10,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0102 DFLD  POS=(10,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0116 DFLD  POS=(10,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0088 DFLD  POS=(10,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0074 DFLD  POS=(10,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0033 DFLD  POS=(11,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0047 DFLD  POS=(11,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0061 DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0145 DFLD  POS=(11,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0131 DFLD  POS=(11,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0103 DFLD  POS=(11,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0117 DFLD  POS=(11,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0089 DFLD  POS=(11,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0075 DFLD  POS=(11,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(12,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0048 DFLD  POS=(12,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0062 DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0146 DFLD  POS=(12,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0132 DFLD  POS=(12,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0104 DFLD  POS=(12,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0118 DFLD  POS=(12,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0090 DFLD  POS=(12,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0076 DFLD  POS=(12,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0035 DFLD  POS=(13,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0049 DFLD  POS=(13,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0063 DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0147 DFLD  POS=(13,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0133 DFLD  POS=(13,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0105 DFLD  POS=(13,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0119 DFLD  POS=(13,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0091 DFLD  POS=(13,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0077 DFLD  POS=(13,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0036 DFLD  POS=(14,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0050 DFLD  POS=(14,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0064 DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0148 DFLD  POS=(14,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0134 DFLD  POS=(14,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0106 DFLD  POS=(14,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0120 DFLD  POS=(14,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0092 DFLD  POS=(14,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(14,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0037 DFLD  POS=(15,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0051 DFLD  POS=(15,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0065 DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0149 DFLD  POS=(15,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0135 DFLD  POS=(15,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0107 DFLD  POS=(15,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0121 DFLD  POS=(15,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0093 DFLD  POS=(15,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(15,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0038 DFLD  POS=(16,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0052 DFLD  POS=(16,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0066 DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0150 DFLD  POS=(16,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0136 DFLD  POS=(16,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(16,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0122 DFLD  POS=(16,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0094 DFLD  POS=(16,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(16,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0039 DFLD  POS=(17,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0053 DFLD  POS=(17,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0067 DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0151 DFLD  POS=(17,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0137 DFLD  POS=(17,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0109 DFLD  POS=(17,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0123 DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0095 DFLD  POS=(17,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(17,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0040 DFLD  POS=(18,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0054 DFLD  POS=(18,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0068 DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0152 DFLD  POS=(18,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0138 DFLD  POS=(18,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0110 DFLD  POS=(18,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0124 DFLD  POS=(18,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0096 DFLD  POS=(18,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(18,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0026 DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0041 DFLD  POS=(19,6),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0055 DFLD  POS=(19,10),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0069 DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0153 DFLD  POS=(19,30),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0139 DFLD  POS=(19,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0111 DFLD  POS=(19,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0125 DFLD  POS=(19,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0097 DFLD  POS=(19,66),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(19,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0027 DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Sats ordkö  14 Satsord åtg   15 Satsrad åtg 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I30101 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F301),                                           +        
               OPT=2,                                                  +        
               NXT=W2O30101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23011',                                                +        
               LTH=5                                                            
         MFLD  (IDANSKFI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDANSKFU,                                               +        
               LTH=3                                                            
         MFLD  (IDANSKTI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDANSKTU,                                               +        
               LTH=3                                                            
         MFLD  (FLBYGGBI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLBYGGBU,                                               +        
               LTH=1                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDORDNSI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNSU,                                               +        
               LTH=5                                                            
         MFLD  (IIDARTNI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IIDARTNU,                                               +        
               LTH=9                                                            
         MFLD  (KDSATKMI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KDSATKMU,                                               +        
               LTH=1                                                            
         MFLD  IDANSKE,                                                +        
               LTH=3                                                            
         MFLD  IDANSKN,                                                +        
               LTH=3                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDORDNSE,                                               +        
               LTH=5                                                            
         MFLD  IDORDNSN,                                               +        
               LTH=5                                                            
         MFLD  TIREGDAE,                                               +        
               LTH=6                                                            
         MFLD  TIREGDAN,                                               +        
               LTH=6                                                            
         MFLD  FLBYGGBE,                                               +        
               LTH=1                                                            
         MFLD  FLBYGGBN,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=1                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=1                                                            
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  DGIA0056,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  DGIA0065,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=5                                                            
         MFLD  DGIA0067,                                               +        
               LTH=5                                                            
         MFLD  DGIA0068,                                               +        
               LTH=5                                                            
         MFLD  DGIA0069,                                               +        
               LTH=5                                                            
         MSGEND                                                                 
W2O30101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F301,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I30101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDANSKFI,                                               +        
               LTH=3                                                            
         MFLD  IDANSKTI,                                               +        
               LTH=3                                                            
         MFLD  FLBYGGBI,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDORDNSI,                                               +        
               LTH=5                                                            
         MFLD  IIDARTNI,                                               +        
               LTH=9                                                            
         MFLD  KDSATKMI,                                               +        
               LTH=1                                                            
         MFLD  IDANSKFU,                                               +        
               LTH=3                                                            
         MFLD  IDANSKTU,                                               +        
               LTH=3                                                            
         MFLD  FLBYGGBU,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDORDNSU,                                               +        
               LTH=5                                                            
         MFLD  IIDARTNU,                                               +        
               LTH=9                                                            
         MFLD  KDSATKMU,                                               +        
               LTH=1                                                            
         MFLD  IDANSKE,                                                +        
               LTH=3                                                            
         MFLD  IDANSKN,                                                +        
               LTH=3                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDORDNSE,                                               +        
               LTH=5                                                            
         MFLD  IDORDNSN,                                               +        
               LTH=5                                                            
         MFLD  TIREGDAE,                                               +        
               LTH=6                                                            
         MFLD  TIREGDAN,                                               +        
               LTH=6                                                            
         MFLD  FLBYGGBE,                                               +        
               LTH=1                                                            
         MFLD  FLBYGGBN,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=1                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=1                                                            
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  DGIA0028,                                               +        
               LTH=3                                                            
         MFLD  DGIA0029,                                               +        
               LTH=3                                                            
         MFLD  DGIA0030,                                               +        
               LTH=3                                                            
         MFLD  DGIA0031,                                               +        
               LTH=3                                                            
         MFLD  DGIA0032,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0034,                                               +        
               LTH=3                                                            
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  DGIA0037,                                               +        
               LTH=3                                                            
         MFLD  DGIA0038,                                               +        
               LTH=3                                                            
         MFLD  DGIA0039,                                               +        
               LTH=3                                                            
         MFLD  DGIA0040,                                               +        
               LTH=3                                                            
         MFLD  DGIA0041,                                               +        
               LTH=3                                                            
         MFLD  DGIA0042,                                               +        
               LTH=11                                                           
         MFLD  DGIA0043,                                               +        
               LTH=11                                                           
         MFLD  DGIA0044,                                               +        
               LTH=11                                                           
         MFLD  DGIA0045,                                               +        
               LTH=11                                                           
         MFLD  DGIA0046,                                               +        
               LTH=11                                                           
         MFLD  DGIA0047,                                               +        
               LTH=11                                                           
         MFLD  DGIA0048,                                               +        
               LTH=11                                                           
         MFLD  DGIA0049,                                               +        
               LTH=11                                                           
         MFLD  DGIA0050,                                               +        
               LTH=11                                                           
         MFLD  DGIA0051,                                               +        
               LTH=11                                                           
         MFLD  DGIA0052,                                               +        
               LTH=11                                                           
         MFLD  DGIA0053,                                               +        
               LTH=11                                                           
         MFLD  DGIA0054,                                               +        
               LTH=11                                                           
         MFLD  DGIA0055,                                               +        
               LTH=11                                                           
         MFLD  DGIA0056,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  DGIA0065,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=5                                                            
         MFLD  DGIA0067,                                               +        
               LTH=5                                                            
         MFLD  DGIA0068,                                               +        
               LTH=5                                                            
         MFLD  DGIA0069,                                               +        
               LTH=5                                                            
         MFLD  DGIA0140,                                               +        
               LTH=6                                                            
         MFLD  DGIA0141,                                               +        
               LTH=6                                                            
         MFLD  DGIA0142,                                               +        
               LTH=6                                                            
         MFLD  DGIA0143,                                               +        
               LTH=6                                                            
         MFLD  DGIA0144,                                               +        
               LTH=6                                                            
         MFLD  DGIA0145,                                               +        
               LTH=6                                                            
         MFLD  DGIA0146,                                               +        
               LTH=6                                                            
         MFLD  DGIA0147,                                               +        
               LTH=6                                                            
         MFLD  DGIA0148,                                               +        
               LTH=6                                                            
         MFLD  DGIA0149,                                               +        
               LTH=6                                                            
         MFLD  DGIA0150,                                               +        
               LTH=6                                                            
         MFLD  DGIA0151,                                               +        
               LTH=6                                                            
         MFLD  DGIA0152,                                               +        
               LTH=6                                                            
         MFLD  DGIA0153,                                               +        
               LTH=6                                                            
         MFLD  DGIA0126,                                               +        
               LTH=6                                                            
         MFLD  DGIA0127,                                               +        
               LTH=6                                                            
         MFLD  DGIA0128,                                               +        
               LTH=6                                                            
         MFLD  DGIA0129,                                               +        
               LTH=6                                                            
         MFLD  DGIA0130,                                               +        
               LTH=6                                                            
         MFLD  DGIA0131,                                               +        
               LTH=6                                                            
         MFLD  DGIA0132,                                               +        
               LTH=6                                                            
         MFLD  DGIA0133,                                               +        
               LTH=6                                                            
         MFLD  DGIA0134,                                               +        
               LTH=6                                                            
         MFLD  DGIA0135,                                               +        
               LTH=6                                                            
         MFLD  DGIA0136,                                               +        
               LTH=6                                                            
         MFLD  DGIA0137,                                               +        
               LTH=6                                                            
         MFLD  DGIA0138,                                               +        
               LTH=6                                                            
         MFLD  DGIA0139,                                               +        
               LTH=6                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  DGIA0104,                                               +        
               LTH=7                                                            
         MFLD  DGIA0105,                                               +        
               LTH=7                                                            
         MFLD  DGIA0106,                                               +        
               LTH=7                                                            
         MFLD  DGIA0107,                                               +        
               LTH=7                                                            
         MFLD  DGIA0108,                                               +        
               LTH=7                                                            
         MFLD  DGIA0109,                                               +        
               LTH=7                                                            
         MFLD  DGIA0110,                                               +        
               LTH=7                                                            
         MFLD  DGIA0111,                                               +        
               LTH=7                                                            
         MFLD  DGIA0112,                                               +        
               LTH=7                                                            
         MFLD  DGIA0113,                                               +        
               LTH=7                                                            
         MFLD  DGIA0114,                                               +        
               LTH=7                                                            
         MFLD  DGIA0115,                                               +        
               LTH=7                                                            
         MFLD  DGIA0116,                                               +        
               LTH=7                                                            
         MFLD  DGIA0117,                                               +        
               LTH=7                                                            
         MFLD  DGIA0118,                                               +        
               LTH=7                                                            
         MFLD  DGIA0119,                                               +        
               LTH=7                                                            
         MFLD  DGIA0120,                                               +        
               LTH=7                                                            
         MFLD  DGIA0121,                                               +        
               LTH=7                                                            
         MFLD  DGIA0122,                                               +        
               LTH=7                                                            
         MFLD  DGIA0123,                                               +        
               LTH=7                                                            
         MFLD  DGIA0124,                                               +        
               LTH=7                                                            
         MFLD  DGIA0125,                                               +        
               LTH=7                                                            
         MFLD  DGIA0084,                                               +        
               LTH=1                                                            
         MFLD  DGIA0085,                                               +        
               LTH=1                                                            
         MFLD  DGIA0086,                                               +        
               LTH=1                                                            
         MFLD  DGIA0087,                                               +        
               LTH=1                                                            
         MFLD  DGIA0088,                                               +        
               LTH=1                                                            
         MFLD  DGIA0089,                                               +        
               LTH=1                                                            
         MFLD  DGIA0090,                                               +        
               LTH=1                                                            
         MFLD  DGIA0091,                                               +        
               LTH=1                                                            
         MFLD  DGIA0092,                                               +        
               LTH=1                                                            
         MFLD  DGIA0093,                                               +        
               LTH=1                                                            
         MFLD  DGIA0094,                                               +        
               LTH=1                                                            
         MFLD  DGIA0095,                                               +        
               LTH=1                                                            
         MFLD  DGIA0096,                                               +        
               LTH=1                                                            
         MFLD  DGIA0097,                                               +        
               LTH=1                                                            
         MFLD  DGIA0070,                                               +        
               LTH=4                                                            
         MFLD  DGIA0071,                                               +        
               LTH=4                                                            
         MFLD  DGIA0072,                                               +        
               LTH=4                                                            
         MFLD  DGIA0073,                                               +        
               LTH=4                                                            
         MFLD  DGIA0074,                                               +        
               LTH=4                                                            
         MFLD  DGIA0075,                                               +        
               LTH=4                                                            
         MFLD  DGIA0076,                                               +        
               LTH=4                                                            
         MFLD  DGIA0077,                                               +        
               LTH=4                                                            
         MFLD  DGIA0078,                                               +        
               LTH=4                                                            
         MFLD  DGIA0079,                                               +        
               LTH=4                                                            
         MFLD  DGIA0080,                                               +        
               LTH=4                                                            
         MFLD  DGIA0081,                                               +        
               LTH=4                                                            
         MFLD  DGIA0082,                                               +        
               LTH=4                                                            
         MFLD  DGIA0083,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=1                                                            
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  DGIA0020,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  DGIA0023,                                               +        
               LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=1                                                            
         MFLD  DGIA0025,                                               +        
               LTH=1                                                            
         MFLD  DGIA0026,                                               +        
               LTH=1                                                            
         MFLD  DGIA0027,                                               +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
