***********************************************************************         
* CREATED BY PC65704   ON 99/02/11  AT 15:06                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'INCOMING ORDER STATISTICS       '                               
W2N107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T101  ',                                           +        
               2='W2T102  ',                                           +        
               3='W2T103  ',                                           +        
               4='W2T104  ',                                           +        
               5='W2T105  ',                                           +        
               6='W2T106  ',                                           +        
               7='W2T107  ',                                           +        
               8='W2T108  ',                                           +        
               9='W2T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T105U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T101  ',                                          +        
               14='W2T102  ',                                          +        
               15='W2T103  ',                                          +        
               16='W2T104  ',                                          +        
               17='W2T105  ',                                          +        
               18='W2T106  ',                                          +        
               19='W2T107  ',                                          +        
               20='W2T108  ',                                          +        
               21='W2T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T105U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N107   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'INCOMING ORDER STATISTICS',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Type',                                                 +        
               POS=(2,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
VALIN    DFLD  POS=(2,29),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
VALUT    DFLD  POS=(3,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BENART   DFLD  POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Per',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
YEARCURR DFLD  POS=(6,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0624  DFLD  POS=(6,24),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0636  DFLD  POS=(6,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0648  DFLD  POS=(6,48),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0660  DFLD  POS=(6,60),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0672  DFLD  POS=(6,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '1',                                                    +        
               POS=(7,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0710  DFLD  POS=(7,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0722  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0734  DFLD  POS=(7,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0746  DFLD  POS=(7,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0758  DFLD  POS=(7,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0770  DFLD  POS=(7,69),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '2',                                                    +        
               POS=(8,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0810  DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0822  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0834  DFLD  POS=(8,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0846  DFLD  POS=(8,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0858  DFLD  POS=(8,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0870  DFLD  POS=(8,69),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '3',                                                    +        
               POS=(9,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0910  DFLD  POS=(9,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0922  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0934  DFLD  POS=(9,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0946  DFLD  POS=(9,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0958  DFLD  POS=(9,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0970  DFLD  POS=(9,69),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '4',                                                    +        
               POS=(10,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1010  DFLD  POS=(10,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1022  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1034  DFLD  POS=(10,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1046  DFLD  POS=(10,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1058  DFLD  POS=(10,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1070  DFLD  POS=(10,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '5',                                                    +        
               POS=(11,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1110  DFLD  POS=(11,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1122  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1134  DFLD  POS=(11,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1146  DFLD  POS=(11,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1158  DFLD  POS=(11,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1170  DFLD  POS=(11,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '6',                                                    +        
               POS=(12,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1210  DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1222  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1234  DFLD  POS=(12,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1246  DFLD  POS=(12,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1258  DFLD  POS=(12,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1270  DFLD  POS=(12,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '7',                                                    +        
               POS=(13,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1310  DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1322  DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1334  DFLD  POS=(13,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1346  DFLD  POS=(13,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1358  DFLD  POS=(13,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1370  DFLD  POS=(13,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '8',                                                    +        
               POS=(14,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1410  DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1422  DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1434  DFLD  POS=(14,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1446  DFLD  POS=(14,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1458  DFLD  POS=(14,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1470  DFLD  POS=(14,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '9',                                                    +        
               POS=(15,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1510  DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1522  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1534  DFLD  POS=(15,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1546  DFLD  POS=(15,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1558  DFLD  POS=(15,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1570  DFLD  POS=(15,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '10',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1610  DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1622  DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1634  DFLD  POS=(16,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1646  DFLD  POS=(16,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1658  DFLD  POS=(16,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1670  DFLD  POS=(16,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '11',                                                   +        
               POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1710  DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1722  DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1734  DFLD  POS=(17,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1746  DFLD  POS=(17,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1758  DFLD  POS=(17,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1770  DFLD  POS=(17,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '12',                                                   +        
               POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1810  DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1822  DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1834  DFLD  POS=(18,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1846  DFLD  POS=(18,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1858  DFLD  POS=(18,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1870  DFLD  POS=(18,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1910  DFLD  POS=(19,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1922  DFLD  POS=(19,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1934  DFLD  POS=(19,33),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1946  DFLD  POS=(19,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1958  DFLD  POS=(19,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1970  DFLD  POS=(19,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Type : T,P,D,S,N,E,R OR L',                            +        
               POS=(21,02),LTH=25,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O107N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I107N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N107                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  VALIN,                                                  +        
               LTH=1                                                            
         MFLD  VALUT,                                                  +        
               LTH=7                                                            
         MFLD  BENART,                                                 +        
               LTH=25                                                           
         MFLD  YEARCURR,                                               +        
               LTH=4                                                            
         MFLD  FLD0710,                                                +        
               LTH=7                                                            
         MFLD  FLD0810,                                                +        
               LTH=7                                                            
         MFLD  FLD0910,                                                +        
               LTH=7                                                            
         MFLD  FLD1010,                                                +        
               LTH=7                                                            
         MFLD  FLD1110,                                                +        
               LTH=7                                                            
         MFLD  FLD1210,                                                +        
               LTH=7                                                            
         MFLD  FLD1310,                                                +        
               LTH=7                                                            
         MFLD  FLD1410,                                                +        
               LTH=7                                                            
         MFLD  FLD1510,                                                +        
               LTH=7                                                            
         MFLD  FLD1610,                                                +        
               LTH=7                                                            
         MFLD  FLD1710,                                                +        
               LTH=7                                                            
         MFLD  FLD1810,                                                +        
               LTH=7                                                            
         MFLD  FLD1910,                                                +        
               LTH=7                                                            
         MFLD  FLD0624,                                                +        
               LTH=4                                                            
         MFLD  FLD0722,                                                +        
               LTH=7                                                            
         MFLD  FLD0822,                                                +        
               LTH=7                                                            
         MFLD  FLD0922,                                                +        
               LTH=7                                                            
         MFLD  FLD1022,                                                +        
               LTH=7                                                            
         MFLD  FLD1122,                                                +        
               LTH=7                                                            
         MFLD  FLD1222,                                                +        
               LTH=7                                                            
         MFLD  FLD1322,                                                +        
               LTH=7                                                            
         MFLD  FLD1422,                                                +        
               LTH=7                                                            
         MFLD  FLD1522,                                                +        
               LTH=7                                                            
         MFLD  FLD1622,                                                +        
               LTH=7                                                            
         MFLD  FLD1722,                                                +        
               LTH=7                                                            
         MFLD  FLD1822,                                                +        
               LTH=7                                                            
         MFLD  FLD1922,                                                +        
               LTH=7                                                            
         MFLD  FLD0636,                                                +        
               LTH=4                                                            
         MFLD  FLD0734,                                                +        
               LTH=7                                                            
         MFLD  FLD0834,                                                +        
               LTH=7                                                            
         MFLD  FLD0934,                                                +        
               LTH=7                                                            
         MFLD  FLD1034,                                                +        
               LTH=7                                                            
         MFLD  FLD1134,                                                +        
               LTH=7                                                            
         MFLD  FLD1234,                                                +        
               LTH=7                                                            
         MFLD  FLD1334,                                                +        
               LTH=7                                                            
         MFLD  FLD1434,                                                +        
               LTH=7                                                            
         MFLD  FLD1534,                                                +        
               LTH=7                                                            
         MFLD  FLD1634,                                                +        
               LTH=7                                                            
         MFLD  FLD1734,                                                +        
               LTH=7                                                            
         MFLD  FLD1834,                                                +        
               LTH=7                                                            
         MFLD  FLD1934,                                                +        
               LTH=7                                                            
         MFLD  FLD0648,                                                +        
               LTH=4                                                            
         MFLD  FLD0746,                                                +        
               LTH=7                                                            
         MFLD  FLD0846,                                                +        
               LTH=7                                                            
         MFLD  FLD0946,                                                +        
               LTH=7                                                            
         MFLD  FLD1046,                                                +        
               LTH=7                                                            
         MFLD  FLD1146,                                                +        
               LTH=7                                                            
         MFLD  FLD1246,                                                +        
               LTH=7                                                            
         MFLD  FLD1346,                                                +        
               LTH=7                                                            
         MFLD  FLD1446,                                                +        
               LTH=7                                                            
         MFLD  FLD1546,                                                +        
               LTH=7                                                            
         MFLD  FLD1646,                                                +        
               LTH=7                                                            
         MFLD  FLD1746,                                                +        
               LTH=7                                                            
         MFLD  FLD1846,                                                +        
               LTH=7                                                            
         MFLD  FLD1946,                                                +        
               LTH=7                                                            
         MFLD  FLD0660,                                                +        
               LTH=4                                                            
         MFLD  FLD0758,                                                +        
               LTH=7                                                            
         MFLD  FLD0858,                                                +        
               LTH=7                                                            
         MFLD  FLD0958,                                                +        
               LTH=7                                                            
         MFLD  FLD1058,                                                +        
               LTH=7                                                            
         MFLD  FLD1158,                                                +        
               LTH=7                                                            
         MFLD  FLD1258,                                                +        
               LTH=7                                                            
         MFLD  FLD1358,                                                +        
               LTH=7                                                            
         MFLD  FLD1458,                                                +        
               LTH=7                                                            
         MFLD  FLD1558,                                                +        
               LTH=7                                                            
         MFLD  FLD1658,                                                +        
               LTH=7                                                            
         MFLD  FLD1758,                                                +        
               LTH=7                                                            
         MFLD  FLD1858,                                                +        
               LTH=7                                                            
         MFLD  FLD1958,                                                +        
               LTH=7                                                            
         MFLD  FLD0672,                                                +        
               LTH=4                                                            
         MFLD  FLD0770,                                                +        
               LTH=7                                                            
         MFLD  FLD0870,                                                +        
               LTH=7                                                            
         MFLD  FLD0970,                                                +        
               LTH=7                                                            
         MFLD  FLD1070,                                                +        
               LTH=7                                                            
         MFLD  FLD1170,                                                +        
               LTH=7                                                            
         MFLD  FLD1270,                                                +        
               LTH=7                                                            
         MFLD  FLD1370,                                                +        
               LTH=7                                                            
         MFLD  FLD1470,                                                +        
               LTH=7                                                            
         MFLD  FLD1570,                                                +        
               LTH=7                                                            
         MFLD  FLD1670,                                                +        
               LTH=7                                                            
         MFLD  FLD1770,                                                +        
               LTH=7                                                            
         MFLD  FLD1870,                                                +        
               LTH=7                                                            
         MFLD  FLD1970,                                                +        
               LTH=7                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I107N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N107),                                           +        
               OPT=2,                                                  +        
               NXT=W2O107N1                                                     
MID      LPAGE SOR=(W2N107)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21072',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VALIN,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VALUT,                                                 +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
