***********************************************************************         
* CREATED BY PC40073   ON 97/05/23  AT 10:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TOTAL DEMAND PER PART           '                               
W2N128   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W2T128 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T121  ',                                          +        
               14='W2T122  ',                                          +        
               15='W2T123  ',                                          +        
               16='W2T124  ',                                          +        
               17='W2T125  ',                                          +        
               18='W2T126  ',                                          +        
               19='W2T127  ',                                          +        
               20='W2T128  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N128   DPAGE CURSOR=((2,12,CURSOR)),                                 +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TOTAL DEMAND PER PART',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Week Separate',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kit',                                                  +        
               POS=(5,21),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TPO  SDC tot  NDC tot     Trend',                      +        
               POS=(5,30),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Total',                                                +        
               POS=(5,66),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PB-plan',                                              +        
               POS=(5,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIAAVV1  DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP1 DFLD  POS=(6,07),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(6,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTPO1   DFLD  POS=(6,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVSDC1   DFLD  POS=(6,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVNDC1   DFLD  POS=(6,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
TREND01  DFLD  POS=(6,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTOT1   DFLD  POS=(6,62),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PBPLAN1  DFLD  POS=(6,72),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAAVV2  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP2 DFLD  POS=(7,07),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(7,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTPO2   DFLD  POS=(7,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVSDC2   DFLD  POS=(7,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVNDC2   DFLD  POS=(7,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
TREND02  DFLD  POS=(7,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTOT2   DFLD  POS=(7,62),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PBPLAN2  DFLD  POS=(7,72),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAAVV3  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP3 DFLD  POS=(8,07),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(8,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTPO3   DFLD  POS=(8,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVSDC3   DFLD  POS=(8,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVNDC3   DFLD  POS=(8,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
TREND03  DFLD  POS=(8,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTOT3   DFLD  POS=(8,62),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PBPLAN3  DFLD  POS=(8,72),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAAVV4  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP4 DFLD  POS=(9,07),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(9,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTPO4   DFLD  POS=(9,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVSDC4   DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVNDC4   DFLD  POS=(9,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
TREND04  DFLD  POS=(9,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVTOT4   DFLD  POS=(9,62),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PBPLAN4  DFLD  POS=(9,72),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAAVV5  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP5 DFLD  POS=(10,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(10,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO5   DFLD  POS=(10,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC5   DFLD  POS=(10,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC5   DFLD  POS=(10,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND05  DFLD  POS=(10,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT5   DFLD  POS=(10,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN5  DFLD  POS=(10,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV6  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP6 DFLD  POS=(11,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(11,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO6   DFLD  POS=(11,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC6   DFLD  POS=(11,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC6   DFLD  POS=(11,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND06  DFLD  POS=(11,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT6   DFLD  POS=(11,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN6  DFLD  POS=(11,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV7  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP7 DFLD  POS=(12,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(12,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO7   DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC7   DFLD  POS=(12,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC7   DFLD  POS=(12,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND07  DFLD  POS=(12,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT7   DFLD  POS=(12,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN7  DFLD  POS=(12,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV8  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP8 DFLD  POS=(13,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(13,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO8   DFLD  POS=(13,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC8   DFLD  POS=(13,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC8   DFLD  POS=(13,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND08  DFLD  POS=(13,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT8   DFLD  POS=(13,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN8  DFLD  POS=(13,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV9  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KVPBSEP9 DFLD  POS=(14,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(14,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO9   DFLD  POS=(14,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC9   DFLD  POS=(14,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC9   DFLD  POS=(14,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND09  DFLD  POS=(14,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT9   DFLD  POS=(14,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN9  DFLD  POS=(14,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV10 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(15,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(15,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO10  DFLD  POS=(15,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC10  DFLD  POS=(15,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC10  DFLD  POS=(15,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND10  DFLD  POS=(15,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT10  DFLD  POS=(15,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN10 DFLD  POS=(15,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV11 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(16,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(16,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO11  DFLD  POS=(16,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC11  DFLD  POS=(16,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC11  DFLD  POS=(16,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND11  DFLD  POS=(16,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT11  DFLD  POS=(16,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN11 DFLD  POS=(16,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV12 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(17,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(17,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO12  DFLD  POS=(17,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC12  DFLD  POS=(17,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC12  DFLD  POS=(17,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND12  DFLD  POS=(17,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT12  DFLD  POS=(17,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN12 DFLD  POS=(17,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV13 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(18,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(18,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO13  DFLD  POS=(18,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC13  DFLD  POS=(18,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC13  DFLD  POS=(18,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND13  DFLD  POS=(18,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT13  DFLD  POS=(18,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN13 DFLD  POS=(18,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
TIAAVV14 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(19,07),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(19,16),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTPO14  DFLD  POS=(19,25),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVSDC14  DFLD  POS=(19,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVNDC14  DFLD  POS=(19,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TREND14  DFLD  POS=(19,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVTOT14  DFLD  POS=(19,62),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
PBPLAN14 DFLD  POS=(19,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Order-Agreem 14 Grafic order 15 Forecast inf 16 Supp+        
               l. cert. 17 BO/TPO',                                    +        
               POS=(21,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Unconf. TPOs 19 Unconf.offer 20 Tot demand/p 21',   +        
               POS=(22,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O128N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N128,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I128N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N128                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  TIAAVV1,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP1,                                               +        
               LTH=8                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8                                                            
         MFLD  KVTPO1,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC1,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC1,                                                 +        
               LTH=8                                                            
         MFLD  TREND01,                                                +        
               LTH=9                                                            
         MFLD  KVTOT1,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN1,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV2,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP2,                                               +        
               LTH=8                                                            
         MFLD  DGIA0001,                                               +        
               LTH=8                                                            
         MFLD  KVTPO2,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC2,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC2,                                                 +        
               LTH=8                                                            
         MFLD  TREND02,                                                +        
               LTH=9                                                            
         MFLD  KVTOT2,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN2,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV3,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP3,                                               +        
               LTH=8                                                            
         MFLD  DGIA0002,                                               +        
               LTH=8                                                            
         MFLD  KVTPO3,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC3,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC3,                                                 +        
               LTH=8                                                            
         MFLD  TREND03,                                                +        
               LTH=9                                                            
         MFLD  KVTOT3,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN3,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV4,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP4,                                               +        
               LTH=8                                                            
         MFLD  DGIA0003,                                               +        
               LTH=8                                                            
         MFLD  KVTPO4,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC4,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC4,                                                 +        
               LTH=8                                                            
         MFLD  TREND04,                                                +        
               LTH=9                                                            
         MFLD  KVTOT4,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN4,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV5,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP5,                                               +        
               LTH=8                                                            
         MFLD  DGIA0004,                                               +        
               LTH=8                                                            
         MFLD  KVTPO5,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC5,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC5,                                                 +        
               LTH=8                                                            
         MFLD  TREND05,                                                +        
               LTH=9                                                            
         MFLD  KVTOT5,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN5,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV6,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP6,                                               +        
               LTH=8                                                            
         MFLD  DGIA0005,                                               +        
               LTH=8                                                            
         MFLD  KVTPO6,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC6,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC6,                                                 +        
               LTH=8                                                            
         MFLD  TREND06,                                                +        
               LTH=9                                                            
         MFLD  KVTOT6,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN6,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV7,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP7,                                               +        
               LTH=8                                                            
         MFLD  DGIA0006,                                               +        
               LTH=8                                                            
         MFLD  KVTPO7,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC7,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC7,                                                 +        
               LTH=8                                                            
         MFLD  TREND07,                                                +        
               LTH=9                                                            
         MFLD  KVTOT7,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN7,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV8,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP8,                                               +        
               LTH=8                                                            
         MFLD  DGIA0007,                                               +        
               LTH=8                                                            
         MFLD  KVTPO8,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC8,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC8,                                                 +        
               LTH=8                                                            
         MFLD  TREND08,                                                +        
               LTH=9                                                            
         MFLD  KVTOT8,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN8,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV9,                                                +        
               LTH=4                                                            
         MFLD  KVPBSEP9,                                               +        
               LTH=8                                                            
         MFLD  DGIA0008,                                               +        
               LTH=8                                                            
         MFLD  KVTPO9,                                                 +        
               LTH=8                                                            
         MFLD  KVSDC9,                                                 +        
               LTH=8                                                            
         MFLD  KVNDC9,                                                 +        
               LTH=8                                                            
         MFLD  TREND09,                                                +        
               LTH=9                                                            
         MFLD  KVTOT9,                                                 +        
               LTH=9                                                            
         MFLD  PBPLAN9,                                                +        
               LTH=9                                                            
         MFLD  TIAAVV10,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=8                                                            
         MFLD  DGIA0009,                                               +        
               LTH=8                                                            
         MFLD  KVTPO10,                                                +        
               LTH=8                                                            
         MFLD  KVSDC10,                                                +        
               LTH=8                                                            
         MFLD  KVNDC10,                                                +        
               LTH=8                                                            
         MFLD  TREND10,                                                +        
               LTH=9                                                            
         MFLD  KVTOT10,                                                +        
               LTH=9                                                            
         MFLD  PBPLAN10,                                               +        
               LTH=9                                                            
         MFLD  TIAAVV11,                                               +        
               LTH=4                                                            
         MFLD  DGIA0015,                                               +        
               LTH=8                                                            
         MFLD  DGIA0010,                                               +        
               LTH=8                                                            
         MFLD  KVTPO11,                                                +        
               LTH=8                                                            
         MFLD  KVSDC11,                                                +        
               LTH=8                                                            
         MFLD  KVNDC11,                                                +        
               LTH=8                                                            
         MFLD  TREND11,                                                +        
               LTH=9                                                            
         MFLD  KVTOT11,                                                +        
               LTH=9                                                            
         MFLD  PBPLAN11,                                               +        
               LTH=9                                                            
         MFLD  TIAAVV12,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=8                                                            
         MFLD  DGIA0011,                                               +        
               LTH=8                                                            
         MFLD  KVTPO12,                                                +        
               LTH=8                                                            
         MFLD  KVSDC12,                                                +        
               LTH=8                                                            
         MFLD  KVNDC12,                                                +        
               LTH=8                                                            
         MFLD  TREND12,                                                +        
               LTH=9                                                            
         MFLD  KVTOT12,                                                +        
               LTH=9                                                            
         MFLD  PBPLAN12,                                               +        
               LTH=9                                                            
         MFLD  TIAAVV13,                                               +        
               LTH=4                                                            
         MFLD  DGIA0017,                                               +        
               LTH=8                                                            
         MFLD  DGIA0012,                                               +        
               LTH=8                                                            
         MFLD  KVTPO13,                                                +        
               LTH=8                                                            
         MFLD  KVSDC13,                                                +        
               LTH=8                                                            
         MFLD  KVNDC13,                                                +        
               LTH=8                                                            
         MFLD  TREND13,                                                +        
               LTH=9                                                            
         MFLD  KVTOT13,                                                +        
               LTH=9                                                            
         MFLD  PBPLAN13,                                               +        
               LTH=9                                                            
         MFLD  TIAAVV14,                                               +        
               LTH=4                                                            
         MFLD  DGIA0018,                                               +        
               LTH=8                                                            
         MFLD  DGIA0013,                                               +        
               LTH=8                                                            
         MFLD  KVTPO14,                                                +        
               LTH=8                                                            
         MFLD  KVSDC14,                                                +        
               LTH=8                                                            
         MFLD  KVNDC14,                                                +        
               LTH=8                                                            
         MFLD  TREND14,                                                +        
               LTH=9                                                            
         MFLD  KVTOT14,                                                +        
               LTH=9                                                            
         MFLD  PBPLAN14,                                               +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I128N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N128),                                           +        
               OPT=2,                                                  +        
               NXT=W2O128N1                                                     
MID      LPAGE SOR=(W2N128)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21282',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV1,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV2,                                                +        
               LTH=4                                                            
         MFLD  TIAAVV3,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV4,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV5,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV6,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV7,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV8,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV9,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV10,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV11,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV12,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV13,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  TIAAVV14,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  CURSOR,LTH=0004                                                  
         MSGEND                                                                 
         END                                                                    
