***********************************************************************         
* CREATED BY PC40073   ON 98/09/23  AT 13:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANTÖRS-INFO USA            '                               
W2N116   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T116U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T111  ',                                          +        
               14='W2T112  ',                                          +        
               15='W2T113  ',                                          +        
               16='W2T114  ',                                          +        
               17='W2T115  ',                                          +        
               18='W2T116  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SUPPLIER TERMS       ',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier No.',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,15),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Name',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
LEVNAMN  DFLD  POS=(5,12),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Leadtime DC 51',                                       +        
               POS=(5,50),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DC51UT   DFLD  POS=(5,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DC51IN   DFLD  POS=(5,71),LTH=3,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(5,75),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Address-1',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
ADRESS1  DFLD  POS=(6,12),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 52',                                                +        
               POS=(6,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DC52UT   DFLD  POS=(6,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DC52IN   DFLD  POS=(6,71),LTH=3,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(6,75),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Address-2',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
ADRESS2  DFLD  POS=(7,12),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 53',                                                +        
               POS=(7,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DC53UT   DFLD  POS=(7,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DC53IN   DFLD  POS=(7,71),LTH=3,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(7,75),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Postaladr',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
POSTADR  DFLD  POS=(8,12),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 61',                                                +        
               POS=(8,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DC61UT   DFLD  POS=(8,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DC61IN   DFLD  POS=(8,71),LTH=3,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(8,75),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Country',                                              +        
               POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
LAND     DFLD  POS=(9,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 62',                                                +        
               POS=(9,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DC62UT   DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DC62IN   DFLD  POS=(9,71),LTH=3,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(9,75),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC 63',                                                +        
               POS=(10,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC63UT   DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC63IN   DFLD  POS=(10,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(10,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 64',                                                +        
               POS=(11,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC64UT   DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC64IN   DFLD  POS=(11,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(11,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ship via/way of transp:',                              +        
               POS=(12,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 65',                                                +        
               POS=(12,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC65UT   DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC65IN   DFLD  POS=(12,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(12,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FRAKT    DFLD  POS=(13,27),LTH=20,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DC 66',                                                +        
               POS=(13,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC66UT   DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC66IN   DFLD  POS=(13,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(13,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 67',                                                +        
               POS=(14,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC67UT   DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC67IN   DFLD  POS=(14,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(14,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vendor FOB/terms of transp:',                          +        
               POS=(15,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 85',                                                +        
               POS=(15,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC85UT   DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC85IN   DFLD  POS=(15,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(15,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VILLKOR  DFLD  POS=(16,31),LTH=24,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DC 86',                                                +        
               POS=(16,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC86UT   DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC86IN   DFLD  POS=(16,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(16,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC 87',                                                +        
               POS=(17,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DC87UT   DFLD  POS=(17,66),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DC87IN   DFLD  POS=(17,71),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'days',                                                 +        
               POS=(17,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Terms of payment:',                                    +        
               POS=(18,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
BETALN   DFLD  POS=(19,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 SUPPLIER-INF 14 PRICE-INF 15 DELIV-PLAN 16 DEL/CRE S+        
               UPPL 17 UPDATE SUPPL',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(ALPHA,PROT)                                                
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I116N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N116),                                           +        
               OPT=2,                                                  +        
               NXT=W2O116N1                                                     
DGI2     LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21162',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DC51IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC52IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC53IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC61IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC62IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC63IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC64IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC65IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC66IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC67IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC85IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC86IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DC87IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT,                                                 +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VILLKOR,                                               +        
               '++++++++++++++++++++++++'),                            +        
               LTH=24,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BETALN,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W2O116N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N116,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I116N1,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  LEVNAMN,                                                +        
               LTH=35                                                           
         MFLD  DC51UT,                                                 +        
               LTH=3                                                            
         MFLD  DC51IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS1,                                                +        
               LTH=35                                                           
         MFLD  DC52UT,                                                 +        
               LTH=3                                                            
         MFLD  DC52IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS2,                                                +        
               LTH=35                                                           
         MFLD  DC53UT,                                                 +        
               LTH=3                                                            
         MFLD  DC53IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  POSTADR,                                                +        
               LTH=35                                                           
         MFLD  DC61UT,                                                 +        
               LTH=3                                                            
         MFLD  DC61IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAND,                                                   +        
               LTH=20                                                           
         MFLD  DC62UT,                                                 +        
               LTH=3                                                            
         MFLD  DC62IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC63UT,                                                 +        
               LTH=3                                                            
         MFLD  DC63IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC64UT,                                                 +        
               LTH=3                                                            
         MFLD  DC64IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC65UT,                                                 +        
               LTH=3                                                            
         MFLD  DC65IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT,                                                  +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DC66UT,                                                 +        
               LTH=3                                                            
         MFLD  DC66IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC67UT,                                                 +        
               LTH=3                                                            
         MFLD  DC67IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC85UT,                                                 +        
               LTH=3                                                            
         MFLD  DC85IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VILLKOR,                                                +        
               LTH=26,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DC86UT,                                                 +        
               LTH=3                                                            
         MFLD  DC86IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC87UT,                                                 +        
               LTH=3                                                            
         MFLD  DC87IN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BETALN,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
