***********************************************************************         
* CREATED BY V028439   ON 06/03/21  AT 08:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPDATERING ANSK-DATA-2         '                               
W2N132   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T131  ',                                           +        
               2='W2T132  ',                                           +        
               3='W2T133  ',                                           +        
               4='W2T134  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T132U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T131  ',                                          +        
               14='W2T132  ',                                          +        
               15='W2T133  ',                                          +        
               16='W2T134  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T132V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N132   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPDATE PROCURER INFORMATION 2',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
C2FAELT  DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Descript.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dir.del.sh',                                           +        
               POS=(6,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
REDIRL1U DFLD  POS=(6,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Distrib.block',                                        +        
               POS=(6,21),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLFSPU   DFLD  POS=(6,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Final purch.',                                         +        
               POS=(6,41),LTH=12,                                      +        
               ATTR=(PROT)                                                      
SLUTKPU  DFLD  POS=(6,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KSP',                                                  +        
               POS=(6,64),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDKSPU   DFLD  POS=(6,78),LTH=2,                                       +        
               ATTR=(PROT)                                                      
REDIRL1I DFLD  POS=(7,13),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLFSPI   DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SLUTKPI  DFLD  POS=(7,54),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDKSPI   DFLD  POS=(7,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Agreement',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KDAVTU   DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Purchaser',                                            +        
               POS=(8,21),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDINKU   DFLD  POS=(8,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date fin.purch',                                       +        
               POS=(8,41),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TSLUTKPU DFLD  POS=(8,56),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'NewCalc',                                              +        
               POS=(8,64),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLNYBERU DFLD  POS=(8,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDAVTI   DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDINKI   DFLD  POS=(9,32),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
TSLUTKPI DFLD  POS=(9,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLNYBERI DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ph.in vs SOP',                                         +        
               POS=(10,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KDSOPU   DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ph.out vs EOP',                                        +        
               POS=(10,21),LTH=13,                                     +        
               ATTR=(PROT)                                                      
KVEOPU   DFLD  POS=(10,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Just-In-Time',                                         +        
               POS=(10,41),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLJITU   DFLD  POS=(10,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ledtime var',                                          +        
               POS=(10,64),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KVVECKOU DFLD  POS=(10,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSOPI   DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KVEOPI   DFLD  POS=(11,35),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLJITI   DFLD  POS=(11,60),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KVVECKI1 DFLD  POS=(11,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Key business',                                         +        
               POS=(12,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLBSNESU DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BrandSensitiv',                                        +        
               POS=(12,21),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLBRANDU DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Alert Block',                                          +        
               POS=(12,41),LTH=11,                                     +        
               ATTR=(PROT)                                                      
STODATU  DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLBSNESI DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLBRANDI DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
STODATI  DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KP',                                                   +        
               POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVKPU    DFLD  POS=(14,10),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man-KP',                                               +        
               POS=(14,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLMANKPU DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Add.del.adr',                                          +        
               POS=(14,41),LTH=11,                                     +        
               ATTR=(PROT)                                                      
GATEU    DFLD  POS=(14,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVKPI    DFLD  POS=(15,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLMANKPI DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pub. week',                                            +        
               POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TIFINLVU DFLD  POS=(16,12),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EOP',                                                  +        
               POS=(16,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TIURPROU DFLD  POS=(16,35),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Rel. Bl.',                                             +        
               POS=(16,41),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLRELSPU DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Send.day',                                             +        
               POS=(16,57),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TILEVD1  DFLD  POS=(16,66),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
TILEVD2  DFLD  POS=(16,69),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
TILEVD3  DFLD  POS=(16,72),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
TILEVD4  DFLD  POS=(16,75),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
TILEVD5  DFLD  POS=(16,78),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
TIFINLVI DFLD  POS=(17,12),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
TIURPROI DFLD  POS=(17,35),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLRELSPI DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
TILEVS1  DFLD  POS=(17,66),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
TILEVS2  DFLD  POS=(17,69),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TILEVS3  DFLD  POS=(17,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TILEVS4  DFLD  POS=(17,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TILEVS5  DFLD  POS=(17,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Note 1',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNOT1  DFLD  POS=(18,16),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note 2',                                               +        
               POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNOT2  DFLD  POS=(19,16),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '10 WHELP',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O132N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N132,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I132N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N132                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  C2FAELT,                                                +        
               LTH=1                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  REDIRL1U,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLFSPU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SLUTKPU,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKSPU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REDIRL1I,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLFSPI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SLUTKPI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKSPI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDAVTU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDINKU,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TSLUTKPU,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLNYBERU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDAVTI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDINKI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TSLUTKPI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLNYBERI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSOPU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSOPI,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVEOPU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVEOPI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLJITU,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLJITI,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBSNESU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBSNESI,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBRANDU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBRANDI,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STODATU,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STODATI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKPU,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLMANKPU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GATEU,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVKPI,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLMANKPI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIFINLVU,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIURPROU,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLRELSPU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVVECKOU,                                               +        
               LTH=4                                                            
         MFLD  KVVECKI1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIFINLVI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIURPROI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLRELSPI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVD1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVD2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVD3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVD4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVD5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVS1,                                                +        
               LTH=2                                                            
         MFLD  TILEVS2,                                                +        
               LTH=2                                                            
         MFLD  TILEVS3,                                                +        
               LTH=2                                                            
         MFLD  TILEVS4,                                                +        
               LTH=2                                                            
         MFLD  TILEVS5,                                                +        
               LTH=2                                                            
         MFLD  ARTNOT1,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNOT2,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I132N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N132),                                           +        
               OPT=2,                                                  +        
               NXT=W2O132N1                                                     
MID      LPAGE SOR=(W2N132)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21322',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  C2FAELT,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (REDIRL1I,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLFSPI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SLUTKPI,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKSPI,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDAVTI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDINKI,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TSLUTKPI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLNYBERI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDSOPI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVEOPI,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLJITI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLBSNESI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLBRANDI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (STODATI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKPI,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLMANKPI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TIFINLVI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIURPROI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLRELSPI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVVECKI1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TILEVD1,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVD2,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVD3,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVD4,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVD5,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNOT1,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNOT2,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TILEVS1,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVS2,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVS3,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVS4,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TILEVS5,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
