***********************************************************************         
* CREATED BY PC40073   ON 97/05/29  AT 12:10                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CHANGE RULES FOR REPLACEMENT'                                   
W2N124   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T124 7',                                           +        
               8='W2T124 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T124U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T124  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T124U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXCL. AK ON REPLACEMENT',                              +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD0136  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0210  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0310  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0404  DFLD  POS=(4,5),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'C Proc   Stock      AK     BO BO-Value  SS',           +        
               POS=(5,2),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '  Date   C Tot DC-Value ID',                           +        
               POS=(5,48),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0605  DFLD  POS=(6,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0609  DFLD  POS=(6,9),LTH=7,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0617  DFLD  POS=(6,17),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0625  DFLD  POS=(6,25),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0633  DFLD  POS=(6,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0642  DFLD  POS=(6,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0650  DFLD  POS=(6,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0657  DFLD  POS=(6,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0662  DFLD  POS=(6,62),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0672  DFLD  POS=(6,72),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0750  DFLD  POS=(7,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0757  DFLD  POS=(7,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0762  DFLD  POS=(7,62),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0772  DFLD  POS=(7,72),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC  AK-PAV   Value Inv.dat   Stock   DC-Value',        +        
               POS=(8,2),LTH=45,                                       +        
               ATTR=(PROT)                                                      
COL0850  DFLD  POS=(8,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0857  DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0862  DFLD  POS=(8,62),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0872  DFLD  POS=(8,72),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0902  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0905  DFLD  POS=(9,5),LTH=7,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL0913  DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0922  DFLD  POS=(9,22),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0929  DFLD  POS=(9,29),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0938  DFLD  POS=(9,38),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0950  DFLD  POS=(9,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0957  DFLD  POS=(9,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0962  DFLD  POS=(9,62),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0972  DFLD  POS=(9,72),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1002  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1005  DFLD  POS=(10,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1013  DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1022  DFLD  POS=(10,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1029  DFLD  POS=(10,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1038  DFLD  POS=(10,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1050  DFLD  POS=(10,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1057  DFLD  POS=(10,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1062  DFLD  POS=(10,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1072  DFLD  POS=(10,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1102  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1105  DFLD  POS=(11,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1113  DFLD  POS=(11,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1122  DFLD  POS=(11,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1129  DFLD  POS=(11,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1138  DFLD  POS=(11,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1150  DFLD  POS=(11,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1157  DFLD  POS=(11,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1162  DFLD  POS=(11,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1172  DFLD  POS=(11,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1202  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1205  DFLD  POS=(12,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1213  DFLD  POS=(12,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1222  DFLD  POS=(12,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1229  DFLD  POS=(12,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1238  DFLD  POS=(12,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1250  DFLD  POS=(12,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1257  DFLD  POS=(12,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1262  DFLD  POS=(12,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1272  DFLD  POS=(12,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1302  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1305  DFLD  POS=(13,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1313  DFLD  POS=(13,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1322  DFLD  POS=(13,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1329  DFLD  POS=(13,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1338  DFLD  POS=(13,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1350  DFLD  POS=(13,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1357  DFLD  POS=(13,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1362  DFLD  POS=(13,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1372  DFLD  POS=(13,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1402  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1405  DFLD  POS=(14,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1413  DFLD  POS=(14,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1422  DFLD  POS=(14,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1429  DFLD  POS=(14,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1438  DFLD  POS=(14,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1450  DFLD  POS=(14,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1457  DFLD  POS=(14,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1462  DFLD  POS=(14,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1472  DFLD  POS=(14,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1502  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1505  DFLD  POS=(15,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1513  DFLD  POS=(15,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1522  DFLD  POS=(15,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1529  DFLD  POS=(15,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1538  DFLD  POS=(15,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1550  DFLD  POS=(15,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1557  DFLD  POS=(15,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1562  DFLD  POS=(15,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1572  DFLD  POS=(15,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1602  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1605  DFLD  POS=(16,5),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1613  DFLD  POS=(16,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1622  DFLD  POS=(16,22),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1629  DFLD  POS=(16,29),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1638  DFLD  POS=(16,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1650  DFLD  POS=(16,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1657  DFLD  POS=(16,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1662  DFLD  POS=(16,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1672  DFLD  POS=(16,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1750  DFLD  POS=(17,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1757  DFLD  POS=(17,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1762  DFLD  POS=(17,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1772  DFLD  POS=(17,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'More AK-PAV?',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
COL1815  DFLD  POS=(18,15),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Tot DC-Value',                                         +        
               POS=(18,24),LTH=12,                                     +        
               ATTR=(PROT)                                                      
COL1838  DFLD  POS=(18,38),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1850  DFLD  POS=(18,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1857  DFLD  POS=(18,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1862  DFLD  POS=(18,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1872  DFLD  POS=(18,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Notes',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL1908  DFLD  POS=(19,8),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1917  DFLD  POS=(19,17),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1950  DFLD  POS=(19,50),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1957  DFLD  POS=(19,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1962  DFLD  POS=(19,62),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1972  DFLD  POS=(19,72),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2008  DFLD  POS=(20,8),LTH=50,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F7 First   F8 Forward   F10 WHELP   F11 Update  ',     +        
               POS=(21,2),LTH=48,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F12 LogOff',                                           +        
               POS=(21,51),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O124N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N124,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I124N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0136,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=9                                                            
         MFLD  FLD0310,                                                +        
               LTH=9                                                            
         MFLD  FLD0402,                                                +        
               LTH=2                                                            
         MFLD  FLD0404,                                                +        
               LTH=9                                                            
         MFLD  FLD0602,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0605,                                                +        
               LTH=3                                                            
         MFLD  FLD0609,                                                +        
               LTH=7                                                            
         MFLD  FLD0617,                                                +        
               LTH=7                                                            
         MFLD  FLD0625,                                                +        
               LTH=6                                                            
         MFLD  FLD0633,                                                +        
               LTH=7                                                            
         MFLD  FLD0642,                                                +        
               LTH=2                                                            
         MFLD  COL0902,                                                +        
               LTH=2                                                            
         MFLD  COL0905,                                                +        
               LTH=7                                                            
         MFLD  COL0913,                                                +        
               LTH=7                                                            
         MFLD  COL0922,                                                +        
               LTH=6                                                            
         MFLD  COL0929,                                                +        
               LTH=7                                                            
         MFLD  COL0938,                                                +        
               LTH=9                                                            
         MFLD  COL1002,                                                +        
               LTH=2                                                            
         MFLD  COL1005,                                                +        
               LTH=7                                                            
         MFLD  COL1013,                                                +        
               LTH=7                                                            
         MFLD  COL1022,                                                +        
               LTH=6                                                            
         MFLD  COL1029,                                                +        
               LTH=7                                                            
         MFLD  COL1038,                                                +        
               LTH=9                                                            
         MFLD  COL1102,                                                +        
               LTH=2                                                            
         MFLD  COL1105,                                                +        
               LTH=7                                                            
         MFLD  COL1113,                                                +        
               LTH=7                                                            
         MFLD  COL1122,                                                +        
               LTH=6                                                            
         MFLD  COL1129,                                                +        
               LTH=7                                                            
         MFLD  COL1138,                                                +        
               LTH=9                                                            
         MFLD  COL1202,                                                +        
               LTH=2                                                            
         MFLD  COL1205,                                                +        
               LTH=7                                                            
         MFLD  COL1213,                                                +        
               LTH=7                                                            
         MFLD  COL1222,                                                +        
               LTH=6                                                            
         MFLD  COL1229,                                                +        
               LTH=7                                                            
         MFLD  COL1238,                                                +        
               LTH=9                                                            
         MFLD  COL1302,                                                +        
               LTH=2                                                            
         MFLD  COL1305,                                                +        
               LTH=7                                                            
         MFLD  COL1313,                                                +        
               LTH=7                                                            
         MFLD  COL1322,                                                +        
               LTH=6                                                            
         MFLD  COL1329,                                                +        
               LTH=7                                                            
         MFLD  COL1338,                                                +        
               LTH=9                                                            
         MFLD  COL1402,                                                +        
               LTH=2                                                            
         MFLD  COL1405,                                                +        
               LTH=7                                                            
         MFLD  COL1413,                                                +        
               LTH=7                                                            
         MFLD  COL1422,                                                +        
               LTH=6                                                            
         MFLD  COL1429,                                                +        
               LTH=7                                                            
         MFLD  COL1438,                                                +        
               LTH=9                                                            
         MFLD  COL1502,                                                +        
               LTH=2                                                            
         MFLD  COL1505,                                                +        
               LTH=7                                                            
         MFLD  COL1513,                                                +        
               LTH=7                                                            
         MFLD  COL1522,                                                +        
               LTH=6                                                            
         MFLD  COL1529,                                                +        
               LTH=7                                                            
         MFLD  COL1538,                                                +        
               LTH=9                                                            
         MFLD  COL1602,                                                +        
               LTH=2                                                            
         MFLD  COL1605,                                                +        
               LTH=7                                                            
         MFLD  COL1613,                                                +        
               LTH=7                                                            
         MFLD  COL1622,                                                +        
               LTH=6                                                            
         MFLD  COL1629,                                                +        
               LTH=7                                                            
         MFLD  COL1638,                                                +        
               LTH=9                                                            
         MFLD  COL1815,                                                +        
               LTH=1                                                            
         MFLD  COL1838,                                                +        
               LTH=9                                                            
         MFLD  COL1908,                                                +        
               LTH=8                                                            
         MFLD  COL1917,                                                +        
               LTH=6                                                            
         MFLD  COL2008,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0650,                                                +        
               LTH=6                                                            
         MFLD  COL0657,                                                +        
               LTH=1                                                            
         MFLD  COL0662,                                                +        
               LTH=9                                                            
         MFLD  COL0672,                                                +        
               LTH=8                                                            
         MFLD  COL0750,                                                +        
               LTH=6                                                            
         MFLD  COL0757,                                                +        
               LTH=1                                                            
         MFLD  COL0762,                                                +        
               LTH=9                                                            
         MFLD  COL0772,                                                +        
               LTH=8                                                            
         MFLD  COL0850,                                                +        
               LTH=6                                                            
         MFLD  COL0857,                                                +        
               LTH=1                                                            
         MFLD  COL0862,                                                +        
               LTH=9                                                            
         MFLD  COL0872,                                                +        
               LTH=8                                                            
         MFLD  COL0950,                                                +        
               LTH=6                                                            
         MFLD  COL0957,                                                +        
               LTH=1                                                            
         MFLD  COL0962,                                                +        
               LTH=9                                                            
         MFLD  COL0972,                                                +        
               LTH=8                                                            
         MFLD  COL1050,                                                +        
               LTH=6                                                            
         MFLD  COL1057,                                                +        
               LTH=1                                                            
         MFLD  COL1062,                                                +        
               LTH=9                                                            
         MFLD  COL1072,                                                +        
               LTH=8                                                            
         MFLD  COL1150,                                                +        
               LTH=6                                                            
         MFLD  COL1157,                                                +        
               LTH=1                                                            
         MFLD  COL1162,                                                +        
               LTH=9                                                            
         MFLD  COL1172,                                                +        
               LTH=8                                                            
         MFLD  COL1250,                                                +        
               LTH=6                                                            
         MFLD  COL1257,                                                +        
               LTH=1                                                            
         MFLD  COL1262,                                                +        
               LTH=9                                                            
         MFLD  COL1272,                                                +        
               LTH=8                                                            
         MFLD  COL1350,                                                +        
               LTH=6                                                            
         MFLD  COL1357,                                                +        
               LTH=1                                                            
         MFLD  COL1362,                                                +        
               LTH=9                                                            
         MFLD  COL1372,                                                +        
               LTH=8                                                            
         MFLD  COL1450,                                                +        
               LTH=6                                                            
         MFLD  COL1457,                                                +        
               LTH=1                                                            
         MFLD  COL1462,                                                +        
               LTH=9                                                            
         MFLD  COL1472,                                                +        
               LTH=8                                                            
         MFLD  COL1550,                                                +        
               LTH=6                                                            
         MFLD  COL1557,                                                +        
               LTH=1                                                            
         MFLD  COL1562,                                                +        
               LTH=9                                                            
         MFLD  COL1572,                                                +        
               LTH=8                                                            
         MFLD  COL1650,                                                +        
               LTH=6                                                            
         MFLD  COL1657,                                                +        
               LTH=1                                                            
         MFLD  COL1662,                                                +        
               LTH=9                                                            
         MFLD  COL1672,                                                +        
               LTH=8                                                            
         MFLD  COL1750,                                                +        
               LTH=6                                                            
         MFLD  COL1757,                                                +        
               LTH=1                                                            
         MFLD  COL1762,                                                +        
               LTH=9                                                            
         MFLD  COL1772,                                                +        
               LTH=8                                                            
         MFLD  COL1850,                                                +        
               LTH=6                                                            
         MFLD  COL1857,                                                +        
               LTH=1                                                            
         MFLD  COL1862,                                                +        
               LTH=9                                                            
         MFLD  COL1872,                                                +        
               LTH=8                                                            
         MFLD  COL1950,                                                +        
               LTH=6                                                            
         MFLD  COL1957,                                                +        
               LTH=1                                                            
         MFLD  COL1962,                                                +        
               LTH=9                                                            
         MFLD  COL1972,                                                +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I124N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N124),                                           +        
               OPT=2,                                                  +        
               NXT=W2O124N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21242',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0404,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0602,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0605,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0609,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0617,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0625,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0633,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0642,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0902,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0905,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0913,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0922,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0929,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0938,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1002,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1005,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1013,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1022,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1029,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1038,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1102,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1105,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1113,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1122,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1129,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1138,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1202,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1205,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1213,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1222,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1229,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1238,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1302,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1305,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1313,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1322,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1329,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1338,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1402,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1405,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1413,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1422,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1429,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1438,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1502,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1505,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1513,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1522,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1529,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1538,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1602,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1605,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1613,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1622,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1629,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1638,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1815,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1838,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1908,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1917,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL2008,                                                +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0650,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0657,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0662,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0672,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0750,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0757,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0762,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0772,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0850,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0857,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0862,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0872,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0950,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0957,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0962,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0972,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1050,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1057,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1062,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1072,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1150,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1157,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1162,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1172,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1250,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1257,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1262,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1272,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1350,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1357,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1362,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1372,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1450,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1457,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1462,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1472,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1550,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1557,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1562,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1572,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1650,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1657,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1662,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1672,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1750,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1757,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1762,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1772,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1850,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1857,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1862,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1872,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1950,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1957,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1962,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1972,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
