***********************************************************************         
* CREATED BY PC40073   ON 97/05/05  AT 08:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2N137   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T131  ',                                           +        
               2='W2T132  ',                                           +        
               3='W2T133  ',                                           +        
               4='W2T134  ',                                           +        
               5='W2T135  ',                                           +        
               6='W2T136  ',                                           +        
               7='W2T137  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T137U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T131  ',                                          +        
               14='W2T132  ',                                          +        
               15='W2T133  ',                                          +        
               16='W2T134  ',                                          +        
               17='W2T135  ',                                          +        
               18='W2T136  ',                                          +        
               19='W2T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SEASON ANALYSIS PB-PLAN',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0322  DFLD  POS=(4,12),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Per     Cdc    Dc-r   Dc-fk    Hist',                  +        
               POS=(5,2),LTH=35,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ' Computed       Manuel       -----Sim---',             +        
               POS=(5,41),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0607  DFLD  POS=(6,07),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0615  DFLD  POS=(6,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0623  DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0633  DFLD  POS=(6,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0639  DFLD  POS=(6,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0646  DFLD  POS=(6,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0659  DFLD  POS=(6,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0670  DFLD  POS=(6,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0677  DFLD  POS=(6,77),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0702  DFLD  POS=(7,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0707  DFLD  POS=(7,07),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0715  DFLD  POS=(7,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0723  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0733  DFLD  POS=(7,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0739  DFLD  POS=(7,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(7,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0759  DFLD  POS=(7,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0770  DFLD  POS=(7,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0777  DFLD  POS=(7,77),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0802  DFLD  POS=(8,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0807  DFLD  POS=(8,07),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0815  DFLD  POS=(8,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0833  DFLD  POS=(8,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0839  DFLD  POS=(8,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0846  DFLD  POS=(8,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0859  DFLD  POS=(8,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0870  DFLD  POS=(8,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0877  DFLD  POS=(8,77),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0902  DFLD  POS=(9,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0907  DFLD  POS=(9,07),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0915  DFLD  POS=(9,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0923  DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0933  DFLD  POS=(9,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0939  DFLD  POS=(9,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0946  DFLD  POS=(9,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0959  DFLD  POS=(9,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0970  DFLD  POS=(9,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0977  DFLD  POS=(9,77),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD1002  DFLD  POS=(10,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1007  DFLD  POS=(10,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1015  DFLD  POS=(10,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1023  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1033  DFLD  POS=(10,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1039  DFLD  POS=(10,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1046  DFLD  POS=(10,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1059  DFLD  POS=(10,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1070  DFLD  POS=(10,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1077  DFLD  POS=(10,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1102  DFLD  POS=(11,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1107  DFLD  POS=(11,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1115  DFLD  POS=(11,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1123  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1133  DFLD  POS=(11,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1139  DFLD  POS=(11,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1146  DFLD  POS=(11,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1159  DFLD  POS=(11,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1170  DFLD  POS=(11,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1177  DFLD  POS=(11,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1202  DFLD  POS=(12,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1207  DFLD  POS=(12,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1215  DFLD  POS=(12,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1233  DFLD  POS=(12,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1239  DFLD  POS=(12,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1246  DFLD  POS=(12,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1259  DFLD  POS=(12,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1270  DFLD  POS=(12,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1277  DFLD  POS=(12,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1302  DFLD  POS=(13,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1307  DFLD  POS=(13,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1315  DFLD  POS=(13,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1323  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1333  DFLD  POS=(13,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1339  DFLD  POS=(13,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1346  DFLD  POS=(13,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1359  DFLD  POS=(13,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1370  DFLD  POS=(13,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1377  DFLD  POS=(13,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1402  DFLD  POS=(14,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1407  DFLD  POS=(14,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1415  DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1423  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1433  DFLD  POS=(14,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1439  DFLD  POS=(14,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1446  DFLD  POS=(14,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1459  DFLD  POS=(14,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1470  DFLD  POS=(14,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1477  DFLD  POS=(14,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1502  DFLD  POS=(15,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1507  DFLD  POS=(15,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1515  DFLD  POS=(15,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1523  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1533  DFLD  POS=(15,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1539  DFLD  POS=(15,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1546  DFLD  POS=(15,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1559  DFLD  POS=(15,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1570  DFLD  POS=(15,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1577  DFLD  POS=(15,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1602  DFLD  POS=(16,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1607  DFLD  POS=(16,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1615  DFLD  POS=(16,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1623  DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1633  DFLD  POS=(16,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1639  DFLD  POS=(16,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(16,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1659  DFLD  POS=(16,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1670  DFLD  POS=(16,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1677  DFLD  POS=(16,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
FLD1702  DFLD  POS=(17,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1707  DFLD  POS=(17,07),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1715  DFLD  POS=(17,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1723  DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1733  DFLD  POS=(17,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1739  DFLD  POS=(17,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1746  DFLD  POS=(17,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1759  DFLD  POS=(17,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1770  DFLD  POS=(17,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1777  DFLD  POS=(17,77),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PB-Plan comp',                                         +        
               POS=(18,38),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PB-Plan man',                                          +        
               POS=(18,52),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Until',                                                +        
               POS=(18,65),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Until',                                                +        
               POS=(18,76),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Tot',                                                  +        
               POS=(19,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1906  DFLD  POS=(19,06),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1914  DFLD  POS=(19,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1922  DFLD  POS=(19,22),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1938  DFLD  POS=(19,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1951  DFLD  POS=(19,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1964  DFLD  POS=(19,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1975  DFLD  POS=(19,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD2075  DFLD  POS=(20,75),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O137N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N137,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I137N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0322,                                                +        
               LTH=25                                                           
         MFLD  FLD0602,                                                +        
               LTH=2                                                            
         MFLD  FLD0702,                                                +        
               LTH=2                                                            
         MFLD  FLD0802,                                                +        
               LTH=2                                                            
         MFLD  FLD0902,                                                +        
               LTH=2                                                            
         MFLD  FLD1002,                                                +        
               LTH=2                                                            
         MFLD  FLD1102,                                                +        
               LTH=2                                                            
         MFLD  FLD1202,                                                +        
               LTH=2                                                            
         MFLD  FLD1302,                                                +        
               LTH=2                                                            
         MFLD  FLD1402,                                                +        
               LTH=2                                                            
         MFLD  FLD1502,                                                +        
               LTH=2                                                            
         MFLD  FLD1602,                                                +        
               LTH=2                                                            
         MFLD  FLD1702,                                                +        
               LTH=2                                                            
         MFLD  FLD0607,                                                +        
               LTH=6                                                            
         MFLD  FLD0707,                                                +        
               LTH=6                                                            
         MFLD  FLD0807,                                                +        
               LTH=6                                                            
         MFLD  FLD0907,                                                +        
               LTH=6                                                            
         MFLD  FLD1007,                                                +        
               LTH=6                                                            
         MFLD  FLD1107,                                                +        
               LTH=6                                                            
         MFLD  FLD1207,                                                +        
               LTH=6                                                            
         MFLD  FLD1307,                                                +        
               LTH=6                                                            
         MFLD  FLD1407,                                                +        
               LTH=6                                                            
         MFLD  FLD1507,                                                +        
               LTH=6                                                            
         MFLD  FLD1607,                                                +        
               LTH=6                                                            
         MFLD  FLD1707,                                                +        
               LTH=6                                                            
         MFLD  FLD0615,                                                +        
               LTH=6                                                            
         MFLD  FLD0715,                                                +        
               LTH=6                                                            
         MFLD  FLD0815,                                                +        
               LTH=6                                                            
         MFLD  FLD0915,                                                +        
               LTH=6                                                            
         MFLD  FLD1015,                                                +        
               LTH=6                                                            
         MFLD  FLD1115,                                                +        
               LTH=6                                                            
         MFLD  FLD1215,                                                +        
               LTH=6                                                            
         MFLD  FLD1315,                                                +        
               LTH=6                                                            
         MFLD  FLD1415,                                                +        
               LTH=6                                                            
         MFLD  FLD1515,                                                +        
               LTH=6                                                            
         MFLD  FLD1615,                                                +        
               LTH=6                                                            
         MFLD  FLD1715,                                                +        
               LTH=6                                                            
         MFLD  FLD0623,                                                +        
               LTH=6                                                            
         MFLD  FLD0723,                                                +        
               LTH=6                                                            
         MFLD  FLD0823,                                                +        
               LTH=6                                                            
         MFLD  FLD0923,                                                +        
               LTH=6                                                            
         MFLD  FLD1023,                                                +        
               LTH=6                                                            
         MFLD  FLD1123,                                                +        
               LTH=6                                                            
         MFLD  FLD1223,                                                +        
               LTH=6                                                            
         MFLD  FLD1323,                                                +        
               LTH=6                                                            
         MFLD  FLD1423,                                                +        
               LTH=6                                                            
         MFLD  FLD1523,                                                +        
               LTH=6                                                            
         MFLD  FLD1623,                                                +        
               LTH=6                                                            
         MFLD  FLD1723,                                                +        
               LTH=6                                                            
         MFLD  FLD1906,                                                +        
               LTH=7                                                            
         MFLD  FLD1914,                                                +        
               LTH=7                                                            
         MFLD  FLD1922,                                                +        
               LTH=7                                                            
         MFLD  FLD0633,                                                +        
               LTH=4                                                            
         MFLD  FLD0733,                                                +        
               LTH=4                                                            
         MFLD  FLD0833,                                                +        
               LTH=4                                                            
         MFLD  FLD0933,                                                +        
               LTH=4                                                            
         MFLD  FLD1033,                                                +        
               LTH=4                                                            
         MFLD  FLD1133,                                                +        
               LTH=4                                                            
         MFLD  FLD1233,                                                +        
               LTH=4                                                            
         MFLD  FLD1333,                                                +        
               LTH=4                                                            
         MFLD  FLD1433,                                                +        
               LTH=4                                                            
         MFLD  FLD1533,                                                +        
               LTH=4                                                            
         MFLD  FLD1633,                                                +        
               LTH=4                                                            
         MFLD  FLD1733,                                                +        
               LTH=4                                                            
         MFLD  FLD0639,                                                +        
               LTH=6                                                            
         MFLD  FLD0739,                                                +        
               LTH=6                                                            
         MFLD  FLD0839,                                                +        
               LTH=6                                                            
         MFLD  FLD0939,                                                +        
               LTH=6                                                            
         MFLD  FLD1039,                                                +        
               LTH=6                                                            
         MFLD  FLD1139,                                                +        
               LTH=6                                                            
         MFLD  FLD1239,                                                +        
               LTH=6                                                            
         MFLD  FLD1339,                                                +        
               LTH=6                                                            
         MFLD  FLD1439,                                                +        
               LTH=6                                                            
         MFLD  FLD1539,                                                +        
               LTH=6                                                            
         MFLD  FLD1639,                                                +        
               LTH=6                                                            
         MFLD  FLD1739,                                                +        
               LTH=6                                                            
         MFLD  FLD1938,                                                +        
               LTH=8                                                            
         MFLD  FLD0646,                                                +        
               LTH=4                                                            
         MFLD  FLD0746,                                                +        
               LTH=4                                                            
         MFLD  FLD0846,                                                +        
               LTH=4                                                            
         MFLD  FLD0946,                                                +        
               LTH=4                                                            
         MFLD  FLD1046,                                                +        
               LTH=4                                                            
         MFLD  FLD1146,                                                +        
               LTH=4                                                            
         MFLD  FLD1246,                                                +        
               LTH=4                                                            
         MFLD  FLD1346,                                                +        
               LTH=4                                                            
         MFLD  FLD1446,                                                +        
               LTH=4                                                            
         MFLD  FLD1546,                                                +        
               LTH=4                                                            
         MFLD  FLD1646,                                                +        
               LTH=4                                                            
         MFLD  FLD1746,                                                +        
               LTH=4                                                            
         MFLD  FLD1951,                                                +        
               LTH=8                                                            
         MFLD  FLD1964,                                                +        
               LTH=6                                                            
         MFLD  FLD0659,                                                +        
               LTH=4                                                            
         MFLD  FLD0759,                                                +        
               LTH=4                                                            
         MFLD  FLD0859,                                                +        
               LTH=4                                                            
         MFLD  FLD0959,                                                +        
               LTH=4                                                            
         MFLD  FLD1059,                                                +        
               LTH=4                                                            
         MFLD  FLD1159,                                                +        
               LTH=4                                                            
         MFLD  FLD1259,                                                +        
               LTH=4                                                            
         MFLD  FLD1359,                                                +        
               LTH=4                                                            
         MFLD  FLD1459,                                                +        
               LTH=4                                                            
         MFLD  FLD1559,                                                +        
               LTH=4                                                            
         MFLD  FLD1659,                                                +        
               LTH=4                                                            
         MFLD  FLD1759,                                                +        
               LTH=4                                                            
         MFLD  FLD1975,                                                +        
               LTH=6                                                            
         MFLD  FLD0670,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0770,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0870,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0970,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1070,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1170,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1270,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1370,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1470,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1570,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1670,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1770,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0677,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0777,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0877,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0977,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1077,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1177,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1277,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1377,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1477,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1577,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1677,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1777,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2075,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I137N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N137),                                           +        
               OPT=2,                                                  +        
               NXT=W2O137N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21372',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0670,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0770,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0870,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0970,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1070,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1170,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1270,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1370,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1470,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1570,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1670,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1770,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0677,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0777,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0877,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0977,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1077,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1177,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1277,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1377,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1477,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1577,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1677,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1777,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2075,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
