***********************************************************************         
* CREATED BY V028439   ON 01/11/13  AT 09:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LARM                            '                               
W2N171   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551u ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W2T171 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T171 7',                                           +        
               8='W2T171 8',                                           +        
               9='W2T171 9',                                           +        
               10='WHELP   ',                                          +        
               11='W2T171U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T171  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W2T171 4',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T171u ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N171   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A L A R M',                                            +        
               POS=(1,20),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Procur.No',                                            +        
               POS=(2,22),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
ANSKIN   DFLD  POS=(2,32),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Suppl.',                                               +        
               POS=(2,36),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNRIN  DFLD  POS=(2,43),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Causecode',                                            +        
               POS=(2,50),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ORSAKIN  DFLD  POS=(2,60),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'OHF',                                                  +        
               POS=(2,65),LTH=3,                                       +        
               ATTR=(PROT)                                                      
OTFREKIN DFLD  POS=(2,69),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANSKUT   DFLD  POS=(3,32),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNRUT  DFLD  POS=(3,43),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ORSAKUT  DFLD  POS=(3,60),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
OTFREKUT DFLD  POS=(3,69),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0004 DFLD  POS=(4,9),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0000 DFLD  POS=(4,16),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0003 DFLD  POS=(4,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0005 DFLD  POS=(4,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(4,34),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'S-D N  Cau  Part No. Suppl. Date  Time  Distr Cause tex+        
               t',                                                     +        
               POS=(5,2),LTH=56,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'OHF',                                                  +        
               POS=(5,71),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Alert',                                                +        
               POS=(4,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'date',                                                 +        
               POS=(5,76),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0603  DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0606  DFLD  POS=(6,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0609  DFLD  POS=(6,9),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0613  DFLD  POS=(6,13),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR1   DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0623  DFLD  POS=(6,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0630  DFLD  POS=(6,36),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0639  DFLD  POS=(6,43),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0644  DFLD  POS=(6,48),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK06 DFLD  POS=(6,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0670  DFLD  POS=(6,75),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0703  DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0706  DFLD  POS=(7,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0709  DFLD  POS=(7,9),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0713  DFLD  POS=(7,13),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR2   DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0723  DFLD  POS=(7,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0730  DFLD  POS=(7,36),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0739  DFLD  POS=(7,43),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0744  DFLD  POS=(7,48),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK07 DFLD  POS=(7,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0770  DFLD  POS=(7,75),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0803  DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0806  DFLD  POS=(8,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0809  DFLD  POS=(8,9),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0813  DFLD  POS=(8,13),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR3   DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0823  DFLD  POS=(8,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0830  DFLD  POS=(8,36),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0839  DFLD  POS=(8,43),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0844  DFLD  POS=(8,48),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK08 DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0870  DFLD  POS=(8,75),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0903  DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0906  DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0909  DFLD  POS=(9,9),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0913  DFLD  POS=(9,13),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR4   DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0923  DFLD  POS=(9,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0930  DFLD  POS=(9,36),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0939  DFLD  POS=(9,43),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0944  DFLD  POS=(9,48),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
OTFREK09 DFLD  POS=(9,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0970  DFLD  POS=(9,75),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1003  DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1006  DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1009  DFLD  POS=(10,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1013  DFLD  POS=(10,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR5   DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1023  DFLD  POS=(10,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1030  DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1039  DFLD  POS=(10,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1044  DFLD  POS=(10,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK10 DFLD  POS=(10,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1070  DFLD  POS=(10,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1103  DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1106  DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1109  DFLD  POS=(11,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1113  DFLD  POS=(11,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR6   DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1123  DFLD  POS=(11,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1130  DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1139  DFLD  POS=(11,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1144  DFLD  POS=(11,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK11 DFLD  POS=(11,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1170  DFLD  POS=(11,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1203  DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1206  DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1209  DFLD  POS=(12,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1213  DFLD  POS=(12,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR7   DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1223  DFLD  POS=(12,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1230  DFLD  POS=(12,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1239  DFLD  POS=(12,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1244  DFLD  POS=(12,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK12 DFLD  POS=(12,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1270  DFLD  POS=(12,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1303  DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1306  DFLD  POS=(13,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1309  DFLD  POS=(13,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1313  DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR8   DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1323  DFLD  POS=(13,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1330  DFLD  POS=(13,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1339  DFLD  POS=(13,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1344  DFLD  POS=(13,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK13 DFLD  POS=(13,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1370  DFLD  POS=(13,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1403  DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1406  DFLD  POS=(14,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1409  DFLD  POS=(14,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1413  DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR9   DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1423  DFLD  POS=(14,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1430  DFLD  POS=(14,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1439  DFLD  POS=(14,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1444  DFLD  POS=(14,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK14 DFLD  POS=(14,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1470  DFLD  POS=(14,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1503  DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1506  DFLD  POS=(15,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1509  DFLD  POS=(15,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1513  DFLD  POS=(15,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR10  DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1523  DFLD  POS=(15,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1530  DFLD  POS=(15,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1539  DFLD  POS=(15,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1544  DFLD  POS=(15,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK15 DFLD  POS=(15,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1570  DFLD  POS=(15,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1603  DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1606  DFLD  POS=(16,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1609  DFLD  POS=(16,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1613  DFLD  POS=(16,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR11  DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1623  DFLD  POS=(16,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1630  DFLD  POS=(16,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1639  DFLD  POS=(16,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1644  DFLD  POS=(16,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK16 DFLD  POS=(16,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1670  DFLD  POS=(16,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1703  DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1706  DFLD  POS=(17,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1709  DFLD  POS=(17,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1713  DFLD  POS=(17,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR12  DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1723  DFLD  POS=(17,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1730  DFLD  POS=(17,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1739  DFLD  POS=(17,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1744  DFLD  POS=(17,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK17 DFLD  POS=(17,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1770  DFLD  POS=(17,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1803  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1806  DFLD  POS=(18,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1809  DFLD  POS=(18,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1813  DFLD  POS=(18,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR13  DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1823  DFLD  POS=(18,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1830  DFLD  POS=(18,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1839  DFLD  POS=(18,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1844  DFLD  POS=(18,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK18 DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1870  DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1903  DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1906  DFLD  POS=(19,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1909  DFLD  POS=(19,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1913  DFLD  POS=(19,13),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVNR14  DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1923  DFLD  POS=(19,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1930  DFLD  POS=(19,36),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL1939  DFLD  POS=(19,43),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
COL1944  DFLD  POS=(19,48),LTH=24,                                     +        
               ATTR=(NUM,PROT)                                                  
OTFREK19 DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1970  DFLD  POS=(19,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Alarm',                                             +        
               POS=(21,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '05',                                                   +        
               POS=(21,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIMME    DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O171N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N171,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I171N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N171                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  ANSKIN,                                                 +        
               LTH=3                                                            
         MFLD  ANSKUT,                                                 +        
               LTH=3                                                            
         MFLD  LEVNRIN,                                                +        
               LTH=5                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  ORSAKIN,                                                +        
               LTH=3                                                            
         MFLD  ORSAKUT,                                                +        
               LTH=3                                                            
         MFLD  OTFREKIN,                                               +        
               LTH=1                                                            
         MFLD  OTFREKUT,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=3                                                            
         MFLD  COL0603,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0606,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0609,                                                +        
               LTH=3                                                            
         MFLD  COL0613,                                                +        
               LTH=9                                                            
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  COL0623,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0630,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0639,                                                +        
               LTH=4                                                            
         MFLD  COL0644,                                                +        
               LTH=24                                                           
         MFLD  OTFREK06,                                               +        
               LTH=1                                                            
         MFLD  COL0670,                                                +        
               LTH=6                                                            
         MFLD  COL0703,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0706,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0709,                                                +        
               LTH=3                                                            
         MFLD  COL0713,                                                +        
               LTH=9                                                            
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  COL0723,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0730,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0739,                                                +        
               LTH=4                                                            
         MFLD  COL0744,                                                +        
               LTH=24                                                           
         MFLD  OTFREK07,                                               +        
               LTH=1                                                            
         MFLD  COL0770,                                                +        
               LTH=6                                                            
         MFLD  COL0803,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0806,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0809,                                                +        
               LTH=3                                                            
         MFLD  COL0813,                                                +        
               LTH=9                                                            
         MFLD  LEVNR3,                                                 +        
               LTH=5                                                            
         MFLD  COL0823,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0830,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0839,                                                +        
               LTH=4                                                            
         MFLD  COL0844,                                                +        
               LTH=24                                                           
         MFLD  OTFREK08,                                               +        
               LTH=1                                                            
         MFLD  COL0870,                                                +        
               LTH=6                                                            
         MFLD  COL0903,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0906,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0909,                                                +        
               LTH=3                                                            
         MFLD  COL0913,                                                +        
               LTH=9                                                            
         MFLD  LEVNR4,                                                 +        
               LTH=5                                                            
         MFLD  COL0923,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0930,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0939,                                                +        
               LTH=4                                                            
         MFLD  COL0944,                                                +        
               LTH=24                                                           
         MFLD  OTFREK09,                                               +        
               LTH=1                                                            
         MFLD  COL0970,                                                +        
               LTH=6                                                            
         MFLD  COL1003,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1006,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1009,                                                +        
               LTH=3                                                            
         MFLD  COL1013,                                                +        
               LTH=9                                                            
         MFLD  LEVNR5,                                                 +        
               LTH=5                                                            
         MFLD  COL1023,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1030,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1039,                                                +        
               LTH=4                                                            
         MFLD  COL1044,                                                +        
               LTH=24                                                           
         MFLD  OTFREK10,                                               +        
               LTH=1                                                            
         MFLD  COL1070,                                                +        
               LTH=6                                                            
         MFLD  COL1103,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1106,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1109,                                                +        
               LTH=3                                                            
         MFLD  COL1113,                                                +        
               LTH=9                                                            
         MFLD  LEVNR6,                                                 +        
               LTH=5                                                            
         MFLD  COL1123,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1130,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1139,                                                +        
               LTH=4                                                            
         MFLD  COL1144,                                                +        
               LTH=24                                                           
         MFLD  OTFREK11,                                               +        
               LTH=1                                                            
         MFLD  COL1170,                                                +        
               LTH=6                                                            
         MFLD  COL1203,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1206,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1209,                                                +        
               LTH=3                                                            
         MFLD  COL1213,                                                +        
               LTH=9                                                            
         MFLD  LEVNR7,                                                 +        
               LTH=5                                                            
         MFLD  COL1223,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1230,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1239,                                                +        
               LTH=4                                                            
         MFLD  COL1244,                                                +        
               LTH=24                                                           
         MFLD  OTFREK12,                                               +        
               LTH=1                                                            
         MFLD  COL1270,                                                +        
               LTH=6                                                            
         MFLD  COL1303,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1306,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1309,                                                +        
               LTH=3                                                            
         MFLD  COL1313,                                                +        
               LTH=9                                                            
         MFLD  LEVNR8,                                                 +        
               LTH=5                                                            
         MFLD  COL1323,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1330,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1339,                                                +        
               LTH=4                                                            
         MFLD  COL1344,                                                +        
               LTH=24                                                           
         MFLD  OTFREK13,                                               +        
               LTH=1                                                            
         MFLD  COL1370,                                                +        
               LTH=6                                                            
         MFLD  COL1403,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1406,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=3                                                            
         MFLD  COL1413,                                                +        
               LTH=9                                                            
         MFLD  LEVNR9,                                                 +        
               LTH=5                                                            
         MFLD  COL1423,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1430,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1439,                                                +        
               LTH=4                                                            
         MFLD  COL1444,                                                +        
               LTH=24                                                           
         MFLD  OTFREK14,                                               +        
               LTH=1                                                            
         MFLD  COL1470,                                                +        
               LTH=6                                                            
         MFLD  COL1503,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1506,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1509,                                                +        
               LTH=3                                                            
         MFLD  COL1513,                                                +        
               LTH=9                                                            
         MFLD  LEVNR10,                                                +        
               LTH=5                                                            
         MFLD  COL1523,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1530,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1539,                                                +        
               LTH=4                                                            
         MFLD  COL1544,                                                +        
               LTH=24                                                           
         MFLD  OTFREK15,                                               +        
               LTH=1                                                            
         MFLD  COL1570,                                                +        
               LTH=6                                                            
         MFLD  COL1603,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1606,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1609,                                                +        
               LTH=3                                                            
         MFLD  COL1613,                                                +        
               LTH=9                                                            
         MFLD  LEVNR11,                                                +        
               LTH=5                                                            
         MFLD  COL1623,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1630,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1639,                                                +        
               LTH=4                                                            
         MFLD  COL1644,                                                +        
               LTH=24                                                           
         MFLD  OTFREK16,                                               +        
               LTH=1                                                            
         MFLD  COL1670,                                                +        
               LTH=6                                                            
         MFLD  COL1703,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1706,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1709,                                                +        
               LTH=3                                                            
         MFLD  COL1713,                                                +        
               LTH=9                                                            
         MFLD  LEVNR12,                                                +        
               LTH=5                                                            
         MFLD  COL1723,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1730,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1739,                                                +        
               LTH=4                                                            
         MFLD  COL1744,                                                +        
               LTH=24                                                           
         MFLD  OTFREK17,                                               +        
               LTH=1                                                            
         MFLD  COL1770,                                                +        
               LTH=6                                                            
         MFLD  COL1803,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1806,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1809,                                                +        
               LTH=3                                                            
         MFLD  COL1813,                                                +        
               LTH=9                                                            
         MFLD  LEVNR13,                                                +        
               LTH=5                                                            
         MFLD  COL1823,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1830,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1839,                                                +        
               LTH=4                                                            
         MFLD  COL1844,                                                +        
               LTH=24                                                           
         MFLD  OTFREK18,                                               +        
               LTH=1                                                            
         MFLD  COL1870,                                                +        
               LTH=6                                                            
         MFLD  COL1903,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1906,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1909,                                                +        
               LTH=3                                                            
         MFLD  COL1913,                                                +        
               LTH=9                                                            
         MFLD  LEVNR14,                                                +        
               LTH=5                                                            
         MFLD  COL1923,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1930,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1939,                                                +        
               LTH=4                                                            
         MFLD  COL1944,                                                +        
               LTH=24                                                           
         MFLD  OTFREK19,                                               +        
               LTH=1                                                            
         MFLD  COL1970,                                                +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIMME,                                                 +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I171N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N171),                                           +        
               OPT=2,                                                  +        
               NXT=W2O171N1                                                     
MID      LPAGE SOR=(W2N171)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21712',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANSKIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ANSKUT,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ORSAKIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ORSAKUT,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (OTFREKIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OTFREKUT,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL0603,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0606,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0609,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0623,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0630,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0703,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0706,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0709,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0723,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0730,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0803,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0806,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0809,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0823,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0830,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0903,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0906,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0909,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0923,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0930,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1003,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1006,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1009,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1023,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1030,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1103,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1106,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1109,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1123,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1130,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1203,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1206,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1209,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1223,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1230,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1303,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1306,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1309,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1323,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1330,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1403,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1406,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1409,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1423,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1430,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1503,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1506,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1509,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1523,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1530,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1603,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1606,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1609,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1623,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1630,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1703,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1706,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1709,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1723,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1730,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1803,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1806,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1809,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1823,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1830,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1903,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1906,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL1909,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1923,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL1930,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
