***********************************************************************         
* CREATED BY V086977   ON 01/12/17  AT 12:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEMAND PER PART                 '                               
W2N158   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W2T128  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N158   DPAGE CURSOR=((2,11)),                                        +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DEMAND PER WEEK AND DC',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'YYWW',                                                 +        
               POS=(2,20),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
AAVVIN   DFLD  POS=(2,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
AAVVUT   DFLD  POS=(3,25),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC      Qty',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC      Qty',                                          +        
               POS=(5,18),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC      Qty',                                          +        
               POS=(5,34),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC      Qty',                                          +        
               POS=(5,50),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC      Qty',                                          +        
               POS=(5,66),LTH=11,                                      +        
               ATTR=(PROT)                                                      
* column 1                                                                      
DC101    DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KVPB101  DFLD  POS=(6,5),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DC102    DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KVPB102  DFLD  POS=(7,5),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DC103    DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KVPB103  DFLD  POS=(8,5),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DC104    DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KVPB104  DFLD  POS=(9,5),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DC105    DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB105  DFLD  POS=(10,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC106    DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB106  DFLD  POS=(11,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC107    DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB107  DFLD  POS=(12,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC108    DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB108  DFLD  POS=(13,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC109    DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB109  DFLD  POS=(14,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC110    DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB110  DFLD  POS=(15,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC111    DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB111  DFLD  POS=(16,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC112    DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB112  DFLD  POS=(17,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC113    DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB113  DFLD  POS=(18,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC114    DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB114  DFLD  POS=(19,5),LTH=8,                                       +        
               ATTR=(PROT)                                                      
* column 2                                                                      
DC201    DFLD  POS=(6,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB201  DFLD  POS=(6,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC202    DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB202  DFLD  POS=(7,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC203    DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB203  DFLD  POS=(8,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC204    DFLD  POS=(9,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB204  DFLD  POS=(9,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC205    DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB205  DFLD  POS=(10,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC206    DFLD  POS=(11,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB206  DFLD  POS=(11,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC207    DFLD  POS=(12,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB207  DFLD  POS=(12,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC208    DFLD  POS=(13,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB208  DFLD  POS=(13,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC209    DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB209  DFLD  POS=(14,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC210    DFLD  POS=(15,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB210  DFLD  POS=(15,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC211    DFLD  POS=(16,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB211  DFLD  POS=(16,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC212    DFLD  POS=(17,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB212  DFLD  POS=(17,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC213    DFLD  POS=(18,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB213  DFLD  POS=(18,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC214    DFLD  POS=(19,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB214  DFLD  POS=(19,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
* column 3                                                                      
DC301    DFLD  POS=(6,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB301  DFLD  POS=(6,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC302    DFLD  POS=(7,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB302  DFLD  POS=(7,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC303    DFLD  POS=(8,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB303  DFLD  POS=(8,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC304    DFLD  POS=(9,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB304  DFLD  POS=(9,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC305    DFLD  POS=(10,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB305  DFLD  POS=(10,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC306    DFLD  POS=(11,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB306  DFLD  POS=(11,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC307    DFLD  POS=(12,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB307  DFLD  POS=(12,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC308    DFLD  POS=(13,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB308  DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC309    DFLD  POS=(14,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB309  DFLD  POS=(14,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC310    DFLD  POS=(15,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB310  DFLD  POS=(15,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC311    DFLD  POS=(16,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB311  DFLD  POS=(16,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC312    DFLD  POS=(17,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB312  DFLD  POS=(17,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC313    DFLD  POS=(18,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB313  DFLD  POS=(18,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC314    DFLD  POS=(19,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB314  DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
* column 4                                                                      
DC401    DFLD  POS=(6,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB401  DFLD  POS=(6,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC402    DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB402  DFLD  POS=(7,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC403    DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB403  DFLD  POS=(8,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC404    DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB404  DFLD  POS=(9,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC405    DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB405  DFLD  POS=(10,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC406    DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB406  DFLD  POS=(11,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC407    DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB407  DFLD  POS=(12,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC408    DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB408  DFLD  POS=(13,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC409    DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB409  DFLD  POS=(14,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC410    DFLD  POS=(15,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB410  DFLD  POS=(15,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC411    DFLD  POS=(16,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB411  DFLD  POS=(16,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC412    DFLD  POS=(17,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB412  DFLD  POS=(17,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC413    DFLD  POS=(18,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB413  DFLD  POS=(18,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC414    DFLD  POS=(19,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB414  DFLD  POS=(19,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
* column 5                                                                      
DC501    DFLD  POS=(6,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB501  DFLD  POS=(6,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC502    DFLD  POS=(7,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB502  DFLD  POS=(7,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC503    DFLD  POS=(8,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB503  DFLD  POS=(8,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC504    DFLD  POS=(9,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB504  DFLD  POS=(9,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC505    DFLD  POS=(10,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB505  DFLD  POS=(10,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC506    DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB506  DFLD  POS=(11,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC507    DFLD  POS=(12,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB507  DFLD  POS=(12,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC508    DFLD  POS=(13,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB508  DFLD  POS=(13,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC509    DFLD  POS=(14,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB509  DFLD  POS=(14,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC510    DFLD  POS=(15,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB510  DFLD  POS=(15,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC511    DFLD  POS=(16,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB511  DFLD  POS=(16,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC512    DFLD  POS=(17,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB512  DFLD  POS=(17,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC513    DFLD  POS=(18,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB513  DFLD  POS=(18,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC514    DFLD  POS=(19,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVPB514  DFLD  POS=(19,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13              14              15              16     +        
                        17       ',                                    +        
               POS=(21,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18              19              20                ',   +        
               POS=(22,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O158N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N158,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I158N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N158                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  AAVVIN,                                                 +        
               LTH=4                                                            
         MFLD  AAVVUT,                                                 +        
               LTH=4                                                            
*column 1                                                                       
         MFLD  DC101,                                                  +        
               LTH=2                                                            
         MFLD  KVPB101,                                                +        
               LTH=8                                                            
         MFLD  DC102,                                                  +        
               LTH=2                                                            
         MFLD  KVPB102,                                                +        
               LTH=8                                                            
         MFLD  DC103,                                                  +        
               LTH=2                                                            
         MFLD  KVPB103,                                                +        
               LTH=8                                                            
         MFLD  DC104,                                                  +        
               LTH=2                                                            
         MFLD  KVPB104,                                                +        
               LTH=8                                                            
         MFLD  DC105,                                                  +        
               LTH=2                                                            
         MFLD  KVPB105,                                                +        
               LTH=8                                                            
         MFLD  DC106,                                                  +        
               LTH=2                                                            
         MFLD  KVPB106,                                                +        
               LTH=8                                                            
         MFLD  DC107,                                                  +        
               LTH=2                                                            
         MFLD  KVPB107,                                                +        
               LTH=8                                                            
         MFLD  DC108,                                                  +        
               LTH=2                                                            
         MFLD  KVPB108,                                                +        
               LTH=8                                                            
         MFLD  DC109,                                                  +        
               LTH=2                                                            
         MFLD  KVPB109,                                                +        
               LTH=8                                                            
         MFLD  DC110,                                                  +        
               LTH=2                                                            
         MFLD  KVPB110,                                                +        
               LTH=8                                                            
         MFLD  DC111,                                                  +        
               LTH=2                                                            
         MFLD  KVPB111,                                                +        
               LTH=8                                                            
         MFLD  DC112,                                                  +        
               LTH=2                                                            
         MFLD  KVPB112,                                                +        
               LTH=8                                                            
         MFLD  DC113,                                                  +        
               LTH=2                                                            
         MFLD  KVPB113,                                                +        
               LTH=8                                                            
         MFLD  DC114,                                                  +        
               LTH=2                                                            
         MFLD  KVPB114,                                                +        
               LTH=8                                                            
*column 2                                                                       
         MFLD  DC201,                                                  +        
               LTH=2                                                            
         MFLD  KVPB201,                                                +        
               LTH=8                                                            
         MFLD  DC202,                                                  +        
               LTH=2                                                            
         MFLD  KVPB202,                                                +        
               LTH=8                                                            
         MFLD  DC203,                                                  +        
               LTH=2                                                            
         MFLD  KVPB203,                                                +        
               LTH=8                                                            
         MFLD  DC204,                                                  +        
               LTH=2                                                            
         MFLD  KVPB204,                                                +        
               LTH=8                                                            
         MFLD  DC205,                                                  +        
               LTH=2                                                            
         MFLD  KVPB205,                                                +        
               LTH=8                                                            
         MFLD  DC206,                                                  +        
               LTH=2                                                            
         MFLD  KVPB206,                                                +        
               LTH=8                                                            
         MFLD  DC207,                                                  +        
               LTH=2                                                            
         MFLD  KVPB207,                                                +        
               LTH=8                                                            
         MFLD  DC208,                                                  +        
               LTH=2                                                            
         MFLD  KVPB208,                                                +        
               LTH=8                                                            
         MFLD  DC209,                                                  +        
               LTH=2                                                            
         MFLD  KVPB209,                                                +        
               LTH=8                                                            
         MFLD  DC210,                                                  +        
               LTH=2                                                            
         MFLD  KVPB210,                                                +        
               LTH=8                                                            
         MFLD  DC211,                                                  +        
               LTH=2                                                            
         MFLD  KVPB211,                                                +        
               LTH=8                                                            
         MFLD  DC212,                                                  +        
               LTH=2                                                            
         MFLD  KVPB212,                                                +        
               LTH=8                                                            
         MFLD  DC213,                                                  +        
               LTH=2                                                            
         MFLD  KVPB213,                                                +        
               LTH=8                                                            
         MFLD  DC214,                                                  +        
               LTH=2                                                            
         MFLD  KVPB214,                                                +        
               LTH=8                                                            
*column 3                                                                       
         MFLD  DC301,                                                  +        
               LTH=2                                                            
         MFLD  KVPB301,                                                +        
               LTH=8                                                            
         MFLD  DC302,                                                  +        
               LTH=2                                                            
         MFLD  KVPB302,                                                +        
               LTH=8                                                            
         MFLD  DC303,                                                  +        
               LTH=2                                                            
         MFLD  KVPB303,                                                +        
               LTH=8                                                            
         MFLD  DC304,                                                  +        
               LTH=2                                                            
         MFLD  KVPB304,                                                +        
               LTH=8                                                            
         MFLD  DC305,                                                  +        
               LTH=2                                                            
         MFLD  KVPB305,                                                +        
               LTH=8                                                            
         MFLD  DC306,                                                  +        
               LTH=2                                                            
         MFLD  KVPB306,                                                +        
               LTH=8                                                            
         MFLD  DC307,                                                  +        
               LTH=2                                                            
         MFLD  KVPB307,                                                +        
               LTH=8                                                            
         MFLD  DC308,                                                  +        
               LTH=2                                                            
         MFLD  KVPB308,                                                +        
               LTH=8                                                            
         MFLD  DC309,                                                  +        
               LTH=2                                                            
         MFLD  KVPB309,                                                +        
               LTH=8                                                            
         MFLD  DC310,                                                  +        
               LTH=2                                                            
         MFLD  KVPB310,                                                +        
               LTH=8                                                            
         MFLD  DC311,                                                  +        
               LTH=2                                                            
         MFLD  KVPB311,                                                +        
               LTH=8                                                            
         MFLD  DC312,                                                  +        
               LTH=2                                                            
         MFLD  KVPB312,                                                +        
               LTH=8                                                            
         MFLD  DC313,                                                  +        
               LTH=2                                                            
         MFLD  KVPB313,                                                +        
               LTH=8                                                            
         MFLD  DC314,                                                  +        
               LTH=2                                                            
         MFLD  KVPB314,                                                +        
               LTH=8                                                            
*column 4                                                                       
         MFLD  DC401,                                                  +        
               LTH=2                                                            
         MFLD  KVPB401,                                                +        
               LTH=8                                                            
         MFLD  DC402,                                                  +        
               LTH=2                                                            
         MFLD  KVPB402,                                                +        
               LTH=8                                                            
         MFLD  DC403,                                                  +        
               LTH=2                                                            
         MFLD  KVPB403,                                                +        
               LTH=8                                                            
         MFLD  DC404,                                                  +        
               LTH=2                                                            
         MFLD  KVPB404,                                                +        
               LTH=8                                                            
         MFLD  DC405,                                                  +        
               LTH=2                                                            
         MFLD  KVPB405,                                                +        
               LTH=8                                                            
         MFLD  DC406,                                                  +        
               LTH=2                                                            
         MFLD  KVPB406,                                                +        
               LTH=8                                                            
         MFLD  DC407,                                                  +        
               LTH=2                                                            
         MFLD  KVPB407,                                                +        
               LTH=8                                                            
         MFLD  DC408,                                                  +        
               LTH=2                                                            
         MFLD  KVPB408,                                                +        
               LTH=8                                                            
         MFLD  DC409,                                                  +        
               LTH=2                                                            
         MFLD  KVPB409,                                                +        
               LTH=8                                                            
         MFLD  DC410,                                                  +        
               LTH=2                                                            
         MFLD  KVPB410,                                                +        
               LTH=8                                                            
         MFLD  DC411,                                                  +        
               LTH=2                                                            
         MFLD  KVPB411,                                                +        
               LTH=8                                                            
         MFLD  DC412,                                                  +        
               LTH=2                                                            
         MFLD  KVPB412,                                                +        
               LTH=8                                                            
         MFLD  DC413,                                                  +        
               LTH=2                                                            
         MFLD  KVPB413,                                                +        
               LTH=8                                                            
         MFLD  DC414,                                                  +        
               LTH=2                                                            
         MFLD  KVPB414,                                                +        
               LTH=8                                                            
*column 5                                                                       
         MFLD  DC501,                                                  +        
               LTH=2                                                            
         MFLD  KVPB501,                                                +        
               LTH=8                                                            
         MFLD  DC502,                                                  +        
               LTH=2                                                            
         MFLD  KVPB502,                                                +        
               LTH=8                                                            
         MFLD  DC503,                                                  +        
               LTH=2                                                            
         MFLD  KVPB503,                                                +        
               LTH=8                                                            
         MFLD  DC504,                                                  +        
               LTH=2                                                            
         MFLD  KVPB504,                                                +        
               LTH=8                                                            
         MFLD  DC505,                                                  +        
               LTH=2                                                            
         MFLD  KVPB505,                                                +        
               LTH=8                                                            
         MFLD  DC506,                                                  +        
               LTH=2                                                            
         MFLD  KVPB506,                                                +        
               LTH=8                                                            
         MFLD  DC507,                                                  +        
               LTH=2                                                            
         MFLD  KVPB507,                                                +        
               LTH=8                                                            
         MFLD  DC508,                                                  +        
               LTH=2                                                            
         MFLD  KVPB508,                                                +        
               LTH=8                                                            
         MFLD  DC509,                                                  +        
               LTH=2                                                            
         MFLD  KVPB509,                                                +        
               LTH=8                                                            
         MFLD  DC510,                                                  +        
               LTH=2                                                            
         MFLD  KVPB510,                                                +        
               LTH=8                                                            
         MFLD  DC511,                                                  +        
               LTH=2                                                            
         MFLD  KVPB511,                                                +        
               LTH=8                                                            
         MFLD  DC512,                                                  +        
               LTH=2                                                            
         MFLD  KVPB512,                                                +        
               LTH=8                                                            
         MFLD  DC513,                                                  +        
               LTH=2                                                            
         MFLD  KVPB513,                                                +        
               LTH=8                                                            
         MFLD  DC514,                                                  +        
               LTH=2                                                            
         MFLD  KVPB514,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I158N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N158),                                           +        
               OPT=2,                                                  +        
               NXT=W2O158N1                                                     
MID      LPAGE SOR=(W2N158)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21582',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AAVVIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
