**********W.XDEV.******************************************************         
* CREATED BY V040073   ON 00/02/04  AT 09:28                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DELIVERY SCHEDULE               '                               
W2N139   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W2T103  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T139U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DELIVERY SCHEDULE',                                    +        
               POS=(1,21),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
MESS01   DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Partnumber',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Type',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0232  DFLD  POS=(2,33),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Supplier',                                             +        
               POS=(2,39),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0245  DFLD  POS=(2,49),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Period',                                               +        
               POS=(2,63),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0270  DFLD  POS=(2,70),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0332  DFLD  POS=(3,33),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0345  DFLD  POS=(3,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SHP',                                                  +        
               POS=(3,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0356  DFLD  POS=(3,59),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0370  DFLD  POS=(3,70),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description:',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,16),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dispatch day:',                                        +        
               POS=(5,43),LTH=8,                                       +        
               ATTR=(PROT)                                                      
AVSDAG1  DFLD  POS=(5,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAG2  DFLD  POS=(5,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAG3  DFLD  POS=(5,64),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAG4  DFLD  POS=(5,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAG5  DFLD  POS=(5,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Proc',                                                 +        
               POS=(6,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
AG       DFLD  POS=(6,08),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lt',                                                   +        
               POS=(6,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LT       DFLD  POS=(6,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ft',                                                   +        
               POS=(6,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FT       DFLD  POS=(6,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ot',                                                   +        
               POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BT       DFLD  POS=(6,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ds',                                                   +        
               POS=(6,30),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LP       DFLD  POS=(6,33),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DsBI',                                                 +        
               POS=(6,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
LPSP     DFLD  POS=(6,40),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ob',                                                   +        
               POS=(6,45),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BR       DFLD  POS=(6,48),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PER1     DFLD  POS=(8,2),LTH=04,                                       +        
               ATTR=(NUM,PROT)                                                  
GRP1     DFLD  POS=(8,07),LTH=9,                                       +        
               ATTR=(PROT)                                                      
GRP2     DFLD  POS=(8,21),LTH=9,                                       +        
               ATTR=(PROT)                                                      
GRP3     DFLD  POS=(8,35),LTH=9,                                       +        
               ATTR=(PROT)                                                      
GRP4     DFLD  POS=(8,49),LTH=9,                                       +        
               ATTR=(PROT)                                                      
GRP5     DFLD  POS=(8,63),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'MO',                                                   +        
               POS=(9,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVRUT1   DFLD  POS=(9,07),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVRIN1   DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVRUT2   DFLD  POS=(9,21),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVRIN2   DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVRUT3   DFLD  POS=(9,35),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVRIN3   DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVRUT4   DFLD  POS=(9,49),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVRIN4   DFLD  POS=(9,56),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVRUT5   DFLD  POS=(9,63),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVRIN5   DFLD  POS=(9,70),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TU',                                                   +        
               POS=(10,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT6   DFLD  POS=(10,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN6   DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT7   DFLD  POS=(10,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN7   DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT8   DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN8   DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT9   DFLD  POS=(10,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN9   DFLD  POS=(10,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT10  DFLD  POS=(10,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN10  DFLD  POS=(10,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'WE',                                                   +        
               POS=(11,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT11  DFLD  POS=(11,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN11  DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT12  DFLD  POS=(11,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN12  DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT13  DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN13  DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT14  DFLD  POS=(11,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN14  DFLD  POS=(11,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT15  DFLD  POS=(11,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN15  DFLD  POS=(11,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TH',                                                   +        
               POS=(12,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT16  DFLD  POS=(12,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN16  DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT17  DFLD  POS=(12,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN17  DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT18  DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN18  DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT19  DFLD  POS=(12,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN19  DFLD  POS=(12,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT20  DFLD  POS=(12,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN20  DFLD  POS=(12,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FR',                                                   +        
               POS=(13,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT21  DFLD  POS=(13,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN21  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT22  DFLD  POS=(13,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN22  DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT23  DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN23  DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT24  DFLD  POS=(13,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN24  DFLD  POS=(13,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT25  DFLD  POS=(13,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN25  DFLD  POS=(13,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
PER2     DFLD  POS=(15,2),LTH=04,                                      +        
               ATTR=(NUM,PROT)                                                  
GRP6     DFLD  POS=(15,07),LTH=9,                                      +        
               ATTR=(PROT)                                                      
GRP7     DFLD  POS=(15,21),LTH=9,                                      +        
               ATTR=(PROT)                                                      
GRP8     DFLD  POS=(15,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
GRP9     DFLD  POS=(15,49),LTH=9,                                      +        
               ATTR=(PROT)                                                      
GRP10    DFLD  POS=(15,63),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MO',                                                   +        
               POS=(16,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT26  DFLD  POS=(16,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN26  DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT27  DFLD  POS=(16,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN27  DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT28  DFLD  POS=(16,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN28  DFLD  POS=(16,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT29  DFLD  POS=(16,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN29  DFLD  POS=(16,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT30  DFLD  POS=(16,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN30  DFLD  POS=(16,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TU',                                                   +        
               POS=(17,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT31  DFLD  POS=(17,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN31  DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT32  DFLD  POS=(17,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN32  DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT33  DFLD  POS=(17,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN33  DFLD  POS=(17,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT34  DFLD  POS=(17,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN34  DFLD  POS=(17,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT35  DFLD  POS=(17,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN35  DFLD  POS=(17,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'WE',                                                   +        
               POS=(18,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT36  DFLD  POS=(18,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN36  DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT37  DFLD  POS=(18,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN37  DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT38  DFLD  POS=(18,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN38  DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT39  DFLD  POS=(18,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN39  DFLD  POS=(18,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT40  DFLD  POS=(18,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN40  DFLD  POS=(18,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TH',                                                   +        
               POS=(19,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT41  DFLD  POS=(19,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN41  DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT42  DFLD  POS=(19,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN42  DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT43  DFLD  POS=(19,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN43  DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT44  DFLD  POS=(19,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN44  DFLD  POS=(19,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT45  DFLD  POS=(19,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN45  DFLD  POS=(19,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FR',                                                   +        
               POS=(20,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AVRUT46  DFLD  POS=(20,07),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN46  DFLD  POS=(20,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT47  DFLD  POS=(20,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN47  DFLD  POS=(20,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT48  DFLD  POS=(20,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN48  DFLD  POS=(20,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT49  DFLD  POS=(20,49),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN49  DFLD  POS=(20,56),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVRUT50  DFLD  POS=(20,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
AVRIN50  DFLD  POS=(20,70),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PF3 Dlv-sched',                                        +        
               POS=(22,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
MESS23   DFLD  POS=(23,2),LTH=56,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O139N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N139,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I139N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  MESS01,                                                 +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0232,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0332,                                                +        
               LTH=1                                                            
         MFLD  FLD0245,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0270,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0345,                                                +        
               LTH=5                                                            
         MFLD  FLD0356,                                                +        
               LTH=5                                                            
         MFLD  FLD0370,                                                +        
               LTH=4                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  AVSDAG1,                                                +        
               LTH=2                                                            
         MFLD  AVSDAG2,                                                +        
               LTH=2                                                            
         MFLD  AVSDAG3,                                                +        
               LTH=2                                                            
         MFLD  AVSDAG4,                                                +        
               LTH=2                                                            
         MFLD  AVSDAG5,                                                +        
               LTH=2                                                            
         MFLD  AG,                                                     +        
               LTH=3                                                            
         MFLD  LT,                                                     +        
               LTH=2                                                            
         MFLD  FT,                                                     +        
               LTH=2                                                            
         MFLD  BT,                                                     +        
               LTH=2                                                            
         MFLD  LP,                                                     +        
               LTH=1                                                            
         MFLD  LPSP,                                                   +        
               LTH=4                                                            
         MFLD  BR,                                                     +        
               LTH=7                                                            
         MFLD  PER1,                                                   +        
               LTH=4                                                            
         MFLD  GRP1,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT1,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT6,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT11,                                                +        
               LTH=6                                                            
         MFLD  AVRIN11,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT16,                                                +        
               LTH=6                                                            
         MFLD  AVRIN16,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT21,                                                +        
               LTH=6                                                            
         MFLD  AVRIN21,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP2,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT2,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT7,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT12,                                                +        
               LTH=6                                                            
         MFLD  AVRIN12,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT17,                                                +        
               LTH=6                                                            
         MFLD  AVRIN17,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT22,                                                +        
               LTH=6                                                            
         MFLD  AVRIN22,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP3,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT3,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT8,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT13,                                                +        
               LTH=6                                                            
         MFLD  AVRIN13,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT18,                                                +        
               LTH=6                                                            
         MFLD  AVRIN18,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT23,                                                +        
               LTH=6                                                            
         MFLD  AVRIN23,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP4,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT4,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT9,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT14,                                                +        
               LTH=6                                                            
         MFLD  AVRIN14,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT19,                                                +        
               LTH=6                                                            
         MFLD  AVRIN19,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT24,                                                +        
               LTH=6                                                            
         MFLD  AVRIN24,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP5,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT5,                                                 +        
               LTH=6                                                            
         MFLD  AVRIN5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT10,                                                +        
               LTH=6                                                            
         MFLD  AVRIN10,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT15,                                                +        
               LTH=6                                                            
         MFLD  AVRIN15,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT20,                                                +        
               LTH=6                                                            
         MFLD  AVRIN20,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT25,                                                +        
               LTH=6                                                            
         MFLD  AVRIN25,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PER2,                                                   +        
               LTH=4                                                            
         MFLD  GRP6,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT26,                                                +        
               LTH=6                                                            
         MFLD  AVRIN26,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT31,                                                +        
               LTH=6                                                            
         MFLD  AVRIN31,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT36,                                                +        
               LTH=6                                                            
         MFLD  AVRIN36,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT41,                                                +        
               LTH=6                                                            
         MFLD  AVRIN41,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT46,                                                +        
               LTH=6                                                            
         MFLD  AVRIN46,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP7,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT27,                                                +        
               LTH=6                                                            
         MFLD  AVRIN27,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT32,                                                +        
               LTH=6                                                            
         MFLD  AVRIN32,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT37,                                                +        
               LTH=6                                                            
         MFLD  AVRIN37,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT42,                                                +        
               LTH=6                                                            
         MFLD  AVRIN42,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT47,                                                +        
               LTH=6                                                            
         MFLD  AVRIN47,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP8,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT28,                                                +        
               LTH=6                                                            
         MFLD  AVRIN28,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT33,                                                +        
               LTH=6                                                            
         MFLD  AVRIN33,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT38,                                                +        
               LTH=6                                                            
         MFLD  AVRIN38,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT43,                                                +        
               LTH=6                                                            
         MFLD  AVRIN43,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT48,                                                +        
               LTH=6                                                            
         MFLD  AVRIN48,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP9,                                                   +        
               LTH=9                                                            
         MFLD  AVRUT29,                                                +        
               LTH=6                                                            
         MFLD  AVRIN29,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT34,                                                +        
               LTH=6                                                            
         MFLD  AVRIN34,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT39,                                                +        
               LTH=6                                                            
         MFLD  AVRIN39,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT44,                                                +        
               LTH=6                                                            
         MFLD  AVRIN44,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT49,                                                +        
               LTH=6                                                            
         MFLD  AVRIN49,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRP10,                                                  +        
               LTH=9                                                            
         MFLD  AVRUT30,                                                +        
               LTH=6                                                            
         MFLD  AVRIN30,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT35,                                                +        
               LTH=6                                                            
         MFLD  AVRIN35,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT40,                                                +        
               LTH=6                                                            
         MFLD  AVRIN40,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT45,                                                +        
               LTH=6                                                            
         MFLD  AVRIN45,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVRUT50,                                                +        
               LTH=6                                                            
         MFLD  AVRIN50,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MESS23,                                                 +        
               LTH=56                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I139N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N139),                                           +        
               OPT=2,                                                  +        
               NXT=W2O139N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21392',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0232,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0332,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0245,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0345,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0270,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0370,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN11,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN16,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN21,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN12,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN17,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN22,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN13,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN18,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN23,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN14,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN19,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN24,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN10,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN15,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN20,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN25,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN26,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN31,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN36,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN41,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN46,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN27,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN32,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN37,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN42,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN47,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN28,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN33,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN38,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN43,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN48,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN29,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN34,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN39,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN44,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN49,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN30,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN35,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN40,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN45,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVRIN50,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
