***********************************************************************         
* CREATED BY PC40073   ON 97/05/27  AT 09:16                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2N141   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T141 7',                                           +        
               8='W2T141 8',                                           +        
               9='W2T133  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T141U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T141U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,24)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'NEW PARTS',                                            +        
               POS=(1,13),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Procurer No.',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'from',                                                 +        
               POS=(2,19),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0224  DFLD  POS=(2,24),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'till',                                                 +        
               POS=(2,29),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0234  DFLD  POS=(2,34),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(2,39),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0245  DFLD  POS=(2,45),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0324  DFLD  POS=(3,24),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,34),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0345  DFLD  POS=(3,45),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0408  DFLD  POS=(4,8),LTH=5,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0414  DFLD  POS=(4,14),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0420  DFLD  POS=(4,20),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0422  DFLD  POS=(4,22),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0426  DFLD  POS=(4,26),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0430  DFLD  POS=(4,30),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0435  DFLD  POS=(4,35),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0440  DFLD  POS=(4,40),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0442  DFLD  POS=(4,42),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0444  DFLD  POS=(4,44),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0452  DFLD  POS=(4,52),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0460  DFLD  POS=(4,60),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0471  DFLD  POS=(4,71),LTH=10,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Qty parts',                                            +        
               POS=(5,4),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0517  DFLD  POS=(5,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1:st deliv. passed',                                   +        
               POS=(5,24),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0543  DFLD  POS=(5,43),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PISK',                                                 +        
               POS=(5,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0555  DFLD  POS=(5,55),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part No.  Proj DCN-No.',                               +        
               POS=(7,5),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1:st del. PISK Regdat Fcngrp Proc New proc RegOTH',    +        
               POS=(7,32),LTH=49,                                      +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0408  DFLD  POS=(8,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1508  DFLD  POS=(8,15),LTH=50,                                      +        
               ATTR=(PROT)                                                      
COL6708  DFLD  POS=(8,67),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL7808  DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0409  DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1509  DFLD  POS=(9,15),LTH=50,                                      +        
               ATTR=(PROT)                                                      
COL6709  DFLD  POS=(9,67),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL7809  DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0410  DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1510  DFLD  POS=(10,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6710  DFLD  POS=(10,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7810  DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0411  DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1511  DFLD  POS=(11,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6711  DFLD  POS=(11,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7811  DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0412  DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1512  DFLD  POS=(12,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6712  DFLD  POS=(12,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7812  DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0413  DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1513  DFLD  POS=(13,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6713  DFLD  POS=(13,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7813  DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0414  DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1514  DFLD  POS=(14,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6714  DFLD  POS=(14,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7814  DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0415  DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1515  DFLD  POS=(15,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6715  DFLD  POS=(15,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7815  DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0416  DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1516  DFLD  POS=(16,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6716  DFLD  POS=(16,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7816  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0417  DFLD  POS=(17,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1517  DFLD  POS=(17,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6717  DFLD  POS=(17,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7817  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0418  DFLD  POS=(18,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1518  DFLD  POS=(18,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6718  DFLD  POS=(18,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7818  DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0419  DFLD  POS=(19,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1519  DFLD  POS=(19,15),LTH=50,                                     +        
               ATTR=(PROT)                                                      
COL6719  DFLD  POS=(19,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7819  DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2002  DFLD  POS=(20,2),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2012  DFLD  POS=(20,12),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 New parts    14 Parts purch  15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 ANSK/NYK',                                           +        
               POS=(22,67),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O141N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N141,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I141N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0224,                                                +        
               LTH=2                                                            
         MFLD  FLD0324,                                                +        
               LTH=3                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0334,                                                +        
               LTH=3                                                            
         MFLD  FLD0245,                                                +        
               LTH=2                                                            
         MFLD  FLD0345,                                                +        
               LTH=4                                                            
         MFLD  FLD0402,                                                +        
               LTH=5                                                            
         MFLD  FLD0408,                                                +        
               LTH=5                                                            
         MFLD  FLD0414,                                                +        
               LTH=5                                                            
         MFLD  FLD0420,                                                +        
               LTH=1                                                            
         MFLD  FLD0422,                                                +        
               LTH=3                                                            
         MFLD  FLD0426,                                                +        
               LTH=3                                                            
         MFLD  FLD0430,                                                +        
               LTH=4                                                            
         MFLD  FLD0435,                                                +        
               LTH=4                                                            
         MFLD  FLD0440,                                                +        
               LTH=1                                                            
         MFLD  FLD0442,                                                +        
               LTH=1                                                            
         MFLD  FLD0444,                                                +        
               LTH=6                                                            
         MFLD  FLD0452,                                                +        
               LTH=6                                                            
         MFLD  FLD0460,                                                +        
               LTH=10                                                           
         MFLD  FLD0471,                                                +        
               LTH=10                                                           
         MFLD  FLD0517,                                                +        
               LTH=5                                                            
         MFLD  FLD0543,                                                +        
               LTH=5                                                            
         MFLD  FLD0555,                                                +        
               LTH=5                                                            
         MFLD  COL0208,                                                +        
               LTH=1                                                            
         MFLD  COL0408,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1508,                                                +        
               LTH=50                                                           
         MFLD  COL6708,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7808,                                                +        
               LTH=1                                                            
         MFLD  COL0209,                                                +        
               LTH=1                                                            
         MFLD  COL0409,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1509,                                                +        
               LTH=50                                                           
         MFLD  COL6709,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7809,                                                +        
               LTH=1                                                            
         MFLD  COL0210,                                                +        
               LTH=1                                                            
         MFLD  COL0410,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1510,                                                +        
               LTH=50                                                           
         MFLD  COL6710,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7810,                                                +        
               LTH=1                                                            
         MFLD  COL0211,                                                +        
               LTH=1                                                            
         MFLD  COL0411,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1511,                                                +        
               LTH=50                                                           
         MFLD  COL6711,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7811,                                                +        
               LTH=1                                                            
         MFLD  COL0212,                                                +        
               LTH=1                                                            
         MFLD  COL0412,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1512,                                                +        
               LTH=50                                                           
         MFLD  COL6712,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7812,                                                +        
               LTH=1                                                            
         MFLD  COL0213,                                                +        
               LTH=1                                                            
         MFLD  COL0413,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1513,                                                +        
               LTH=50                                                           
         MFLD  COL6713,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7813,                                                +        
               LTH=1                                                            
         MFLD  COL0214,                                                +        
               LTH=1                                                            
         MFLD  COL0414,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1514,                                                +        
               LTH=50                                                           
         MFLD  COL6714,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7814,                                                +        
               LTH=1                                                            
         MFLD  COL0215,                                                +        
               LTH=1                                                            
         MFLD  COL0415,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1515,                                                +        
               LTH=50                                                           
         MFLD  COL6715,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7815,                                                +        
               LTH=1                                                            
         MFLD  COL0216,                                                +        
               LTH=1                                                            
         MFLD  COL0416,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1516,                                                +        
               LTH=50                                                           
         MFLD  COL6716,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7816,                                                +        
               LTH=1                                                            
         MFLD  COL0217,                                                +        
               LTH=1                                                            
         MFLD  COL0417,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1517,                                                +        
               LTH=50                                                           
         MFLD  COL6717,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7817,                                                +        
               LTH=1                                                            
         MFLD  COL0218,                                                +        
               LTH=1                                                            
         MFLD  COL0418,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1518,                                                +        
               LTH=50                                                           
         MFLD  COL6718,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7818,                                                +        
               LTH=1                                                            
         MFLD  COL0219,                                                +        
               LTH=1                                                            
         MFLD  COL0419,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1519,                                                +        
               LTH=50                                                           
         MFLD  COL6719,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7819,                                                +        
               LTH=1                                                            
         MFLD  FLD2002,                                                +        
               LTH=9                                                            
         MFLD  FLD2012,                                                +        
               LTH=9                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I141N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N141),                                           +        
               OPT=2,                                                  +        
               NXT=W2O141N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21412',                                                +        
               LTH=5                                                            
         MFLD  (FLD0224,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0334,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0245,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0345,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0408,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0414,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0420,                                                +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0422,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0426,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0430,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0435,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0440,                                                +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0442,                                                +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0444,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0452,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0460,                                                +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0471,                                                +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0208,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0408,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6708,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0209,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0409,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6709,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0210,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0410,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6710,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0211,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0411,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6711,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0212,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0412,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6712,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0213,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0413,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6713,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0214,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0414,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6714,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0215,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0415,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6715,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0216,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0416,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6716,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0217,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0417,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6717,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0218,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0418,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6718,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0219,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0419,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6719,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2012,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
