***********************************************************************         
* CREATED BY V028439   ON 07/02/19  AT 08:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Delivery schedule proposals     '                               
W2N147   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W2T147 6',                                           +        
               7='W2T147 7',                                           +        
               8='W2T147 8',                                           +        
               9='W2T147 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T141  ',                                          +        
               14='W2T142  ',                                          +        
               15='W2T143  ',                                          +        
               16='W2T144  ',                                          +        
               17='W2T145  ',                                          +        
               18='W2T146  ',                                          +        
               19='W2T147  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DELIVERY SCHEDULE PROPOSALS',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Proc',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
IDANSKIN DFLD  POS=(2,7),LTH=3,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'to  ',                                                 +        
               POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
ANSKTOIN DFLD  POS=(2,16),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Suppl',                                                +        
               POS=(2,22),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVIN  DFLD  POS=(2,28),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Reason',                                               +        
               POS=(2,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDLPORSI DFLD  POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Plan',                                                 +        
               POS=(2,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PLANIN   DFLD  POS=(2,52),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Page no',                                              +        
               POS=(2,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDPAGE   DFLD  POS=(2,71),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDANSKUT DFLD  POS=(3,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
ANSKTOUT DFLD  POS=(3,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLEVUT  DFLD  POS=(3,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDLPORSU DFLD  POS=(3,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLANUT   DFLD  POS=(3,52),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Number of rows',                                       +        
               POS=(3,56),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KVRADER  DFLD  POS=(3,71),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Part no.  Description',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl Reason1  Reason2  Reason3 Plan Date',            +        
               POS=(5,40),LTH=41,                                      +        
               ATTR=(PROT)                                                      
KDCMDV01 DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR01  DFLD  POS=(6,4),LTH=8,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART01  DFLD  POS=(6,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
LEVNR01  DFLD  POS=(6,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS011 DFLD  POS=(6,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS012 DFLD  POS=(6,55),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS013 DFLD  POS=(6,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PLAN01   DFLD  POS=(6,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DAT01    DFLD  POS=(6,77),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMDV02 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR02  DFLD  POS=(7,4),LTH=8,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART02  DFLD  POS=(7,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
LEVNR02  DFLD  POS=(7,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS021 DFLD  POS=(7,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS022 DFLD  POS=(7,55),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS023 DFLD  POS=(7,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PLAN02   DFLD  POS=(7,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DAT02    DFLD  POS=(7,77),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMDV03 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR03  DFLD  POS=(8,4),LTH=8,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART03  DFLD  POS=(8,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
LEVNR03  DFLD  POS=(8,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS031 DFLD  POS=(8,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS032 DFLD  POS=(8,55),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS033 DFLD  POS=(8,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PLAN03   DFLD  POS=(8,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DAT03    DFLD  POS=(8,77),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMDV04 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR04  DFLD  POS=(9,4),LTH=8,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
BEART04  DFLD  POS=(9,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
LEVNR04  DFLD  POS=(9,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS041 DFLD  POS=(9,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS042 DFLD  POS=(9,55),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORS043 DFLD  POS=(9,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PLAN04   DFLD  POS=(9,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DAT04    DFLD  POS=(9,77),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMDV05 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR05  DFLD  POS=(10,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART05  DFLD  POS=(10,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNR05  DFLD  POS=(10,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS051 DFLD  POS=(10,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS052 DFLD  POS=(10,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS053 DFLD  POS=(10,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAN05   DFLD  POS=(10,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAT05    DFLD  POS=(10,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDV06 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR06  DFLD  POS=(11,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART06  DFLD  POS=(11,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNR06  DFLD  POS=(11,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS061 DFLD  POS=(11,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS062 DFLD  POS=(11,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS063 DFLD  POS=(11,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAN06   DFLD  POS=(11,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAT06    DFLD  POS=(11,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDV07 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR07  DFLD  POS=(12,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART07  DFLD  POS=(12,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNR07  DFLD  POS=(12,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS071 DFLD  POS=(12,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS072 DFLD  POS=(12,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS073 DFLD  POS=(12,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAN07   DFLD  POS=(12,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAT07    DFLD  POS=(12,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDV08 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR08  DFLD  POS=(13,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART08  DFLD  POS=(13,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNR08  DFLD  POS=(13,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS081 DFLD  POS=(13,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS082 DFLD  POS=(13,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS083 DFLD  POS=(13,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAN08   DFLD  POS=(13,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAT08    DFLD  POS=(13,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDV09 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR09  DFLD  POS=(14,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEART09  DFLD  POS=(14,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNR09  DFLD  POS=(14,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORS091 DFLD  POS=(14,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS092 DFLD  POS=(14,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORS093 DFLD  POS=(14,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAN09   DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAT09    DFLD  POS=(14,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVA1 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRA1  DFLD  POS=(15,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTA1  DFLD  POS=(15,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRA1  DFLD  POS=(15,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSA11 DFLD  POS=(15,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSA12 DFLD  POS=(15,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSA13 DFLD  POS=(15,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLANA1   DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATA1    DFLD  POS=(15,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVB1 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRB1  DFLD  POS=(16,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTB1  DFLD  POS=(16,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRB1  DFLD  POS=(16,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSB11 DFLD  POS=(16,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSB12 DFLD  POS=(16,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSB13 DFLD  POS=(16,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLANB1   DFLD  POS=(16,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATB1    DFLD  POS=(16,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVC1 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRC1  DFLD  POS=(17,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTC1  DFLD  POS=(17,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRC1  DFLD  POS=(17,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSC11 DFLD  POS=(17,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSC12 DFLD  POS=(17,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSC13 DFLD  POS=(17,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLANC1   DFLD  POS=(17,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATC1    DFLD  POS=(17,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVD1 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRD1  DFLD  POS=(18,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTD1  DFLD  POS=(18,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRD1  DFLD  POS=(18,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSD11 DFLD  POS=(18,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSD12 DFLD  POS=(18,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSD13 DFLD  POS=(18,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLAND1   DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATD1    DFLD  POS=(18,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVE1 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRE1  DFLD  POS=(19,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTE1  DFLD  POS=(19,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRE1  DFLD  POS=(19,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSE11 DFLD  POS=(19,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSE12 DFLD  POS=(19,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSE13 DFLD  POS=(19,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLANE1   DFLD  POS=(19,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATE1    DFLD  POS=(19,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMDVF1 DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRF1  DFLD  POS=(20,4),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEARTF1  DFLD  POS=(20,14),LTH=25,                                     +        
               ATTR=(PROT)                                                      
LEVNRF1  DFLD  POS=(20,40),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORSF11 DFLD  POS=(20,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSF12 DFLD  POS=(20,55),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORSF13 DFLD  POS=(20,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PLANF1   DFLD  POS=(20,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATF1    DFLD  POS=(20,77),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F1 Help page',                                         +        
               POS=(22,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F6 Previous page    F7 First page    F8 Next page     1+        
               0 WHELP',                                               +        
               POS=(22,19),LTH=62,                                     +        
               ATTR=(PROT)                                                      
FLD0223  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD6423  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD7323  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O147N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N147,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I147N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDANSKIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKUT,                                               +        
               LTH=3                                                            
         MFLD  ANSKTOIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSKTOUT,                                               +        
               LTH=3                                                            
         MFLD  IDLEVIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  KDLPORSI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDLPORSU,                                               +        
               LTH=2                                                            
         MFLD  PLANIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLANUT,                                                 +        
               LTH=1                                                            
         MFLD  IDPAGE,                                                 +        
               LTH=3                                                            
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  KDCMDV01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR01,                                                +        
               LTH=8                                                            
         MFLD  BEART01,                                                +        
               LTH=25                                                           
         MFLD  LEVNR01,                                                +        
               LTH=5                                                            
         MFLD  KDORS011,                                               +        
               LTH=8                                                            
         MFLD  KDORS012,                                               +        
               LTH=8                                                            
         MFLD  KDORS013,                                               +        
               LTH=8                                                            
         MFLD  PLAN01,                                                 +        
               LTH=1                                                            
         MFLD  DAT01,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR02,                                                +        
               LTH=8                                                            
         MFLD  BEART02,                                                +        
               LTH=25                                                           
         MFLD  LEVNR02,                                                +        
               LTH=5                                                            
         MFLD  KDORS021,                                               +        
               LTH=8                                                            
         MFLD  KDORS022,                                               +        
               LTH=8                                                            
         MFLD  KDORS023,                                               +        
               LTH=8                                                            
         MFLD  PLAN02,                                                 +        
               LTH=1                                                            
         MFLD  DAT02,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR03,                                                +        
               LTH=8                                                            
         MFLD  BEART03,                                                +        
               LTH=25                                                           
         MFLD  LEVNR03,                                                +        
               LTH=5                                                            
         MFLD  KDORS031,                                               +        
               LTH=8                                                            
         MFLD  KDORS032,                                               +        
               LTH=8                                                            
         MFLD  KDORS033,                                               +        
               LTH=8                                                            
         MFLD  PLAN03,                                                 +        
               LTH=1                                                            
         MFLD  DAT03,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR04,                                                +        
               LTH=8                                                            
         MFLD  BEART04,                                                +        
               LTH=25                                                           
         MFLD  LEVNR04,                                                +        
               LTH=5                                                            
         MFLD  KDORS041,                                               +        
               LTH=8                                                            
         MFLD  KDORS042,                                               +        
               LTH=8                                                            
         MFLD  KDORS043,                                               +        
               LTH=8                                                            
         MFLD  PLAN04,                                                 +        
               LTH=1                                                            
         MFLD  DAT04,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR05,                                                +        
               LTH=8                                                            
         MFLD  BEART05,                                                +        
               LTH=25                                                           
         MFLD  LEVNR05,                                                +        
               LTH=5                                                            
         MFLD  KDORS051,                                               +        
               LTH=8                                                            
         MFLD  KDORS052,                                               +        
               LTH=8                                                            
         MFLD  KDORS053,                                               +        
               LTH=8                                                            
         MFLD  PLAN05,                                                 +        
               LTH=1                                                            
         MFLD  DAT05,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR06,                                                +        
               LTH=8                                                            
         MFLD  BEART06,                                                +        
               LTH=25                                                           
         MFLD  LEVNR06,                                                +        
               LTH=5                                                            
         MFLD  KDORS061,                                               +        
               LTH=8                                                            
         MFLD  KDORS062,                                               +        
               LTH=8                                                            
         MFLD  KDORS063,                                               +        
               LTH=8                                                            
         MFLD  PLAN06,                                                 +        
               LTH=1                                                            
         MFLD  DAT06,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR07,                                                +        
               LTH=8                                                            
         MFLD  BEART07,                                                +        
               LTH=25                                                           
         MFLD  LEVNR07,                                                +        
               LTH=5                                                            
         MFLD  KDORS071,                                               +        
               LTH=8                                                            
         MFLD  KDORS072,                                               +        
               LTH=8                                                            
         MFLD  KDORS073,                                               +        
               LTH=8                                                            
         MFLD  PLAN07,                                                 +        
               LTH=1                                                            
         MFLD  DAT07,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR08,                                                +        
               LTH=8                                                            
         MFLD  BEART08,                                                +        
               LTH=25                                                           
         MFLD  LEVNR08,                                                +        
               LTH=5                                                            
         MFLD  KDORS081,                                               +        
               LTH=8                                                            
         MFLD  KDORS082,                                               +        
               LTH=8                                                            
         MFLD  KDORS083,                                               +        
               LTH=8                                                            
         MFLD  PLAN08,                                                 +        
               LTH=1                                                            
         MFLD  DAT08,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDV09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR09,                                                +        
               LTH=8                                                            
         MFLD  BEART09,                                                +        
               LTH=25                                                           
         MFLD  LEVNR09,                                                +        
               LTH=5                                                            
         MFLD  KDORS091,                                               +        
               LTH=8                                                            
         MFLD  KDORS092,                                               +        
               LTH=8                                                            
         MFLD  KDORS093,                                               +        
               LTH=8                                                            
         MFLD  PLAN09,                                                 +        
               LTH=1                                                            
         MFLD  DAT09,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVA1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRA1,                                                +        
               LTH=8                                                            
         MFLD  BEARTA1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRA1,                                                +        
               LTH=5                                                            
         MFLD  KDORSA11,                                               +        
               LTH=8                                                            
         MFLD  KDORSA12,                                               +        
               LTH=8                                                            
         MFLD  KDORSA13,                                               +        
               LTH=8                                                            
         MFLD  PLANA1,                                                 +        
               LTH=1                                                            
         MFLD  DATA1,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVB1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRB1,                                                +        
               LTH=8                                                            
         MFLD  BEARTB1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRB1,                                                +        
               LTH=5                                                            
         MFLD  KDORSB11,                                               +        
               LTH=8                                                            
         MFLD  KDORSB12,                                               +        
               LTH=8                                                            
         MFLD  KDORSB13,                                               +        
               LTH=8                                                            
         MFLD  PLANB1,                                                 +        
               LTH=1                                                            
         MFLD  DATB1,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVC1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRC1,                                                +        
               LTH=8                                                            
         MFLD  BEARTC1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRC1,                                                +        
               LTH=5                                                            
         MFLD  KDORSC11,                                               +        
               LTH=8                                                            
         MFLD  KDORSC12,                                               +        
               LTH=8                                                            
         MFLD  KDORSC13,                                               +        
               LTH=8                                                            
         MFLD  PLANC1,                                                 +        
               LTH=1                                                            
         MFLD  DATC1,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVD1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRD1,                                                +        
               LTH=8                                                            
         MFLD  BEARTD1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRD1,                                                +        
               LTH=5                                                            
         MFLD  KDORSD11,                                               +        
               LTH=8                                                            
         MFLD  KDORSD12,                                               +        
               LTH=8                                                            
         MFLD  KDORSD13,                                               +        
               LTH=8                                                            
         MFLD  PLAND1,                                                 +        
               LTH=1                                                            
         MFLD  DATD1,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVE1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRE1,                                                +        
               LTH=8                                                            
         MFLD  BEARTE1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRE1,                                                +        
               LTH=5                                                            
         MFLD  KDORSE11,                                               +        
               LTH=8                                                            
         MFLD  KDORSE12,                                               +        
               LTH=8                                                            
         MFLD  KDORSE13,                                               +        
               LTH=8                                                            
         MFLD  PLANE1,                                                 +        
               LTH=1                                                            
         MFLD  DATE1,                                                  +        
               LTH=4                                                            
         MFLD  KDCMDVF1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNRF1,                                                +        
               LTH=8                                                            
         MFLD  BEARTF1,                                                +        
               LTH=25                                                           
         MFLD  LEVNRF1,                                                +        
               LTH=5                                                            
         MFLD  KDORSF11,                                               +        
               LTH=8                                                            
         MFLD  KDORSF12,                                               +        
               LTH=8                                                            
         MFLD  KDORSF13,                                               +        
               LTH=8                                                            
         MFLD  PLANF1,                                                 +        
               LTH=1                                                            
         MFLD  DATF1,                                                  +        
               LTH=4                                                            
         MFLD  FLD0223,                                                +        
               LTH=55                                                           
         MFLD  (FLD6423,                                               +        
               DATE4)                                                           
         MFLD  (FLD7323,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I147N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N147),                                           +        
               OPT=2,                                                  +        
               NXT=W2O147N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21471',                                                +        
               LTH=5                                                            
         MFLD  (IDANSKIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANSKTOIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDLPORSI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLANIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMDV01,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR01,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR01,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV02,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR02,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR02,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV03,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR03,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR03,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV04,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR04,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR04,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV05,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR05,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR05,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV06,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR06,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR06,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV07,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR07,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR07,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV08,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR08,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR08,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDV09,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR09,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNR09,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVA1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRA1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRA1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVB1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRB1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRB1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVC1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRC1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRC1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVD1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRD1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRD1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVE1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRE1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRE1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (KDCMDVF1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNRF1,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (LEVNRF1,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
