***********************************************************************         
* CREATED BY PC40073   ON 97/05/05  AT 08:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2N136   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T131  ',                                           +        
               2='W2T132  ',                                           +        
               3='W2T133  ',                                           +        
               4='W2T134  ',                                           +        
               5='W2T135  ',                                           +        
               6='W2T136  ',                                           +        
               7='W2T137  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T136U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T131  ',                                          +        
               14='W2T132  ',                                          +        
               15='W2T133  ',                                          +        
               16='W2T134  ',                                          +        
               17='W2T135  ',                                          +        
               18='W2T136  ',                                          +        
               19='W2T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PB-PLAN              ',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0322  DFLD  POS=(5,02),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Per    Cdc   Dc-r  Dc-fk  Per    Cdc   Dc-r  Dc-fk',   +        
               POS=(6,2),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(6,59),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0563  DFLD  POS=(6,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(6,67),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0571  DFLD  POS=(6,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Roll-12',                                              +        
               POS=(6,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(7,02),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0606  DFLD  POS=(7,06),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0613  DFLD  POS=(7,13),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0620  DFLD  POS=(7,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0628  DFLD  POS=(7,28),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0632  DFLD  POS=(7,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0639  DFLD  POS=(7,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0646  DFLD  POS=(7,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cdc',                                                  +        
               POS=(7,54),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0658  DFLD  POS=(7,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0666  DFLD  POS=(7,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0674  DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(8,02),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0706  DFLD  POS=(8,06),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0713  DFLD  POS=(8,13),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0720  DFLD  POS=(8,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0728  DFLD  POS=(8,28),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0732  DFLD  POS=(8,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0739  DFLD  POS=(8,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(8,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dc-r',                                                 +        
               POS=(8,53),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0758  DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0766  DFLD  POS=(8,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0774  DFLD  POS=(8,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(9,02),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0806  DFLD  POS=(9,06),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0813  DFLD  POS=(9,13),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0820  DFLD  POS=(9,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0828  DFLD  POS=(9,28),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0832  DFLD  POS=(9,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0839  DFLD  POS=(9,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0846  DFLD  POS=(9,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dcfk',                                                 +        
               POS=(9,53),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0858  DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0866  DFLD  POS=(9,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0874  DFLD  POS=(9,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(10,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD0906  DFLD  POS=(10,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0913  DFLD  POS=(10,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0920  DFLD  POS=(10,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0928  DFLD  POS=(10,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD0932  DFLD  POS=(10,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0939  DFLD  POS=(10,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD0946  DFLD  POS=(10,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(11,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1006  DFLD  POS=(11,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1013  DFLD  POS=(11,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1020  DFLD  POS=(11,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1028  DFLD  POS=(11,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1032  DFLD  POS=(11,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1039  DFLD  POS=(11,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1046  DFLD  POS=(11,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tot',                                                  +        
               POS=(11,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1063  DFLD  POS=(11,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Curr.per',                                             +        
               POS=(11,66),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1102  DFLD  POS=(12,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1106  DFLD  POS=(12,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1113  DFLD  POS=(12,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1120  DFLD  POS=(12,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1128  DFLD  POS=(12,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1132  DFLD  POS=(12,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1139  DFLD  POS=(12,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1146  DFLD  POS=(12,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cdc',                                                  +        
               POS=(12,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1158  DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1167  DFLD  POS=(12,67),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(13,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1206  DFLD  POS=(13,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1213  DFLD  POS=(13,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1220  DFLD  POS=(13,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1228  DFLD  POS=(13,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1232  DFLD  POS=(13,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1239  DFLD  POS=(13,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1246  DFLD  POS=(13,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dc-r',                                                 +        
               POS=(13,53),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1258  DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1267  DFLD  POS=(13,67),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(14,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1306  DFLD  POS=(14,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1313  DFLD  POS=(14,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1320  DFLD  POS=(14,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1328  DFLD  POS=(14,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(14,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1339  DFLD  POS=(14,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1346  DFLD  POS=(14,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dcfk',                                                 +        
               POS=(14,53),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1358  DFLD  POS=(14,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1366  DFLD  POS=(14,67),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(15,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1406  DFLD  POS=(15,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1413  DFLD  POS=(15,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1420  DFLD  POS=(15,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1428  DFLD  POS=(15,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1432  DFLD  POS=(15,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1439  DFLD  POS=(15,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1446  DFLD  POS=(15,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(16,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1506  DFLD  POS=(16,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1513  DFLD  POS=(16,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1520  DFLD  POS=(16,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1528  DFLD  POS=(16,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1532  DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1539  DFLD  POS=(16,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1546  DFLD  POS=(16,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Curr PB',                                              +        
               POS=(16,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Aver. 12p',                                            +        
               POS=(16,72),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1602  DFLD  POS=(17,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1606  DFLD  POS=(17,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1613  DFLD  POS=(17,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1620  DFLD  POS=(17,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1628  DFLD  POS=(17,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1632  DFLD  POS=(17,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1639  DFLD  POS=(17,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cdc',                                                  +        
               POS=(17,53),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1657  DFLD  POS=(17,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cdc',                                                  +        
               POS=(17,69),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1675  DFLD  POS=(17,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(18,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1706  DFLD  POS=(18,06),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1713  DFLD  POS=(18,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1720  DFLD  POS=(18,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1728  DFLD  POS=(18,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1732  DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1739  DFLD  POS=(18,39),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1746  DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dc',                                                   +        
               POS=(18,54),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1757  DFLD  POS=(18,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dc-r',                                                 +        
               POS=(18,68),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1775  DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man FC-Plan',                                          +        
               POS=(20,2),LTH=11,                                      +        
               ATTR=(NOPROT)                                                    
FLD2015  DFLD  POS=(20,15),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FLD2024  DFLD  POS=(20,24),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Until',                                                +        
               POS=(20,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2038  DFLD  POS=(20,40),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
FLD2045  DFLD  POS=(20,47),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Comp PB-Plan',                                         +        
               POS=(20,54),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD2065  DFLD  POS=(20,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FC-plan jus1',                                         +        
               POS=(21,02),LTH=12,                                     +        
               ATTR=(PROT)                                                      
PBPLJ1I  DFLD  POS=(21,15),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPLJ1U  DFLD  POS=(21,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Until',                                                +        
               POS=(21,34),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PBPL1I   DFLD  POS=(21,40),LTH=6,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPL1U   DFLD  POS=(21,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'YYWW',                                                 +        
               POS=(21,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PBPLF1I  DFLD  POS=(21,59),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPLF1U  DFLD  POS=(21,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FC-plan jus2',                                         +        
               POS=(22,02),LTH=12,                                     +        
               ATTR=(PROT)                                                      
PBPLJ2I  DFLD  POS=(22,15),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPLJ2U  DFLD  POS=(22,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Until',                                                +        
               POS=(22,34),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PBPL2I   DFLD  POS=(22,40),LTH=6,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPL2U   DFLD  POS=(22,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'YYWW',                                                 +        
               POS=(22,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PBPLF2I  DFLD  POS=(22,59),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
PBPLF2U  DFLD  POS=(22,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O136N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N136,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I136N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0322,                                                +        
               LTH=25                                                           
         MFLD  FLD0602,                                                +        
               LTH=3                                                            
         MFLD  FLD0702,                                                +        
               LTH=3                                                            
         MFLD  FLD0802,                                                +        
               LTH=3                                                            
         MFLD  FLD0902,                                                +        
               LTH=3                                                            
         MFLD  FLD1002,                                                +        
               LTH=3                                                            
         MFLD  FLD1102,                                                +        
               LTH=3                                                            
         MFLD  FLD1202,                                                +        
               LTH=3                                                            
         MFLD  FLD1302,                                                +        
               LTH=3                                                            
         MFLD  FLD1402,                                                +        
               LTH=3                                                            
         MFLD  FLD1502,                                                +        
               LTH=3                                                            
         MFLD  FLD1602,                                                +        
               LTH=3                                                            
         MFLD  FLD1702,                                                +        
               LTH=3                                                            
         MFLD  FLD0628,                                                +        
               LTH=3                                                            
         MFLD  FLD0728,                                                +        
               LTH=3                                                            
         MFLD  FLD0828,                                                +        
               LTH=3                                                            
         MFLD  FLD0928,                                                +        
               LTH=3                                                            
         MFLD  FLD1028,                                                +        
               LTH=3                                                            
         MFLD  FLD1128,                                                +        
               LTH=3                                                            
         MFLD  FLD1228,                                                +        
               LTH=3                                                            
         MFLD  FLD1328,                                                +        
               LTH=3                                                            
         MFLD  FLD1428,                                                +        
               LTH=3                                                            
         MFLD  FLD1528,                                                +        
               LTH=3                                                            
         MFLD  FLD1628,                                                +        
               LTH=3                                                            
         MFLD  FLD1728,                                                +        
               LTH=3                                                            
         MFLD  FLD0606,                                                +        
               LTH=6                                                            
         MFLD  FLD0706,                                                +        
               LTH=6                                                            
         MFLD  FLD0806,                                                +        
               LTH=6                                                            
         MFLD  FLD0906,                                                +        
               LTH=6                                                            
         MFLD  FLD1006,                                                +        
               LTH=6                                                            
         MFLD  FLD1106,                                                +        
               LTH=6                                                            
         MFLD  FLD1206,                                                +        
               LTH=6                                                            
         MFLD  FLD1306,                                                +        
               LTH=6                                                            
         MFLD  FLD1406,                                                +        
               LTH=6                                                            
         MFLD  FLD1506,                                                +        
               LTH=6                                                            
         MFLD  FLD1606,                                                +        
               LTH=6                                                            
         MFLD  FLD1706,                                                +        
               LTH=6                                                            
         MFLD  FLD0632,                                                +        
               LTH=6                                                            
         MFLD  FLD0732,                                                +        
               LTH=6                                                            
         MFLD  FLD0832,                                                +        
               LTH=6                                                            
         MFLD  FLD0932,                                                +        
               LTH=6                                                            
         MFLD  FLD1032,                                                +        
               LTH=6                                                            
         MFLD  FLD1132,                                                +        
               LTH=6                                                            
         MFLD  FLD1232,                                                +        
               LTH=6                                                            
         MFLD  FLD1332,                                                +        
               LTH=6                                                            
         MFLD  FLD1432,                                                +        
               LTH=6                                                            
         MFLD  FLD1532,                                                +        
               LTH=6                                                            
         MFLD  FLD1632,                                                +        
               LTH=6                                                            
         MFLD  FLD1732,                                                +        
               LTH=6                                                            
         MFLD  FLD0613,                                                +        
               LTH=6                                                            
         MFLD  FLD0713,                                                +        
               LTH=6                                                            
         MFLD  FLD0813,                                                +        
               LTH=6                                                            
         MFLD  FLD0913,                                                +        
               LTH=6                                                            
         MFLD  FLD1013,                                                +        
               LTH=6                                                            
         MFLD  FLD1113,                                                +        
               LTH=6                                                            
         MFLD  FLD1213,                                                +        
               LTH=6                                                            
         MFLD  FLD1313,                                                +        
               LTH=6                                                            
         MFLD  FLD1413,                                                +        
               LTH=6                                                            
         MFLD  FLD1513,                                                +        
               LTH=6                                                            
         MFLD  FLD1613,                                                +        
               LTH=6                                                            
         MFLD  FLD1713,                                                +        
               LTH=6                                                            
         MFLD  FLD0639,                                                +        
               LTH=6                                                            
         MFLD  FLD0739,                                                +        
               LTH=6                                                            
         MFLD  FLD0839,                                                +        
               LTH=6                                                            
         MFLD  FLD0939,                                                +        
               LTH=6                                                            
         MFLD  FLD1039,                                                +        
               LTH=6                                                            
         MFLD  FLD1139,                                                +        
               LTH=6                                                            
         MFLD  FLD1239,                                                +        
               LTH=6                                                            
         MFLD  FLD1339,                                                +        
               LTH=6                                                            
         MFLD  FLD1439,                                                +        
               LTH=6                                                            
         MFLD  FLD1539,                                                +        
               LTH=6                                                            
         MFLD  FLD1639,                                                +        
               LTH=6                                                            
         MFLD  FLD1739,                                                +        
               LTH=6                                                            
         MFLD  FLD0620,                                                +        
               LTH=6                                                            
         MFLD  FLD0720,                                                +        
               LTH=6                                                            
         MFLD  FLD0820,                                                +        
               LTH=6                                                            
         MFLD  FLD0920,                                                +        
               LTH=6                                                            
         MFLD  FLD1020,                                                +        
               LTH=6                                                            
         MFLD  FLD1120,                                                +        
               LTH=6                                                            
         MFLD  FLD1220,                                                +        
               LTH=6                                                            
         MFLD  FLD1320,                                                +        
               LTH=6                                                            
         MFLD  FLD1420,                                                +        
               LTH=6                                                            
         MFLD  FLD1520,                                                +        
               LTH=6                                                            
         MFLD  FLD1620,                                                +        
               LTH=6                                                            
         MFLD  FLD1720,                                                +        
               LTH=6                                                            
         MFLD  FLD0646,                                                +        
               LTH=6                                                            
         MFLD  FLD0746,                                                +        
               LTH=6                                                            
         MFLD  FLD0846,                                                +        
               LTH=6                                                            
         MFLD  FLD0946,                                                +        
               LTH=6                                                            
         MFLD  FLD1046,                                                +        
               LTH=6                                                            
         MFLD  FLD1146,                                                +        
               LTH=6                                                            
         MFLD  FLD1246,                                                +        
               LTH=6                                                            
         MFLD  FLD1346,                                                +        
               LTH=6                                                            
         MFLD  FLD1446,                                                +        
               LTH=6                                                            
         MFLD  FLD1546,                                                +        
               LTH=6                                                            
         MFLD  FLD1646,                                                +        
               LTH=6                                                            
         MFLD  FLD1746,                                                +        
               LTH=6                                                            
         MFLD  FLD1167,                                                +        
               LTH=6                                                            
         MFLD  FLD1267,                                                +        
               LTH=6                                                            
         MFLD  FLD1367,                                                +        
               LTH=6                                                            
         MFLD  FLD0674,                                                +        
               LTH=7                                                            
         MFLD  FLD0774,                                                +        
               LTH=7                                                            
         MFLD  FLD0874,                                                +        
               LTH=7                                                            
         MFLD  FLD0563,                                                +        
               LTH=2                                                            
         MFLD  FLD0658,                                                +        
               LTH=7                                                            
         MFLD  FLD0758,                                                +        
               LTH=7                                                            
         MFLD  FLD0858,                                                +        
               LTH=7                                                            
         MFLD  FLD0571,                                                +        
               LTH=2                                                            
         MFLD  FLD0666,                                                +        
               LTH=7                                                            
         MFLD  FLD0766,                                                +        
               LTH=7                                                            
         MFLD  FLD0866,                                                +        
               LTH=7                                                            
         MFLD  FLD1063,                                                +        
               LTH=2                                                            
         MFLD  FLD1158,                                                +        
               LTH=7                                                            
         MFLD  FLD1258,                                                +        
               LTH=7                                                            
         MFLD  FLD1358,                                                +        
               LTH=7                                                            
         MFLD  FLD2065,                                                +        
               LTH=8                                                            
         MFLD  FLD2015,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2024,                                                +        
               LTH=8                                                            
         MFLD  FLD2038,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2045,                                                +        
               LTH=6                                                            
         MFLD  PBPLJ1I,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PBPLJ1U,                                                +        
               LTH=8                                                            
         MFLD  PBPLF1I,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBPLF1U,                                                +        
               LTH=4                                                            
         MFLD  PBPL1I,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBPL1U,                                                 +        
               LTH=6                                                            
         MFLD  PBPLJ2I,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PBPLJ2U,                                                +        
               LTH=8                                                            
         MFLD  PBPLF2I,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBPLF2U,                                                +        
               LTH=4                                                            
         MFLD  PBPL2I,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBPL2U,                                                 +        
               LTH=6                                                            
         MFLD  FLD1657,                                                +        
               LTH=9                                                            
         MFLD  FLD1757,                                                +        
               LTH=9                                                            
         MFLD  FLD1675,                                                +        
               LTH=6                                                            
         MFLD  FLD1775,                                                +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I136N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N136),                                           +        
               OPT=2,                                                  +        
               NXT=W2O136N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21361',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD2015,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2038,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPLJ1I,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPLF1I,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPL1I,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPLJ2I,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPLF2I,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBPL2I,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
