***********************************************************************         
* CREATED BY V040073   ON 00/10/04  AT 14:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPDATERING ANSKAFFNINGSDATA    '                               
W2N131   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T131  ',                                           +        
               2='W2T132  ',                                           +        
               3='W2T133  ',                                           +        
               4='W2T134  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T131U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T131  ',                                          +        
               14='W2T132  ',                                          +        
               15='W2T133  ',                                          +        
               16='W2T134  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T131V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPDATE PROCURER INFORMATION',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descript.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0513  DFLD  POS=(5,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MFG',                                                  +        
               POS=(5,39),LTH=3,                                       +        
               ATTR=(PROT)                                                      
LEVNRUT  DFLD  POS=(5,43),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEVNRIN  DFLD  POS=(5,49),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'SHP',                                                  +        
               POS=(5,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
SHIPUT   DFLD  POS=(5,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SHIPIN   DFLD  POS=(5,65),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Procurer',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0618  DFLD  POS=(6,18),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Plangr-lev',                                           +        
               POS=(6,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0640  DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Blocked qty',                                          +        
               POS=(6,48),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0661  DFLD  POS=(6,61),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0671  DFLD  POS=(6,71),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0740  DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0761  DFLD  POS=(7,61),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0771  DFLD  POS=(7,71),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Plangr-AG',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0820  DFLD  POS=(8,20),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Refill Part',                                          +        
               POS=(8,25),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0840  DFLD  POS=(8,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Refill stop unt.',                                     +        
               POS=(8,48),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD0865  DFLD  POS=(8,65),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0920  DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0940  DFLD  POS=(9,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0965  DFLD  POS=(9,65),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LT',                                                   +        
               POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1018  DFLD  POS=(10,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man LT',                                               +        
               POS=(10,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1040  DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SL-factor',                                            +        
               POS=(10,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1065  DFLD  POS=(10,65),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1075  DFLD  POS=(10,75),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1118  DFLD  POS=(11,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1140  DFLD  POS=(11,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1165  DFLD  POS=(11,65),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1175  DFLD  POS=(11,75),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AT',                                                   +        
               POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD1218  DFLD  POS=(12,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man AT',                                               +        
               POS=(12,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1240  DFLD  POS=(12,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date SL-fact',                                         +        
               POS=(12,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1264  DFLD  POS=(12,64),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1274  DFLD  POS=(12,74),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1318  DFLD  POS=(13,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1340  DFLD  POS=(13,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1364  DFLD  POS=(13,64),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1374  DFLD  POS=(13,74),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order qty',                                            +        
               POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1414  DFLD  POS=(14,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man BK',                                               +        
               POS=(14,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1440  DFLD  POS=(14,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Safety stock',                                         +        
               POS=(14,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1461  DFLD  POS=(14,61),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1471  DFLD  POS=(14,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1514  DFLD  POS=(15,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1540  DFLD  POS=(15,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1561  DFLD  POS=(15,61),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1571  DFLD  POS=(15,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q.qty',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1614  DFLD  POS=(16,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Man Q',                                                +        
               POS=(16,25),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1640  DFLD  POS=(16,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Load',                                                 +        
               POS=(16,48),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1664  DFLD  POS=(16,64),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1714  DFLD  POS=(17,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1740  DFLD  POS=(17,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1764  DFLD  POS=(17,64),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q-adjust',                                             +        
               POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1814  DFLD  POS=(18,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date Q-adj.',                                          +        
               POS=(18,25),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1837  DFLD  POS=(18,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MOQ',                                                  +        
               POS=(18,48),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1861  DFLD  POS=(18,61),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1914  DFLD  POS=(19,14),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(19,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1961  DFLD  POS=(19,61),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Proc-data-1  14 Proc-data-2  15 Proc/newpur  16 Proc+        
               -data-3  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O131N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N131,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I131N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0513,                                                +        
               LTH=25                                                           
         MFLD  LEVNRUT,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRIN,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SHIPUT,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SHIPIN,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0618,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0640,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0661,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0671,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0718,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0740,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0761,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0771,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0820,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0840,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0865,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0920,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0940,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0965,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1018,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1040,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1065,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1075,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1118,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1140,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1165,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1175,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1218,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1240,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1264,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1274,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1318,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1340,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1364,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1374,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1414,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1440,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1461,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1471,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1514,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1540,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1561,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1571,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1614,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1640,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1664,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1714,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1740,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1764,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1814,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1837,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1861,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1914,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1937,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1961,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I131N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N131),                                           +        
               OPT=2,                                                  +        
               NXT=W2O131N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21312',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  SHIPUT,                                                 +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SHIPIN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0618,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0718,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0740,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0761,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0771,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0820,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0920,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0940,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0965,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1065,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1075,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1118,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1140,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1165,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1175,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1264,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1274,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1318,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1340,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1364,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1374,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1514,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1540,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1561,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1571,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1714,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1740,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1764,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1914,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1937,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1961,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
