***********************************************************************         
* CREATED BY PC40073   ON 97/06/03  AT 08:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2N152   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T152 7',                                           +        
               8='W2T152 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T152U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T151  ',                                          +        
               14='W2T152  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T152U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSSREF. PROC/FUNCTION GROUP',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Product grp',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0215  DFLD  POS=(2,15),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0315  DFLD  POS=(3,15),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0408  DFLD  POS=(4,8),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Func.grp Procurer  User-id',                           +        
               POS=(5,3),LTH=26,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Func.grp Procurer  User-id',                           +        
               POS=(5,35),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'from  till',                                           +        
               POS=(6,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'from  till',                                           +        
               POS=(6,34),LTH=10,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
COL3407  DFLD  POS=(7,34),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
COL3408  DFLD  POS=(8,34),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
COL3409  DFLD  POS=(9,34),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3410  DFLD  POS=(10,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3411  DFLD  POS=(11,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3412  DFLD  POS=(12,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3413  DFLD  POS=(13,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3414  DFLD  POS=(14,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3415  DFLD  POS=(15,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3416  DFLD  POS=(16,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
COL3417  DFLD  POS=(17,34),LTH=28,                                     +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1908  DFLD  POS=(19,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1917  DFLD  POS=(19,17),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1922  DFLD  POS=(19,22),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Action  N/C/D',                                        +        
               POS=(19,34),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLD1949  DFLD  POS=(19,49),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Account/Sec. 14 Proc/Func.gr 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O152N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N152,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I152N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0215,                                                +        
               LTH=2                                                            
         MFLD  FLD0315,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0408,                                                +        
               LTH=4                                                            
         MFLD  COL0207,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3407,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3408,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3409,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3410,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3411,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3412,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3413,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3414,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3415,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3416,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3417,                                                +        
               LTH=30,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1922,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1949,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I152N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N152),                                           +        
               OPT=2,                                                  +        
               NXT=W2O152N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21522',                                                +        
               LTH=5                                                            
         MFLD  (FLD0215,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0315,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0408,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1902,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1908,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1917,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1922,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1949,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
