         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Artiklar saknar FP-instruktion'                                 
W2N146   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T146 7',                                           +        
               8='W2T146 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N146   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Artiklar saknar FP-instruktion',                       +        
               POS=(1,10),LTH=30,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=38,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '1:A Inlev',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Fom',                                                  +        
               POS=(2,13),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FOMIN    DFLD  POS=(2,17),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tom',                                                  +        
               POS=(2,23),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TOMIN    DFLD  POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(2,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROJIN   DFLD  POS=(2,38),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FOMUT    DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TOMUT    DFLD  POS=(3,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PROJUT   DFLD  POS=(3,38),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal artiklar',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
ANTART   DFLD  POS=(5,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1:A Inlev passerad',                                   +        
               POS=(5,25),LTH=18,                                      +        
               ATTR=(PROT)                                                      
ANTINLEV DFLD  POS=(5,44),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pisk',                                                 +        
               POS=(5,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ANTPISK  DFLD  POS=(5,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artikelnr',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Proj',                                                 +        
               POS=(7,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EmbkodQ2',                                             +        
               POS=(7,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1:A Inlev',                                            +        
               POS=(7,29),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pisk',                                                 +        
               POS=(7,40),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regdat',                                               +        
               POS=(7,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FP-tekn',                                              +        
               POS=(7,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ART01    DFLD  POS=(8,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
PROJ01   DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
EMB01    DFLD  POS=(8,22),LTH=3,                                       +        
               ATTR=(PROT)                                                      
INLEV01  DFLD  POS=(8,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PISK01   DFLD  POS=(8,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REG01    DFLD  POS=(8,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEKN01   DFLD  POS=(8,54),LTH=27,                                      +        
               ATTR=(PROT)                                                      
ART02    DFLD  POS=(9,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
PROJ02   DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
EMB02    DFLD  POS=(9,22),LTH=3,                                       +        
               ATTR=(PROT)                                                      
INLEV02  DFLD  POS=(9,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PISK02   DFLD  POS=(9,42),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REG02    DFLD  POS=(9,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEKN02   DFLD  POS=(9,54),LTH=27,                                      +        
               ATTR=(PROT)                                                      
ART03    DFLD  POS=(10,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ03   DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB03    DFLD  POS=(10,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV03  DFLD  POS=(10,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK03   DFLD  POS=(10,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG03    DFLD  POS=(10,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN03   DFLD  POS=(10,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART04    DFLD  POS=(11,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ04   DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB04    DFLD  POS=(11,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV04  DFLD  POS=(11,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK04   DFLD  POS=(11,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG04    DFLD  POS=(11,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN04   DFLD  POS=(11,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART05    DFLD  POS=(12,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ05   DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB05    DFLD  POS=(12,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV05  DFLD  POS=(12,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK05   DFLD  POS=(12,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG05    DFLD  POS=(12,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN05   DFLD  POS=(12,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART06    DFLD  POS=(13,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ06   DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB06    DFLD  POS=(13,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV06  DFLD  POS=(13,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK06   DFLD  POS=(13,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG06    DFLD  POS=(13,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN06   DFLD  POS=(13,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART07    DFLD  POS=(14,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ07   DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB07    DFLD  POS=(14,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV07  DFLD  POS=(14,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK07   DFLD  POS=(14,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG07    DFLD  POS=(14,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN07   DFLD  POS=(14,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART08    DFLD  POS=(15,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ08   DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB08    DFLD  POS=(15,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV08  DFLD  POS=(15,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK08   DFLD  POS=(15,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG08    DFLD  POS=(15,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN08   DFLD  POS=(15,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART09    DFLD  POS=(16,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ09   DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB09    DFLD  POS=(16,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV09  DFLD  POS=(16,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK09   DFLD  POS=(16,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG09    DFLD  POS=(16,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN09   DFLD  POS=(16,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART10    DFLD  POS=(17,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ10   DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB10    DFLD  POS=(17,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV10  DFLD  POS=(17,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK10   DFLD  POS=(17,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG10    DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN10   DFLD  POS=(17,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
ART11    DFLD  POS=(18,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROJ11   DFLD  POS=(18,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
EMB11    DFLD  POS=(18,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
INLEV11  DFLD  POS=(18,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PISK11   DFLD  POS=(18,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REG11    DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEKN11   DFLD  POS=(18,54),LTH=27,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First  F8=Next                   F10=WHELP          +        
                 ',                                                    +        
               POS=(21,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I146N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N146),                                           +        
               OPT=2,                                                  +        
               NXT=W2O146N1                                                     
MID      LPAGE SOR=(W2N146)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '21461',                                                +        
               LTH=5                                                            
         MFLD  (FOMIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOMIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROJIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W2O146N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N146,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I146N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N146                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FOMIN,                                                  +        
               LTH=5                                                            
         MFLD  TOMIN,                                                  +        
               LTH=5                                                            
         MFLD  PROJIN,                                                 +        
               LTH=4                                                            
         MFLD  FOMUT,                                                  +        
               LTH=5                                                            
         MFLD  TOMUT,                                                  +        
               LTH=5                                                            
         MFLD  PROJUT,                                                 +        
               LTH=4                                                            
         MFLD  ANTART,                                                 +        
               LTH=3                                                            
         MFLD  ANTINLEV,                                               +        
               LTH=3                                                            
         MFLD  ANTPISK,                                                +        
               LTH=3                                                            
         MFLD  ART01,                                                  +        
               LTH=8                                                            
         MFLD  PROJ01,                                                 +        
               LTH=4                                                            
         MFLD  EMB01,                                                  +        
               LTH=3                                                            
         MFLD  INLEV01,                                                +        
               LTH=5                                                            
         MFLD  PISK01,                                                 +        
               LTH=1                                                            
         MFLD  REG01,                                                  +        
               LTH=6                                                            
         MFLD  TEKN01,                                                 +        
               LTH=40                                                           
         MFLD  ART02,                                                  +        
               LTH=8                                                            
         MFLD  PROJ02,                                                 +        
               LTH=4                                                            
         MFLD  EMB02,                                                  +        
               LTH=3                                                            
         MFLD  INLEV02,                                                +        
               LTH=5                                                            
         MFLD  PISK02,                                                 +        
               LTH=1                                                            
         MFLD  REG02,                                                  +        
               LTH=6                                                            
         MFLD  TEKN02,                                                 +        
               LTH=40                                                           
         MFLD  ART03,                                                  +        
               LTH=8                                                            
         MFLD  PROJ03,                                                 +        
               LTH=4                                                            
         MFLD  EMB03,                                                  +        
               LTH=3                                                            
         MFLD  INLEV03,                                                +        
               LTH=5                                                            
         MFLD  PISK03,                                                 +        
               LTH=1                                                            
         MFLD  REG03,                                                  +        
               LTH=6                                                            
         MFLD  TEKN03,                                                 +        
               LTH=40                                                           
         MFLD  ART04,                                                  +        
               LTH=8                                                            
         MFLD  PROJ04,                                                 +        
               LTH=4                                                            
         MFLD  EMB04,                                                  +        
               LTH=3                                                            
         MFLD  INLEV04,                                                +        
               LTH=5                                                            
         MFLD  PISK04,                                                 +        
               LTH=1                                                            
         MFLD  REG04,                                                  +        
               LTH=6                                                            
         MFLD  TEKN04,                                                 +        
               LTH=40                                                           
         MFLD  ART05,                                                  +        
               LTH=8                                                            
         MFLD  PROJ05,                                                 +        
               LTH=4                                                            
         MFLD  EMB05,                                                  +        
               LTH=3                                                            
         MFLD  INLEV05,                                                +        
               LTH=5                                                            
         MFLD  PISK05,                                                 +        
               LTH=1                                                            
         MFLD  REG05,                                                  +        
               LTH=6                                                            
         MFLD  TEKN05,                                                 +        
               LTH=40                                                           
         MFLD  ART06,                                                  +        
               LTH=8                                                            
         MFLD  PROJ06,                                                 +        
               LTH=4                                                            
         MFLD  EMB06,                                                  +        
               LTH=3                                                            
         MFLD  INLEV06,                                                +        
               LTH=5                                                            
         MFLD  PISK06,                                                 +        
               LTH=1                                                            
         MFLD  REG06,                                                  +        
               LTH=6                                                            
         MFLD  TEKN06,                                                 +        
               LTH=40                                                           
         MFLD  ART07,                                                  +        
               LTH=8                                                            
         MFLD  PROJ07,                                                 +        
               LTH=4                                                            
         MFLD  EMB07,                                                  +        
               LTH=3                                                            
         MFLD  INLEV07,                                                +        
               LTH=5                                                            
         MFLD  PISK07,                                                 +        
               LTH=1                                                            
         MFLD  REG07,                                                  +        
               LTH=6                                                            
         MFLD  TEKN07,                                                 +        
               LTH=40                                                           
         MFLD  ART08,                                                  +        
               LTH=8                                                            
         MFLD  PROJ08,                                                 +        
               LTH=4                                                            
         MFLD  EMB08,                                                  +        
               LTH=3                                                            
         MFLD  INLEV08,                                                +        
               LTH=5                                                            
         MFLD  PISK08,                                                 +        
               LTH=1                                                            
         MFLD  REG08,                                                  +        
               LTH=6                                                            
         MFLD  TEKN08,                                                 +        
               LTH=40                                                           
         MFLD  ART09,                                                  +        
               LTH=8                                                            
         MFLD  PROJ09,                                                 +        
               LTH=4                                                            
         MFLD  EMB09,                                                  +        
               LTH=3                                                            
         MFLD  INLEV09,                                                +        
               LTH=5                                                            
         MFLD  PISK09,                                                 +        
               LTH=1                                                            
         MFLD  REG09,                                                  +        
               LTH=6                                                            
         MFLD  TEKN09,                                                 +        
               LTH=40                                                           
         MFLD  ART10,                                                  +        
               LTH=8                                                            
         MFLD  PROJ10,                                                 +        
               LTH=4                                                            
         MFLD  EMB10,                                                  +        
               LTH=3                                                            
         MFLD  INLEV10,                                                +        
               LTH=5                                                            
         MFLD  PISK10,                                                 +        
               LTH=1                                                            
         MFLD  REG10,                                                  +        
               LTH=6                                                            
         MFLD  TEKN10,                                                 +        
               LTH=40                                                           
         MFLD  ART11,                                                  +        
               LTH=8                                                            
         MFLD  PROJ11,                                                 +        
               LTH=4                                                            
         MFLD  EMB11,                                                  +        
               LTH=3                                                            
         MFLD  INLEV11,                                                +        
               LTH=5                                                            
         MFLD  PISK11,                                                 +        
               LTH=1                                                            
         MFLD  REG11,                                                  +        
               LTH=6                                                            
         MFLD  TEKN11,                                                 +        
               LTH=40                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
