***********************************************************************         
* CREATED BY PC30186   ON 97/09/05  AT 10:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BY PASS REFILL ORDERS           '                               
W2N362   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T362 7',                                           +        
               8='W2T362 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T362U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T361  ',                                          +        
               14='W2T362  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N362   DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0107  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'BY PASS REFILL ORDERS',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Sending DC',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
SENDDC   DFLD  POS=(5,13),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Receiving DC',                                         +        
               POS=(5,17),LTH=12,                                      +        
               ATTR=(PROT)                                                      
RECVDC   DFLD  POS=(5,30),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Air',                                                  +        
               POS=(5,34),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AIRIN    DFLD  POS=(5,38),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Campaign ref',                                         +        
               POS=(5,41),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KAMPIN   DFLD  POS=(5,55),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Warehouse instr',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
BELAGINS DFLD  POS=(6,18),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No.',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Quant',                                                +        
               POS=(8,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Line refer',                                           +        
               POS=(8,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Part No',                                              +        
               POS=(8,42),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quant',                                                +        
               POS=(8,55),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Line refer',                                           +        
               POS=(8,65),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDARTN01 DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR01 DFLD  POS=(10,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR01 DFLD  POS=(10,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN07 DFLD  POS=(10,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR07 DFLD  POS=(10,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR07 DFLD  POS=(10,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN02 DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR02 DFLD  POS=(11,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR02 DFLD  POS=(11,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN08 DFLD  POS=(11,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR08 DFLD  POS=(11,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR08 DFLD  POS=(11,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN03 DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR03 DFLD  POS=(12,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR03 DFLD  POS=(12,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN09 DFLD  POS=(12,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR09 DFLD  POS=(12,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR09 DFLD  POS=(12,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN04 DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR04 DFLD  POS=(13,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR04 DFLD  POS=(13,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN10 DFLD  POS=(13,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR10 DFLD  POS=(13,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR10 DFLD  POS=(13,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN05 DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR05 DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR05 DFLD  POS=(14,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN11 DFLD  POS=(14,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR11 DFLD  POS=(14,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR11 DFLD  POS=(14,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN06 DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR06 DFLD  POS=(15,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR06 DFLD  POS=(15,25),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
IDARTN12 DFLD  POS=(15,42),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVBEAR12 DFLD  POS=(15,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BERADR12 DFLD  POS=(15,65),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Order ready',                                          +        
               POS=(19,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLSLUT   DFLD  POS=(19,14),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Order No',                                             +        
               POS=(19,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ORDERNR  DFLD  POS=(19,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 DC part info 14 Demand/Forec 15 Ret/Scrapp 16 Balanc+        
               e info 17 Ref proposal',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,48),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 whelp',                                             +        
               POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O362N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N362,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I362N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N362                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0107,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  SENDDC,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RECVDC,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMPIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BELAGINS,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN01,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR01,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR01,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN09,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR09,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR09,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR11,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR11,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR12,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BERADR12,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSLUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDERNR,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I362N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N362),                                           +        
               OPT=2,                                                  +        
               NXT=W2O362N1                                                     
MID      LPAGE SOR=(W2N362)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0107,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23622',                                                +        
               LTH=5                                                            
         MFLD  (SENDDC,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RECVDC,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AIRIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KAMPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BELAGINS,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN01,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR01,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR01,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN02,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR02,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR02,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN03,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR03,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR03,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN04,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR04,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR04,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN05,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR05,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR05,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN06,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR06,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR06,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN07,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR07,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR07,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN08,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR08,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR08,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN09,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR09,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR09,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN10,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR10,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN11,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR11,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN12,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR12,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BERADR12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLSLUT,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
