***********************************************************************         
* CREATED BY PC65704   ON 99/02/11  AT 14:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL ETA INQUIRY NDC          '                               
W2N354   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T354 7',                                           +        
               8='W2T354 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T354  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REFILL ETA INQUIRY NDC',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMSFEL  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDCUT   DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr',                                                +        
               POS=(4,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
BEART    DFLD  POS=(4,11),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Stock',                                                +        
               POS=(5,12),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AK Current',                                           +        
               POS=(5,23),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '+1',                                                   +        
               POS=(5,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '+2',                                                   +        
               POS=(5,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '+3',                                                   +        
               POS=(5,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '+4',                                                   +        
               POS=(5,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '+5',                                                   +        
               POS=(5,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '>+5',                                                  +        
               POS=(5,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DCTXT01  DFLD  POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
LS01     DFLD  POS=(6,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
AK01     DFLD  POS=(6,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CW01     DFLD  POS=(6,26),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0001 DFLD  POS=(6,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0006 DFLD  POS=(6,42),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0011 DFLD  POS=(6,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0016 DFLD  POS=(6,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0021 DFLD  POS=(6,66),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0026 DFLD  POS=(6,74),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT02  DFLD  POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
LS02     DFLD  POS=(7,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
AK02     DFLD  POS=(7,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CW02     DFLD  POS=(7,26),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0002 DFLD  POS=(7,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0007 DFLD  POS=(7,42),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0012 DFLD  POS=(7,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0017 DFLD  POS=(7,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0022 DFLD  POS=(7,66),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0027 DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT03  DFLD  POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
LS03     DFLD  POS=(8,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
AK03     DFLD  POS=(8,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CW03     DFLD  POS=(8,26),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0003 DFLD  POS=(8,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0008 DFLD  POS=(8,42),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0013 DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0018 DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0023 DFLD  POS=(8,66),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0028 DFLD  POS=(8,74),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT04  DFLD  POS=(9,2),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
LS04     DFLD  POS=(9,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
AK04     DFLD  POS=(9,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CW04     DFLD  POS=(9,26),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0004 DFLD  POS=(9,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0009 DFLD  POS=(9,42),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0014 DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0019 DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0024 DFLD  POS=(9,66),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0029 DFLD  POS=(9,74),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT05  DFLD  POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS05     DFLD  POS=(10,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK05     DFLD  POS=(10,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW05     DFLD  POS=(10,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0005 DFLD  POS=(10,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0010 DFLD  POS=(10,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0015 DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0020 DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0025 DFLD  POS=(10,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0030 DFLD  POS=(10,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT06  DFLD  POS=(11,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS06     DFLD  POS=(11,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK06     DFLD  POS=(11,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW06     DFLD  POS=(11,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0000 DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0005 DFLD  POS=(11,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0010 DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0015 DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0020 DFLD  POS=(11,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0025 DFLD  POS=(11,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT07  DFLD  POS=(12,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS07     DFLD  POS=(12,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK07     DFLD  POS=(12,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW07     DFLD  POS=(12,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0004 DFLD  POS=(12,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0009 DFLD  POS=(12,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0014 DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0019 DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0024 DFLD  POS=(12,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIB0029 DFLD  POS=(12,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT08  DFLD  POS=(13,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS08     DFLD  POS=(13,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK08     DFLD  POS=(13,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW08     DFLD  POS=(13,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA161   DFLD  POS=(13,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA261   DFLD  POS=(13,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA361   DFLD  POS=(13,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA461   DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA561   DFLD  POS=(13,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA661   DFLD  POS=(13,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT09  DFLD  POS=(14,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS09     DFLD  POS=(14,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK09     DFLD  POS=(14,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW09     DFLD  POS=(14,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA162   DFLD  POS=(14,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA262   DFLD  POS=(14,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA362   DFLD  POS=(14,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA462   DFLD  POS=(14,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA562   DFLD  POS=(14,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA662   DFLD  POS=(14,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT10  DFLD  POS=(15,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS10     DFLD  POS=(15,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK10     DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW10     DFLD  POS=(15,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA171   DFLD  POS=(15,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA271   DFLD  POS=(15,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA371   DFLD  POS=(15,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA471   DFLD  POS=(15,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA571   DFLD  POS=(15,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA671   DFLD  POS=(15,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT11  DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS11     DFLD  POS=(16,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK11     DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW11     DFLD  POS=(16,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA172   DFLD  POS=(16,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA272   DFLD  POS=(16,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA372   DFLD  POS=(16,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA472   DFLD  POS=(16,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA572   DFLD  POS=(16,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA672   DFLD  POS=(16,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT12  DFLD  POS=(17,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS12     DFLD  POS=(17,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK12     DFLD  POS=(17,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW12     DFLD  POS=(17,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA173   DFLD  POS=(17,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA273   DFLD  POS=(17,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA373   DFLD  POS=(17,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA473   DFLD  POS=(17,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA573   DFLD  POS=(17,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA673   DFLD  POS=(17,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT13  DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS13     DFLD  POS=(18,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK13     DFLD  POS=(18,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW13     DFLD  POS=(18,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA1LCN  DFLD  POS=(18,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA2LCN  DFLD  POS=(18,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA3LCN  DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA4LCN  DFLD  POS=(18,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA5LCN  DFLD  POS=(18,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA6LCN  DFLD  POS=(18,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DCTXT14  DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LS14     DFLD  POS=(19,9),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AK14     DFLD  POS=(19,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CW14     DFLD  POS=(19,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA1CNT  DFLD  POS=(19,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA2CNT  DFLD  POS=(19,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA3CNT  DFLD  POS=(19,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA4CNT  DFLD  POS=(19,58),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA5CNT  DFLD  POS=(19,66),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VKA6CNT  DFLD  POS=(19,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13 Purch menu   14 Purch prop   15 On order',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Season',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist   19 Refill info  20 On ord local 21 Tran+        
                Scrap   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O354N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N354,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I354N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMSFEL,                                                +        
               LTH=40                                                           
         MFLD  IDARTIN,                                                +        
               LTH=9                                                            
         MFLD  IDARTUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  DCTXT01,                                                +        
               LTH=6                                                            
         MFLD  LS01,                                                   +        
               LTH=8                                                            
         MFLD  AK01,                                                   +        
               LTH=7                                                            
         MFLD  CW01,                                                   +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  DGIA0011,                                               +        
               LTH=7                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MFLD  DCTXT02,                                                +        
               LTH=6                                                            
         MFLD  LS02,                                                   +        
               LTH=8                                                            
         MFLD  AK02,                                                   +        
               LTH=7                                                            
         MFLD  CW02,                                                   +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=7                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  DGIA0012,                                               +        
               LTH=7                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0027,                                               +        
               LTH=7                                                            
         MFLD  DCTXT03,                                                +        
               LTH=6                                                            
         MFLD  LS03,                                                   +        
               LTH=8                                                            
         MFLD  AK03,                                                   +        
               LTH=7                                                            
         MFLD  CW03,                                                   +        
               LTH=7                                                            
         MFLD  DGIA0003,                                               +        
               LTH=7                                                            
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  DGIA0013,                                               +        
               LTH=7                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  DGIA0028,                                               +        
               LTH=7                                                            
         MFLD  DCTXT04,                                                +        
               LTH=6                                                            
         MFLD  LS04,                                                   +        
               LTH=8                                                            
         MFLD  AK04,                                                   +        
               LTH=7                                                            
         MFLD  CW04,                                                   +        
               LTH=7                                                            
         MFLD  DGIA0004,                                               +        
               LTH=7                                                            
         MFLD  DGIA0009,                                               +        
               LTH=7                                                            
         MFLD  DGIA0014,                                               +        
               LTH=7                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0029,                                               +        
               LTH=7                                                            
         MFLD  DCTXT05,                                                +        
               LTH=6                                                            
         MFLD  LS05,                                                   +        
               LTH=8                                                            
         MFLD  AK05,                                                   +        
               LTH=7                                                            
         MFLD  CW05,                                                   +        
               LTH=7                                                            
         MFLD  DGIA0005,                                               +        
               LTH=7                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  DGIA0030,                                               +        
               LTH=7                                                            
         MFLD  DCTXT06,                                                +        
               LTH=6                                                            
         MFLD  LS06,                                                   +        
               LTH=8                                                            
         MFLD  AK06,                                                   +        
               LTH=7                                                            
         MFLD  CW06,                                                   +        
               LTH=7                                                            
         MFLD  DGIB0000,                                               +        
               LTH=7                                                            
         MFLD  DGIB0005,                                               +        
               LTH=7                                                            
         MFLD  DGIB0010,                                               +        
               LTH=7                                                            
         MFLD  DGIB0015,                                               +        
               LTH=7                                                            
         MFLD  DGIB0020,                                               +        
               LTH=7                                                            
         MFLD  DGIB0025,                                               +        
               LTH=7                                                            
         MFLD  DCTXT07,                                                +        
               LTH=6                                                            
         MFLD  LS07,                                                   +        
               LTH=8                                                            
         MFLD  AK07,                                                   +        
               LTH=7                                                            
         MFLD  CW07,                                                   +        
               LTH=7                                                            
         MFLD  DGIB0004,                                               +        
               LTH=7                                                            
         MFLD  DGIB0009,                                               +        
               LTH=7                                                            
         MFLD  DGIB0014,                                               +        
               LTH=7                                                            
         MFLD  DGIB0019,                                               +        
               LTH=7                                                            
         MFLD  DGIB0024,                                               +        
               LTH=7                                                            
         MFLD  DGIB0029,                                               +        
               LTH=7                                                            
         MFLD  DCTXT08,                                                +        
               LTH=6                                                            
         MFLD  LS08,                                                   +        
               LTH=8                                                            
         MFLD  AK08,                                                   +        
               LTH=7                                                            
         MFLD  CW08,                                                   +        
               LTH=7                                                            
         MFLD  VKA161,                                                 +        
               LTH=7                                                            
         MFLD  VKA261,                                                 +        
               LTH=7                                                            
         MFLD  VKA361,                                                 +        
               LTH=7                                                            
         MFLD  VKA461,                                                 +        
               LTH=7                                                            
         MFLD  VKA561,                                                 +        
               LTH=7                                                            
         MFLD  VKA661,                                                 +        
               LTH=7                                                            
         MFLD  DCTXT09,                                                +        
               LTH=6                                                            
         MFLD  LS09,                                                   +        
               LTH=8                                                            
         MFLD  AK09,                                                   +        
               LTH=7                                                            
         MFLD  CW09,                                                   +        
               LTH=7                                                            
         MFLD  VKA162,                                                 +        
               LTH=7                                                            
         MFLD  VKA262,                                                 +        
               LTH=7                                                            
         MFLD  VKA362,                                                 +        
               LTH=7                                                            
         MFLD  VKA462,                                                 +        
               LTH=7                                                            
         MFLD  VKA562,                                                 +        
               LTH=7                                                            
         MFLD  VKA662,                                                 +        
               LTH=7                                                            
         MFLD  DCTXT10,                                                +        
               LTH=6                                                            
         MFLD  LS10,                                                   +        
               LTH=8                                                            
         MFLD  AK10,                                                   +        
               LTH=7                                                            
         MFLD  CW10,                                                   +        
               LTH=7                                                            
         MFLD  VKA171,                                                 +        
               LTH=7                                                            
         MFLD  VKA271,                                                 +        
               LTH=7                                                            
         MFLD  VKA371,                                                 +        
               LTH=7                                                            
         MFLD  VKA471,                                                 +        
               LTH=7                                                            
         MFLD  VKA571,                                                 +        
               LTH=7                                                            
         MFLD  VKA671,                                                 +        
               LTH=7                                                            
         MFLD  DCTXT11,                                                +        
               LTH=6                                                            
         MFLD  LS11,                                                   +        
               LTH=8                                                            
         MFLD  AK11,                                                   +        
               LTH=7                                                            
         MFLD  CW11,                                                   +        
               LTH=7                                                            
         MFLD  VKA172,                                                 +        
               LTH=7                                                            
         MFLD  VKA272,                                                 +        
               LTH=7                                                            
         MFLD  VKA372,                                                 +        
               LTH=7                                                            
         MFLD  VKA472,                                                 +        
               LTH=7                                                            
         MFLD  VKA572,                                                 +        
               LTH=7                                                            
         MFLD  VKA672,                                                 +        
               LTH=7                                                            
         MFLD  DCTXT12,                                                +        
               LTH=6                                                            
         MFLD  LS12,                                                   +        
               LTH=8                                                            
         MFLD  AK12,                                                   +        
               LTH=7                                                            
         MFLD  CW12,                                                   +        
               LTH=7                                                            
         MFLD  VKA173,                                                 +        
               LTH=7                                                            
         MFLD  VKA273,                                                 +        
               LTH=7                                                            
         MFLD  VKA373,                                                 +        
               LTH=7                                                            
         MFLD  VKA473,                                                 +        
               LTH=7                                                            
         MFLD  VKA573,                                                 +        
               LTH=7                                                            
         MFLD  VKA673,                                                 +        
               LTH=7                                                            
         MFLD  DCTXT13,                                                +        
               LTH=6                                                            
         MFLD  LS13,                                                   +        
               LTH=8                                                            
         MFLD  AK13,                                                   +        
               LTH=7                                                            
         MFLD  CW13,                                                   +        
               LTH=7                                                            
         MFLD  VKA1LCN,                                                +        
               LTH=7                                                            
         MFLD  VKA2LCN,                                                +        
               LTH=7                                                            
         MFLD  VKA3LCN,                                                +        
               LTH=7                                                            
         MFLD  VKA4LCN,                                                +        
               LTH=7                                                            
         MFLD  VKA5LCN,                                                +        
               LTH=7                                                            
         MFLD  VKA6LCN,                                                +        
               LTH=7                                                            
         MFLD  DCTXT14,                                                +        
               LTH=6                                                            
         MFLD  LS14,                                                   +        
               LTH=8                                                            
         MFLD  AK14,                                                   +        
               LTH=7                                                            
         MFLD  CW14,                                                   +        
               LTH=7                                                            
         MFLD  VKA1CNT,                                                +        
               LTH=7                                                            
         MFLD  VKA2CNT,                                                +        
               LTH=7                                                            
         MFLD  VKA3CNT,                                                +        
               LTH=7                                                            
         MFLD  VKA4CNT,                                                +        
               LTH=7                                                            
         MFLD  VKA5CNT,                                                +        
               LTH=7                                                            
         MFLD  VKA6CNT,                                                +        
               LTH=7                                                            
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I354N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N354),                                           +        
               OPT=2,                                                  +        
               NXT=W2O354N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23542',                                                +        
               LTH=5                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
