***********************************************************************         
* CREATED BY PC30186   ON 97/09/17  AT 13:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL INFORMATION NDC          '                               
W2N363   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T363U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T363  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N363   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REFILL INFO USA/CANADA',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART    DFLD  POS=(3,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Warehouse info',                                       +        
               POS=(5,3),LTH=14,                                       +        
               ATTR=(PROT)                                                      
DC1      DFLD  POS=(5,28),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC2      DFLD  POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC3      DFLD  POS=(5,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC4      DFLD  POS=(5,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(7,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
SUP1UT   DFLD  POS=(7,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP1IN   DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
SUP2UT   DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP2IN   DFLD  POS=(7,45),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
SUP3UT   DFLD  POS=(7,53),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP3IN   DFLD  POS=(7,59),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
SUP4UT   DFLD  POS=(7,67),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP4IN   DFLD  POS=(7,73),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Orderblock',                                           +        
               POS=(8,3),LTH=10,                                       +        
               ATTR=(PROT)                                                      
OSP1UT   DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSP1IN   DFLD  POS=(8,31),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OSP2UT   DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSP2IN   DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OSP3UT   DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSP3IN   DFLD  POS=(8,59),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OSP4UT   DFLD  POS=(8,71),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSP4IN   DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(9,7),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DATE1O   DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATE2O   DFLD  POS=(9,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATE3O   DFLD  POS=(9,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATE4O   DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(10,7),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USER1O   DFLD  POS=(10,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER2O   DFLD  POS=(10,36),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER3O   DFLD  POS=(10,50),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER4O   DFLD  POS=(10,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bulkorderbl',                                          +        
               POS=(11,3),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BSP1UT   DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BSP1IN   DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BSP2UT   DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BSP2IN   DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BSP3UT   DFLD  POS=(11,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BSP3IN   DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
BSP4UT   DFLD  POS=(11,71),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BSP4IN   DFLD  POS=(11,73),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(12,7),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DATE1B   DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE2B   DFLD  POS=(12,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE3B   DFLD  POS=(12,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE4B   DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(13,7),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USER1B   DFLD  POS=(13,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER2B   DFLD  POS=(13,36),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER3B   DFLD  POS=(13,50),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER4B   DFLD  POS=(13,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Leadtime',                                             +        
               POS=(14,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
MLT1UT   DFLD  POS=(14,27),LTH=3,                                      +        
               ATTR=(PROT)                                                      
MLT2UT   DFLD  POS=(14,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
MLT3UT   DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
MLT4UT   DFLD  POS=(14,69),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Buyer',                                                +        
               POS=(15,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BUY1UT   DFLD  POS=(15,27),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUY1IN   DFLD  POS=(15,31),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUY2UT   DFLD  POS=(15,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUY2IN   DFLD  POS=(15,45),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUY3UT   DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUY3IN   DFLD  POS=(15,59),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUY4UT   DFLD  POS=(15,69),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUY4IN   DFLD  POS=(15,73),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Referral Block (Y/N)',                                 +        
               POS=(16,3),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
REFERUT  DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REFERIN  DFLD  POS=(16,31),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'User',                                                 +        
               POS=(16,33),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
USER     DFLD  POS=(16,38),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(16,47),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
REGDAT   DFLD  POS=(16,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Comm:1',                                               +        
               POS=(17,3),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
NOT1     DFLD  POS=(17,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comm:2',                                               +        
               POS=(18,3),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
NOT2     DFLD  POS=(18,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comm:3',                                               +        
               POS=(19,3),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
NOT3     DFLD  POS=(19,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comm:4',                                               +        
               POS=(20,3),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
NOT4     DFLD  POS=(20,11),LTH=70,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O363N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N363,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I363N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N363                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  SUP1UT,                                                 +        
               LTH=5                                                            
         MFLD  SUP2UT,                                                 +        
               LTH=5                                                            
         MFLD  SUP3UT,                                                 +        
               LTH=5                                                            
         MFLD  SUP4UT,                                                 +        
               LTH=5                                                            
         MFLD  OSP1UT,                                                 +        
               LTH=1                                                            
         MFLD  OSP2UT,                                                 +        
               LTH=1                                                            
         MFLD  OSP3UT,                                                 +        
               LTH=1                                                            
         MFLD  OSP4UT,                                                 +        
               LTH=1                                                            
         MFLD  DATE1O,                                                 +        
               LTH=6                                                            
         MFLD  DATE2O,                                                 +        
               LTH=6                                                            
         MFLD  DATE3O,                                                 +        
               LTH=6                                                            
         MFLD  DATE4O,                                                 +        
               LTH=6                                                            
         MFLD  USER1O,                                                 +        
               LTH=8                                                            
         MFLD  USER2O,                                                 +        
               LTH=8                                                            
         MFLD  USER3O,                                                 +        
               LTH=8                                                            
         MFLD  USER4O,                                                 +        
               LTH=8                                                            
         MFLD  BSP1UT,                                                 +        
               LTH=1                                                            
         MFLD  BSP2UT,                                                 +        
               LTH=1                                                            
         MFLD  BSP3UT,                                                 +        
               LTH=1                                                            
         MFLD  BSP4UT,                                                 +        
               LTH=1                                                            
         MFLD  DATE1B,                                                 +        
               LTH=6                                                            
         MFLD  DATE2B,                                                 +        
               LTH=6                                                            
         MFLD  DATE3B,                                                 +        
               LTH=6                                                            
         MFLD  DATE4B,                                                 +        
               LTH=6                                                            
         MFLD  USER1B,                                                 +        
               LTH=8                                                            
         MFLD  USER2B,                                                 +        
               LTH=8                                                            
         MFLD  USER3B,                                                 +        
               LTH=8                                                            
         MFLD  USER4B,                                                 +        
               LTH=8                                                            
         MFLD  MLT1UT,                                                 +        
               LTH=3                                                   +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  MLT2UT,                                                 +        
               LTH=3                                                            
         MFLD  MLT3UT,                                                 +        
               LTH=3                                                            
         MFLD  MLT4UT,                                                 +        
               LTH=3                                                            
         MFLD  BUY1UT,                                                 +        
               LTH=3                                                            
         MFLD  BUY2UT,                                                 +        
               LTH=3                                                            
         MFLD  BUY3UT,                                                 +        
               LTH=3                                                            
         MFLD  BUY4UT,                                                 +        
               LTH=3                                                            
         MFLD  REFERUT,                                                +        
               LTH=1                                                            
         MFLD  USER,                                                   +        
               LTH=8                                                            
         MFLD  REGDAT,                                                 +        
               LTH=6                                                            
         MFLD  SUP1IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUP2IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUP3IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUP4IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSP1IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSP2IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSP3IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSP4IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BSP1IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BSP2IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BSP3IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BSP4IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUY1IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUY2IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUY3IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUY4IN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFERIN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NOT1,                                                   +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOT2,                                                   +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOT3,                                                   +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOT4,                                                   +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  LTH=25                                                           
         MSGEND                                                                 
W2I363N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N363),                                           +        
               OPT=2,                                                  +        
               NXT=W2O363N1                                                     
MID      LPAGE SOR=(W2N363)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23632',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUP1IN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SUP2IN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SUP3IN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SUP4IN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OSP1IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSP2IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSP3IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSP4IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BSP1IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BSP2IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BSP3IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BSP4IN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BUY1IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUY2IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUY3IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUY4IN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFERIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (NOT1,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOT2,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOT3,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOT4,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
