***********************************************************************         
* CREATED BY PC30186   ON 97/06/10  AT 15:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEMAND/FORECAST DC              '                               
W2N342   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T342U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T341  ',                                          +        
               14='W2T342  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T342U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N342   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DEMAND/FORECAST DC',                                   +        
               POS=(1,11),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,33),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCI    DFLD  POS=(2,40),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '-',                                                    +        
               POS=(3,43),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDDISTR  DFLD  POS=(3,45),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Descr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BEARTSVE DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Proc No.',                                             +        
               POS=(5,35),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(5,44),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PRTEXT   DFLD  POS=(5,48),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'price',                                                +        
               POS=(5,53),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRARTSTD DFLD  POS=(5,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q1',                                                   +        
               POS=(5,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVQP1    DFLD  POS=(5,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sup code',                                             +        
               POS=(6,35),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(6,45),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SS-ing',                                               +        
               POS=(6,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLERS    DFLD  POS=(6,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pub w',                                                +        
               POS=(6,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIFINLV  DFLD  POS=(6,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(7,8),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDCREF  DFLD  POS=(7,11),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(7,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Available',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KVDISP   DFLD  POS=(8,15),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Available',                                            +        
               POS=(8,24),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
KVLS     DFLD  POS=(8,34),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(8,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(8,60),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Roll 12 Roll 6',                                       +        
               POS=(8,66),LTH=14,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AK',                                                   +        
               POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KVAKS    DFLD  POS=(9,15),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AK',                                                   +        
               POS=(9,24),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'per',                                                  +        
               POS=(9,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'per',                                                  +        
               POS=(9,74),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adviced',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FORAVIS  DFLD  POS=(10,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ordered q',                                            +        
               POS=(10,24),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVEFRS   DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'OH',                                                   +        
               POS=(10,47),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(10,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(10,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(10,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Forecast',                                             +        
               POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVPBTOT  DFLD  POS=(11,11),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'FC ref',                                               +        
               POS=(11,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(11,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'o DC',                                                 +        
               POS=(11,45),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(11,66),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(11,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Q3',                                                   +        
               POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVQP3    DFLD  POS=(12,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FC reoi',                                              +        
               POS=(12,24),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FCTEXT   DFLD  POS=(12,27),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPBREOI DFLD  POS=(12,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'IO-sep',                                               +        
               POS=(12,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(12,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(12,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(12,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(12,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Refill q',                                             +        
               POS=(13,24),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KVREFBER DFLD  POS=(13,35),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'IO-ref',                                               +        
               POS=(13,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA1350 DFLD  POS=(13,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA1358 DFLD  POS=(13,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA1366 DFLD  POS=(13,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA1374 DFLD  POS=(13,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Per',                                                  +        
               POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIPP1    DFLD  POS=(14,12),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TIPP2    DFLD  POS=(14,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TIPP3    DFLD  POS=(14,28),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TIPP4    DFLD  POS=(14,36),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TIPP5    DFLD  POS=(14,44),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TIPP6    DFLD  POS=(14,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Curr.',                                                +        
               POS=(14,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dat ESC sep',                                          +        
               POS=(14,63),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DASEPESC DFLD  POS=(14,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ww',                                                   +        
               POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TIVV1    DFLD  POS=(15,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
TIVV2    DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
TIVV3    DFLD  POS=(15,25),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
TIVV4    DFLD  POS=(15,33),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
TIVV5    DFLD  POS=(15,41),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
TIVV6    DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'period',                                               +        
               POS=(15,56),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Dat ESC ref',                                          +        
               POS=(15,63),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DAREFESC DFLD  POS=(15,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'OH',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVOT1    DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVOT2    DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOT3    DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOT4    DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOT5    DFLD  POS=(16,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOT6    DFLD  POS=(16,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOTIN   DFLD  POS=(16,56),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dat man sep',                                          +        
               POS=(16,63),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
TIREFMPB DFLD  POS=(16,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'o DC',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVOTCL1  DFLD  POS=(17,7),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVOTCL2  DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVOTCL3  DFLD  POS=(17,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVOTCL4  DFLD  POS=(17,31),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVOTCL5  DFLD  POS=(17,39),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVOTCL6  DFLD  POS=(17,47),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVOTCLIN DFLD  POS=(17,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TIRMPBUP DFLD  POS=(17,75),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'IOsep',                                                +        
               POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVOI1    DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVOI2    DFLD  POS=(18,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI3    DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI4    DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI5    DFLD  POS=(18,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI6    DFLD  POS=(18,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOIIN   DFLD  POS=(18,56),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dat man ref',                                          +        
               POS=(18,63),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
TIPBREOI DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'IOref',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVOI7    DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVOI8    DFLD  POS=(19,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI9    DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI10   DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI11   DFLD  POS=(19,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI12   DFLD  POS=(19,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVOI13   DFLD  POS=(19,56),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIPBREUP DFLD  POS=(19,75),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 DC part info 14 Demand/FC',                         +        
               POS=(21,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O342N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N342,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I342N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N342                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  BEARTSVE,                                               +        
               LTH=25                                                           
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  PRTEXT,                                                 +        
               LTH=4                                                            
         MFLD  PRARTSTD,                                               +        
               LTH=10                                                           
         MFLD  KVQP1,                                                  +        
               LTH=5                                                            
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  FLERS,                                                  +        
               LTH=1                                                            
         MFLD  TIFINLV,                                                +        
               LTH=5                                                            
         MFLD  IDDCREF,                                                +        
               LTH=2                                                            
         MFLD  KVDISP,                                                 +        
               LTH=8                                                            
         MFLD  KVAKS,                                                  +        
               LTH=8                                                            
         MFLD  FORAVIS,                                                +        
               LTH=8                                                            
         MFLD  KVPBTOT,                                                +        
               LTH=12                                                           
         MFLD  KVQP3,                                                  +        
               LTH=5                                                            
         MFLD  KVLS,                                                   +        
               LTH=8                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8                                                            
         MFLD  KVEFRS,                                                 +        
               LTH=6                                                            
         MFLD  DGIA0014,                                               +        
               LTH=8                                                            
         MFLD  FCTEXT,                                                 +        
               LTH=5                                                            
         MFLD  KVPBREOI,                                               +        
               LTH=8                                                            
         MFLD  KVREFBER,                                               +        
               LTH=7                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA1350,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0009,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA1358,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0011,                                               +        
               LTH=7                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA1366,                                               +        
               LTH=6                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0012,                                               +        
               LTH=7                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA1374,                                               +        
               LTH=6                                                            
         MFLD  TIPP1,                                                  +        
               LTH=2                                                            
         MFLD  TIVV1,                                                  +        
               LTH=5                                                            
         MFLD  KVOT1,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL1,                                                +        
               LTH=7                                                            
         MFLD  KVOI1,                                                  +        
               LTH=6                                                            
         MFLD  KVOI7,                                                  +        
               LTH=6                                                            
         MFLD  TIPP2,                                                  +        
               LTH=2                                                            
         MFLD  TIVV2,                                                  +        
               LTH=5                                                            
         MFLD  KVOT2,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL2,                                                +        
               LTH=7                                                            
         MFLD  KVOI2,                                                  +        
               LTH=6                                                            
         MFLD  KVOI8,                                                  +        
               LTH=6                                                            
         MFLD  TIPP3,                                                  +        
               LTH=2                                                            
         MFLD  TIVV3,                                                  +        
               LTH=5                                                            
         MFLD  KVOT3,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL3,                                                +        
               LTH=7                                                            
         MFLD  KVOI3,                                                  +        
               LTH=6                                                            
         MFLD  KVOI9,                                                  +        
               LTH=6                                                            
         MFLD  TIPP4,                                                  +        
               LTH=2                                                            
         MFLD  TIVV4,                                                  +        
               LTH=5                                                            
         MFLD  KVOT4,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL4,                                                +        
               LTH=7                                                            
         MFLD  KVOI4,                                                  +        
               LTH=6                                                            
         MFLD  KVOI10,                                                 +        
               LTH=6                                                            
         MFLD  TIPP5,                                                  +        
               LTH=2                                                            
         MFLD  TIVV5,                                                  +        
               LTH=5                                                            
         MFLD  KVOT5,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL5,                                                +        
               LTH=7                                                            
         MFLD  KVOI5,                                                  +        
               LTH=6                                                            
         MFLD  KVOI11,                                                 +        
               LTH=6                                                            
         MFLD  TIPP6,                                                  +        
               LTH=2                                                            
         MFLD  TIVV6,                                                  +        
               LTH=5                                                            
         MFLD  KVOT6,                                                  +        
               LTH=6                                                            
         MFLD  KVOTCL6,                                                +        
               LTH=7                                                            
         MFLD  KVOI6,                                                  +        
               LTH=6                                                            
         MFLD  KVOI12,                                                 +        
               LTH=6                                                            
         MFLD  DASEPESC,                                               +        
               LTH=6                                                            
         MFLD  DAREFESC,                                               +        
               LTH=6                                                            
         MFLD  KVOTIN,                                                 +        
               LTH=6                                                            
         MFLD  KVOTCLIN,                                               +        
               LTH=7                                                            
         MFLD  KVOIIN,                                                 +        
               LTH=6                                                            
         MFLD  KVOI13,                                                 +        
               LTH=6                                                            
         MFLD  TIREFMPB,                                               +        
               LTH=6                                                            
         MFLD  TIRMPBUP,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIPBREOI,                                               +        
               LTH=6                                                            
         MFLD  TIPBREUP,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I342N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N342),                                           +        
               OPT=2,                                                  +        
               NXT=W2O342N1                                                     
MID      LPAGE SOR=(W2N342)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23422',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIRMPBUP,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIPBREUP,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
