***********************************************************************         
* CREATED BY V006144   ON 03/06/24  AT 18:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CAMPAIGN INFORMATION - DETAIL   '                               
W2N314   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T553 9',                                           +        
               7='W2T314 7',                                           +        
               8='W2T314 8',                                           +        
               9='W2T314 9',                                           +        
               10='WHELP   ',                                          +        
               11='W2T314U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N314   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CAMPAIGN INFO. - DETAIL',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Campaign no',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
KAMPIN   DFLD  POS=(2,14),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Campaign group',                                       +        
               POS=(2,23),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KGRPIN   DFLD  POS=(2,38),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Show only',                                            +        
               POS=(2,48),LTH=9,                                       +        
               ATTR=(PROT)                                                      
UNIKIN   DFLD  POS=(2,67),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
UNIKUT   DFLD  POS=(2,69),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
KAMPUT   DFLD  POS=(3,14),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KGRPUT   DFLD  POS=(3,38),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Show def SS code',                                     +        
               POS=(3,48),LTH=17,                                      +        
               ATTR=(PROT)                                                      
ERSIN    DFLD  POS=(3,67),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ERSUT    DFLD  POS=(3,69),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'E',                                                    +        
               POS=(5,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SS   Resp',                                            +        
               POS=(5,52),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Part no   No/Rep Launch  1:st yr Tot. no X Proc code +        
               rate Comment',                                          +        
               POS=(6,2),LTH=67,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR1   DFLD  POS=(7,4),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
REPANT1  DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH1  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FIRST1   DFLD  POS=(7,29),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
TOTAL1   DFLD  POS=(7,37),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLTOT1   DFLD  POS=(7,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANSK1    DFLD  POS=(7,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ERSKOD1  DFLD  POS=(7,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
RESPRT1  DFLD  POS=(7,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOMM1    DFLD  POS=(7,62),LTH=19,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR2   DFLD  POS=(8,4),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
REPANT2  DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH2  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FIRST2   DFLD  POS=(8,29),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
TOTAL2   DFLD  POS=(8,37),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLTOT2   DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANSK2    DFLD  POS=(8,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ERSKOD2  DFLD  POS=(8,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
RESPRT2  DFLD  POS=(8,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOMM2    DFLD  POS=(8,62),LTH=19,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR3   DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
REPANT3  DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH3  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FIRST3   DFLD  POS=(9,29),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
TOTAL3   DFLD  POS=(9,37),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLTOT3   DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ANSK3    DFLD  POS=(9,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ERSKOD3  DFLD  POS=(9,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
RESPRT3  DFLD  POS=(9,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOMM3    DFLD  POS=(9,62),LTH=19,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR4   DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT4  DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH4  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST4   DFLD  POS=(10,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL4   DFLD  POS=(10,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT4   DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK4    DFLD  POS=(10,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD4  DFLD  POS=(10,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT4  DFLD  POS=(10,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM4    DFLD  POS=(10,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR5   DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT5  DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH5  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST5   DFLD  POS=(11,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL5   DFLD  POS=(11,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT5   DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK5    DFLD  POS=(11,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD5  DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT5  DFLD  POS=(11,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM5    DFLD  POS=(11,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR6   DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT6  DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH6  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST6   DFLD  POS=(12,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL6   DFLD  POS=(12,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT6   DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK6    DFLD  POS=(12,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD6  DFLD  POS=(12,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT6  DFLD  POS=(12,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM6    DFLD  POS=(12,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR7   DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT7  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH7  DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST7   DFLD  POS=(13,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL7   DFLD  POS=(13,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT7   DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK7    DFLD  POS=(13,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD7  DFLD  POS=(13,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT7  DFLD  POS=(13,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM7    DFLD  POS=(13,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR8   DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT8  DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH8  DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST8   DFLD  POS=(14,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL8   DFLD  POS=(14,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT8   DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK8    DFLD  POS=(14,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD8  DFLD  POS=(14,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT8  DFLD  POS=(14,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM8    DFLD  POS=(14,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR9   DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT9  DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH9  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST9   DFLD  POS=(15,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL9   DFLD  POS=(15,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT9   DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK9    DFLD  POS=(15,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD9  DFLD  POS=(15,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT9  DFLD  POS=(15,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM9    DFLD  POS=(15,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR10  DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT10 DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH10 DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST10  DFLD  POS=(16,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL10  DFLD  POS=(16,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT10  DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK10   DFLD  POS=(16,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD10 DFLD  POS=(16,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT10 DFLD  POS=(16,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM10   DFLD  POS=(16,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR11  DFLD  POS=(17,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT11 DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH11 DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST11  DFLD  POS=(17,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL11  DFLD  POS=(17,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT11  DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK11   DFLD  POS=(17,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD11 DFLD  POS=(17,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT11 DFLD  POS=(17,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM11   DFLD  POS=(17,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR12  DFLD  POS=(18,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
REPANT12 DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LAUNCH12 DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST12  DFLD  POS=(18,29),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL12  DFLD  POS=(18,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLTOT12  DFLD  POS=(18,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
ANSK12   DFLD  POS=(18,47),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ERSKOD12 DFLD  POS=(18,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
RESPRT12 DFLD  POS=(18,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOMM12   DFLD  POS=(18,62),LTH=19,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part no   Launch  1:st yr Total no',                   +        
               POS=(20,4),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(20,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(21,4),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
LAUNCH   DFLD  POS=(21,14),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
FIRST    DFLD  POS=(21,22),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
TOTAL    DFLD  POS=(21,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKAMP   DFLD  POS=(21,51),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F6=CAMP TXT',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First',                                             +        
               POS=(22,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(22,25),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F9=2315',                                              +        
               POS=(22,34),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP',                                            +        
               POS=(22,43),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W2I314N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N314),                                           +        
               OPT=2,                                                  +        
               NXT=W2O314N1                                                     
MID      LPAGE SOR=(W2N314)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23142',                                                +        
               LTH=5                                                            
         MFLD  (KAMPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KAMPUT,                                                +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KGRPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KGRPUT,                                                +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (UNIKIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (UNIKUT,                                                +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ERSIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ERSUT,                                                 +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH1,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST1,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL1,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT1,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH2,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST2,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL2,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT2,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH3,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST3,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL3,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT3,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH4,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST4,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL4,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT4,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH5,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST5,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL5,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT5,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH6,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST6,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL6,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT6,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT6,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH7,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST7,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL7,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT7,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT7,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH8,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST8,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL8,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT8,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT8,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH9,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST9,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL9,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT9,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT9,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT10,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT10,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST11,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL11,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT11,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT11,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST12,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL12,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT12,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RESPRT12,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAUNCH,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FIRST,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTAL,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W2O314N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N314,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I314N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N314                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KAMPIN,                                                 +        
               LTH=7                                                            
         MFLD  KAMPUT,                                                 +        
               LTH=7                                                            
         MFLD  KGRPIN,                                                 +        
               LTH=7                                                            
         MFLD  KGRPUT,                                                 +        
               LTH=7                                                            
         MFLD  UNIKIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UNIKUT,                                                 +        
               LTH=1                                                            
         MFLD  ERSIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ERSUT,                                                  +        
               LTH=1                                                            
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  REPANT1,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH1,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST1,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL1,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK1,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD1,                                                +        
               LTH=2                                                            
         MFLD  RESPRT1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM1,                                                  +        
               LTH=19                                                           
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  REPANT2,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH2,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST2,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL2,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK2,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD2,                                                +        
               LTH=2                                                            
         MFLD  RESPRT2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM2,                                                  +        
               LTH=19                                                           
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  REPANT3,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH3,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST3,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL3,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK3,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD3,                                                +        
               LTH=2                                                            
         MFLD  RESPRT3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM3,                                                  +        
               LTH=19                                                           
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  REPANT4,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH4,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST4,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL4,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK4,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD4,                                                +        
               LTH=2                                                            
         MFLD  RESPRT4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM4,                                                  +        
               LTH=19                                                           
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  REPANT5,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH5,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST5,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL5,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK5,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD5,                                                +        
               LTH=2                                                            
         MFLD  RESPRT5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM5,                                                  +        
               LTH=19                                                           
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  REPANT6,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH6,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST6,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL6,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK6,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD6,                                                +        
               LTH=2                                                            
         MFLD  RESPRT6,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM6,                                                  +        
               LTH=19                                                           
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  REPANT7,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH7,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST7,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL7,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK7,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD7,                                                +        
               LTH=2                                                            
         MFLD  RESPRT7,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM7,                                                  +        
               LTH=19                                                           
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  REPANT8,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH8,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST8,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL8,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK8,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD8,                                                +        
               LTH=2                                                            
         MFLD  RESPRT8,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM8,                                                  +        
               LTH=19                                                           
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  REPANT9,                                                +        
               LTH=6                                                            
         MFLD  LAUNCH9,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST9,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL9,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK9,                                                  +        
               LTH=3                                                            
         MFLD  ERSKOD9,                                                +        
               LTH=2                                                            
         MFLD  RESPRT9,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM9,                                                  +        
               LTH=19                                                           
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  REPANT10,                                               +        
               LTH=6                                                            
         MFLD  LAUNCH10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST10,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL10,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK10,                                                 +        
               LTH=3                                                            
         MFLD  ERSKOD10,                                               +        
               LTH=2                                                            
         MFLD  RESPRT10,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM10,                                                 +        
               LTH=19                                                           
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  REPANT11,                                               +        
               LTH=6                                                            
         MFLD  LAUNCH11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST11,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL11,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK11,                                                 +        
               LTH=3                                                            
         MFLD  ERSKOD11,                                               +        
               LTH=2                                                            
         MFLD  RESPRT11,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM11,                                                 +        
               LTH=19                                                           
         MFLD  CMD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  REPANT12,                                               +        
               LTH=6                                                            
         MFLD  LAUNCH12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST12,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL12,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK12,                                                 +        
               LTH=3                                                            
         MFLD  ERSKOD12,                                               +        
               LTH=2                                                            
         MFLD  RESPRT12,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOMM12,                                                 +        
               LTH=19                                                           
         MFLD  IDARTNR,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LAUNCH,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FIRST,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTAL,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKAMP,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
