***********************************************************************         
* CREATED BY PC65704   ON 99/01/27  AT 07:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ON ORDER NDC                    '                               
W2N353   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T353 7',                                           +        
               8='W2T353 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T353  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N353   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ON ORDER NDC',                                         +        
               POS=(1,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description:',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
BEARTSVE DFLD  POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC Vendor Order dte C Order NO.  Ord.qty  BO qty Inv.qt+        
               y  Inv.NO   Date    ETA',                               +        
               POS=(6,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
RAD01    DFLD  POS=(7,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
RAD02    DFLD  POS=(8,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
RAD03    DFLD  POS=(9,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
RAD04    DFLD  POS=(10,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD05    DFLD  POS=(11,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD06    DFLD  POS=(12,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD07    DFLD  POS=(13,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD08    DFLD  POS=(14,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD09    DFLD  POS=(15,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD10    DFLD  POS=(16,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD11    DFLD  POS=(17,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD12    DFLD  POS=(18,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
RAD13    DFLD  POS=(19,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Purch menu  14 Purch prop   15 On order',           +        
               POS=(21,2),LTH=42,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,49),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Season',                                            +        
               POS=(21,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist  19 Refill info  20 On ord local 21 Tran +        
               Scrap   22 Whelp',                                      +        
               POS=(22,2),LTH=71,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=61,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O353N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N353,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I353N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N353                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEARTSVE,                                               +        
               LTH=25                                                           
         MFLD  RAD01,                                                  +        
               LTH=78                                                           
         MFLD  RAD02,                                                  +        
               LTH=78                                                           
         MFLD  RAD03,                                                  +        
               LTH=78                                                           
         MFLD  RAD04,                                                  +        
               LTH=78                                                           
         MFLD  RAD05,                                                  +        
               LTH=78                                                           
         MFLD  RAD06,                                                  +        
               LTH=78                                                           
         MFLD  RAD07,                                                  +        
               LTH=78                                                           
         MFLD  RAD08,                                                  +        
               LTH=78                                                           
         MFLD  RAD09,                                                  +        
               LTH=78                                                           
         MFLD  RAD10,                                                  +        
               LTH=78                                                           
         MFLD  RAD11,                                                  +        
               LTH=78                                                           
         MFLD  RAD12,                                                  +        
               LTH=78                                                           
         MFLD  RAD13,                                                  +        
               LTH=78                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I353N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N353),                                           +        
               OPT=2,                                                  +        
               NXT=W2O353N1                                                     
MID      LPAGE SOR=(W2N353)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23532',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
