***********************************************************************         
* CREATED BY V059625   ON 07/03/26  AT 15:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SPFU MANUAL UPDATE              '                               
W2N325   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T325 7',                                           +        
               8='W2T325 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T325U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SPFU MANUAL UPDATE',                                   +        
               POS=(1,18),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'SUPPL    PART NO  DATE ORDERED  DELIVERED   ORDERED  T(+        
               A/D)',                                                  +        
               POS=(5,6),LTH=59,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(6,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDLEV1   DFLD  POS=(6,6),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDART1   DFLD  POS=(6,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE1    DFLD  POS=(6,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL1     DFLD  POS=(6,40),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD1     DFLD  POS=(6,50),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD1     DFLD  POS=(6,61),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(7,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDLEV2   DFLD  POS=(7,6),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDART2   DFLD  POS=(7,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE2    DFLD  POS=(7,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL2     DFLD  POS=(7,40),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD2     DFLD  POS=(7,50),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD2     DFLD  POS=(7,61),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '3',                                                    +        
               POS=(8,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDLEV3   DFLD  POS=(8,6),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDART3   DFLD  POS=(8,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE3    DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL3     DFLD  POS=(8,40),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD3     DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD3     DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '4',                                                    +        
               POS=(9,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDLEV4   DFLD  POS=(9,6),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDART4   DFLD  POS=(9,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE4    DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL4     DFLD  POS=(9,40),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD4     DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD4     DFLD  POS=(9,61),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '5',                                                    +        
               POS=(10,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLEV5   DFLD  POS=(10,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART5   DFLD  POS=(10,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE5    DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL5     DFLD  POS=(10,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD5     DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD5     DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '6',                                                    +        
               POS=(11,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLEV6   DFLD  POS=(11,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART6   DFLD  POS=(11,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE6    DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL6     DFLD  POS=(11,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD6     DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD6     DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '7',                                                    +        
               POS=(12,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLEV7   DFLD  POS=(12,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART7   DFLD  POS=(12,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE7    DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL7     DFLD  POS=(12,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD7     DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD7     DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '8',                                                    +        
               POS=(13,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLEV8   DFLD  POS=(13,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART8   DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE8    DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL8     DFLD  POS=(13,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD8     DFLD  POS=(13,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD8     DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '9',                                                    +        
               POS=(14,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLEV9   DFLD  POS=(14,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART9   DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE9    DFLD  POS=(14,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL9     DFLD  POS=(14,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD9     DFLD  POS=(14,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD9     DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '10',                                                   +        
               POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDLEV10  DFLD  POS=(15,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART10  DFLD  POS=(15,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE10   DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL10    DFLD  POS=(15,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD10    DFLD  POS=(15,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD10    DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '11',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDLEV11  DFLD  POS=(16,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART11  DFLD  POS=(16,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE11   DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL11    DFLD  POS=(16,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD11    DFLD  POS=(16,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD11    DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '12',                                                   +        
               POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDLEV12  DFLD  POS=(17,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART12  DFLD  POS=(17,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE12   DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL12    DFLD  POS=(17,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD12    DFLD  POS=(17,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD12    DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDLEV13  DFLD  POS=(18,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART13  DFLD  POS=(18,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE13   DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL13    DFLD  POS=(18,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD13    DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD13    DFLD  POS=(18,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '14',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDLEV14  DFLD  POS=(19,6),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDART14  DFLD  POS=(19,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATE14   DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DEL14    DFLD  POS=(19,40),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ORD14    DFLD  POS=(19,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KOD14    DFLD  POS=(19,61),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O325N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N325,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I325N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEV1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART1,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL1,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD1,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART2,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL2,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD2,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART3,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL3,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD3,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV4,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART4,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL4,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD4,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV5,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART5,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE5,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL5,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD5,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV6,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART6,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE6,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL6,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD6,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV7,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART7,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE7,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL7,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD7,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV8,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART8,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE8,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL8,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD8,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV9,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART9,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE9,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL9,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD9,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV10,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL10,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD10,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV11,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART11,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL11,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD11,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV12,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART12,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL12,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD12,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV13,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART13,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE13,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL13,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD13,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEV14,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDART14,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATE14,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEL14,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD14,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I325N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N325),                                           +        
               OPT=2,                                                  +        
               NXT=W2O325N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23252',                                                +        
               LTH=5                                                            
         MFLD  (IDLEV1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL1,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD1,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL2,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD2,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL3,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD3,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV4,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL4,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD4,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV5,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE5,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL5,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD5,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV6,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE6,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL6,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD6,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV7,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE7,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL7,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD7,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV8,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE8,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL8,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD8,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV9,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE9,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL9,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD9,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV10,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL10,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD10,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV11,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL11,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD11,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV12,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL12,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD12,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV13,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART13,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE13,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL13,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD13,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEV14,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDART14,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATE14,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DEL14,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORD14,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD14,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
