***********************************************************************         
* CREATED BY PC65704   ON 99/02/11  AT 14:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL POINT DC                 '                               
W2N346   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T346 7',                                           +        
               8='W2T346 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T346U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T341  ',                                          +        
               14='W2T342  ',                                          +        
               15='W2T343  ',                                          +        
               16='W2T344  ',                                          +        
               17='W2T345  ',                                          +        
               18='W2T346  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T346U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N346   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SAFETY STOCK DC',                                      +        
               POS=(1,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,3),LTH=2,                                        +        
               ATTR=(PROT)                                                      
SDCKEYIN DFLD  POS=(2,7),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Table No',                                             +        
               POS=(2,15),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TABKEYIN DFLD  POS=(2,24),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'n/b',                                                  +        
               POS=(2,45),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDBHXIN  DFLD  POS=(2,49),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'copy DC',                                              +        
               POS=(2,51),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
SDCCOPIN DFLD  POS=(2,59),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Table',                                                +        
               POS=(2,62),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TABCOPIN DFLD  POS=(2,68),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SDCKYOLD DFLD  POS=(3,7),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
TABKYOLD DFLD  POS=(3,24),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
TABFIRST DFLD  POS=(4,8),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
TABLAST  DFLD  POS=(4,12),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Note',                                                 +        
               POS=(5,1),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TEXT     DFLD  POS=(5,6),LTH=70,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Class',                                                +        
               POS=(6,1),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'A',                                                    +        
               POS=(6,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'B',                                                    +        
               POS=(6,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'C',                                                    +        
               POS=(6,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'D',                                                    +        
               POS=(6,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'E',                                                    +        
               POS=(6,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F',                                                    +        
               POS=(6,61),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'G',                                                    +        
               POS=(6,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'H',                                                    +        
               POS=(6,77),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PB <=',                                                +        
               POS=(7,8),LTH=5,                                        +        
               ATTR=(PROT)                                                      
PBAUT    DFLD  POS=(7,15),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PBBUT    DFLD  POS=(7,23),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBCUT    DFLD  POS=(7,31),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBDUT    DFLD  POS=(7,39),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBEUT    DFLD  POS=(7,47),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBFUT    DFLD  POS=(7,55),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBGUT    DFLD  POS=(7,63),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PBHUT    DFLD  POS=(7,71),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Price <=',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
PBAIN    DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBBIN    DFLD  POS=(8,23),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBCIN    DFLD  POS=(8,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBDIN    DFLD  POS=(8,39),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBEIN    DFLD  POS=(8,47),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBFIN    DFLD  POS=(8,55),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBGIN    DFLD  POS=(8,63),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
PBHIN    DFLD  POS=(8,71),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '1',                                                    +        
               POS=(9,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
PRIS1    DFLD  POS=(9,4),LTH=10,                                       +        
               ATTR=(PROT)                                                      
PUNKT1A  DFLD  POS=(9,15),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1A    DFLD  POS=(9,21),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1B  DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1B    DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1C  DFLD  POS=(9,31),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1C    DFLD  POS=(9,37),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1D  DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1D    DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1E  DFLD  POS=(9,47),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1E    DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1F  DFLD  POS=(9,55),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1F    DFLD  POS=(9,61),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1G  DFLD  POS=(9,63),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD16    DFLD  POS=(9,69),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PUNKT1H  DFLD  POS=(9,71),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1H    DFLD  POS=(9,77),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '2',                                                    +        
               POS=(10,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS2    DFLD  POS=(10,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT2A  DFLD  POS=(10,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2A    DFLD  POS=(10,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2B  DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2B    DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2C  DFLD  POS=(10,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2C    DFLD  POS=(10,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2D  DFLD  POS=(10,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2D    DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2E  DFLD  POS=(10,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2E    DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2F  DFLD  POS=(10,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2F    DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2G  DFLD  POS=(10,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2G    DFLD  POS=(10,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT2H  DFLD  POS=(10,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD2H    DFLD  POS=(10,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '3',                                                    +        
               POS=(11,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS3    DFLD  POS=(11,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT3A  DFLD  POS=(11,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3A    DFLD  POS=(11,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3B  DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3B    DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3C  DFLD  POS=(11,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3C    DFLD  POS=(11,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3D  DFLD  POS=(11,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3D    DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3E  DFLD  POS=(11,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3E    DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3F  DFLD  POS=(11,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3F    DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3G  DFLD  POS=(11,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3G    DFLD  POS=(11,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT3H  DFLD  POS=(11,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD3H    DFLD  POS=(11,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '4',                                                    +        
               POS=(12,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS4    DFLD  POS=(12,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT4A  DFLD  POS=(12,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4A    DFLD  POS=(12,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4B  DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4B    DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4C  DFLD  POS=(12,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4C    DFLD  POS=(12,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4D  DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4D    DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4E  DFLD  POS=(12,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4E    DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4F  DFLD  POS=(12,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4F    DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4G  DFLD  POS=(12,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4G    DFLD  POS=(12,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT4H  DFLD  POS=(12,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD4H    DFLD  POS=(12,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '5',                                                    +        
               POS=(13,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS5    DFLD  POS=(13,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT5A  DFLD  POS=(13,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5A    DFLD  POS=(13,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5B  DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5B    DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5C  DFLD  POS=(13,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5C    DFLD  POS=(13,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5D  DFLD  POS=(13,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5D    DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5E  DFLD  POS=(13,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5E    DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5F  DFLD  POS=(13,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5F    DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5G  DFLD  POS=(13,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5G    DFLD  POS=(13,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT5H  DFLD  POS=(13,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD5H    DFLD  POS=(13,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '6',                                                    +        
               POS=(14,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS6    DFLD  POS=(14,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT6A  DFLD  POS=(14,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6A    DFLD  POS=(14,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6B  DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6B    DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6C  DFLD  POS=(14,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6C    DFLD  POS=(14,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6D  DFLD  POS=(14,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6D    DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6E  DFLD  POS=(14,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6E    DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6F  DFLD  POS=(14,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6F    DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6G  DFLD  POS=(14,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6G    DFLD  POS=(14,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT6H  DFLD  POS=(14,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6H    DFLD  POS=(14,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '7',                                                    +        
               POS=(15,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS7    DFLD  POS=(15,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT7A  DFLD  POS=(15,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7A    DFLD  POS=(15,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7B  DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7B    DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7C  DFLD  POS=(15,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7C    DFLD  POS=(15,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7D  DFLD  POS=(15,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7D    DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7E  DFLD  POS=(15,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7E    DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7F  DFLD  POS=(15,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7F    DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7G  DFLD  POS=(15,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7G    DFLD  POS=(15,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT7H  DFLD  POS=(15,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7H    DFLD  POS=(15,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '8',                                                    +        
               POS=(16,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS8    DFLD  POS=(16,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT8A  DFLD  POS=(16,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8A    DFLD  POS=(16,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8B  DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8B    DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8C  DFLD  POS=(16,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8C    DFLD  POS=(16,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8D  DFLD  POS=(16,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8D    DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8E  DFLD  POS=(16,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8E    DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8F  DFLD  POS=(16,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8F    DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8G  DFLD  POS=(16,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8G    DFLD  POS=(16,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT8H  DFLD  POS=(16,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8H    DFLD  POS=(16,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '9',                                                    +        
               POS=(17,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIS9    DFLD  POS=(17,4),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PUNKT9A  DFLD  POS=(17,15),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9A    DFLD  POS=(17,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9B  DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9B    DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9C  DFLD  POS=(17,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9C    DFLD  POS=(17,37),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9D  DFLD  POS=(17,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9D    DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9E  DFLD  POS=(17,47),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9E    DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9F  DFLD  POS=(17,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9F    DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9G  DFLD  POS=(17,63),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9G    DFLD  POS=(17,69),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PUNKT9H  DFLD  POS=(17,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9H    DFLD  POS=(17,77),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS10   DFLD  POS=(18,4),LTH=10,                                      +        
               ATTR=(PROT,NODISP)                                               
PUNKT10A DFLD  POS=(18,15),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10A   DFLD  POS=(18,21),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10B DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10B   DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10C DFLD  POS=(18,31),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10C   DFLD  POS=(18,37),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10D DFLD  POS=(18,39),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10D   DFLD  POS=(18,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10E DFLD  POS=(18,47),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10E   DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10F DFLD  POS=(18,55),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10F   DFLD  POS=(18,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10G DFLD  POS=(18,63),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10G   DFLD  POS=(18,69),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
PUNKT10H DFLD  POS=(18,71),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KOD10H   DFLD  POS=(18,77),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
RADIXIN  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRISIN   DFLD  POS=(19,4),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
PUNKTAIN DFLD  POS=(19,15),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPAIN   DFLD  POS=(19,21),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTBIN DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPBIN   DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTCIN DFLD  POS=(19,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPCIN   DFLD  POS=(19,37),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTDIN DFLD  POS=(19,39),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPDIN   DFLD  POS=(19,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTEIN DFLD  POS=(19,47),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPEIN   DFLD  POS=(19,53),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTFIN DFLD  POS=(19,55),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPFIN   DFLD  POS=(19,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTGIN DFLD  POS=(19,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPGIN   DFLD  POS=(19,69),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PUNKTHIN DFLD  POS=(19,71),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPHIN   DFLD  POS=(19,77),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O346N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N346,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I346N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N346                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  SDCKEYIN,                                               +        
               LTH=2                                                            
         MFLD  SDCKYOLD,                                               +        
               LTH=2                                                            
         MFLD  TABKEYIN,                                               +        
               LTH=1                                                            
         MFLD  TABKYOLD,                                               +        
               LTH=1                                                            
         MFLD  TABFIRST,                                               +        
               LTH=1                                                            
         MFLD  TABLAST,                                                +        
               LTH=1                                                            
         MFLD  KDBHXIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDCCOPIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TABCOPIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEXT,                                                   +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PBAUT,                                                  +        
               LTH=7                                                            
         MFLD  PBBUT,                                                  +        
               LTH=7                                                            
         MFLD  PBCUT,                                                  +        
               LTH=7                                                            
         MFLD  PBDUT,                                                  +        
               LTH=7                                                            
         MFLD  PBEUT,                                                  +        
               LTH=7                                                            
         MFLD  PBFUT,                                                  +        
               LTH=7                                                            
         MFLD  PBGUT,                                                  +        
               LTH=7                                                            
         MFLD  PBHUT,                                                  +        
               LTH=7                                                            
         MFLD  PBAIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBBIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBCIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBDIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBEIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBFIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBGIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PBHIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRIS1,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT1A,                                                +        
               LTH=5                                                            
         MFLD  KOD1A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1B,                                                +        
               LTH=5                                                            
         MFLD  KOD1B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1C,                                                +        
               LTH=5                                                            
         MFLD  KOD1C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1D,                                                +        
               LTH=5                                                            
         MFLD  KOD1D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1E,                                                +        
               LTH=5                                                            
         MFLD  KOD1E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1F,                                                +        
               LTH=5                                                            
         MFLD  KOD1F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1G,                                                +        
               LTH=5                                                            
         MFLD  KOD16,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT1H,                                                +        
               LTH=5                                                            
         MFLD  KOD1H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS2,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT2A,                                                +        
               LTH=5                                                            
         MFLD  KOD2A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2B,                                                +        
               LTH=5                                                            
         MFLD  KOD2B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2C,                                                +        
               LTH=5                                                            
         MFLD  KOD2C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2D,                                                +        
               LTH=5                                                            
         MFLD  KOD2D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2E,                                                +        
               LTH=5                                                            
         MFLD  KOD2E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2F,                                                +        
               LTH=5                                                            
         MFLD  KOD2F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2G,                                                +        
               LTH=5                                                            
         MFLD  KOD2G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT2H,                                                +        
               LTH=5                                                            
         MFLD  KOD2H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS3,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT3A,                                                +        
               LTH=5                                                            
         MFLD  KOD3A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3B,                                                +        
               LTH=5                                                            
         MFLD  KOD3B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3C,                                                +        
               LTH=5                                                            
         MFLD  KOD3C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3D,                                                +        
               LTH=5                                                            
         MFLD  KOD3D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3E,                                                +        
               LTH=5                                                            
         MFLD  KOD3E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3F,                                                +        
               LTH=5                                                            
         MFLD  KOD3F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3G,                                                +        
               LTH=5                                                            
         MFLD  KOD3G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT3H,                                                +        
               LTH=5                                                            
         MFLD  KOD3H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS4,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT4A,                                                +        
               LTH=5                                                            
         MFLD  KOD4A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4B,                                                +        
               LTH=5                                                            
         MFLD  KOD4B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4C,                                                +        
               LTH=5                                                            
         MFLD  KOD4C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4D,                                                +        
               LTH=5                                                            
         MFLD  KOD4D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4E,                                                +        
               LTH=5                                                            
         MFLD  KOD4E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4F,                                                +        
               LTH=5                                                            
         MFLD  KOD4F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4G,                                                +        
               LTH=5                                                            
         MFLD  KOD4G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT4H,                                                +        
               LTH=5                                                            
         MFLD  KOD4H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS5,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT5A,                                                +        
               LTH=5                                                            
         MFLD  KOD5A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5B,                                                +        
               LTH=5                                                            
         MFLD  KOD5B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5C,                                                +        
               LTH=5                                                            
         MFLD  KOD5C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5D,                                                +        
               LTH=5                                                            
         MFLD  KOD5D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5E,                                                +        
               LTH=5                                                            
         MFLD  KOD5E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5F,                                                +        
               LTH=5                                                            
         MFLD  KOD5F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5G,                                                +        
               LTH=5                                                            
         MFLD  KOD5G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT5H,                                                +        
               LTH=5                                                            
         MFLD  KOD5H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS6,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT6A,                                                +        
               LTH=5                                                            
         MFLD  KOD6A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6B,                                                +        
               LTH=5                                                            
         MFLD  KOD6B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6C,                                                +        
               LTH=5                                                            
         MFLD  KOD6C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6D,                                                +        
               LTH=5                                                            
         MFLD  KOD6D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6E,                                                +        
               LTH=5                                                            
         MFLD  KOD6E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6F,                                                +        
               LTH=5                                                            
         MFLD  KOD6F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6G,                                                +        
               LTH=5                                                            
         MFLD  KOD6G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT6H,                                                +        
               LTH=5                                                            
         MFLD  KOD6H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS7,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT7A,                                                +        
               LTH=5                                                            
         MFLD  KOD7A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7B,                                                +        
               LTH=5                                                            
         MFLD  KOD7B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7C,                                                +        
               LTH=5                                                            
         MFLD  KOD7C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7D,                                                +        
               LTH=5                                                            
         MFLD  KOD7D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7E,                                                +        
               LTH=5                                                            
         MFLD  KOD7E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7F,                                                +        
               LTH=5                                                            
         MFLD  KOD7F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7G,                                                +        
               LTH=5                                                            
         MFLD  KOD7G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT7H,                                                +        
               LTH=5                                                            
         MFLD  KOD7H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS8,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT8A,                                                +        
               LTH=5                                                            
         MFLD  KOD8A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8B,                                                +        
               LTH=5                                                            
         MFLD  KOD8B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8C,                                                +        
               LTH=5                                                            
         MFLD  KOD8C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8D,                                                +        
               LTH=5                                                            
         MFLD  KOD8D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8E,                                                +        
               LTH=5                                                            
         MFLD  KOD8E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8F,                                                +        
               LTH=5                                                            
         MFLD  KOD8F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8G,                                                +        
               LTH=5                                                            
         MFLD  KOD8G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT8H,                                                +        
               LTH=5                                                            
         MFLD  KOD8H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS9,                                                  +        
               LTH=10                                                           
         MFLD  PUNKT9A,                                                +        
               LTH=5                                                            
         MFLD  KOD9A,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9B,                                                +        
               LTH=5                                                            
         MFLD  KOD9B,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9C,                                                +        
               LTH=5                                                            
         MFLD  KOD9C,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9D,                                                +        
               LTH=5                                                            
         MFLD  KOD9D,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9E,                                                +        
               LTH=5                                                            
         MFLD  KOD9E,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9F,                                                +        
               LTH=5                                                            
         MFLD  KOD9F,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9G,                                                +        
               LTH=5                                                            
         MFLD  KOD9G,                                                  +        
               LTH=1                                                            
         MFLD  PUNKT9H,                                                +        
               LTH=5                                                            
         MFLD  KOD9H,                                                  +        
               LTH=1                                                            
         MFLD  PRIS10,                                                 +        
               LTH=10                                                           
         MFLD  PUNKT10A,                                               +        
               LTH=5                                                            
         MFLD  KOD10A,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10B,                                               +        
               LTH=5                                                            
         MFLD  KOD10B,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10C,                                               +        
               LTH=5                                                            
         MFLD  KOD10C,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10D,                                               +        
               LTH=5                                                            
         MFLD  KOD10D,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10E,                                               +        
               LTH=5                                                            
         MFLD  KOD10E,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10F,                                               +        
               LTH=5                                                            
         MFLD  KOD10F,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10G,                                               +        
               LTH=5                                                            
         MFLD  KOD10G,                                                 +        
               LTH=1                                                            
         MFLD  PUNKT10H,                                               +        
               LTH=5                                                            
         MFLD  KOD10H,                                                 +        
               LTH=1                                                            
         MFLD  RADIXIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRISIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTAIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPAIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTBIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPBIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTCIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTDIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPDIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTEIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPEIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTFIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPFIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTGIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPGIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUNKTHIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPHIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I346N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N346),                                           +        
               OPT=2,                                                  +        
               NXT=W2O346N1                                                     
MID      LPAGE SOR=(W2N346)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23462',                                                +        
               LTH=5                                                            
         MFLD  (SDCKEYIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  SDCKYOLD,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TABKEYIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  TABKYOLD,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  TABFIRST,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  TABLAST,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDBHXIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SDCCOPIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TABCOPIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TEXT,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70                                                           
         MFLD  (PBAIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBBIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBCIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBDIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBEIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBFIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBGIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PBHIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADIXIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRISIN,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTAIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPAIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTBIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPBIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTCIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPCIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTDIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPDIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTEIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPEIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTFIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPFIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTGIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPGIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUNKTHIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPHIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
