***********************************************************************         
* CREATED BY PCC6483   ON 00/10/25  AT 12:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Direct delivery control         '                               
W2N335   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T335 7',                                           +        
               8='W2T335 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T335U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DIRECT DELIVERY CONTROL',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier:',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
LEVNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Group:',                                               +        
               POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDGRPIN  DFLD  POS=(2,25),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr:',                                               +        
               POS=(2,36),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,43),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dealer:',                                              +        
               POS=(2,49),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DEALERIN DFLD  POS=(2,57),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEVNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRPUT  DFLD  POS=(3,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,43),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DEALERUT DFLD  POS=(3,57),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kl0       Kl1       Kl2       Kl3       Kl4       ',   +        
               POS=(4,31),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'C Distr Distr Dealer Dealer  MinQ O/N  MinQ O/N  MinQ O+        
               /N  MinQ O/N  MinQ O/N',                                +        
               POS=(5,2),LTH=77,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'fom   tom   fom    tom',                               +        
               POS=(6,4),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DDGS  SDC DDGS  SDC DDGS  SDC DDGS  SDC DDGS  SDC',    +        
               POS=(6,31),LTH=49,                                      +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTFOM1 DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DISTTOM1 DFLD  POS=(7,10),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DEALFOM1 DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DEALTOM1 DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
MINQ01   DFLD  POS=(7,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDDDGS01 DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MINQ11   DFLD  POS=(7,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDDDGS11 DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MINQ21   DFLD  POS=(7,51),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDDDGS21 DFLD  POS=(7,58),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MINQ31   DFLD  POS=(7,61),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDDDGS31 DFLD  POS=(7,68),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
MINQ41   DFLD  POS=(7,71),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDDDGS41 DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLDDGS01 DFLD  POS=(8,33),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SDC01    DFLD  POS=(8,38),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLDDGS11 DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
SDC11    DFLD  POS=(8,48),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLDDGS21 DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SDC21    DFLD  POS=(8,58),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLDDGS31 DFLD  POS=(8,63),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SDC31    DFLD  POS=(8,68),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLDDGS41 DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
SDC41    DFLD  POS=(8,78),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
CMD2     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTFOM2 DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM2 DFLD  POS=(9,10),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DEALFOM2 DFLD  POS=(9,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DEALTOM2 DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ02   DFLD  POS=(9,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDDDGS02 DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
MINQ12   DFLD  POS=(9,41),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDDDGS12 DFLD  POS=(9,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
MINQ22   DFLD  POS=(9,51),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDDDGS22 DFLD  POS=(9,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
MINQ32   DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDDDGS32 DFLD  POS=(9,68),LTH=1,                                       +        
               ATTR=(PROT)                                                      
MINQ42   DFLD  POS=(9,71),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDDDGS42 DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLDDGS02 DFLD  POS=(10,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC02    DFLD  POS=(10,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS12 DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC12    DFLD  POS=(10,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS22 DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC22    DFLD  POS=(10,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS32 DFLD  POS=(10,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC32    DFLD  POS=(10,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS42 DFLD  POS=(10,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC42    DFLD  POS=(10,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD3     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOM3 DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM3 DFLD  POS=(11,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALFOM3 DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALTOM3 DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ03   DFLD  POS=(11,31),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS03 DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ13   DFLD  POS=(11,41),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS13 DFLD  POS=(11,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ23   DFLD  POS=(11,51),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS23 DFLD  POS=(11,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ33   DFLD  POS=(11,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS33 DFLD  POS=(11,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ43   DFLD  POS=(11,71),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS43 DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLDDGS03 DFLD  POS=(12,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC03    DFLD  POS=(12,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS13 DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC13    DFLD  POS=(12,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS23 DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC23    DFLD  POS=(12,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS33 DFLD  POS=(12,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC33    DFLD  POS=(12,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS43 DFLD  POS=(12,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC43    DFLD  POS=(12,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD4     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOM4 DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM4 DFLD  POS=(13,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALFOM4 DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALTOM4 DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ04   DFLD  POS=(13,31),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS04 DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ14   DFLD  POS=(13,41),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS14 DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ24   DFLD  POS=(13,51),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS24 DFLD  POS=(13,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ34   DFLD  POS=(13,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS34 DFLD  POS=(13,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ44   DFLD  POS=(13,71),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS44 DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLDDGS04 DFLD  POS=(14,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC04    DFLD  POS=(14,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS14 DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC14    DFLD  POS=(14,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS24 DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC24    DFLD  POS=(14,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS34 DFLD  POS=(14,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC34    DFLD  POS=(14,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS44 DFLD  POS=(14,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC44    DFLD  POS=(14,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD5     DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOM5 DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM5 DFLD  POS=(15,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALFOM5 DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALTOM5 DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ05   DFLD  POS=(15,31),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS05 DFLD  POS=(15,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ15   DFLD  POS=(15,41),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS15 DFLD  POS=(15,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ25   DFLD  POS=(15,51),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS25 DFLD  POS=(15,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ35   DFLD  POS=(15,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS35 DFLD  POS=(15,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ45   DFLD  POS=(15,71),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS45 DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLDDGS05 DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC05    DFLD  POS=(16,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS15 DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC15    DFLD  POS=(16,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS25 DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC25    DFLD  POS=(16,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS35 DFLD  POS=(16,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC35    DFLD  POS=(16,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS45 DFLD  POS=(16,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC45    DFLD  POS=(16,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD6     DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOM6 DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM6 DFLD  POS=(17,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALFOM6 DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALTOM6 DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ06   DFLD  POS=(17,31),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS06 DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ16   DFLD  POS=(17,41),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS16 DFLD  POS=(17,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ26   DFLD  POS=(17,51),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS26 DFLD  POS=(17,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ36   DFLD  POS=(17,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS36 DFLD  POS=(17,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ46   DFLD  POS=(17,71),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS46 DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLDDGS06 DFLD  POS=(18,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC06    DFLD  POS=(18,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS16 DFLD  POS=(18,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC16    DFLD  POS=(18,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS26 DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC26    DFLD  POS=(18,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS36 DFLD  POS=(18,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC36    DFLD  POS=(18,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS46 DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC46    DFLD  POS=(18,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD7     DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOM7 DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTOM7 DFLD  POS=(19,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALFOM7 DFLD  POS=(19,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEALTOM7 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MINQ07   DFLD  POS=(19,31),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS07 DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ17   DFLD  POS=(19,41),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS17 DFLD  POS=(19,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ27   DFLD  POS=(19,51),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS27 DFLD  POS=(19,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ37   DFLD  POS=(19,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS37 DFLD  POS=(19,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
MINQ47   DFLD  POS=(19,71),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KDDDGS47 DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLDDGS07 DFLD  POS=(20,33),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC07    DFLD  POS=(20,38),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS17 DFLD  POS=(20,43),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC17    DFLD  POS=(20,48),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS27 DFLD  POS=(20,53),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC27    DFLD  POS=(20,58),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS37 DFLD  POS=(20,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC37    DFLD  POS=(20,68),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLDDGS47 DFLD  POS=(20,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
SDC47    DFLD  POS=(20,78),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O335N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N335,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I335N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  IDGRPIN,                                                +        
               LTH=2                                                            
         MFLD  IDGRPUT,                                                +        
               LTH=10                                                           
         MFLD  DISTRIN,                                                +        
               LTH=2                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  DEALERIN,                                               +        
               LTH=2                                                            
         MFLD  DEALERUT,                                               +        
               LTH=6                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTTOM1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEALFOM1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEALTOM1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MINQ01,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDDGS01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDDGS01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDC01,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MINQ11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDDGS11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDDGS11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDC11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MINQ21,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDDGS21,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDDGS21,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDC21,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MINQ31,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDDGS31,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDDGS31,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDC31,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MINQ41,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDDGS41,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDDGS41,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SDC41,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM2,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM2,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM2,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM2,                                               +        
               LTH=6                                                            
         MFLD  MINQ02,                                                 +        
               LTH=6                                                            
         MFLD  MINQ12,                                                 +        
               LTH=6                                                            
         MFLD  MINQ22,                                                 +        
               LTH=6                                                            
         MFLD  MINQ32,                                                 +        
               LTH=6                                                            
         MFLD  MINQ42,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS02,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS12,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS22,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS32,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS42,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS02,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS12,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS22,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS32,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS42,                                               +        
               LTH=1                                                            
         MFLD  SDC02,                                                  +        
               LTH=2                                                            
         MFLD  SDC12,                                                  +        
               LTH=2                                                            
         MFLD  SDC22,                                                  +        
               LTH=2                                                            
         MFLD  SDC32,                                                  +        
               LTH=2                                                            
         MFLD  SDC42,                                                  +        
               LTH=2                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM3,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM3,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM3,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM3,                                               +        
               LTH=6                                                            
         MFLD  MINQ03,                                                 +        
               LTH=6                                                            
         MFLD  MINQ13,                                                 +        
               LTH=6                                                            
         MFLD  MINQ23,                                                 +        
               LTH=6                                                            
         MFLD  MINQ33,                                                 +        
               LTH=6                                                            
         MFLD  MINQ43,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS03,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS13,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS23,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS33,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS43,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS03,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS13,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS23,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS33,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS43,                                               +        
               LTH=1                                                            
         MFLD  SDC03,                                                  +        
               LTH=2                                                            
         MFLD  SDC13,                                                  +        
               LTH=2                                                            
         MFLD  SDC23,                                                  +        
               LTH=2                                                            
         MFLD  SDC33,                                                  +        
               LTH=2                                                            
         MFLD  SDC43,                                                  +        
               LTH=2                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM4,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM4,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM4,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM4,                                               +        
               LTH=6                                                            
         MFLD  MINQ04,                                                 +        
               LTH=6                                                            
         MFLD  MINQ14,                                                 +        
               LTH=6                                                            
         MFLD  MINQ24,                                                 +        
               LTH=6                                                            
         MFLD  MINQ34,                                                 +        
               LTH=6                                                            
         MFLD  MINQ44,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS04,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS14,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS24,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS34,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS44,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS04,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS14,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS24,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS34,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS44,                                               +        
               LTH=1                                                            
         MFLD  SDC04,                                                  +        
               LTH=2                                                            
         MFLD  SDC14,                                                  +        
               LTH=2                                                            
         MFLD  SDC24,                                                  +        
               LTH=2                                                            
         MFLD  SDC34,                                                  +        
               LTH=2                                                            
         MFLD  SDC44,                                                  +        
               LTH=2                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM5,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM5,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM5,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM5,                                               +        
               LTH=6                                                            
         MFLD  MINQ05,                                                 +        
               LTH=6                                                            
         MFLD  MINQ15,                                                 +        
               LTH=6                                                            
         MFLD  MINQ25,                                                 +        
               LTH=6                                                            
         MFLD  MINQ35,                                                 +        
               LTH=6                                                            
         MFLD  MINQ45,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS05,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS15,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS25,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS35,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS45,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS05,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS15,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS25,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS35,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS45,                                               +        
               LTH=1                                                            
         MFLD  SDC05,                                                  +        
               LTH=2                                                            
         MFLD  SDC15,                                                  +        
               LTH=2                                                            
         MFLD  SDC25,                                                  +        
               LTH=2                                                            
         MFLD  SDC35,                                                  +        
               LTH=2                                                            
         MFLD  SDC45,                                                  +        
               LTH=2                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM6,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM6,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM6,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM6,                                               +        
               LTH=6                                                            
         MFLD  MINQ06,                                                 +        
               LTH=6                                                            
         MFLD  MINQ16,                                                 +        
               LTH=6                                                            
         MFLD  MINQ26,                                                 +        
               LTH=6                                                            
         MFLD  MINQ36,                                                 +        
               LTH=6                                                            
         MFLD  MINQ46,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS06,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS16,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS26,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS36,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS46,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS06,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS16,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS26,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS36,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS46,                                               +        
               LTH=1                                                            
         MFLD  SDC06,                                                  +        
               LTH=2                                                            
         MFLD  SDC16,                                                  +        
               LTH=2                                                            
         MFLD  SDC26,                                                  +        
               LTH=2                                                            
         MFLD  SDC36,                                                  +        
               LTH=2                                                            
         MFLD  SDC46,                                                  +        
               LTH=2                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOM7,                                               +        
               LTH=4                                                            
         MFLD  DISTTOM7,                                               +        
               LTH=4                                                            
         MFLD  DEALFOM7,                                               +        
               LTH=6                                                            
         MFLD  DEALTOM7,                                               +        
               LTH=6                                                            
         MFLD  MINQ07,                                                 +        
               LTH=6                                                            
         MFLD  MINQ17,                                                 +        
               LTH=6                                                            
         MFLD  MINQ27,                                                 +        
               LTH=6                                                            
         MFLD  MINQ37,                                                 +        
               LTH=6                                                            
         MFLD  MINQ47,                                                 +        
               LTH=6                                                            
         MFLD  KDDDGS07,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS17,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS27,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS37,                                               +        
               LTH=1                                                            
         MFLD  KDDDGS47,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS07,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS17,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS27,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS37,                                               +        
               LTH=1                                                            
         MFLD  FLDDGS47,                                               +        
               LTH=1                                                            
         MFLD  SDC07,                                                  +        
               LTH=2                                                            
         MFLD  SDC17,                                                  +        
               LTH=2                                                            
         MFLD  SDC27,                                                  +        
               LTH=2                                                            
         MFLD  SDC37,                                                  +        
               LTH=2                                                            
         MFLD  SDC47,                                                  +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I335N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N335),                                           +        
               OPT=2,                                                  +        
               NXT=W2O335N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23352',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDGRPIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (IDGRPUT,                                               +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (DISTRUT,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DEALERIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  (DEALERUT,                                              +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTFOM1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (DISTTOM1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (DEALFOM1,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DEALTOM1,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MINQ01,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MINQ11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MINQ21,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MINQ31,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MINQ41,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDDDGS01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDDDGS11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDDDGS21,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDDDGS31,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDDDGS41,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLDDGS01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R                                                           
         MFLD  (FLDDGS11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R                                                           
         MFLD  (FLDDGS21,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R                                                           
         MFLD  (FLDDGS31,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R                                                           
         MFLD  (FLDDGS41,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R                                                           
         MFLD  (SDC01,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SDC11,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SDC21,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SDC31,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SDC41,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
