***********************************************************************         
* CREATED BY V059625   ON 00/03/24  AT 10:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KIT ORDER -CHANGE               '                               
W2N302   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T302 7',                                           +        
               8='W2T302 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T302U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T301  ',                                          +        
               14='W2T302  ',                                          +        
               15='W2T303  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KIT ORDER - CHANGE',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Order',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDORDNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*F AG',                                                +        
               POS=(2,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDANSKFI DFLD  POS=(2,21),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'T AG',                                                 +        
               POS=(2,25),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSKTI DFLD  POS=(2,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Bb',                                                   +        
               POS=(2,34),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLBYGGBI DFLD  POS=(2,37),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Artnr',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,45),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ing artnr',                                            +        
               POS=(2,55),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
IIDARTNI DFLD  POS=(2,65),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Komb',                                                 +        
               POS=(2,75),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDSATKMI DFLD  POS=(2,80),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDORDNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,15),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDANSKFU DFLD  POS=(3,21),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDANSKTU DFLD  POS=(3,30),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLBYGGBU DFLD  POS=(3,37),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,45),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IIDARTNU DFLD  POS=(3,65),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KDSATKMU DFLD  POS=(3,80),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRE DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRN DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Artikelnr',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,12),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CL',                                                   +        
               POS=(5,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDCLAGER DFLD  POS=(5,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRC',                                                  +        
               POS=(5,31),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC    DFLD  POS=(5,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CL',                                                   +        
               POS=(5,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pb',                                                   +        
               POS=(5,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RO',                                                   +        
               POS=(5,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Disp S-lager',                                         +        
               POS=(5,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(6,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(6,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(6,47),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(6,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(6,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(6,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Best',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
KVBEART  DFLD  POS=(7,7),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Bb',                                                   +        
               POS=(7,15),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLBYGGB  DFLD  POS=(7,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Att bygga',                                            +        
               POS=(7,21),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVBYGGB  DFLD  POS=(7,31),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(7,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(7,47),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(7,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(7,65),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Spärrad',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLSATSPH DFLD  POS=(8,10),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prio',                                                 +        
               POS=(8,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLSATPRI DFLD  POS=(8,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ing artnr  Ant/sats   Best ant',                       +        
               POS=(10,4),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Res ant',                                              +        
               POS=(10,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RO ant   Ag  Sp   Nästa inlev',                        +        
               POS=(10,52),LTH=29,                                     +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(11,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(11,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(11,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(11,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK1    DFLD  POS=(11,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(11,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(11,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(12,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(12,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(12,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(12,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(12,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK2    DFLD  POS=(12,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(12,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(12,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(13,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(13,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(13,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(13,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(13,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK3    DFLD  POS=(13,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(13,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(13,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(14,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(14,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(14,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(14,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK4    DFLD  POS=(14,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(14,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(14,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(15,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(15,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(15,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(15,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(15,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK5    DFLD  POS=(15,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(15,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(15,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(16,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(16,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(16,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(16,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(16,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK6    DFLD  POS=(16,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(16,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(16,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(17,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(17,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(17,39),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(17,51),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANSK7    DFLD  POS=(17,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(17,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(17,70),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dela satsen',                                          +        
               POS=(19,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVDELA   DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,21),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Annullera resten',                                     +        
               POS=(19,24),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FLANNURE DFLD  POS=(19,41),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(19,43),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Annullera hela',                                       +        
               POS=(19,45),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLANNUHE DFLD  POS=(19,60),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,62),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Man prio',                                             +        
               POS=(19,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLSATPIN DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,75),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Sats ordkö  14 Satsord åtg   15 Satsrad åtg 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I302N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N302),                                           +        
               OPT=2,                                                  +        
               NXT=W2O302N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23021',                                                +        
               LTH=5                                                            
         MFLD  (IDANSKFI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDANSKFU,                                               +        
               LTH=3                                                            
         MFLD  (IDANSKTI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDANSKTU,                                               +        
               LTH=3                                                            
         MFLD  (FLBYGGBI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLBYGGBU,                                               +        
               LTH=1                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  (IIDARTNI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IIDARTNU,                                               +        
               LTH=9                                                            
         MFLD  (KDSATKMI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KDSATKMU,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  (KVDELA,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLANNURE,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLANNUHE,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATPIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2O302N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N302,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I302N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDORDNRI,                                               +        
               LTH=5                                                            
         MFLD  IDANSKFI,                                               +        
               LTH=3                                                            
         MFLD  IDANSKTI,                                               +        
               LTH=3                                                            
         MFLD  FLBYGGBI,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IIDARTNI,                                               +        
               LTH=9                                                            
         MFLD  KDSATKMI,                                               +        
               LTH=1                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  IDANSKFU,                                               +        
               LTH=3                                                            
         MFLD  IDANSKTU,                                               +        
               LTH=3                                                            
         MFLD  FLBYGGBU,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IIDARTNU,                                               +        
               LTH=9                                                            
         MFLD  KDSATKMU,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDARTNR,                                                +        
               LTH=11                                                           
         MFLD  KDCLAGER,                                               +        
               LTH=1                                                            
         MFLD  IDPRC,                                                  +        
               LTH=4                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KVBEART,                                                +        
               LTH=7                                                            
         MFLD  FLBYGGB,                                                +        
               LTH=1                                                            
         MFLD  KVBYGGB,                                                +        
               LTH=7                                                            
         MFLD  DGIA0014,                                               +        
               LTH=1                                                            
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=8                                                            
         MFLD  DGIA0019,                                               +        
               LTH=8                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  DGIA0016,                                               +        
               LTH=8                                                            
         MFLD  DGIA0017,                                               +        
               LTH=8                                                            
         MFLD  DGIA0036,                                               +        
               LTH=7                                                            
         MFLD  DGIA0037,                                               +        
               LTH=7                                                            
         MFLD  FLSATSPH,                                               +        
               LTH=1                                                            
         MFLD  FLSATPRI,                                               +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=11                                                           
         MFLD  DGIA0008,                                               +        
               LTH=11                                                           
         MFLD  DGIA0009,                                               +        
               LTH=11                                                           
         MFLD  DGIA0010,                                               +        
               LTH=11                                                           
         MFLD  DGIA0011,                                               +        
               LTH=11                                                           
         MFLD  DGIA0012,                                               +        
               LTH=11                                                           
         MFLD  DGIA0013,                                               +        
               LTH=11                                                           
         MFLD  DGIA0038,                                               +        
               LTH=6                                                            
         MFLD  DGIA0039,                                               +        
               LTH=6                                                            
         MFLD  DGIA0040,                                               +        
               LTH=6                                                            
         MFLD  DGIA0041,                                               +        
               LTH=6                                                            
         MFLD  DGIA0042,                                               +        
               LTH=6                                                            
         MFLD  DGIA0043,                                               +        
               LTH=6                                                            
         MFLD  DGIA0044,                                               +        
               LTH=6                                                            
         MFLD  DGIA0045,                                               +        
               LTH=7                                                            
         MFLD  DGIA0046,                                               +        
               LTH=7                                                            
         MFLD  DGIA0047,                                               +        
               LTH=7                                                            
         MFLD  DGIA0048,                                               +        
               LTH=7                                                            
         MFLD  DGIA0049,                                               +        
               LTH=7                                                            
         MFLD  DGIA0050,                                               +        
               LTH=7                                                            
         MFLD  DGIA0051,                                               +        
               LTH=7                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MFLD  DGIA0027,                                               +        
               LTH=7                                                            
         MFLD  DGIA0028,                                               +        
               LTH=7                                                            
         MFLD  DGIA0029,                                               +        
               LTH=7                                                            
         MFLD  DGIA0030,                                               +        
               LTH=7                                                            
         MFLD  DGIA0031,                                               +        
               LTH=7                                                            
         MFLD  DGIA0032,                                               +        
               LTH=7                                                            
         MFLD  DGIA0033,                                               +        
               LTH=7                                                            
         MFLD  DGIA0034,                                               +        
               LTH=7                                                            
         MFLD  DGIA0035,                                               +        
               LTH=7                                                            
         MFLD  ANSK1,                                                  +        
               LTH=3                                                            
         MFLD  ANSK2,                                                  +        
               LTH=3                                                            
         MFLD  ANSK3,                                                  +        
               LTH=3                                                            
         MFLD  ANSK4,                                                  +        
               LTH=3                                                            
         MFLD  ANSK5,                                                  +        
               LTH=3                                                            
         MFLD  ANSK6,                                                  +        
               LTH=3                                                            
         MFLD  ANSK7,                                                  +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  DGIA0052,                                               +        
               LTH=6                                                            
         MFLD  DGIA0053,                                               +        
               LTH=6                                                            
         MFLD  DGIA0054,                                               +        
               LTH=6                                                            
         MFLD  DGIA0055,                                               +        
               LTH=6                                                            
         MFLD  DGIA0056,                                               +        
               LTH=6                                                            
         MFLD  DGIA0057,                                               +        
               LTH=6                                                            
         MFLD  DGIA0058,                                               +        
               LTH=6                                                            
         MFLD  KVDELA,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLANNURE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLANNUHE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATPIN,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
