***********************************************************************         
* CREATED BY PC65704   ON 98/12/08  AT 08:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL TRANSFERS NDC/SDC        '                               
W2N359   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0t501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T359U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352   ',                                         +        
               15='W2T353   ',                                         +        
               16='W2T354   ',                                         +        
               17='W2T355   ',                                         +        
               18='W2T356   ',                                         +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T359V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N359   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TRANSFERS/ SCRAP DC',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTNRU DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Desc.',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
ARTBESKR DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Send to',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDDCTO   DFLD  POS=(6,16),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Last returned',                                        +        
               POS=(6,42),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KVRETBEO DFLD  POS=(6,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIRETBEO DFLD  POS=(6,65),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Qty.',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRETUR  DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'In stock',                                             +        
               POS=(7,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
STOCK    DFLD  POS=(7,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fast order',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Freight',                                              +        
               POS=(8,19),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDFRAKT  DFLD  POS=(8,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'GIT',                                                  +        
               POS=(8,42),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AKPAV    DFLD  POS=(8,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AK in NDC',                                            +        
               POS=(9,42),LTH=9,                                       +        
               ATTR=(PROT)                                                      
AKNDC    DFLD  POS=(9,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot.',                                                 +        
               POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLTOT    DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ordered qty.',                                         +        
               POS=(10,42),LTH=12,                                     +        
               ATTR=(PROT)                                                      
KVBEART  DFLD  POS=(10,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Repl.Code',                                            +        
               POS=(11,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q1',                                                   +        
               POS=(11,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVQPACK  DFLD  POS=(11,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks:',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TXT1     DFLD  POS=(12,11),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Aut blocked until',                                    +        
               POS=(12,42),LTH=17,                                     +        
               ATTR=(PROT)                                                      
TISKRIN DFLD   POS=(12,60),LTH=06,                                     +        
               ATTR=(NOPROT)                                                    
TISKRUT  DFLD  POS=(12,67),LTH=06,                                     +        
               ATTR=(PROT)                                                      
TXT2     DFLD  POS=(13,11),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'To be left after scrapping:',                          +        
               POS=(15,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
KVSKKVAR DFLD  POS=(15,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Value of scrapped qty:',                               +        
               POS=(15,39),LTH=22,                                     +        
               ATTR=(PROT)                                                      
PRSKROT  DFLD  POS=(15,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks for scrap:',                                   +        
               POS=(16,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
SKROTTXT DFLD  POS=(16,21),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Account:',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDKONTO  DFLD  POS=(17,11),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Analysis No:',                                         +        
               POS=(17,22),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDANALYS DFLD  POS=(17,35),LTH=12,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Last scrap:',                                          +        
               POS=(18,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TISKROT  DFLD  POS=(18,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVSKROT  DFLD  POS=(18,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Scrap flag',                                           +        
               POS=(18,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLSKTBE DFLD   POS=(18,45),LTH=01,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'last scrap ordered:',                                  +        
               POS=(19,2),LTH=19,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Aut',                                                  +        
               POS=(19,34),LTH=03,                                     +        
               ATTR=(PROT)                                                      
FLSKROT  DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TISKROBE DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Purch menu   14 Purch prop   15 On order',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Season',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist   19 Refill info  20 On ord local 21 Tran+        
                Scrap   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         FMTEND                                                                 
W2O359N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N359,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I359N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N359                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTBESKR,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCTO,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRETBEO,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIRETBEO,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOCK,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AKPAV,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AKNDC,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTOT,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVBEART,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFRAKT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQPACK,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TXT1,                                                   +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TISKRIN,                                                +        
               LTH=08,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TISKRUT,                                                +        
               LTH=08,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TXT2,                                                   +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVSKKVAR,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRSKROT,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TISKROT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSKROT,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SKROTTXT,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TISKROBE,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKROT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKTBE,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W2I359N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N359),                                           +        
               OPT=2,                                                  +        
               NXT=W2O359N1                                                     
MID      LPAGE SOR=(W2N359)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS4,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23592',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCTO,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDFRAKT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLTOT,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TXT1,                                                  +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TXT2,                                                  +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVSKKVAR,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SKROTTXT,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDKONTO,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  (TISKRIN,                                               +        
               '++++++'),                                              +        
               LTH=06,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSKTBE,                                               +        
               '+'),                                                   +        
               LTH=01,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
