***********************************************************************         
* CREATED BY V028439   ON 06/06/19  AT 14:38                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTSINFO DEPENDING ON CHOICE   '                               
W2N322   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T322 7',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T322U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T321  ',                                          +        
               14='W2T322  ',                                          +        
               15='W2T323  ',                                          +        
               16='W2T324  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W2T322 7',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T322U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N322   DPAGE CURSOR=((4,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PARTSINFO DEPENDING ON CHOICE',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
******* rad 4 *******                                                           
         DFLD  'Mail',                                                 +        
               POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDARBTYP DFLD  POS=(4,8),LTH=4,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDPERSON DFLD  POS=(4,13),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 5 *******                                                           
         DFLD  'Proc   From-To ',                                      +        
               POS=(5,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
IDANSKF  DFLD  POS=(5,18),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(5,23),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSKT  DFLD  POS=(5,25),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '/ RespNo(max5)',                                       +        
               POS=(5,30),LTH=14,                                      +        
               ATTR=(PROT)                                                      
IDANSK1  DFLD  POS=(5,45),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK2  DFLD  POS=(5,49),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK3  DFLD  POS=(5,53),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK4  DFLD  POS=(5,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK5  DFLD  POS=(5,61),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Plan.no',                                              +        
               POS=(5,69),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLBERED  DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 6 *******                                                           
         DFLD  'SHP',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FLSHIP   DFLD  POS=(6,10),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Supp.max9',                                            +        
               POS=(6,12),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDLEVN1  DFLD  POS=(6,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN2  DFLD  POS=(6,28),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN3  DFLD  POS=(6,34),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN4  DFLD  POS=(6,40),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN5  DFLD  POS=(6,46),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN6  DFLD  POS=(6,52),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN7  DFLD  POS=(6,58),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN8  DFLD  POS=(6,64),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN9  DFLD  POS=(6,70),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 7 *******                                                           
         DFLD  'SS-code From-To',                                      +        
               POS=(7,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
KDERSF   DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(7,23),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KDERST   DFLD  POS=(7,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '/ SS-code(5)',                                         +        
               POS=(7,30),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KDERS1   DFLD  POS=(7,45),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS2   DFLD  POS=(7,48),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS3   DFLD  POS=(7,51),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS4   DFLD  POS=(7,54),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS5   DFLD  POS=(7,57),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'OHF',                                                  +        
               POS=(7,68),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDOTFREK DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 8 *******                                                           
         DFLD  'FuncGrp.From-To',                                      +        
               POS=(8,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FNKGRPF  DFLD  POS=(8,18),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(8,23),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FNKGRPT  DFLD  POS=(8,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '/ Fnc-Grp(4)',                                         +        
               POS=(8,30),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FNKGRP1  DFLD  POS=(8,45),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP2  DFLD  POS=(8,50),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP3  DFLD  POS=(8,55),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP4  DFLD  POS=(8,60),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 9 *******                                                           
         DFLD  'Packtype(4) ',                                         +        
               POS=(09,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FPTYP1   DFLD  POS=(09,18),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP2   DFLD  POS=(09,21),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP3   DFLD  POS=(09,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP4   DFLD  POS=(09,27),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Description ',                                         +        
               POS=(09,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(09,45),LTH=25,                                     +        
               ATTR=(NOPROT,MOD)                                                
******* rad 10 *******                                                          
         DFLD  'Prodgrp From-To',                                      +        
               POS=(10,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
PRODSLF  DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(10,23),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODSLT  DFLD  POS=(10,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Project',                                              +        
               POS=(10,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PROJURV  DFLD  POS=(10,40),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH area',                                              +        
               POS=(10,45),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(10,53),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Aisle',                                                +        
               POS=(10,56),LTH=5                                       +        
               ATTR=(PROT)                                                      
ADGANGF  DFLD  POS=(10,62),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(10,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ADGANGT  DFLD  POS=(10,68),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 12 *******                                                          
         DFLD  'Supplier',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
LEV      DFLD  POS=(12,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SupDescr',                                             +        
               POS=(12,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LEVBET   DFLD  POS=(12,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Descr(S)',                                             +        
               POS=(12,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
BEARTS   DFLD  POS=(12,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Descr(GB)',                                            +        
               POS=(12,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEARTGB  DFLD  POS=(12,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'St.on hnd',                                            +        
               POS=(12,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STONHAND DFLD  POS=(12,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'AK      ',                                             +        
               POS=(12,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVAKS    DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 13 *******                                                          
         DFLD  'VOR/BO',                                               +        
               POS=(13,02),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VORROS   DFLD  POS=(13,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Arrear',                                               +        
               POS=(13,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SLAP     DFLD  POS=(13,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Del.prom.',                                            +        
               POS=(13,28),LTH=9,                                      +        
               ATTR=(PROT)                                                      
LEVBESK  DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pre.adv.',                                             +        
               POS=(13,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FAVISER  DFLD  POS=(13,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'TPO',                                                  +        
               POS=(13,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TPO      DFLD  POS=(13,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Leadtime',                                             +        
               POS=(13,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LEDTID   DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 14 *******                                                          
         DFLD  'SScode',                                               +        
               POS=(14,02),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ERSKOD   DFLD  POS=(14,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Proc/Plan',                                            +        
               POS=(14,15),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANSK     DFLD  POS=(14,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Dir.del',                                              +        
               POS=(14,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DIRLEV   DFLD  POS=(14,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DispDay',                                              +        
               POS=(14,42),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVSDAG   DFLD  POS=(14,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Trend',                                                +        
               POS=(14,55),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TREND    DFLD  POS=(14,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Season',                                               +        
               POS=(14,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SAESONG  DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 15 *******                                                          
         DFLD  'LatestDel',                                            +        
               POS=(15,02),LTH=9,                                      +        
               ATTR=(PROT)                                                      
SENINLEV DFLD  POS=(15,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'FC',                                                   +        
               POS=(15,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PB       DFLD  POS=(15,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'OI Roll12',                                            +        
               POS=(15,28),LTH=9,                                      +        
               ATTR=(PROT)                                                      
OIRULL   DFLD  POS=(15,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Oi 5y    ',                                            +        
               POS=(15,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
OI0PLUS5 DFLD  POS=(15,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Aut/JIT',                                              +        
               POS=(15,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AUTPLAN  DFLD  POS=(15,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PurchID ',                                             +        
               POS=(15,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
INKOPARE DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 16 *******                                                          
         DFLD  'Price',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BESTPRIS DFLD  POS=(16,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'OrderBal.',                                            +        
               POS=(16,15),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BESTREST DFLD  POS=(16,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Agreem.',                                              +        
               POS=(16,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVTAL    DFLD  POS=(16,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PackFL   ',                                            +        
               POS=(16,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLFORPSI DFLD  POS=(16,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Weight/Vol',                                           +        
               POS=(16,55),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(16,66),LTH=01,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RefStop  ',                                            +        
               POS=(16,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
REFSTOPP DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 17 *******                                                          
         DFLD  'Proj/Mod.',                                            +        
               POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PROJEKT  DFLD  POS=(17,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PubWeek  ',                                            +        
               POS=(17,15),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FINLEV   DFLD  POS=(17,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'EOP     ',                                             +        
               POS=(17,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
URPROD   DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PartsDir',                                             +        
               POS=(17,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
AARLF    DFLD  POS=(17,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Prodgrp',                                              +        
               POS=(17,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRODSL   DFLD  POS=(17,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Funcgrp',                                              +        
               POS=(17,68),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FKNGRP   DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 18 *******                                                          
         DFLD  'In kit',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ISATS    DFLD  POS=(18,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Tot.need',                                             +        
               POS=(18,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTBEHOV DFLD  POS=(18,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Calloffs',                                             +        
               POS=(18,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KAVROP   DFLD  POS=(18,38),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Parameter',                                            +        
               POS=(18,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
STYRPARM DFLD  POS=(18,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Service',                                              +        
               POS=(18,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
SERVICE  DFLD  POS=(18,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Sort',                                                 +        
               POS=(18,68),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SORT     DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 19 *******                                                          
         DFLD  'Quants ',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVANTER  DFLD  POS=(19,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pack.Info',                                            +        
               POS=(19,15),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FORPINFO DFLD  POS=(19,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Blocked ',                                             +        
               POS=(19,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SPANTAL  DFLD  POS=(19,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Safety.st',                                            +        
               POS=(19,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
SLAGER   DFLD  POS=(19,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'MaxPt   ',                                             +        
               POS=(19,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
MAXPUNKT DFLD  POS=(19,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'IR-status',                                            +        
               POS=(19,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KRSTATUS DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 20 *******                                                          
         DFLD  'Campaign',                                             +        
               POS=(20,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KAMPANJ  DFLD  POS=(20,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH area ',                                             +        
               POS=(20,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LAGOMR   DFLD  POS=(20,25),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Gate',                                                 +        
               POS=(20,28),LTH=4,                                      +        
               ATTR=(PROT)                                                      
GATE     DFLD  POS=(20,38),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Exc.p/LSR',                                            +        
               POS=(20,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
UART     DFLD  POS=(20,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Origin  ',                                             +        
               POS=(20,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
URSPRUNG DFLD  POS=(20,66),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'OHF',                                                  +        
               POS=(20,68),LTH=3,                                      +        
               ATTR=(PROT)                                                      
OTFREK   DFLD  POS=(20,78),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 22 *******                                                          
         DFLD  'F10 WHELP   F12 Logoff',                               +        
               POS=(22,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
******* rad 23 *******                                                          
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
******* rad 24 *******                                                          
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O322N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N322,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I322N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N322                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  IDANSKF,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBERED,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSHIP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERSF,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERST,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS4,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS5,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDOTFREK,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRPF,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRPT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP4,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART,                                                  +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRODSLF,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSLT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PROJURV,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADLAGOMR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANGF,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANGT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTBEHOV,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAVROP,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVBET,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEARTS,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEARTGB,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STONHAND,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAKS,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VORROS,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SLAP,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVBESK,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FAVISER,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TPO,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEDTID,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ERSKOD,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANSK,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIRLEV,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVSDAG,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TREND,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SAESONG,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SENINLEV,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PB,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OIRULL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OI0PLUS5,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AUTPLAN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INKOPARE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESTPRIS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESTREST,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVTAL,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLFORPSI,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKART,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFSTOPP,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PROJEKT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FINLEV,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URPROD,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AARLF,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FKNGRP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ISATS,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STYRPARM,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SERVICE,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANTER,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FORPINFO,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPANTAL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SLAGER,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MAXPUNKT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KRSTATUS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMPANJ,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GATE,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UART,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URSPRUNG,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OTFREK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARBTYP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I322N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N322),                                           +        
               OPT=2,                                                  +        
               NXT=W2O322N1                                                     
MID      LPAGE SOR=(W2N322)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23221',                                                +        
               LTH=5                                                            
         MFLD  (IDANSKF,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLBERED,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLSHIP,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN4,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN5,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN6,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN7,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN8,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN9,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDERSF,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERST,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS1,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS2,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS3,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS4,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS5,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDOTFREK,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FNKGRPF,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRPT,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP4,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP1,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP2,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP3,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP4,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEART,                                                 +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRODSLF,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSLT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROJURV,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADLAGOMR,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGF,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTBEHOV,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KAVROP,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LEVBET,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BEARTS,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BEARTGB,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (STONHAND,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVAKS,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VORROS,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SLAP,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LEVBESK,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FAVISER,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TPO,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LEDTID,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ERSKOD,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ANSK,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DIRLEV,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVSDAG,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TREND,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SAESONG,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SENINLEV,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PB,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (OIRULL,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (OI0PLUS5,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AUTPLAN,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (INKOPARE,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BESTPRIS,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BESTREST,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVTAL,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLFORPSI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VKART,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (REFSTOPP,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PROJEKT,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FINLEV,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (URPROD,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AARLF,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRODSL,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FKNGRP,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ISATS,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (STYRPARM,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SERVICE,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SORT,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVANTER,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FORPINFO,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SPANTAL,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SLAGER,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (MAXPUNKT,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KRSTATUS,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KAMPANJ,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LAGOMR,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (GATE,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (UART,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (URSPRUNG,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (OTFREK,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDARBTYP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
