***********************************************************************         
* CREATED BY V063442   ON 02/01/24  AT 10:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PURCHASE LIST DC                '                               
W2N373   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T373U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T373V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N373   DPAGE CURSOR=((5,09)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PURCHASE LIST DC',                                     +        
               POS=(1,11),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Mail',                                                 +        
               POS=(5,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDARBTYP DFLD  POS=(5,09),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDPERSON DFLD  POS=(5,14),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(7,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(7,09),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Option',                                               +        
               POS=(8,02),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDREFORS DFLD  POS=(8,09),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'F10 WHELP   F11 List   F23 List&Remove',               +        
               POS=(22,2),LTH=38,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F12 Logoff',                                           +        
               POS=(22,43),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O373N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N373,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I373N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N373                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  KDARBTYP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDREFORS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I373N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N373),                                           +        
               OPT=2,                                                  +        
               NXT=W2O373N1                                                     
MID      LPAGE SOR=(W2N373)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23732',                                                +        
               LTH=5                                                            
         MFLD  (KDARBTYP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDREFORS,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
