         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PURCHASE DC GROUP               '                               
W2N382   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T382  ',                                           +        
               2='W2T382  ',                                           +        
               3='W2T382  ',                                           +        
               4='W2T382  ',                                           +        
               5='W2T382  ',                                           +        
               6='W2T382  ',                                           +        
               7='W2T382 7',                                           +        
               8='W2T382 8',                                           +        
               9='W2T382  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T382U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T381  ',                                          +        
               14='W2T382  ',                                          +        
               15='W2T382  ',                                          +        
               16='W2T382  ',                                          +        
               17='W2T382  ',                                          +        
               18='W2T382  ',                                          +        
               19='W2T382  ',                                          +        
               20='W2T382  ',                                          +        
               21='W2T382  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T382V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N382   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PURCHASE DC GROUP  ',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,46),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Type',                                                 +        
               POS=(2,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TYPEIN   DFLD  POS=(2,54),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,60),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUSIN DFLD  POS=(2,67),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEN      DFLD  POS=(3,20),LTH=22,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TYPEUT   DFLD  POS=(3,54),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUSUT DFLD  POS=(3,67),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTART   DFLD  POS=(4,65),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'to review',                                            +        
               POS=(4,71),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ot',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FLD0505  DFLD  POS=(5,5),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0507  DFLD  POS=(5,7),LTH=5,                                        +        
               ATTR=(PROT,HI,MOD)                                               
FLD0516  DFLD  POS=(5,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0513  DFLD  POS=(5,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0524  DFLD  POS=(5,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0521  DFLD  POS=(5,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0532  DFLD  POS=(5,29),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0529  DFLD  POS=(5,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0540  DFLD  POS=(5,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0537  DFLD  POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0548  DFLD  POS=(5,45),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0545  DFLD  POS=(5,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0556  DFLD  POS=(5,53),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0553  DFLD  POS=(5,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0561  DFLD  POS=(5,61),LTH=20,                                      +        
               ATTR=(PROT,HI,MOD)                                               
FLD0602  DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0605  DFLD  POS=(6,5),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0613  DFLD  POS=(6,13),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0621  DFLD  POS=(6,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0629  DFLD  POS=(6,29),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0637  DFLD  POS=(6,37),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0645  DFLD  POS=(6,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0653  DFLD  POS=(6,53),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Model',                                                +        
               POS=(6,61),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MOD1     DFLD  POS=(6,67),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
MOD2     DFLD  POS=(6,72),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MOD3     DFLD  POS=(6,77),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0702  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0705  DFLD  POS=(7,5),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0713  DFLD  POS=(7,13),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0721  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0729  DFLD  POS=(7,29),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0737  DFLD  POS=(7,37),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0745  DFLD  POS=(7,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0753  DFLD  POS=(7,53),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Pubw',                                                 +        
               POS=(7,61),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0766  DFLD  POS=(7,66),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'EOP',                                                  +        
               POS=(7,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0776  DFLD  POS=(7,76),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0802  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0805  DFLD  POS=(8,5),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0813  DFLD  POS=(8,13),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0821  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0829  DFLD  POS=(8,29),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0837  DFLD  POS=(8,37),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0845  DFLD  POS=(8,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0853  DFLD  POS=(8,53),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Replaces',                                             +        
               POS=(8,61),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0872  DFLD  POS=(8,72),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0902  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0905  DFLD  POS=(9,5),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0913  DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0921  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0929  DFLD  POS=(9,29),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0937  DFLD  POS=(9,37),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0945  DFLD  POS=(9,45),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0953  DFLD  POS=(9,53),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Repl by',                                              +        
               POS=(09,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0972  DFLD  POS=(09,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1002  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1005  DFLD  POS=(10,5),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1013  DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1021  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1029  DFLD  POS=(10,29),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1037  DFLD  POS=(10,37),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1045  DFLD  POS=(10,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1053  DFLD  POS=(10,53),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Code',                                                 +        
               POS=(10,61),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1066  DFLD  POS=(10,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'PG',                                                   +        
               POS=(10,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1079  DFLD  POS=(10,79),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Curr w',                                               +        
               POS=(11,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VECKA    DFLD  POS=(11,9),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1113  DFLD  POS=(11,13),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1121  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1129  DFLD  POS=(11,29),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1137  DFLD  POS=(11,37),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1145  DFLD  POS=(11,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1153  DFLD  POS=(11,53),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Volume',                                               +        
               POS=(11,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1171  DFLD  POS=(11,71),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lsold   ',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1714  DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1722  DFLD  POS=(12,22),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1730  DFLD  POS=(12,30),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1738  DFLD  POS=(12,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1746  DFLD  POS=(12,46),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1754  DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1261  DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1271  DFLD  POS=(12,71),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lbin    ',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1814  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1822  DFLD  POS=(13,22),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1830  DFLD  POS=(13,30),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1838  DFLD  POS=(13,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1846  DFLD  POS=(13,46),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1854  DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Forecast',                                             +        
               POS=(13,61),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1374  DFLD  POS=(13,72),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Orderpt ',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1514  DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1522  DFLD  POS=(14,22),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1530  DFLD  POS=(14,30),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1538  DFLD  POS=(14,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1546  DFLD  POS=(14,46),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1554  DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC Bal',                                               +        
               POS=(14,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1474  DFLD  POS=(14,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Refillqt',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1613  DFLD  POS=(15,13),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1621  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1629  DFLD  POS=(15,29),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1637  DFLD  POS=(15,37),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1645  DFLD  POS=(15,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1653  DFLD  POS=(15,53),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Bo     ',                                              +        
               POS=(15,61),LTH=7                                       +        
               ATTR=(PROT)                                                      
FLD1574  DFLD  POS=(15,74),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Forecast',                                             +        
               POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1213  DFLD  POS=(16,13),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1221  DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1229  DFLD  POS=(16,29),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1237  DFLD  POS=(16,37),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1245  DFLD  POS=(16,45),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1253  DFLD  POS=(16,53),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Autref ',                                              +        
               POS=(16,61),LTH=7                                       +        
               ATTR=(PROT)                                                      
FLD1670  DFLD  POS=(16,70),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1672  DFLD  POS=(16,72),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1674  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1676  DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1678  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1680  DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Balance',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1313  DFLD  POS=(17,13),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1321  DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1329  DFLD  POS=(17,29),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1337  DFLD  POS=(17,37),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1345  DFLD  POS=(17,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1353  DFLD  POS=(17,53),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Season',                                               +        
               POS=(17,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1770  DFLD  POS=(17,70),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1772  DFLD  POS=(17,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1774  DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1776  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1778  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1780  DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'In trans',                                             +        
               POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1413  DFLD  POS=(18,13),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1421  DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1429  DFLD  POS=(18,29),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1437  DFLD  POS=(18,37),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1445  DFLD  POS=(18,45),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1453  DFLD  POS=(18,53),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q1',                                                   +        
               POS=(18,61),LTH=2                                       +        
               ATTR=(PROT)                                                      
FLD1864  DFLD  POS=(18,64),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q3',                                                   +        
               POS=(18,73),LTH=2                                       +        
               ATTR=(PROT)                                                      
FLD1873  DFLD  POS=(18,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Purchqty',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1913  DFLD  POS=(19,13),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1921  DFLD  POS=(19,21),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1929  DFLD  POS=(19,29),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1937  DFLD  POS=(19,37),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1945  DFLD  POS=(19,45),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
FLD1953  DFLD  POS=(19,53),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comm',                                                 +        
               POS=(19,61),LTH=4                                       +        
               ATTR=(PROT)                                                      
FLD1966  DFLD  POS=(19,66),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Purchase from',                                        +        
               POS=(20,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2018  DFLD  POS=(20,18),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2026  DFLD  POS=(20,26),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2034  DFLD  POS=(20,34),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2042  DFLD  POS=(20,42),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2050  DFLD  POS=(20,50),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2058  DFLD  POS=(20,58),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLD2066  DFLD  POS=(20,66),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Purch menu   14 Purch prop              ',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '           ',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '         ',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '                                                       +        
                                ',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=72,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O382N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N382,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I382N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N382                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  BEN,                                                    +        
               LTH=22                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  TYPEIN,                                                 +        
               LTH=1                                                            
         MFLD  TYPEUT,                                                 +        
               LTH=5                                                            
         MFLD  STATUSIN,                                               +        
               LTH=1                                                            
         MFLD  STATUSUT,                                               +        
               LTH=12                                                           
         MFLD  ANTART,                                                 +        
               LTH=5                                                            
         MFLD  FLD0505,                                                +        
               LTH=1                                                            
         MFLD  FLD0507,                                                +        
               LTH=5                                                            
         MFLD  FLD0513,                                                +        
               LTH=2                                                            
         MFLD  FLD0516,                                                +        
               LTH=4                                                            
         MFLD  FLD0521,                                                +        
               LTH=2                                                            
         MFLD  FLD0524,                                                +        
               LTH=4                                                            
         MFLD  FLD0529,                                                +        
               LTH=2                                                            
         MFLD  FLD0532,                                                +        
               LTH=4                                                            
         MFLD  FLD0537,                                                +        
               LTH=2                                                            
         MFLD  FLD0540,                                                +        
               LTH=4                                                            
         MFLD  FLD0545,                                                +        
               LTH=2                                                            
         MFLD  FLD0548,                                                +        
               LTH=4                                                            
         MFLD  FLD0553,                                                +        
               LTH=2                                                            
         MFLD  FLD0556,                                                +        
               LTH=4                                                            
         MFLD  FLD0561,                                                +        
               LTH=20                                                           
         MFLD  FLD0602,                                                +        
               LTH=2                                                            
         MFLD  FLD0605,                                                +        
               LTH=5                                                            
         MFLD  FLD0613,                                                +        
               LTH=7                                                            
         MFLD  FLD0621,                                                +        
               LTH=7                                                            
         MFLD  FLD0629,                                                +        
               LTH=7                                                            
         MFLD  FLD0637,                                                +        
               LTH=7                                                            
         MFLD  FLD0645,                                                +        
               LTH=7                                                            
         MFLD  FLD0653,                                                +        
               LTH=7                                                            
         MFLD  FLD0702,                                                +        
               LTH=2                                                            
         MFLD  FLD0705,                                                +        
               LTH=5                                                            
         MFLD  FLD0713,                                                +        
               LTH=7                                                            
         MFLD  FLD0721,                                                +        
               LTH=7                                                            
         MFLD  FLD0729,                                                +        
               LTH=7                                                            
         MFLD  FLD0737,                                                +        
               LTH=7                                                            
         MFLD  FLD0745,                                                +        
               LTH=7                                                            
         MFLD  FLD0753,                                                +        
               LTH=7                                                            
         MFLD  FLD0802,                                                +        
               LTH=2                                                            
         MFLD  FLD0805,                                                +        
               LTH=5                                                            
         MFLD  FLD0813,                                                +        
               LTH=7                                                            
         MFLD  FLD0821,                                                +        
               LTH=7                                                            
         MFLD  FLD0829,                                                +        
               LTH=7                                                            
         MFLD  FLD0837,                                                +        
               LTH=7                                                            
         MFLD  FLD0845,                                                +        
               LTH=7                                                            
         MFLD  FLD0853,                                                +        
               LTH=7                                                            
         MFLD  FLD0902,                                                +        
               LTH=2                                                            
         MFLD  FLD0905,                                                +        
               LTH=5                                                            
         MFLD  FLD0913,                                                +        
               LTH=7                                                            
         MFLD  FLD0921,                                                +        
               LTH=7                                                            
         MFLD  FLD0929,                                                +        
               LTH=7                                                            
         MFLD  FLD0937,                                                +        
               LTH=7                                                            
         MFLD  FLD0945,                                                +        
               LTH=7                                                            
         MFLD  FLD0953,                                                +        
               LTH=7                                                            
         MFLD  FLD1002,                                                +        
               LTH=2                                                            
         MFLD  FLD1005,                                                +        
               LTH=5                                                            
         MFLD  FLD1013,                                                +        
               LTH=7                                                            
         MFLD  FLD1021,                                                +        
               LTH=7                                                            
         MFLD  FLD1029,                                                +        
               LTH=7                                                            
         MFLD  FLD1037,                                                +        
               LTH=7                                                            
         MFLD  FLD1045,                                                +        
               LTH=7                                                            
         MFLD  FLD1053,                                                +        
               LTH=7                                                            
         MFLD  VECKA,                                                  +        
               LTH=1                                                            
         MFLD  FLD1113,                                                +        
               LTH=7                                                            
         MFLD  FLD1121,                                                +        
               LTH=7                                                            
         MFLD  FLD1129,                                                +        
               LTH=7                                                            
         MFLD  FLD1137,                                                +        
               LTH=7                                                            
         MFLD  FLD1145,                                                +        
               LTH=7                                                            
         MFLD  FLD1153,                                                +        
               LTH=7                                                            
         MFLD  FLD1213,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1221,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1229,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1237,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1245,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1253,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1313,                                                +        
               LTH=7                                                            
         MFLD  FLD1321,                                                +        
               LTH=7                                                            
         MFLD  FLD1329,                                                +        
               LTH=7                                                            
         MFLD  FLD1337,                                                +        
               LTH=7                                                            
         MFLD  FLD1345,                                                +        
               LTH=7                                                            
         MFLD  FLD1353,                                                +        
               LTH=7                                                            
         MFLD  FLD1413,                                                +        
               LTH=7                                                            
         MFLD  FLD1421,                                                +        
               LTH=7                                                            
         MFLD  FLD1429,                                                +        
               LTH=7                                                            
         MFLD  FLD1437,                                                +        
               LTH=7                                                            
         MFLD  FLD1445,                                                +        
               LTH=7                                                            
         MFLD  FLD1453,                                                +        
               LTH=7                                                            
         MFLD  FLD1514,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1522,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1530,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1538,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1546,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1554,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1613,                                                +        
               LTH=7                                                            
         MFLD  FLD1621,                                                +        
               LTH=7                                                            
         MFLD  FLD1629,                                                +        
               LTH=7                                                            
         MFLD  FLD1637,                                                +        
               LTH=7                                                            
         MFLD  FLD1645,                                                +        
               LTH=7                                                            
         MFLD  FLD1653,                                                +        
               LTH=7                                                            
         MFLD  FLD1714,                                                +        
               LTH=6                                                            
         MFLD  FLD1722,                                                +        
               LTH=6                                                            
         MFLD  FLD1730,                                                +        
               LTH=6                                                            
         MFLD  FLD1738,                                                +        
               LTH=6                                                            
         MFLD  FLD1746,                                                +        
               LTH=6                                                            
         MFLD  FLD1754,                                                +        
               LTH=6                                                            
         MFLD  FLD1814,                                                +        
               LTH=6                                                            
         MFLD  FLD1822,                                                +        
               LTH=6                                                            
         MFLD  FLD1830,                                                +        
               LTH=6                                                            
         MFLD  FLD1838,                                                +        
               LTH=6                                                            
         MFLD  FLD1846,                                                +        
               LTH=6                                                            
         MFLD  FLD1854,                                                +        
               LTH=6                                                            
         MFLD  FLD1913,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1921,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1929,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1937,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1945,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1953,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2026,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2034,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2042,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2050,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2058,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MOD1,                                                   +        
               LTH=4                                                            
         MFLD  MOD2,                                                   +        
               LTH=4                                                            
         MFLD  MOD3,                                                   +        
               LTH=4                                                            
         MFLD  FLD0766,                                                +        
               LTH=5                                                            
         MFLD  FLD0776,                                                +        
               LTH=4                                                            
         MFLD  FLD0872,                                                +        
               LTH=9                                                            
         MFLD  FLD0972,                                                +        
               LTH=9                                                            
         MFLD  FLD1066,                                                +        
               LTH=2                                                            
         MFLD  FLD1079,                                                +        
               LTH=2                                                            
         MFLD  FLD1171,                                                +        
               LTH=10                                                           
         MFLD  FLD1261,                                                +        
               LTH=6                                                            
         MFLD  FLD1271,                                                +        
               LTH=10                                                           
         MFLD  FLD1374,                                                +        
               LTH=9                                                            
         MFLD  FLD1474,                                                +        
               LTH=8                                                            
         MFLD  FLD1574,                                                +        
               LTH=7                                                            
         MFLD  FLD1670,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1672,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1674,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1676,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1678,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1680,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1770,                                                +        
               LTH=1                                                            
         MFLD  FLD1772,                                                +        
               LTH=1                                                            
         MFLD  FLD1774,                                                +        
               LTH=1                                                            
         MFLD  FLD1776,                                                +        
               LTH=1                                                            
         MFLD  FLD1778,                                                +        
               LTH=1                                                            
         MFLD  FLD1780,                                                +        
               LTH=1                                                            
         MFLD  FLD1864,                                                +        
               LTH=5                                                            
         MFLD  FLD1873,                                                +        
               LTH=5                                                            
         MFLD  FLD1966,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2066,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=72                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I382N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N382),                                           +        
               OPT=2,                                                  +        
               NXT=W2O382N1                                                     
MID      LPAGE SOR=(W2N382)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23822',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TYPEIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TYPEUT,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUSIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUSUT,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0505,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0507,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1213,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1221,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1229,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1237,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1245,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1253,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1670,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1672,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1674,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1676,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1678,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1680,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1913,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1921,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1929,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1937,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1945,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1953,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1966,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD2066,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD2018,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2026,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2034,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2042,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2050,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2058,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
