***********************************************************************         
* CREATED BY PC65704   ON 99/02/11  AT 15:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SEASON ANALYSIS DC              '                               
W2N355   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T355 7',                                           +        
               8='W2T355 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T355U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355 1',                                          +        
               18='W2T356  ',                                          +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N355   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SEASON ANALYSIS DC',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Blocked to',                                           +        
               POS=(2,41),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DASPSEA  DFLD  POS=(2,52),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Man season',                                           +        
               POS=(3,41),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIMANSEA DFLD  POS=(3,52),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Season',                                               +        
               POS=(4,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SEASON   DFLD  POS=(4,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BENART   DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Uncertaintyfactor',                                    +        
               POS=(5,41),LTH=17,                                      +        
               ATTR=(PROT)                                                      
OSAKER   DFLD  POS=(5,59),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Per   Valid',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Simulation',                                           +        
               POS=(6,26),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'History based on',                                     +        
               POS=(6,44),LTH=16,                                      +        
               ATTR=(PROT)                                                      
ANTALAR  DFLD  POS=(6,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'years',                                                +        
               POS=(6,63),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(',                                                    +        
               POS=(6,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANTALMAN DFLD  POS=(6,71),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'months)',                                              +        
               POS=(6,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(7,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
VALIX01  DFLD  POS=(7,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
VALANT01 DFLD  POS=(7,12),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
SIMIX01  DFLD  POS=(7,26),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
SIMANT01 DFLD  POS=(7,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
HISIX01  DFLD  POS=(7,44),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
HISANT01 DFLD  POS=(7,48),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '2',                                                    +        
               POS=(8,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
VALIX02  DFLD  POS=(8,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
VALANT02 DFLD  POS=(8,12),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
SIMIX02  DFLD  POS=(8,26),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
SIMANT02 DFLD  POS=(8,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
HISIX02  DFLD  POS=(8,44),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
HISANT02 DFLD  POS=(8,48),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '3',                                                    +        
               POS=(9,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
VALIX03  DFLD  POS=(9,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
VALANT03 DFLD  POS=(9,12),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
SIMIX03  DFLD  POS=(9,26),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
SIMANT03 DFLD  POS=(9,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
HISIX03  DFLD  POS=(9,44),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
HISANT03 DFLD  POS=(9,48),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '4',                                                    +        
               POS=(10,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX04  DFLD  POS=(10,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT04 DFLD  POS=(10,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX04  DFLD  POS=(10,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT04 DFLD  POS=(10,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX04  DFLD  POS=(10,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT04 DFLD  POS=(10,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '5',                                                    +        
               POS=(11,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX05  DFLD  POS=(11,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT05 DFLD  POS=(11,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX05  DFLD  POS=(11,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT05 DFLD  POS=(11,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX05  DFLD  POS=(11,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT05 DFLD  POS=(11,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '6',                                                    +        
               POS=(12,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX06  DFLD  POS=(12,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT06 DFLD  POS=(12,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX06  DFLD  POS=(12,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT06 DFLD  POS=(12,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX06  DFLD  POS=(12,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT06 DFLD  POS=(12,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '7',                                                    +        
               POS=(13,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX07  DFLD  POS=(13,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT07 DFLD  POS=(13,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX07  DFLD  POS=(13,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT07 DFLD  POS=(13,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX07  DFLD  POS=(13,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT07 DFLD  POS=(13,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '8',                                                    +        
               POS=(14,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX08  DFLD  POS=(14,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT08 DFLD  POS=(14,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX08  DFLD  POS=(14,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT08 DFLD  POS=(14,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX08  DFLD  POS=(14,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT08 DFLD  POS=(14,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '9',                                                    +        
               POS=(15,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VALIX09  DFLD  POS=(15,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT09 DFLD  POS=(15,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX09  DFLD  POS=(15,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT09 DFLD  POS=(15,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX09  DFLD  POS=(15,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT09 DFLD  POS=(15,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '10',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VALIX10  DFLD  POS=(16,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT10 DFLD  POS=(16,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX10  DFLD  POS=(16,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT10 DFLD  POS=(16,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX10  DFLD  POS=(16,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT10 DFLD  POS=(16,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '11',                                                   +        
               POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VALIX11  DFLD  POS=(17,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT11 DFLD  POS=(17,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX11  DFLD  POS=(17,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT11 DFLD  POS=(17,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX11  DFLD  POS=(17,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT11 DFLD  POS=(17,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '12',                                                   +        
               POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VALIX12  DFLD  POS=(18,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
VALANT12 DFLD  POS=(18,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
SIMIX12  DFLD  POS=(18,26),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
SIMANT12 DFLD  POS=(18,30),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
HISIX12  DFLD  POS=(18,44),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
HISANT12 DFLD  POS=(18,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
TOTVALAN DFLD  POS=(19,12),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
TOTSIMAN DFLD  POS=(19,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
TOTHISAN DFLD  POS=(19,48),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Purch menu   14 Purch prop   15 On order',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 IX = 100',                                          +        
               POS=(21,66),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist   19 Refill info  20 On ord local 21 Tran+        
                Scrap   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O355N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N355,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I355N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N355                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  DASPSEA,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIMANSEA,                                               +        
               LTH=6                                                            
         MFLD  SEASON,                                                 +        
               LTH=1                                                            
         MFLD  BENART,                                                 +        
               LTH=25                                                           
         MFLD  OSAKER,                                                 +        
               LTH=5                                                            
         MFLD  ANTALAR,                                                +        
               LTH=1                                                            
         MFLD  ANTALMAN,                                               +        
               LTH=2                                                            
         MFLD  VALIX01,                                                +        
               LTH=3                                                            
         MFLD  VALANT01,                                               +        
               LTH=7                                                            
         MFLD  VALIX02,                                                +        
               LTH=3                                                            
         MFLD  VALANT02,                                               +        
               LTH=7                                                            
         MFLD  VALIX03,                                                +        
               LTH=3                                                            
         MFLD  VALANT03,                                               +        
               LTH=7                                                            
         MFLD  VALIX04,                                                +        
               LTH=3                                                            
         MFLD  VALANT04,                                               +        
               LTH=7                                                            
         MFLD  VALIX05,                                                +        
               LTH=3                                                            
         MFLD  VALANT05,                                               +        
               LTH=7                                                            
         MFLD  VALIX06,                                                +        
               LTH=3                                                            
         MFLD  VALANT06,                                               +        
               LTH=7                                                            
         MFLD  VALIX07,                                                +        
               LTH=3                                                            
         MFLD  VALANT07,                                               +        
               LTH=7                                                            
         MFLD  VALIX08,                                                +        
               LTH=3                                                            
         MFLD  VALANT08,                                               +        
               LTH=7                                                            
         MFLD  VALIX09,                                                +        
               LTH=3                                                            
         MFLD  VALANT09,                                               +        
               LTH=7                                                            
         MFLD  VALIX10,                                                +        
               LTH=3                                                            
         MFLD  VALANT10,                                               +        
               LTH=7                                                            
         MFLD  VALIX11,                                                +        
               LTH=3                                                            
         MFLD  VALANT11,                                               +        
               LTH=7                                                            
         MFLD  VALIX12,                                                +        
               LTH=3                                                            
         MFLD  VALANT12,                                               +        
               LTH=7                                                            
         MFLD  TOTVALAN,                                               +        
               LTH=7                                                            
         MFLD  SIMIX01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT01,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT02,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT03,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT04,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX05,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT05,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX06,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT06,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX07,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT07,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX08,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT08,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX09,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT09,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX10,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX11,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMIX12,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIMANT12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTSIMAN,                                               +        
               LTH=7                                                            
         MFLD  HISIX01,                                                +        
               LTH=3                                                            
         MFLD  HISANT01,                                               +        
               LTH=7                                                            
         MFLD  HISIX02,                                                +        
               LTH=3                                                            
         MFLD  HISANT02,                                               +        
               LTH=7                                                            
         MFLD  HISIX03,                                                +        
               LTH=3                                                            
         MFLD  HISANT03,                                               +        
               LTH=7                                                            
         MFLD  HISIX04,                                                +        
               LTH=3                                                            
         MFLD  HISANT04,                                               +        
               LTH=7                                                            
         MFLD  HISIX05,                                                +        
               LTH=3                                                            
         MFLD  HISANT05,                                               +        
               LTH=7                                                            
         MFLD  HISIX06,                                                +        
               LTH=3                                                            
         MFLD  HISANT06,                                               +        
               LTH=7                                                            
         MFLD  HISIX07,                                                +        
               LTH=3                                                            
         MFLD  HISANT07,                                               +        
               LTH=7                                                            
         MFLD  HISIX08,                                                +        
               LTH=3                                                            
         MFLD  HISANT08,                                               +        
               LTH=7                                                            
         MFLD  HISIX09,                                                +        
               LTH=3                                                            
         MFLD  HISANT09,                                               +        
               LTH=7                                                            
         MFLD  HISIX10,                                                +        
               LTH=3                                                            
         MFLD  HISANT10,                                               +        
               LTH=7                                                            
         MFLD  HISIX11,                                                +        
               LTH=3                                                            
         MFLD  HISANT11,                                               +        
               LTH=7                                                            
         MFLD  HISIX12,                                                +        
               LTH=3                                                            
         MFLD  HISANT12,                                               +        
               LTH=7                                                            
         MFLD  TOTHISAN,                                               +        
               LTH=7                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I355N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N355),                                           +        
               OPT=2,                                                  +        
               NXT=W2O355N1                                                     
MID      LPAGE SOR=(W2N355)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23552',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (DCUT,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (DASPSEA,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SIMIX01,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT01,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX02,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT02,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX03,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT03,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX04,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT04,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX05,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT05,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX06,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT06,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX07,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT07,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX08,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT08,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX09,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT09,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX10,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX11,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMIX12,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIMANT12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
