***********************************************************************         
* CREATED BY PC59625   ON 99/01/29  AT 10:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTS PLANNING DC GROUP         '                               
W2N357   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T357U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N357   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS PLANNING DC GROUP  ',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,3),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,16),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Warehouse info',                                       +        
               POS=(7,3),LTH=14,                                       +        
               ATTR=(PROT)                                                      
IDDCGR1  DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCGR2  DFLD  POS=(7,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCGR3  DFLD  POS=(7,51),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCGR4  DFLD  POS=(7,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(8,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
SUP01UT  DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP02UT  DFLD  POS=(8,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP03UT  DFLD  POS=(8,51),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUP04UT  DFLD  POS=(8,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Local origin',                                         +        
               POS=(9,3),LTH=12,                                       +        
               ATTR=(PROT)                                                      
URS01UT  DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
URS02UT  DFLD  POS=(9,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
URS03UT  DFLD  POS=(9,51),LTH=2,                                       +        
               ATTR=(PROT)                                                      
URS04UT  DFLD  POS=(9,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Insert part',                                          +        
               POS=(10,3),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KOD01IN  DFLD  POS=(10,30),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KOD02IN  DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KOD03IN  DFLD  POS=(10,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KOD04IN  DFLD  POS=(10,72),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Deleted part',                                         +        
               POS=(11,3),LTH=12,                                      +        
               ATTR=(PROT)                                                      
OSPUT01  DFLD  POS=(11,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OSPIN01  DFLD  POS=(11,30),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
OSPUT02  DFLD  POS=(11,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OSPIN02  DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
OSPUT03  DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OSPIN03  DFLD  POS=(11,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
OSPUT04  DFLD  POS=(11,65),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OSPIN04  DFLD  POS=(11,72),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(12,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DATE01O  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE02O  DFLD  POS=(12,37),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE03O  DFLD  POS=(12,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATE04O  DFLD  POS=(12,65),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(13,3),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USER01O  DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER02O  DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER03O  DFLD  POS=(13,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USER04O  DFLD  POS=(13,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Local PSN',                                            +        
               POS=(15,3),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PSNUT01  DFLD  POS=(15,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PSNIN01  DFLD  POS=(15,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
PSNUT02  DFLD  POS=(15,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PSNIN02  DFLD  POS=(15,44),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
PSNUT03  DFLD  POS=(15,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PSNIN03  DFLD  POS=(15,58),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
PSNUT04  DFLD  POS=(15,65),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PSNIN04  DFLD  POS=(15,72),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Publ.date',                                            +        
               POS=(16,3),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PUBUT01  DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PUBIN01  DFLD  POS=(16,30),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
PUBUT02  DFLD  POS=(16,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PUBIN02  DFLD  POS=(16,44),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
PUBUT03  DFLD  POS=(16,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PUBIN03  DFLD  POS=(16,58),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
PUBUT04  DFLD  POS=(16,65),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PUBIN04  DFLD  POS=(16,72),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Buyer',                                                +        
               POS=(17,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PERUT01  DFLD  POS=(17,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PERUT02  DFLD  POS=(17,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PERUT03  DFLD  POS=(17,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PERUT04  DFLD  POS=(17,65),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Publ. CDC',                                            +        
               POS=(18,3),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PUBCDCUT DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Origin CDC',                                           +        
               POS=(19,3),LTH=10,                                      +        
               ATTR=(PROT)                                                      
URSCDCUT DFLD  POS=(19,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PSN CDC',                                              +        
               POS=(20,3),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PSNCDCUT DFLD  POS=(20,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Purch menu   14 Purch prop   15 On order',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Season',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist   19 Refill info  20 On ord local 21 Tran+        
                Scrap   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O357N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N357,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I357N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N357                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  IDDCGR1,                                                +        
               LTH=2                                                            
         MFLD  SUP01UT,                                                +        
               LTH=5                                                            
         MFLD  URS01UT,                                                +        
               LTH=2                                                            
         MFLD  OSPUT01,                                                +        
               LTH=1                                                            
         MFLD  DATE01O,                                                +        
               LTH=6                                                            
         MFLD  USER01O,                                                +        
               LTH=8                                                            
         MFLD  PSNUT01,                                                +        
               LTH=3                                                            
         MFLD  PUBUT01,                                                +        
               LTH=5                                                            
         MFLD  PERUT01,                                                +        
               LTH=3                                                            
         MFLD  IDDCGR2,                                                +        
               LTH=2                                                            
         MFLD  SUP02UT,                                                +        
               LTH=5                                                            
         MFLD  URS02UT,                                                +        
               LTH=2                                                            
         MFLD  OSPUT02,                                                +        
               LTH=1                                                            
         MFLD  DATE02O,                                                +        
               LTH=6                                                            
         MFLD  USER02O,                                                +        
               LTH=8                                                            
         MFLD  PSNUT02,                                                +        
               LTH=3                                                            
         MFLD  PUBUT02,                                                +        
               LTH=5                                                            
         MFLD  PERUT02,                                                +        
               LTH=3                                                            
         MFLD  IDDCGR3,                                                +        
               LTH=2                                                            
         MFLD  SUP03UT,                                                +        
               LTH=5                                                            
         MFLD  URS03UT,                                                +        
               LTH=2                                                            
         MFLD  OSPUT03,                                                +        
               LTH=1                                                            
         MFLD  DATE03O,                                                +        
               LTH=6                                                            
         MFLD  USER03O,                                                +        
               LTH=8                                                            
         MFLD  PSNUT03,                                                +        
               LTH=3                                                            
         MFLD  PUBUT03,                                                +        
               LTH=5                                                            
         MFLD  PERUT03,                                                +        
               LTH=3                                                            
         MFLD  IDDCGR4,                                                +        
               LTH=2                                                            
         MFLD  SUP04UT,                                                +        
               LTH=5                                                            
         MFLD  URS04UT,                                                +        
               LTH=2                                                            
         MFLD  OSPUT04,                                                +        
               LTH=1                                                            
         MFLD  DATE04O,                                                +        
               LTH=6                                                            
         MFLD  USER04O,                                                +        
               LTH=8                                                            
         MFLD  PSNUT04,                                                +        
               LTH=3                                                            
         MFLD  PUBUT04,                                                +        
               LTH=5                                                            
         MFLD  PERUT04,                                                +        
               LTH=3                                                            
         MFLD  PUBCDCUT,                                               +        
               LTH=5                                                            
         MFLD  URSCDCUT,                                               +        
               LTH=2                                                            
         MFLD  PSNCDCUT,                                               +        
               LTH=3                                                            
         MFLD  KOD01IN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN01,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSNIN01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBIN01,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD02IN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN02,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSNIN02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBIN02,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD03IN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN03,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSNIN03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBIN03,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD04IN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN04,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSNIN04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBIN04,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I357N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N357),                                           +        
               OPT=2,                                                  +        
               NXT=W2O357N1                                                     
MID      LPAGE SOR=(W2N357)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23572',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KOD01IN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSPIN01,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PSNIN01,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBIN01,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD02IN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSPIN02,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PSNIN02,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBIN02,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD03IN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSPIN03,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PSNIN03,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBIN03,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD04IN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (OSPIN04,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PSNIN04,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBIN04,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
